{
  "companyName": "Exact Sciences",
  "companyTicker": "EXAS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/exact-sciences-exas-q3-2022-earnings-call-transcri/",
  "content": "Exact Sciences (EXAS -0.88%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nGood evening. My name is Colby and I will be your conference operator today. At this time, I would like to welcome everyone to the Exact Sciences third quarter 2022 earnings call. [Operator instructions] I will now turn the call over to Megan Jones.\n\nMegan Jones -- Senior Director of Investor Relations\n\nThanks, Colby, and I thank all of you for joining us for Exact Sciences third quarter 2022 conference call. On the call today are Kevin Conroy, the company's chairman and CEO; and Jeff Elliott, our chief financial officer and chief operating officer. Everett Cunningham, our chief commercial officer, will also be available for questions. Exact Sciences issued a news release earlier this afternoon detailing our third quarter financial results.\n\nThis news release and today's presentation are available on our website at exactsciences.com. During today's call, we will make forward-looking statements based on current expectations. Our actual results may have material differences from such statements. Discussions of non-GAAP figures and reconciliations to GAAP figures are available in our earnings press release, and descriptions of the risks and uncertainties associated with Exact Sciences are included in our SEC filings.\n\nBoth can be accessed through our website. I'll now turn the call over to Kevin.\n\nKevin Conroy -- Chairman and Chief Executive Officer\n\nOur third quarter results demonstrate the strength of our business and the unique platform this team has built to engage patients and physicians. Together, we're working to help fewer people turn into cancer patients and improving care for those who do. During the quarter, we had record revenue of $523 million or 20% growth, excluding COVID-19 testing. We're raising our full year revenue guidance by $33 million, while decreasing our operating expense guidance by $113 million.\n\nWe're also pulling forward adjusted EBITDA profitability to the third quarter of 2023 from our previous target of 2024. We're building an unstoppable engine that will allow us to achieve our vision to help eradicate cancer. Our differentiated approach starts with world-class science and scientists rigorously developing tests to solve real patient needs. When launched, these tests are immediately supported by our sales and marketing teams with broad reach and deep relationships.\n\nOur well-known test, sophisticated patient navigation, electronic ordering and resulting platform, expansive lab capabilities and deep payer relationships will support new cancer tests with modest incremental investment. This fuels revenue growth and profit generation, which we'll invest in better cancer test and solutions for patients. As we quickly approach profitability, this engine is set to gain momentum with each new test dropped into the platform. Additional highlights from the third quarter include delivering 960,000 total tests including a record number of Cologuard and Oncotype DX results to patients, improving our adjusted EBITDA loss by more than 70% from last quarter and 86% from the first quarter, launching an innovative Cologuard collection kit to give patients more time to get their samples back to our lab, displaying the power of our multi-cancer early detection approach at the European Society for Medical Oncology Congress and making our hereditary cancer test Riskguard available to oncologists through an early access program.\n\nJeff will now review our financial results.\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nThanks, Kevin. Good afternoon. Third quarter revenue grew 15% to $523 million or 20%, excluding COVID testing. Screening revenue increased 29% to $361 million, including three points of growth from prevention genetics.\n\n10,000 new healthcare providers ordered Cologuard during the quarter and more than 292,000 have ordered since the launch as of September. Precision oncology revenue grew 4% to $151 million or 9%, excluding a $2.9 million FX headwind and the sale of our prostate business. COVID testing revenue decreased 64% to $11 million. Third quarter GAAP gross margin was 68%.\n\nNon-GAAP gross margin, which excludes amortization of acquired intangibles, was 72%. This was slightly better than expected as the team find ways to partially offset inflation. Adjusted EBITDA was a loss of $13 million, an improvement of $33 million from last quarter. We ended the quarter with cash and securities of about $670 million.\n\nOur total liquidity is about $900 million, including in our available credit facilities. During the quarter, we extended our $150 million revolving credit facility two years to 2025. We also have up to $100 million available on our accounts receivable facility. We have made significant progress on our goal to generate positive adjusted EBITDA.\n\nThanks to our heightened focus from our team, we now expect to generate positive adjusted EBITDA starting third quarter next year, ahead of our previous target of 2024. The attractive financial profiles of Cologuard and Oncotype DX allow us to continue investing to support growth, drive efficiencies and generate profits sooner than expected while maintaining a strong cash position. Turning to our guidance. We now expect total revenue between $2.025 billion and $2.042 billion for the year.\n\nThis assumes screening revenue between $1.375 billion and $1.382 billion including PreventionGenetics revenue between $40 million and $42 million, precision oncology revenue between $595 million and $600 million, including a $2.9 million fourth quarter FX headwind based on current rates and COVID testing revenue between $55 million and $60 million. Moving to annual operating expense guidance. We're lowering sales and marketing expense by $45 million and now expect between $825 million and $845 million. We're seeing significant leverage in total sales and marketing and now expect expense to decrease about 3% year over year while delivering more than 25% Cologuard growth.\n\nWe're also reducing our G&A expense by $30 million and now expect between $740 million and $760 million. We expect R&D expense between $390 million and $405 million, a reduction of $38 million. The team is becoming more efficient by prioritizing our highest-impact projects and reducing plant hiring. We continue to expect capex of about $200 million.\n\nI'll now turn the call back to Kevin.\n\nKevin Conroy -- Chairman and Chief Executive Officer\n\nThanks, Jeff. Cologuard is becoming synonymous with colorectal cancer screening. It is standard of care because it is accurate, it's a convenient at-home test. It's included in all major guidelines, quality measures and nearly universally covered by insurance with no cost to the patient.\n\nProof points that Cologuard is becoming a preferred screening standard include nearly 10 million people have completed the test. More than 150,000 healthcare providers ordered during the third quarter, a new record. We saw a 25% increase in orders from the first week of August to the last week of October, and its Net Promoter Score has nearly doubled since early 2021. The longer a healthcare provider has been ordering Cologuard, the more ingrained it becomes in their practice.\n\nExcluding COVID disruption, every cohort of new providers orders more Cologuard tests each year. Since the start of last year, we have added 65,000 new ordering healthcare providers, and we expect them to follow a similar trend, increasing their order rate every year. We pulled forward a major benefit of our next-generation Cologuard by launching an enhanced collection kit in September. Our talented team of scientists developed a new protein preservative to extend sample stability by 33%.\n\nThis provides patients more time to ship their completed Cologuard kits back to our lab before the sample expires. We expect this to increase completed test by more than 1 percentage point next year, improving Cologuard revenue and margins. Exact Sciences scale and reach with a 1,000-person primary care sales and marketing team and millions of touch points with patients and providers each year will power our continued leadership in colorectal cancer screening. We'll lead with an intense focus on what is best for each patient.\n\nColorectal cancer is the second leading cause of cancer death in the U.S., with more than 151,000 new cases and 53,000 deaths annually. As screening rates increased over the last 20 years, incidents and mortality rates decreased by 35% and 40%, respectively. The most effective screening tools help prevent the disease by detecting pre-cancer before it turns into cancer. Detecting pre-cancers contributes two-thirds of the light years game through screening and early stage cancer detection provides most of the rest.\n\nThat's why we develop Cologuard, and it's making a difference. Because it detects 42% of all pre-cancers and 69% of advanced pre-cancers and 94% of Stage 1 and 2 cancers, we estimate it has helped by nearly 315,000 people with pre-cancer and 46,000 with early stage cancer. About 90% of people 45 and older see a Cologuard advertisement once a week. Our sales team meets with physicians and their staff a million times per year.\n\nWe will use each of those touch points to make sure patients and providers understand Cologuard is the superior noninvasive test and the appropriate role blood test should play. Oncotype DX provides the groundwork for Exact Sciences to guide a cancer patient's every step. We're using its powerful brand and our deep oncology relationships to introduce new products like our hereditary cancer test. Riskguard helps people understand their inherited risk of cancer and the genetic makeup of their tumor, arming them with critical information to make better treatment decisions.\n\nNext year, we plan to offer additional genomic test to patients, oncologists and our biopharma and academic partners, including minimum residual disease and enhanced therapy selection with RNA analysis. Combining information from our test at different stages of cancer treatment will provide a more complete picture of each patient's disease. Our multi-cancer early detection data presentation at ESMO in September demonstrated meaningful progress toward our goal to bring the best multi-cancer blood test to patients. Combining four biomarker classes and different technologies in a large well-designed case control study, our test detected 61% of cancers at a 98.2% specificity across 15 different organ types, including 11 with no screening option available today.\n\nAdding curated DNA mutation markers detected by next-generation sequencing to methylation, aneuploidy and protein markers improved Stage 1 and 2 cancer detection by 35%. Next, we plan to complete a larger case-control study to further optimize the test, finalize its design and then start enrolling SOAR, our prospective interventional trial to support FDA approval. Exact Sciences is uniquely positioned to support the two biggest patient needs in minimum residual disease and recurrence monitoring in breast and colon cancer. We have relationships with most oncologists in the U.S.\n\nand about 170,000 early stage breast cancer tissue samples are sent to our lab each year. Each sample represents a person who could benefit from a minimum residual disease test. Screening millions of people every year with Cologuard puts Exact Sciences in a leading position to help those likely to develop colorectal cancer and improve outcomes for those patients. We're the only company planning to offer tumor-naive and tumor-informed tests, allowing oncologists to use the best test for each patients with one lab partner.\n\nWe plan to share marker discovery data supporting our tumor-naive approach in breast cancer at the San Antonio Breast Cancer Symposium in December. We also expect to present results of our tumor-informed and tumor-naive approaches for colon cancer at ASCO GI in January. Exact Sciences has the right team, a unique financial profile and the broadest and strongest foundation in cancer diagnostics. Continued execution from the team, over 70% gross margins, a clear path to profitability next year and a leading presence in cancer screening and precision oncology put us in the best position to eradicate cancer and the suffering it causes.\n\nWe're now happy to answer your questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Brandon Couillard from Jefferies. Your line is open.\n\nBrandon Couillard -- Jefferies -- Analyst\n\nHey, thanks. Good afternoon. I'll stick to one question. Kevin, the opex cut to the full year outlook pretty substantial.\n\nCan you just elaborate on exactly where that's coming from, whether it's headcount or other programs?\n\nKevin Conroy -- Chairman and Chief Executive Officer\n\nWell, I think it's a broad-based continued focus by all of our employees from the front line to the leadership team of making sure that we deliver on our promise that we made several quarters ago of rapidly moving the business to profitability. I believe Jeff will have more color.\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nYeah. Thanks, Brandon. The team has just done a really good job of focusing on the highest impact programs across the board. And when you talk about sales and marketing, they're just doing a really nice job making sure we target the right physicians and allocate financials appropriately across all of the various marketing levers we have to pull.\n\nI think what you're really seeing here is a turning point. We've talked for years about the platform that we have built over time. And this has been a significant investment. But now you're really starting to see the part of this platform.\n\nAs Cologuard grew, we grew 25% in the quarter, sales and marketing was down 5%. Over time, it's clear where this is heading with that foundation in place. And two very strong profitable brands on market now and growing, this is going to turn into a cash flow generating machine over time.\n\nOperator\n\nYour next question comes from the line of Derik De Bruin from Bank of America. Your line is open.\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good afternoon. Thank you for taking my question. So can you talk a little bit more about physician access and that had been an issue during prior quarters.\n\nCan you sort of talk about the metrics, sort of where we are, penetration, access there? And then just anything on sort of what's happening with the precision oncology business, OUS, any sort of like slowdowns in demand there? Does macroeconomic issues sort of kick in? Thanks.\n\nKevin Conroy -- Chairman and Chief Executive Officer\n\nEverett, why don't you take the access question. And Jeff, if you would take the precision oncology questions.\n\nEverett Cunningham -- Chief Commercial Officer\n\nThanks, Kevin. Good afternoon, everyone. Thanks for the access question. We're seeing modest improvements in access, but the access is not back to pre-COVID levels.\n\nWhat I do like about our commercial organization is we're deployed very smartly across all of our geographies. We're deployed at the highest target to drive the largest growth for Cologuard. Our representatives across the board have really good data in terms of knowing where to target, when to target. And each month that we're in our revised structure, we get better at making sure that we're making high-quality calls.\n\nI look at and my team looks at the calls that we make, just not the quantity of call but the quality of call and quarter over quarter, we're getting better. So while the access is just showing modest improvement, the activity of our field force is much more efficient.\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nDerik, this is Jeff. I'll take the PL one. So globally, we had a good quarter in precision oncology. If you adjust for FX and the sale of the prostate business, that core growth was about 9%.\n\nWhat we got there was international growth of about 26%, again, adjusted for FX. So really strong growth outside the U.S. You're seeing improved insurance coverage outside the U.S. You're also seeing very strong uptake in the node positive indication.\n\nAnd then when you look at the next year, I expect that momentum will continue. We're on track to launch in Japan early next year. So good momentum will continue for the international side of the business. In the U.S., another really steady quarter, mid-single-digit growth there with balanced contributions from the Oncotype Breast franchise as well as the therapy selection business, which is becoming a much bigger part of overall precision oncology.\n\nOperator\n\nYour next question comes from the line of Catherine Schulte from Baird. Your line is open.\n\nCatherine Schulte -- Robert W. Baird and Company -- Analyst\n\nHey, guys. Thanks for the question. I think on one of your slides, there was a graphic showing 30 million patients screened by Cologuard by looked like 2027. Did I read that correctly? And can you just talk to what kind of assumptions go into that outlook?\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nBrady, you did read that right -- sorry, Catherine. I apologize. You did read that right. It's at least $30 million.\n\nAnd what we did to get there is as we look at the model that we have and all the broad momentum we have that Everett and team are driving across a growing base of providers. Kevin talked about a record number of new order providers in the quarter, over 150,000 ordered during the quarter. We're seeing a deepening of the utilization as Cologuard gets more ingrained in their business. And over time, we expect that growth to continue when you consider the size of this market and the fact that as many as 60 million people remain unscreened today.\n\nOperator\n\nYour next question comes from the line of Jack Meehan from Nephron Research. Your line is open.\n\nJack Meehan -- Nephron Research -- Analyst\n\nThank you. Good afternoon. Kevin or Jeff, it's that time of year. Everybody is very focused on 2023.\n\nGood to see some of the momentum in the quarter and on the order commentary in the year-end. I was just curious if there were any thoughts you could share around kind of positioning into 2023. I caught the profitability comment by the third quarter, but just how are you feeling about the business in the new year?\n\nKevin Conroy -- Chairman and Chief Executive Officer\n\nWell, this is Kevin. I am thrilled, first of all, that there is something different about what's going on with Cologuard now than ever before. You've seen our Net Promoter Scores double from the low 20s in the first quarter of '21 to the low 40s this last quarter. Awareness of Cologuard as a brand is at an all-time high among consumers, relevant consumers and healthcare providers.\n\nReorder rates are at all-time high, number of tests ordered per physician are at an all-time high. And so Cologuard is gaining momentum, and it feels that it is being used now much more frequently among physicians, who are very slow to adopt new technologies and change. We've always said that a primary care launch is more like a jumbo jet than a rocket ship. And what you're starting to see is that it's becoming broader.\n\nOur Cologuard's utilization is deeper among the physicians who are using it. And the interesting data point is that we continue to add about 10,000 new ordering healthcare providers per quarter. And so much of this is driven by two incredible teams. One is a marketing team that we think has mastered both television advertising and digital and consumer as well as a sales force that has just continued throughout the pandemic, and now beyond, to continue to educate healthcare providers, physicians and increasingly now nurse practitioners to order Cologuard and how it should be used in their practice.\n\nSo something else -- something is changing. Maybe, Jeff, you want to provide a little bit more clarity for the year.\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nYeah. Typically, we provide guidance on our fourth quarter call in February, and that is our plan now. As you look out to next year, I think I'd say a lot of this momentum that we're seeing both in Q3 and we guided to Q4 should continue into next year. As Kevin said, we're very optimistic in the long term.\n\nA few reasons to keep in mind. When you think about physician office access, as Everett said, it's not back to normal. It is still somewhat muted. The team has done a really nice job working around that, but keep that in mind as you think about next year.\n\nAlso in our rescreen business, it has been a phenomenal growth driver for us. However, when you think about that pool of patients, who become eligible next year, we're certain to lap against COVID years so that the growth in that pool is about flat year on year. I do believe rescreens will grow next year, but that is -- it won't provide as much incremental growth next year as it has. And lastly, next year, you get a full impact of the Medicare sequester, which kicked in midyear.\n\nAnd it does take down Medicare reimbursement across the board, so you get a full year of that next year. So things to keep in mind. We'll provide full guidance on the fourth quarter call. We are very optimistic.\n\nOperator\n\nYour next question comes from the line of Andrew Brackmann from William Blair. Your line is open.\n\nAndrew Brackmann -- William Blair and Company -- Analyst\n\nHi, guys. Good afternoon. Thanks for taking the questions and glad to be back on these calls. Maybe we could start just given some news that's sort of expected in the next handful of weeks in the space here.\n\nKevin, can you just sort of level set us again sort of on the role pre-cancer detection should be playing in these tests? I think you reiterated some prior commentary about 2/3 of the benefit is coming from pre-cancer. So can you just maybe give us a level set on how you're thinking about that again? Thanks.\n\nKevin Conroy -- Chairman and Chief Executive Officer\n\nYeah, sure. Thanks. So first of all, there is an enormous amount of room to improve screening rates. 60 million out of 110 million Americans in the screening population with ages 45 to 85 remain unscreened today.\n\nSo there is just an enormous opportunity to get people up to date in their screening. And we believe that our blood test is going to play a role in improving rates. But to date, our test, we haven't shown data, and there is no prospective data showing pre-cancer detection to be that similar to the FIT test, which is 24%. And I go back to when we started 13 years ago with Cologuard, one of the most important things we focused on was the detection of precancerous polyps, which take 10 to 15 years to turn into cancer.\n\nAnd with multiple attempts at screening, you can actually prevent the disease. If you look at the drastic drop-off in cervical cancer mortality in the U.S., it's not because the pap smear found cancer. It's because it found the precancerous lesions that lead to cancer. And that's where you've seen mortality drop from 45,000 people -- women a year to 4,500 or thereabouts.\n\nAnd so the goal of any screening test should be to find pre-cancers and then detect Stage I or II cancers at a high rate. And we know that colonoscopy is good at finding Stage 1 and 2 cancers. Cologuard detects 94% of Stage 1 and 2 cancers. Blood tests aren't going to detect 94% of Stage 1 and 2 cancers.\n\nSo if you look at that population wise, if you see 100 people screened with Cologuard and a blood test, there may be, I don't know, 10 people who Cologuard would find but a blood test wouldn't. And so that's why finding those Stage 1 and 2 cancers is critical. And so blood test will have a role. Now there may be a challenge in getting blood test into the guidelines because, again, they look at modeling and the modeling that is done, two-thirds of the life years gained, comes from pre-cancer detection.\n\nSo there's going to be some challenges here. And without getting into the guidelines, you don't get into HEDIS or Stars quality measures. And without that, it's really difficult to launch a test. There's going to be a number of years before all of this plays out.\n\nAnd we plan to share data that we have generated, including more recent data on our blood-based CRC test. And I just want to remind people that the huge investment that is required to participate as a serious player and as a serious provider of colon cancer screening tools. We have invested about $4 billion today in our patient engagement engine, in our commercial team, in our 320,000 square feet of lab space and, really importantly, in the 250 health system connections using Epic to be able to electronically order Cologuard and get results. So this is a really important goal is to get more people screened.\n\nAnd I wanted -- one other comment is that we've recently gotten feedback from the FDA on our blood test. And they have been clear, like they were clear with Cologuard, that there is an expectation around pre-cancer detection. So they have said there's a certain expectation around the sensitivity for detecting cancer, for detecting pre-cancer and also for specificity or the false positive rate. Those are three critically important metrics that will come out of our blood CRC study.\n\nAnd these are serious scientific things that still need to be established, and we look forward to sharing our data with you at the completion of our study.\n\nOperator\n\nYour next question comes from the line of Matt Sykes from Goldman Sachs. Your line is open.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nHey, guys. This is Dave on for Matt Sykes. Can you tell us more about what drove the Oncotype outperformance in the quarter?\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nYeah, this is Jeff. I'll take that one. I talked before about having really strong growth outside the U.S., up 26% adjusted for FX. So I would say that's part of it.\n\nWe're also seeing continued very strong momentum in the node positive indication. Recall this is the newer indication thanks to the responder data that came out a couple of years ago, continue to see really good uptake there. And lastly, I think this doesn't get enough attention, but we do have a pretty sizable therapy selection business that continues to gain momentum. We'll have an additional product launch there early next year.\n\nI think it's -- I would say it's a broad-based good quarter from that team.\n\nOperator\n\nYour next question comes from the line of Vijay Kumar from Evercore. Your line is open. \n\nKevin Conroy -- Chairman and Chief Executive Officer\n\nVijay, we can't hear you. I don't know if you're mute. You're in. Colby, if we can go to the next caller.\n\nWe'll come back to you, Vijay.\n\nOperator\n\nYour next question comes from the line of Thomas Stevens from Cowen and Company. Your line is open.\n\nThomas Stevens -- Cowen and Company -- Analyst\n\nHey. I'll dissect my question, so just kind of two-parter here. On those power users you kind of discussed you've seen some headwinds, just an update on your kind of previously high order in Cologuard doctors. And the kind of second one is an offshoot of those question.\n\nI guess in looking at 2027 in blood, in Medicare, what kind of opportunity do you see for a kind of two-year test there? And what kind of population do you see to tap into with your test? Thanks.\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nThanks, Tom. This is Jeff. I'll start on the -- I think your comment on the power users, and maybe Everett can fill in here, too. We had previously talked about different cohorts.\n\nI think the results here really show that we've seen broad-based improvements in utilization. Whether you look at different cohorts based on when doctors first ordered, there's some data in the deck that people are seeing for the first time. No matter when you first ordered, the order rate continues to climb higher which is really powerful to see, especially when you consider all the new doctors that we're adding. If you segment doctors based on their level of ordering, kind of broadly also there, whether you're kind of toward the top or newer to Cologuard, we're seeing continued strong uptick in utilization.\n\nSo those are the overall trends. I don't know, Everett, anything to add there?\n\nEverett Cunningham -- Chief Commercial Officer\n\nYes. I will add a little bit. I spent a lot of time out in the field in the past few quarters. And the way our commercial organization looked at it, Thomas, is a little bit more simple.\n\nWhat they do is they look at, where is the growth opportunity for Cologuard. And we have targets, we have priorities that we focus on like rescreen opportunities, 45 to 49 opportunities. And where those opportunities are, we go and we make the call. And we have boiled it down to the more quality calls that we make with those targets, the more that, that PCP writes Cologuard.\n\nAnd so we incent our representatives to go out every single day, focus on the priorities, focus on the opportunities and grow Cologuard. And I think that, that's the reason why we're continuing to have good quarter-over-quarter growth.\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nTom, I'll take the second question, which was on the blood opportunity in 2027. Look, as Kevin talked about, he talked about the broader framing. I would just add to that, that this is going to take time. When you think of the obstacles you've got to get through, whether it's first developing the test, get into the guidelines, quality measures, FDA, Medicare, there's a whole series of things that have to happen.\n\nAnd if you look back at Cologuard, right, it takes about four to five years after launch for all those things to come into play. So I think in the 2027 time frame, which is what you asked, I think the opportunity there is still relatively minimal. Potentially, you could see blood being positioned for specific niches of the market. One that stands out to us is somebody who, say, over the age of 75, where perhaps at that age, pre-cancer detection may be less important, but -- and they're likely on Medicare.\n\nCommercial insurance, broad adoption is going to take longer than that. For that, you need to be in USPSTF guidelines, you need to be in the quality measures. And I don't see that coming together in 2027.\n\nOperator\n\nYour next question comes from the line of Patrick Donnelly from Citigroup. Your line is open.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nHey, there. You've got Jason on for Patrick. Maybe just one. I know you're not giving '23 guidance right now, but just at a high level, thinking about the goal of being adjusted EBITDA positive in the third quarter next year.\n\nHow should we be thinking about gross margins next year, some of the moving pieces there, like inflation, FX and then kind of where automation and rescreens fit into that? Thanks.\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nWe'll give more color on this on our fourth quarter call, but it helps -- it starts with a really strong growth drivers in both Cologuard and Oncotype. Both are profitable today. We expect continued momentum into next year. From a gross margin standpoint, obviously, there are headwinds out there.\n\nThere are headwinds out there, they're not unique to us, with inflation, with fuel, supply chain, complexities with COVID. So there's a lot of pressures there. The team did a really nice job of offsetting that. I think when I look at Q4 and the near term here, I think margin is pretty similar to Q3, maybe down a hair just based on the seasonal trends with revenue into next year, inflation is still the wild card.\n\nSo we'll talk more about that. Longer term, gross margin, we're very optimistic there because again, the team has done a really nice job building the foundation that we can scale. So we expect nice margin improvement over time. From an operating expense standpoint, again, I think a hallmark of what you saw in the third quarter, the team has done a nice job finding efficiencies throughout the business.\n\nI think that will continue throughout next year. Next year, we do have the STORE study started for multi-cancer, that will be some additional R&D. Otherwise, we expect continued efficiencies throughout the P&L.\n\nOperator\n\nYour next question comes from the line of Vijay Kumar from Evercore. Your line is open.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nHey, guys. Thanks for taking my question. And congrats on the steady execution here. Maybe my question here on the cash flows, Jeff.\n\nThis is a pretty impressive quarter in terms of cash burn rate. Are we now looking at the Exact Sciences exiting fiscal '23 perhaps being cash flow neutral to positive? How should we think about operating expenses? And maybe just give us some color, Jeff, on what changed. Is this a function of Exact holding back expenses? And is that going to come at the cost of revenue growth or are these structural changes which are sustainable? Thank you.\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nThanks, Vijay. As Kevin talked about, it's not either or, it's growth with efficiencies and a focus on profitability. I don't think this is a shift or change in the business. We've been talking for years about building the foundation that will not only get us to profitability, but allow us to punch through and continue to generate improving margins, steady cash flow generation for years and years to come.\n\nAnd you're now -- I think we're at that turning point now, we're at that turning point where you're really starting to see that fall through. As far as next year, we're excited to pull ahead the EBITDA profitability on a free cash basis, likely lags that a little bit. What's helping recently is that we've had some really nice improvement in working capital management. You see DSOs down 16 days year on year.\n\nInventory turns continue to improve. So the team has done a really nice job with a heightened focus on profitability and cash flow.\n\nOperator\n\nOur next question comes from the line of Kyle Mikson from Canaccord. Your line is open.\n\nAlex Vukasin -- Canaccord Genuity -- Analyst\n\nHi. Alex Vukasin online for Kyle Mikson. Congratulations on the quarter. And one brief question for you.\n\nSo there's probably little value baked into the stock really for multi-cancer, MRD and liquid biopsy test. Why don't you think investors are taking these assets seriously? And what are you going to do to reinvigorate excitement in these promising potential long-term growth drivers? Thank you.\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nThis is Jeff. I'll take that one and maybe Kevin can jump in. Look, we're focused on executing on the business, starting with Cologuard and Oncotype, making sure the foundation is there. And we're in the middle of this period where it's an intense data readout period for our pipeline.\n\nWe started this year with really strong data on Cologuard 2, we shared some additional data on our MRD program at ASCO and then just in September, shared the data on NSABP, we thought it was all really good data. Looking ahead, this robust period of pipeline data continues. When you look ahead to -- in this month, there's additional data coming out on our NSABP program. Next year, as Kevin talked about, our top-line readout starting with BLUE-C, data on our colon cancer blood program.\n\nAnd over time, I think as investors fully appreciate this, look, we're optimistic here. Not only we can continue delivering on the core on-market programs, but we have a really robust growth in store throughout the pipeline.\n\nOperator\n\nYour next question comes from the line of Alex Nowak from Craig-Hallum Capital Group. Your line is open.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nHey. Great. Good afternoon, everyone. A couple of calls this evening, so apologies if you already addressed this.\n\nBut I was just hoping if we can get your latest ideas on M&A in the genomics space. We've seen the valuations come down across the sector. Does that make it more appealing to slot some of these names into this Exact Sciences commercial engine? What are you looking for? Is it new capabilities or would you rather add established products in the bag?\n\nKevin Conroy -- Chairman and Chief Executive Officer\n\nWell, our primary focus is on Cologuard, Oncotype and then three pretty remarkable opportunities in colon cancer screening, both stool and blood, multi-cancer screening, which probably has the biggest potential for impact in human health of any diagnostic ever developed. And then also minimum residual disease testing. Our philosophy on M&A hasn't changed. We'll consider it if three conditions are met.\n\nNumber one, it contributes to our long-term strategy. Two, the company is a good culture fit. And three, it creates shareholder value. So no changes there in our focus.\n\nI'd point out that we added a prevention genetics team. It's an amazing talented team. It's added over $40 million of profitable revenue in a new product line, Riskguard. And so it's all about quality and strategic fit.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMegan Jones -- Senior Director of Investor Relations\n\nKevin Conroy -- Chairman and Chief Executive Officer\n\nJeff Elliott -- Chief Financial Officer and Chief Operating Officer\n\nBrandon Couillard -- Jefferies -- Analyst\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nEverett Cunningham -- Chief Commercial Officer\n\nCatherine Schulte -- Robert W. Baird and Company -- Analyst\n\nJack Meehan -- Nephron Research -- Analyst\n\nAndrew Brackmann -- William Blair and Company -- Analyst\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nThomas Stevens -- Cowen and Company -- Analyst\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nAlex Vukasin -- Canaccord Genuity -- Analyst\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nMore EXAS analysis\n\nAll earnings call transcripts"
}