{
  "companyName": "Invitae",
  "companyTicker": "NVTA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/invitae-nvta-q2-2022-earnings-call-transcript/",
  "content": "Invitae (NVTA 2.20%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and thank you for attending today's Invitae 2022 second quarter results call. My name is Jason, and I will be the moderator for today's call. [Operator instructions] I would now like to pass the conference over to our host, Hoki Luk, head of investor relations. You may begin.\n\nHoki Luk -- Head of Investor Relations\n\nThank you, operator, and good afternoon, everyone. Thank you for joining us for our 2022 second quarter results call. Joining us today are president and CEO, Ken Knight; and our CFO, Roxi Wen. Before we begin, I'd like to remind you the various remarks that we make on this call that are not historical, including those about our vision and business model, the company's strategic business realignment, future financial and operating results, expectations of future growth and reduction in burn rate, future products, services, our product pipeline and the timing, and investments in our infrastructure and operations constitute forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act.\n\nIt is difficult to accurately predict demand for our services, and therefore, our actual results could differ materially from our stated outlook. Statements on future company performance assume, among other things, that we don't conclude any additional business acquisitions, investments, restructurings or legal settlements. We refer you to our most recent 10-Q, in particular to the section titled Risk Factors for additional information on factors that could cause actual results to differ materially from our current expectations. These forward-looking statements speak only as of the date hereof.\n\nAs you listen to today's conference call, we encourage you to have our press release available, which includes financial results, as well as key growth metrics and commentary on the quarter. To supplement our consolidated financial statements prepared in accordance with generally accepted accounting principles in the United States or GAAP, we monitor and consider several non-GAAP measures. We encourage you to review our GAAP to non-GAAP reconciliations, which are available in the press release and in the appendix of the earnings slide deck, both of which you can access by visiting the investors section of the company's website at ir.invitae.com. We have already preannounced key financials, along with our corporate announcements in July.\n\nToday, we will discuss our strategy post the realignment plan, provide some recent developments and continue on to our published second quarter financials, followed by our key metrics and outlook. We will then proceed to Q&A. With that, I'll turn the call over to Ken.\n\nKen Knight -- President and Chief Executive Officer\n\nThank you, Hoki, and thank you all for joining us today. After the first quarter results, we communicated our company's intent to extend our cash runway to the end of 2024, and our July realignment was the translation of that into a thoughtful operating plan. With the realignment plan in place, we are now ready to further accelerate the work that had actually begun months ago. We are pleased to see that our second quarter non-GAAP gross margin, operating expenses and cash management were all demonstrating necessary improvements.\n\nMore importantly, the trailing 12-month trend in those metrics has consistently delivered in a positive direction, confirming our ability to execute on our overall plan. Our team remains committed to achieving the financial goals that we have laid out, which are expected to strengthen our balance sheet. Having said that, one of management's top priorities includes finding the right option for our debt obligations due in 2024, and we continue to be in discussion with various parties looking for the most optimal solution. Despite the recent challenges, these events have also provided an opportunity for our team to take a close examination of our focus and priority.\n\nAnd throughout this process, we found that Invitae continues to have many valuable assets that will position us to win in the future. And we believe that those assets, along with our mission and the execution of our plan, will increasingly provide a compelling proposition for investors who share our vision and belief in our potential. Now I would like to move on to our strategic focus going forward. We will continue to solidify our leading position in the testing space, while utilizing digital tools and support to provide value for our patients and our providers.\n\nThese combined capabilities will be leveraged to deliver our vision of transforming healthcare and unlocking the true potential of genetics. Under this premise, patients, payers, pharma partners, physicians, providers and more will be able to use our information, insights and system for more pieces of the puzzle, leading to more complete results and deep data, data that will be the basis for further research, treatment and better health. That is where we are headed, and we continue to see that as a defensible and differentiated strategy that sets us apart from others. Next, we'd like to touch on a few positive developments in these areas, beginning with the recently updated NCCN guidelines, which now endorses universal germline genetic testing for all patients with colorectal cancer.\n\nNotably, Invitae has advocated for this guideline change, thanks to the efforts of our clinical specialists and research team. The updated guidelines have also cited two of our published collaborative study. Based on this development, we estimate that in the U.S. alone, the colorectal cancer germline testing patient population will more than double.\n\nWe are glad that we have contributed to this change and additional efforts are well underway to do the same for breast, prostate and lung cancer that have larger patient population. We will also be making efforts to further promote clinical adoption and implementation of these guidelines, along with continuing to raise provider and patient awareness. In oncology, Invitae is a leading genetic testing provider offering both germline and somatic assays, which is exciting and supports the growing value in genetic testing. And an increasing number of studies presented each year at ASCO and other major clinical meetings are delivering more and more evidence that indicate the combination of germline and somatic information yields earlier diagnosis, more actionable results, ongoing monitoring and potentially better outcomes.\n\nThe great thing about our portfolio is that we will leverage our technology to utilize the same tissue sample to perform tumor profiling, which is vital for therapy selection and prognosis, as well as to generate a patient-specific panel for ctDNA detection and monitoring in the blood via our MRD assay, which we call Personalized Cancer Monitoring or PCM. For example, a patient with advanced cancer frequently needs tumor profiling for biomarker detection and treatment planning, and that same patient can also benefit from measuring treatment response. So our platform and bioinformatic approach allows one sample input for two important clinical results. This is particularly beneficial in patients with limited tissue availability.\n\nAnd we are adding personalized insights via our Pharmacogenomics offering that have the potential to reduce adverse reactions to prescription medication. We continue to believe that Invitae has a unique proposition based on our combined offerings, our relentless focus on ease of use, our commitment to provide the best customer service and our distribution channel. Speaking of our channel, we have a strong sales team led by highly experienced commercial leaders. We also have a presence in most large NCI and Community Cancer Centers.\n\nMany of the talented genetic counselors we work with have direct relationships with oncologists who oftentimes serve the same patient. We are in the early stages of penetrating the somatic market, and we expect these strong relationships to offer us a competitive edge. Touching on our efforts and digitizing providers' workflow and patients' journey, an example is the adoption of our Gia chatbot, which provides clinicians with patient-driven information such as health and family history. With this risk assessment in the patient's record, our algorithm then offers concrete actions for the physician to further guide the patient such as lifestyle choices, health monitoring or genetic testing.\n\nWe are seeing continued uptake for our Gia chat tool for risk assessment, as our interactions in the second quarter increased 75% from the same quarter in 2021. We have also formed a number of partnerships with different institutions, including Worldwide Clinical Trials Incorporated, a Contract Research Organization. Through this partnership, Worldwide has access to data insights based on prevalence, incidents, demographics and epidemiology for rare disease patients. This aggregated data enables Worldwide to recruit patients faster and pinpoint optimal study locations to help its sponsors uncover new and potentially life-saving treatment.\n\nLonger term, I would like to emphasize the importance and value of the network effect that we are trying to create. This network effect continues to benefit patients we serve well after their initial testing experience with Invitae. Rather than providing a test to a patient as a discrete one-time interaction, we view the first interaction, whether it be a test or risk assessment through Gia as the starting point of forming a relationship with the patient through the rest of their journey. Currently, almost 2 million of our patients have made their data available for sharing, solidifying their belief in our long-term relationship as well.\n\nIn reality, many patients, particularly in rare diseases do not have the information they need at a critical time when outcomes can change for the better. In addition to providing the test to these patients, we intend to provide a more holistic solution addressing other important needs in their journey, such as by offering the connection to patient advocacy and other support groups, finding optimal treatment and alternative therapy options or searching for clinical trial opportunities, with the ultimate goal being to stand by these patients along every step of their way. And while it will take time for us to get there, the patient stories that we hear internally continue to accumulate and give us confidence that our strategy is working. I'll now hand the call over to Roxi to walk us through the details of our second quarter results.\n\nRoxi Wen -- Chief Financial Officer\n\nThanks, Ken. In the second quarter of 2022, we generated approximately $137 million of revenue and the breakdown was as follows: approximately $81 million from oncology, including germline testing, therapy selection, PCM and Companion Diagnostics, representing a 14% growth over prior year, approximately $27 million from our women's health offerings, including NIPS, Carrier and other reproductive tests, a 27% growth over last Q2, approximately $17 million from the RareDx and other testing products, including pharmacogenetics, a 18% growth over prior year, data and platform revenue was approximately $12 million, grew 19% over last year. This includes data management, analytics, data-as-a-service and certain biopharma programs. For this year's second quarter, non-GAAP gross margin was 40.1%, a 465-basis-point improvement over the same quarter of 2021 and a 360-basis-point improvement from the first quarter of this year.\n\nOur communication since the beginning of the year pointed to our confidence in being able to achieve cost productivity in many parts of our business operations. And we're encouraged by the steady positive trend, thanks to our efforts in improving pricing, live operations and product design, among other measures. Non-GAAP operating expense was $200 million or 146% of revenue, compared to $209 million or 169% of revenue in the first quarter of 2022 and 170% of revenue in the prior year. The second quarter operating expenses include costs from acquired businesses and the annual stock-based compensation grant.\n\nAs we've stated on our first quarter call, we plan to hold our operating expenses at a stable level. Aside from adjustments in stock-based compensation, this quarter was our lowest non-GAAP operating expense as a percent of revenue since the fourth quarter of 2020. As communicated on our July call, we will be further reducing that figure by significant amounts going forward as a result of multiple initiatives, including reduction in headcount, lab and office-based third-party services, as well as exiting certain businesses and geographies. Speaking of exiting certain businesses, which included our distributed oncology kits business, we're moving along with our plan.\n\nAs you may be aware, the kits business has several different offerings, of which we're having productive discussions with multiple parties. We also want to note that we have taken a large non-cash write-down to goodwill this quarter resulting from a significant sustained decline in the stock price and market capitalization, as well as lower than projected financial performance. In the third quarter, we also expect to make certain adjustments to our intangible assets in relation to the realignment plan announced in July. Moving to our cash position.\n\nCash, cash equivalents, restricted cash and marketable securities totaled $737 million at June 30, 2022, compared to $885 million on March 31, 2022. Cash burn in the second quarter was $147 million, compared to $169 million in Q1 '22 and $196 million in Q4 '21. We are encouraged by the progress we've made in reducing our cash burn. Now stepping into the business metrics that are intended to offer more transparency and a more consistent balance perspective on our performance.\n\nUnder portfolio growth, our active accounts and active partners, both continued the growth momentum in Q2. Similarly, the number of patients we serve and the ones who are available to share their data has also expanded nicely. Our new product vitality remained flat quarter over quarter, but down from the previous quarter. As a reminder, this metric represents a revenue contribution by new products over the trailing three years.\n\nAs previously communicated, we saw a pullback in that number resulting from the slowdown in new product launches in 2020 and part of 2021, primarily due to COVID disruption. We have a number of product launches either going on now or planned for the remainder of the year, which will contribute to new product revenue in future periods. Revenue per patient measured by total company revenue divided by the number of ordering patients for the period fell in the first quarter due to higher growth from our women's health and international businesses, which have lower average price points. This number has recovered in the second quarter and even exceeded the preceding quarters, largely driven by our efforts to improve quality of revenue.\n\nMoving to operational excellence. We are seeing continued quarter-over-quarter improvement in all categories, as the initiatives we've already put in place are taking hold our margins, cost productivity, operating expense profile are improving and flowing through to our cash flow metrics. As previously mentioned, we're pleased to see the trends reflecting the effectiveness of our initiatives and the team's ability to drive positive changes, and we are ready to accelerate further from here. Moving on to financials and guidance.\n\nRevenue was $260 million for the first half of 2022. Our realignment plan indicates revenue impact from the businesses to be exited in the second half. As such, we expect the second half of 2022 to be flat compared to the first half, resulting in full year revenue to grow in the low double digit compared to 2021. We have previously communicated that about 15% to 18% of our 2022 revenue will not recur due to our plan to exit certain businesses.\n\nAnd as such, this would set a new baseline in 2023. Offsetting this adjustment will be the growth of the remaining business in the range of 15% to 25% in 2023. This range is in line with our long-term revenue growth assumption toward cash flow breakeven. Non-GAAP gross margin for the first half of the year is roughly 38.4%, and we expect continued improvement throughout the year with our full year non-GAAP gross margin to be between 42% to 43%.\n\nSimilar to revenue, as a result of our exits, we also expect non-GAAP gross margin profile to change. The non-GAAP gross margin of our exits are in the range of mid-teens. As such, removing them will lead to a higher gross margin baseline in 2023. This along with our focus on higher quality revenue and other continuous improvement initiatives is anticipated to further expand our gross margin over time.\n\nLastly, we're maintaining our 2022 cash burn guidance of $600 million to $650 million, which includes up to $75 million cash to be used for the realignment activities, including severance. We also continue to anticipate our cash burn to be in the range of $225 million to $275 million in 2023, which includes up to $25 million cash to be used for realignment. With that, I'm turning the call back to Ken.\n\nKen Knight -- President and Chief Executive Officer\n\nThank you, Roxi. As we close the call, I thought I would summarize with a few thoughts. First and foremost, the mission of Invitae and the passion of our people to pursue that mission have not changed. We are, however, changing the pathway amid a realigned focus on business imperatives.\n\nWe find ourselves at a pivotal moment in the company's history. We stand closer than ever to the day when patients and providers are equipped with the test and tools that inform risk, deliver results and guide actions that can instantly incorporate the latest research treatments and advancements that the medical community has to offer. This will require broad integrated testing, improved tools and transformative applications, all of which are within our strategic focus. I appreciate all Invitae-ians who are executing through this transition, driven by an unwavering concern for every patient that we can touch and we are getting after it.\n\nWith that, we'll now turn the call over to the operator for Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from Tejas Savant with Morgan Stanley. Your line is open.\n\nYuko Oku -- Morgan Stanley -- Analyst\n\nThis is Yuko, on for Tejas. While you extended the runway to '24, some of your peers are considering alternative non-dilutive sources of funding such as royalty financing. Is this something that you may explore in the future?\n\nRoxi Wen -- Chief Financial Officer\n\nThanks for the question. We are -- we cannot be very specific about the ongoing conversations we're having. And what I would say is, as you mentioned, we have extended our cash runway through the end of 2024. And we're very encouraged by the early signs of success we have experienced over the last quarters since we put a number of initiatives in our margin expansion and cash flow, cash management in place we've seen some results.\n\nSo we're confident with our ability to execute the plan we put together to extend our cash runway and build a stronger business. In the meantime, yes, we're having multiple conversations, and we look forward to update investors and shareholders with -- as we have more specifics. Many options are on the table, and we are very open-minded about solutions to build a strong and flexible balance sheet from here.\n\nYuko Oku -- Morgan Stanley -- Analyst\n\nGot it. And then, I have a separate follow-up. Could you help us think about the pace of incurring $75 million in cash expense associated with realignment activities of severance over the -- over 3Q and 4Q?\n\nRoxi Wen -- Chief Financial Officer\n\nJust to clarify, you want to understand the cadence of the $75 million we estimated?\n\nYuko Oku -- Morgan Stanley -- Analyst\n\nYes. Like should most of it go into 3Q or should it be roughly equal across both quarters?\n\nRoxi Wen -- Chief Financial Officer\n\nYes. It's difficult to give you precise guidance on this because these things are related to the exact time -- timing of the initiatives being executed, people's exit time line, a lot of the details are still being worked out. But -- up to $75 million of cash expenses in the second half is where we have more clear visibility to.\n\nYuko Oku -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Puneet Souda with SVB Securities. Your line is open.\n\nPuneet Souda -- SVB Securities -- Analyst\n\nYes. So first one is really just wanted to understand in terms of the 2023 guide. I mean, it seems like there -- obviously, there is a reset to the baseline, but you're expecting a growth on top of that. It, based on what I'm looking at in your guidance slide, it appears that there is a step-up in growth from -- in 2023 versus 2022 net-net.\n\nBut I just want to be very clear, I mean, is this -- can you maybe quantify that overall, or I mean, should we expect it to be just slightly better than flat? Could you just clarify based on all the moving parts that sort of you're going through right now?\n\nRoxi Wen -- Chief Financial Officer\n\nYes. Thank you for the question. So 2023, we're providing a range at the moment. As we presented today, you've probably seen the chart 2020 -- we'll have a 2023 new baseline after we exit this year with approximately 15% to 18% of our 2022 realized revenue not reoccur in 2023.\n\nAnd then, the -- from that new baseline, we expect 2023 to grow in the range of 15% to 25% in that range. So we -- this -- it's not a firm guidance that we're providing for 2023, it's a range estimate.\n\nPuneet Souda -- SVB Securities -- Analyst\n\nOK. And then, could you outline for us where do you -- I know these efforts -- workforce reduction efforts have been implemented, but to what extent, maybe sort of just help us understand on the size of the commercial organization now in the hereditary side of the business and the oncology side of business? And I just also wanted to clarify on the oncology kit piece, is that what you were referring to as the mid-teens gross margin. I just wanted to clarify, you made a comment around exiting business, having mid-teens gross margin?\n\nKen Knight -- President and Chief Executive Officer\n\nSo this is Ken. Maybe I'll start with the commercial question. When we look at our commercial team, if you look at the size of our team, we still have a very strong commercial team, as I said in the call. Our oncology team, for the most part, we are just as strong as ever.\n\nWe continue to invest in our oncology commercial channel. The changes that we made commercially were either related to exiting territories or exiting countries outside of the U.S. or exiting a specific product line as we talked about back in July. So for the most part, our commercial team is still strong, especially in oncology, and we continue to invest there.\n\nRoxi Wen -- Chief Financial Officer\n\nYes. I will add to Ken's comments on the -- in terms of your question about margin. The mid-teens gross margin for the exit business, yes, includes the distributed oncology kits business, as well as the -- about 100 countries we're exiting and also part of our IVF business. So all parts of the exit business aggregate to about mid-teens in gross margin level.\n\nPuneet Souda -- SVB Securities -- Analyst\n\nOK. Got it. OK. Thank you.\n\nOperator\n\nOur next question comes from Brian Weinstein with William Blair. Your line is open.\n\nGriffin Soriano -- William Blair -- Analyst\n\nThis is Griffin on for Brian. Just on the guide here in the second half, flat first half versus second half, so somewhere around $260 million in the second half. But can you just give us a little bit more color on how you're thinking about Q3 versus Q4? And how we should think about the pacing of that exited businesses revenue rolling off in the second half here?\n\nRoxi Wen -- Chief Financial Officer\n\nYes. Thank you for the question. So we expect Q3 in general to be higher than Q4 for a couple of reasons. One is, as you mentioned, our exit business will -- the impact of the exit business will primarily be felt in Q4.\n\nWe'll start seeing that in Q4. And also certain seasonalities will also play in. So we -- Q3 would be -- end up being -- have a higher revenue than Q4.\n\nGriffin Soriano -- William Blair -- Analyst\n\nOK. And then, Ken, maybe just recognizing it's early days since the restructuring announcement. But really just beyond the financing, I guess, if you had to point to a few things at Invitae, that really kind of went wrong at the core. I mean, how do you overcome some of those structural issues like maybe a lack of demand or early adoption for genetic testing into widespread clinical practice? Is that really the last iteration of Invitae kind of succumb to here?\n\nKen Knight -- President and Chief Executive Officer\n\nWell, you know what, it's tough to kind of go back too much to do Monday morning quarterback and looking back into the year. I would say that we're on a journey to establish a new era of Invitae. And it's really basically focusing on two or three fundamentals. One is to ensure that as we operate our business that we do it in a way that drives toward cash independents, capital independents.\n\nAnd so, when we focus on getting to cash flow positive, that's because we want to be able to invest in ourselves and invest in our business in the long -- for the long term. Secondly, we had to extend our cash runway, that was not an option we had to deliver on a plan to do that, and we believe we have. And then, I think, a third offshoot to this as I talked about earlier is as we started looking internally at our focus and our prioritization, we found opportunities to really kind of codify the team around items that we really can deliver. And I believe that that focus and that prioritization is going to result in better execution, and that execution is going to be how we earn the right to continue to invest into our future.\n\nSo not looking backwards, I'm looking forward, and that's how I see the opportunities for Invitae. And we are still a leading genetic tester, testing in this organization in this industry. And so we like our chances.\n\nGriffin Soriano -- William Blair -- Analyst\n\nOK. I appreciate the question. Thank you.\n\nOperator\n\nOur next question comes from Dave Delahunt with Goldman Sachs. Your line is open.\n\nDave Delahunt -- Goldman Sachs -- Analyst\n\nSo if my math is right here, a 16% to 17% decline next year followed by a 20% increase in '23 would then put us at about flat in '23. Am I thinking about that right?\n\nRoxi Wen -- Chief Financial Officer\n\nYes. You're thinking about that right. We are expecting to roughly have a year of stabilization from a total revenue perspective in 2023, given the exits that we're planning, and also the growth we are seeing in 2023 for the remainder of the business.\n\nDave Delahunt -- Goldman Sachs -- Analyst\n\nAnd so, what do you expect to be the main sources of that growth when we get out there longer term?\n\nKen Knight -- President and Chief Executive Officer\n\nI mean, I think, a couple of things is we talked about it that we're going to have an opportunity to really have scalable growth with our ability to bring to the market better workflows and aggregation of testing menus and better ability to serve our customers and our patients, we see a scalable growth opportunity that we are currently pursuing, and that's going to continue to fuel our long-term growth. Our core testing business has great opportunities to grow as well. As I talked about with our somatic offering, combining that with our germline hereditary cancer offering, the oncology product portfolio is going to be strong. And with the combination of our PCM, we can help cancer patients throughout their entire journey.\n\nAnd we'll be able to do that better than we ever had before. So we see core growth in our testing business. And then, the final piece of it is we talk about our transformative growth opportunity with how we put all the pieces of the puzzle together for the future, that's going to be our data business and our patient network is going to be part of our growth as well. So we've got three pillars of growth into the future.\n\nAnd that's why we're still bullish on our opportunity to continue to grow the business while we are containing costs and managing cash.\n\nDave Delahunt -- Goldman Sachs -- Analyst\n\nGreat. And then, any puts and takes on the more conservative gross margin expectations?\n\nKen Knight -- President and Chief Executive Officer\n\nWhen you say more conservative, what do you mean by that? I think, we lose you.\n\nDave Delahunt -- Goldman Sachs -- Analyst\n\nJust any -- yes, no, I'm here. Yes, just any additional color you can give us on your -- what you're expecting for gross margin?\n\nKen Knight -- President and Chief Executive Officer\n\nI think, what Roxi laid out for you is how we see it is that, obviously, we've shown over the last several quarters that we can expand our gross margin, and we've done that through kind of managing revenue, managing costs and just being a little bit more intentional about it. And then, we see opportunities with some of the exited businesses and territories and things like that. We chose to exit businesses that were in aggregate in the mid-teens in terms of gross margin. So getting better quality revenue, continuing our journey on improving our cost and efficiency and focusing and investing in businesses that have higher growth and higher gross margin potential is why we see a positive upward trajectory on our gross margins into the short term and into the long term.\n\nAnd so that's what we're signaling, and that's how we see the business going forward.\n\nDave Delahunt -- Goldman Sachs -- Analyst\n\nGreat. Thanks, guys. Thank you.\n\nOperator\n\nOur next question comes from David Westenberg with Piper Sandler. Your line is open.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nI want to actually go to a different angle and talk about the NCCN guidelines and germline testing on CRC. Could you give us a reminder on how often germline testing is done by the oncologist versus the primary care physician or versus the OB/GYN? And is there an opportunity to increase that? And then, can you talk about the long-term synergies of doing that germline testing with the oncologist and then maybe going back to some of that MRD asset potential in the future?\n\nKen Knight -- President and Chief Executive Officer\n\nYes. Sure. So the NCCN guidelines really open up the adoption and utilization of germline genetic testing for colorectal cancer patients. This has been something we've been advocating for, and it's the right thing to do.\n\nIt's the best care for those patients. And so, we're extremely excited about it. And as we see it, we see the patient population who would be having availability for germline genetic testing doubling, conservatively doubling as a result of these guidelines. And so, who's going to order that and how that works out, it's probably more than we can get into on the call.\n\nBut the changes in the guidelines are, is an accelerator for opportunity to serve those patients and we are well-positioned to take advantage of that.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nGot it.\n\nKen Knight -- President and Chief Executive Officer\n\nYou started talking about the opportunity with PCM monitoring and how we see all that playing out is, obviously, a patient with cancer needs several things, they need the right therapies to be prescribed for them. And we believe knowing the DNA of the tumor, as well as how the patient's body operate gives them the best opportunity to getting therapy selected and guided. And sometimes the therapy needs to change however, the tumors can become resistant to the treatments. And so, it's not just an initial guidance of therapy, but it's also a continual helping the patient through that journey.\n\nAnd then, once a patient is in remission, we have the ability to kind of monitor through looking at circulated ctDNA in their bloodstream and detecting whether or not the tumor is recurring. And so, the diagnosis and prognosis are better with early detection. And so, this is a compilation of a body of work that's going to be super important for oncology patients for the future. And we also believe that getting access to these treatments does not always have to come through an oncologist.\n\nWe work with genetic counselors. We also work with OB/GYNs. We had to serve the patient in any way that we can and how they get access to our services is in a variety of ways. So -- but the combination is going to be powerful for the patient.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nGot it. Appreciate it. And then, just as a quick follow-up, you discussed -- I know on the last -- on the pre-announcement call, you didn't really want to talk or you weren't ready to talk about the 2024 refinancing of term loans. I'm just curious if maybe now is the right time, particularly because you now did extend your cash runway, I believe to 2024.\n\nAnd it does look like you have a good road map. But if you're not -- if that's not a conversation for today, we understand that as well?\n\nRoxi Wen -- Chief Financial Officer\n\nI mean, we've been pretty open with responding to this question. What we've done is, again, right, with the realignment plan, we have time to address the 2024 maturity term loan, as well as the convert. And we are, again, very encouraged, as Ken mentioned, with the trajectory we're seeing, the performance improvement we've seen both on gross margin, cash management. And we're having a lot of conversations.\n\nOptions are on the table, having a lot of conversations with folks at the moment can be very specific. But this is something very -- we understand the impact of the debt overhang on our stock performance. And we -- this is something we're working, it's a priority, and we'll update folks once we have more information to share. It's important to us, but we are working toward a solution by hopefully mid of 2023.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nPerfect. Thank you so much.\n\nOperator\n\nOur next question comes from Daniel Brennan with Cowen. Your line is open.\n\nDaniel Brennan -- Cowen and Company -- Analyst\n\nGreat. Maybe to start just on the cost-cutting plans, Ken or Roxi, could you just help us think through while certainly a meaningful reduction and a great step in the right direction, could you even walk us through maybe some of the metrics that got you there? And is there a potential to kind of even go further, in particular, maybe on the gross margins? It sounds like if we strip away the sale of the low-margin businesses, your gross margin should get to like 50% or so, I guess, and kind of what's the potential for that to go higher? And then, as we look at your opex, what stands out to us is your R&D, which looks certainly high versus peers, particularly given your business mix. I'm wondering if there's further potential on R&D, or maybe you can just point us within your cost structure, if you were to go further, kind of what are the right levers?\n\nKen Knight -- President and Chief Executive Officer\n\nLet me take -- I'll take a run at that. First of all, when we talked about the cost reduction, the opex improvements when we announced it in July, we were very clear that we aren't going to kind of go through each of the line items in our cost table. But it was pretty obvious that R&D is one of our larger expenditures. And so, there was -- there's going to be material impact to our R&D as a result of this now.\n\nAt the same time, we were -- we feel we were really intentional and pretty darn smart about how we went about this. We looked at the business opportunity, the ability to serve our patients and clients, and we try to do this holistically. It wasn't just a kind of we didn't just make it up at the last minute. We really worked on this thoughtfully over a period of weeks than two months.\n\nAnd we feel really good about the fact that we targeted the right businesses for us to exit. We targeted either they had -- they weren't fitting our long-term objectives or we didn't like the path it was going to take to get those businesses or those territories to be cash flow positive. It just was going to take too long. So we had an element of time that we looked at in going through this.\n\nAnd we -- so we like where we landed at. And as we can tell by when we talk about what's happening in the second half of '22 and going into '23, these decisions did not come without an implication on revenue. And so, when we looked at the revenue cycle, the impact on cost, the improvement on gross margins, we saw for the longer-term health of the business and health of the company with all those inputs. And so, we feel we landed at a really good space, now we just have to execute.\n\nThe question is, could we have gone farther? I think, we -- I'll just say I think we landed at the right place for us at this time. And the execution of it is in our hands, it's right in front of us. And so, we're pretty excited about the opportunity for the new era of Invitae. And we're going to control what we can control.\n\nAnd when we do that, we think we will deliver -- extend the cash runway and a path toward cash flow positive business in the near term.\n\nDaniel Brennan -- Cowen and Company -- Analyst\n\nGreat. No. Thanks, Ken. Maybe on the top line, could you just walk through maybe a little color on the factors that support the 15% to 25% growth across your markets? Like maybe in particular, there's the view as you mentioned like the cost-cutting, obviously, has brought down the growth rate from the prior like 40% target down to this level.\n\nBut it would be great to hear maybe some of the basic building blocks, if you would, like across oncology and women's health and rare disease and data like which of those businesses, like do you expect to grow kind of toward the high end or the low end of that range? And are you anticipating, say, versus the addressable market, like in which of those segments do you think you'll grow in line or which of those are you taking share or losing share? Any color that would help us get like some visibility and confidence in that 15% to 25%?\n\nKen Knight -- President and Chief Executive Officer\n\nYes. I mean, so when we kind of look at the business lines themselves, and we just kind of just look at Q2, our women's health business grew higher than our total company, we -- the revenue quarter over -- year over year was about 18%, and women's health outpaced that. Our data business is just getting started, and it's starting to get into mid-upper teens of growth. And we're excited about the projection of opportunity in our long-term data transformative business.\n\nOncology was a little bit lower than the corporate total number, but we have products that we're launching. We have somatic assays coming out in the second half of the year. PCM is just getting started. So we are bullish on our hereditary cancer or oncology business and the future prospects for growth.\n\nSo there's nothing that really we see at the current time frame that would say that our 15% to 25% is not achievable. And we -- when we decided to solve for the health of the business, we decided to make sure that we were not depending on outsized growth that was not delivering quality revenue to solve for the health of the business. And so, by no means what we turned down growth that is healthy growth, and we expect that we're going to be out there fighting and competing for business into the future, but we're going to do it in a very responsible way. And we have great products and great people and great relationships that we don't plan to abandon any of them.\n\nAnd so, yes, I mean, it's different than what we've maybe signaled in the past and the 40% growth, but it's also well within our capabilities to hit that 15% to 25% growth and deliver on the cost improvements and the cash management. I continue to talk to our team about, this is a moment for us. Maybe in the past, we were trying to decide if we could do one or the other, so we grow 40% or could we get to cash management? I think, now, this is an an moment for our company, and we're intended upon doing both growing and delivering a healthy business.\n\nDaniel Brennan -- Cowen and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Bruce Jackson with The Benchmark Company. Your line is open.\n\nBruce Jackson -- The Benchmark Company -- Analyst\n\nCould -- do you have a capex target for this year and next year?\n\nRoxi Wen -- Chief Financial Officer\n\nBruce, thank you for the question. Capex is part of our cash burn target, and we are not and have not issued specific capex target, but it's included in part -- as part of our cash burn guidance.\n\nOperator\n\nThere are no further questions waiting at this time. So I'll pass the call back over to the management team for closing remarks.\n\nKen Knight -- President and Chief Executive Officer\n\nThank you, operator. I remain positive about the market opportunities for Invitae, our team's ability to execute and what the future holds for our company. I want to thank everyone for joining us on the call today. And if you have any questions, please reach out to our investor relations team.\n\nWe appreciate your continued support, and have a great rest of your day. Thanks all.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHoki Luk -- Head of Investor Relations\n\nKen Knight -- President and Chief Executive Officer\n\nRoxi Wen -- Chief Financial Officer\n\nYuko Oku -- Morgan Stanley -- Analyst\n\nPuneet Souda -- SVB Securities -- Analyst\n\nGriffin Soriano -- William Blair -- Analyst\n\nDave Delahunt -- Goldman Sachs -- Analyst\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nDaniel Brennan -- Cowen and Company -- Analyst\n\nBruce Jackson -- The Benchmark Company -- Analyst\n\nMore NVTA analysis\n\nAll earnings call transcripts"
}