{
  "companyName": "17 Education & Technology Group Inc.",
  "companyTicker": "YQ",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/14/17-education-technology-group-inc-yq-q2-2022-earni/",
  "content": "17 Education & Technology Group Inc. (YQ 13.33%)\nQ2 2022 Earnings Call\nSep 13, 2022, 9:00 p.m. ET\n\nOperator\n\nGood evening, and good morning, ladies and gentlemen, and thank you for standing by for 17EdTech's first quarter 2022 earnings conference call. [Operator instructions] As a reminder, today's conference call is being recorded. I'll now turn the meeting over to your host for today's call, Ms. Lara Zhao, 17EdTech's investor relations manager.\n\nPlease proceed, Lara.\n\nLara Zhao -- Investor Relations Manager\n\nThank you, operator. Hello, everyone, and thank you for joining us today. Our earnings release was distributed earlier today and is available on our IR website. Joining us today are Mr.\n\nAndy Liu, founder, chairman and chief executive officer; and Mr. Michael Du, director and chief financial officer. Andy will walk you through our latest business performance and strategies, followed by Michael, who will discuss our financial performance and guidance. They will be available to answer your questions during the Q&A session after the prepared remarks.\n\nBefore we begin, I'd like to remind you that this conference call contains forward-looking statements as defined in Section 21E of the Securities Exchange Act of 1934 and the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements are based upon management's current expectations and current market and operating conditions and relate to events that involve known or unknown risks, uncertainties and other factors, all of which are difficult to predict and many of which are beyond the company's control. These risks may cause the company's actual results, performance or achievements to differ materially.\n\nFurther information regarding these and other risks, uncertainties or factors is included in the company's filings with the U.S. SEC. The company does not undertake any obligation to update any forward-looking statements as a result of new information, further events or otherwise, except as required under applicable law. I will now turn the call over to our chairman and chief executive officer to review some of our business development and strategic direction.\n\nAndy, please go ahead.\n\nAndy Chang Liu -- Founder, Chairman, and Chief Executive Officer\n\nThank you, Lara. Hello, everyone. Thank you all for joining us on our second quarter 2022 earnings call. Before we begin, I would like to mention that the financial information and non-GAAP numbers in this release are presented on a continuing operation basis, and all numbers are based on the RMB, unless otherwise stated.\n\nWe are glad to report a solid performance in the second quarter. Before we go into the details, let me update you with some quick highlights. Firstly, we recorded RMB 133.5 million of net revenues in the second quarter of 2022, 11.2% higher than the top end of our estimates provided earlier in June. This was achieved through higher revenue contribution from our teaching and learning SaaS business.\n\nSecondly, our operational efficiency continues to improve, and we recorded a substantially narrowed GAAP basis net loss compared with the same period in 2021, allowing us to achieve net profitability on a non-GAAP basis for the last three consecutive quarters. Thirdly, our new teaching and learning SaaS offerings have gained further momentum and won strong recognition and demand from the government and relevant authorities, contributing an increasing proportion of the company's net revenues in this quarter. Now let me go into some more details. Let's start with our in-school teaching and learning SaaS business.\n\nDuring the period, our teaching and learning SaaS offerings have witnessed major milestones. We successfully delivered a districtwide precision teaching and adaptive learning system project based on intelligent homework in Shanghai Minhang district in the second quarter of 2022. The system has been regularly used throughout the teaching process and it's well recognized by teachers, students and education authorities. This is a clear example satisfying the standard for active use set by education authorities.\n\nThere were a total of 156 schools in Minhang district using our precision teaching and adaptive learning system. During the waves of COVID outbreaks in the second quarter of 2022, our precision teaching and adaptive learning system have played a significant role in helping Minhang authorities for a high-quality online teaching environment for qualified content delivery, collect study information and provide interactive communication between schools and authorities. In the four months after the implementation, around 120,000 students used our system and completed a total of 11 million copies of homework assignments cumulatively. The value of our system is well recognized by its various users.\n\nIt is a clear illustration of a 17EdTech's pioneering capability in the digital transformation of China's education industry. We continue to see greater market potential and opportunities as we make further progress in our teaching and learning SaaS business. Chinese government's continuous endeavor in the digital transformation of Chinese education system to implement enhanced levels of personalization during the teaching and learning process has been the backdrop providing a focused demand for our OneSmart teaching and learning SaaS offerings. It is also to be noted that throughout the entire loop of education progress, homework is the most ideal scenario for steady data collection.\n\nThe ability to collect homework data effectively and efficiently is a key to materialize data-driven differentiated and individual life teaching. Only with the support of the big data and intelligent technology, the requirement of improving homework efficiency can be truly achieved. The precision teaching and adaptive learning system project based on intelligent homework in Minhang is a flagship case we have successfully delivered, not only in Minhang district and national smart education demonstration district designed by MOE, which has substantial illustrate value and influence over cities and districts across China. Our solution has become a clear flagship example of how such a system enables individualized homework and precise teaching while meeting normalized application required by the relevant operators, while reducing the burden of students and schools and improving learning and teaching efficiencies required by double reduction policy.\n\nAs we expanded our sales channels into a broader range, we have signed partnership agreements with over 50 local distribution agents to enlarge our distribution network. We are confident that the increasing market needs will lead us to a deeper market penetration. In the meanwhile, the company is also actively exploring a real response of recurring SaaS billing model for our teaching and learning SaaS offerings with our current and potential customers. This includes one-stop overall solution combining software, hardware and service, although currently not prevalent billing models, the recurring SaaS billing model is expected to gain popularity among local authorities and schools versus the traditional one of procurement model because of the upfront cost of reduction and the promotion of normalized application-based procurement by the Ministry of Education.\n\nHigher proportion of revenue from recurring SaaS billing model also means a healthier financial profile given the steady and predictable ongoing revenue stream. We have already seen a recent product expected to be operated under this model and obtained positive feedback from the local education bureau on such recurring SaaS billing model. In terms of off-campus businesses, we will continue to explore and improve our self-directed learning product based on student and parent feedback to fulfill the diverse and multinational learning demands of students and provide with targeted customized learning content in line with the government's regulation. Q2 marks a few key milestones in our new business model after the double reduction policy.\n\nWe are glad to see these positive momentums are being turned into projects with reputation earned and revenue recognized. As we deploy our SaaS business opportunities and expand our sales network nationwide, we grew even more determined in our new strategies and saw an increasing amount of business opportunities arising. Looking ahead, we expect our teaching and learning SaaS business to continue a significant proportion to the overall revenues in the coming quarters. We are confident that the synergistic linkage between in-school and off-campus business will enable us to build a high-quality education platform, driven by science and technology with ingenuity helping the digital transformation and upgrading of Chinese education industry, reducing the burdens of students and schools, improving education efficiency and making contributions to the promotion of Chinese education reform.\n\nNow I will turn the call over to Michael, our CFO, to walk you through our latest financial performance. Thank you.\n\nMichael Chao Du -- Director and Chief Financial Officer\n\nThanks, Andy, and thank you, everyone, for joining the call. I will now walk you through our financial and operating results. Please note that all financial data I'll talk about will be presented in RMB terms. I would like to remind you that the quarterly results we present here should be taken with care, and reference to our potential future performance are subject to potential impacts from seasonality and one-off events as a result of the series of regulations introduced in 2021 and a corresponding adjustment to our business model, organization and workforce.\n\nThe second quarter of 2022 is the third quarter of operation after we officially seized our online K-12 after-school tutoring services and generated revenue purely from our continuing businesses. Our new business strategy has shown positive momentum in the second quarter with in-school teaching and learning SaaS businesses seeing additional delivery during the second quarter of 2022. As a result of our improved operational efficiency, we are delighted to record net profitability on an adjusted basis for the last three consecutive quarters. Next, I will go through our second quarter financials in greater detail.\n\nOur net revenue were RMB 133.5 million, representing a year-over-year decrease of 80.1% from RMB 617.9 million in the second quarter of 2021. The decrease was mainly due to the cessation of our online K-12 tutoring services by the end of 2021 to be in compliance with the latest PRC regulation. However, when compared with the net revenue, excluding those from online K-12 tutoring services, our net revenue increased significantly from RMB 8.9 million to RMB 133.5 million during the same period, representing a growth of over 14 times. The company's teaching and learning SaaS offerings are contributing an increasing proportion of the company's net revenues for the second quarter of 2022 when compared with the previous quarters.\n\nCost of revenue for the second quarter of 2022 was RMB 63.8 million, representing a year-over-year decrease of 74.3% from RMB 248 million in the second quarter of 2021, which was largely in line with the decrease in net revenue due to the cessation of our online K-12 tutoring services under the new regulatory and business environment. Gross profit was RMB 69.7 million, representing a year-over-year decrease of 83.5% from RMB 422.9 million in the second quarter of 2021. Gross margin for the second quarter of 2022 was 52.2% compared with 63% in the second quarter of 2021. On the expense side, total operating expenses for the second quarter of 2022 were RMB 103.8 million, representing a year-over-year decrease of 85.2% from RMB 702.6 million in the second quarter of 2021.\n\nThe total operating expenses for the second quarter of 2022 included RMB 30.1 million of share-based compensation expenses. Sales and marketing expenses for the second quarter of 2022 were RMB 11.7 million, which included RMB 3.4 million of share-based compensation expenses, representing a year-over-year decrease of 96.2% from RMB 306.7 million in the second quarter of 2021. This was mainly due to the decrease in promotional cost expenses and advertising expenditures as a result of the change in the regulatory environment, as well as staff optimization since the regulatory change. R&D expenses for the second quarter of 2022 were RMB 35.7 million, which includes RMB 7.2 million of share-based compensation expenses.\n\nThis represented a year-over-year decrease of 84.4% from RMB 229.5 million in the second quarter of 2021. The decrease was primarily attributed to stock optimization and expenses saved in line with the business adjustment. G&A expenses for the second quarter of 2022 was RMB 56.4 million, including RMB 19.5 million of share-based compensation expenses, representing a year-over-year decrease of 48.5% from RMB 109.5 million in the second quarter of 2021. This decrease was primarily attributable to staff optimization and expense saving measures in line with our business adjustment.\n\nLoss from operations was RMB 34.1 million, compared with RMB 279.8 million in the second quarter of 2021. Loss from operations as a percentage of revenue for the second quarter of 2022 was negative 25.5%, which was significantly narrowed from negative 41.7% in the second quarter of 2021. Net loss for the second quarter of 2022 was RMB 26.4 million, compared with a net loss of RMB 266.7 million in the second quarter of 2021. Net loss as a percentage of net revenues was negative 19.8% in the second quarter of 2022 compared with negative 39.8% in the second quarter of 2021.\n\nOur adjusted net income on a GAAP basis for the second quarter of 2022 was positive RMB 3.6 million, compared with an adjusted net loss of RMB 218.2 million in the second quarter of 2021. Adjusted net income as a percentage of net revenue was positive 2.7% in the second quarter of 2022, substantially improved from the negative 32.5% in the second quarter of 2021. With that, I will now provide our business outlook. Based on our current estimates, total net revenues for the third quarter of 2022 are expected to be between RMB 120 million and RMB 114 million.\n\nThis estimated net revenues for the third quarter of 2022 is derived entirely from ongoing business of the company's business transformation and does not include revenues from legacy online K-12 tutoring services. This estimated range represents a significant increase year over year as compared with the relatively small base of the net revenues generated from online K-12 tutoring services for the third quarter of 2021. I would also like to note that our teaching and learning SaaS products involve education bureaus and schools and it typically needs to go through a long cycle bidding process. It is thus inevitably subject to a potential delay in project bidding process, our project delivering process due to factors such as COVID outbreaks and others.\n\nThis means our revenue recognition progress might fluctuate from quarter to quarter due to factors that we have limited control over, especially in early quarters of our revenue ramp-up period. The forecast reflects 17EdTech's current and preliminary review and is, therefore, subject to change. Please refer to the safe harbor statement contained in our earnings release for the factors that could cause actual results to differ materially from those contained in any forward-looking statements. With that, that concludes our prepared remarks.\n\nThank you. Operator, we are ready to begin the Q&A session.\n\nOperator\n\nThank you, management. [Operator instructions] We have a question from the line of [Inaudible] from [Inaudible] Capital. Please proceed.\n\nUnknown speaker\n\nYeah. My question is that the management has announced the share buyback plan last year. And so we want to know what's the process of the share buyback plan so far.\n\nMichael Chao Du -- Director and Chief Financial Officer\n\nLet me take this question. Thanks for the question. Yes. We announced a share buyback program last November.\n\nWe are actually in the process of continually buying back the shares at a speed that we consider appropriately so far. Our plan is to continue such buyback -- share buyback programs. In later periodic reports, we will provide detailed numbers about the number of shares and amount we have used.\n\nUnknown speaker\n\nThank you very much. And also, congratulations to the achievement that you guys have achieved. Fantastic.\n\nMichael Chao Du -- Director and Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you for the questions. [Operator instructions] And there are no further questions from the phone line. May I hand the call back to the management? Please continue.\n\nLara Zhao -- Investor Relations Manager\n\nThank you, operator. In closing, on behalf of 17EdTech's management team, we'd like to thank you for your participation on today's call. If you require any further information, please feel free to reach out to us directly. Thank you for joining us today.\n\nThis concludes the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLara Zhao -- Investor Relations Manager\n\nAndy Chang Liu -- Founder, Chairman, and Chief Executive Officer\n\nMichael Chao Du -- Director and Chief Financial Officer\n\nUnknown speaker\n\nMore YQ analysis\n\nAll earnings call transcripts"
}