{
  "companyName": "OptimizeRx Corporation",
  "companyTicker": "OPRX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/optimizerx-corporation-oprx-q2-2022-earnings-call/",
  "content": "OptimizeRx Corporation (OPRX 1.45%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, everyone. Thank you for joining OptimizeRx's second quarter fiscal 2022 earnings discussion. With us today is the chief executive officer of OptimizeRx, William Febbo. He is joined by company's chief financial officer, Ed Stelmakh; chief commercial officer, Steve Silvestro; general counsel and chief compliance officer; Marion Odence-Ford; and senior vice president of corporate finance, Andrew D'Silva.\n\nAt the conclusion of today's earnings call, I will provide some important cautions regarding the forward-looking statements made by management during today's call. I would like to remind everyone that today's call is being recorded and will be made available for replay via webcast only. Instructions are included in today's press release and in the investors section of the company's website. Now with that, I'd like to turn the call over to OptimizeRx CEO, William Febbo.\n\nSir, please go ahead.\n\nWill Febbo -- Chief Executive Officer\n\nThank you, operator. Good afternoon to all, and I hope you've had a good start to the summer season with friends and family. As it relates to today's earnings release, while we continue to report strong KPIs as a measurement of long-term execution and growth potential, we have experienced some short-term headwinds as reflected in our quarterly results. While growth slowed considerably in Q2, we are confident that we have made the necessary investments, which will yield profitable growth while sustaining a competitive differentiation.\n\nBased on the first-half results, we are adjusting our forecasted revenue growth down to approximately 10% at the high-end of our range for the year. While this is below where we expected to be this year, we believe it is primarily a timing issue related to some of the issues I will discuss in detail. Our 2022 challenges are closely tied to three macro factors. Significant year-over-year reduction in FDA drug approvals impacting timing of new product launches, higher turnover of decision-makers within pharma on the back-end of COVID-19, and a longer sales cycle for larger technology spend opportunities that need internal alignment and approvals and routine periodic legal and regulatory reassessments of commercial tactics.\n\nTo be more specific about the aforementioned causes, we saw delays in several very large enterprise deals as a result of timing around brand launch dates. We believe a lot of this is tied to bandwidth issues at the FDA as they have seen substantial employee turnover in recent months, which has resulted in a novel new drug approval decreasing by over 40% when compared to 2021. While these events were not expected, timing disruptions across healthcare do occur. However, these contracts were known very much in play and are expected to be material contributors to future revenue and position us with brands very early in their life cycle.\n\nSecondly, we are noticing that as we become further embedded in pharma's commercial ecosystem, we have been successfully structuring larger, more complex programs for our customers. The closing of these deals is taking longer to complete as they involve more than one decision-maker and further rounds of review and assessment as part of our customers' internal procurement policy. However, these technology-enabled opportunities are multi-million dollar categories per brand. In addition, we see these opportunities across multiple brands where strong ROI has already been demonstrated.\n\nWhile changes in our historical deal velocity can impact the cadence at which revenue flows through our P&L, we believe the breadth and scope of these deals would represent a transformative shift for OPRX and will make us more relevant to our customers. This is in line with what other companies have had broken through and become a strategic commercial partner to pharma have experienced along their growth journeys. Nevertheless, the $10 billion in digital industry spend that we are selling into remains very much intact and continues to expand. While the deal timelines have extended to longer periods, they do not affect our win rate.\n\nA recent McKinsey article referred to health services and technology sector as a long-term growth story, driven by a rapid adoption of data and advanced analytics and software, driving innovation across several areas where OptimizeRx has made substantial investments and offers competitive technology solutions to our clients. We have noticed the flood of recent digital solutions that while lacking platform scalability and integration capabilities, it has certainly muddied the competitive landscape. However, we at OptimizeRx are playing for the long game and are working with our clients to become the clear choice for the future. Lastly, and we view this as a long-term positive for OPRX is the fact that several deals in the pipeline have been delayed as a result of key people turnover at several of our large customers.\n\nWhile this has delayed some of our existing deals as these brands bring in new decision-makers, this additional time will help us cross-sell more products in our suite to customers who weren't firmly embedded with us historically, thus broadening our potential base of revenues. While we believe the current environment is transitory, we believe it is prudent to adjust expectations given the changing landscape. In looking at overall performance of the company, we continue to perform strongly through the lens of OPRX's long-term land-and-expand strategy. We can count 95% of the industry's top 20 pharma manufacturers as our customers and remain positive with regard to the net revenue retention.\n\nClient ROI, which is based on a look back at studies over the last year and covered dozens of brands across 12 manufacturers, also remains high against their spend. These are all indicators that the platform remains both strong and highly beneficial for our clients. We continue to make significant progress in advancing our RWE solution into the market and recently had third-party review completed for our largest deal to-date, which showed an ROI that is more than twice what our customers typically look for from their investments, despite having a much larger than typical contract size. We believe this elevates our relevancy with our client base, brings us closer to them strategically and separates us from the pack in terms of the digital offerings at point of care.\n\nWe also renewed one of the original RWE deals announced last year after a really strong program performance and are currently in discussions with that manufacturer to expand our solution to all the brands in the oncology portfolio. This client represents a top 20 pharma and the expansion across brands would represent our largest engagement to-date. While moving up in deal size creates challenges that we did not experience when dealing with much smaller dollar amounts, it is where we need to be to drive the most value and showcase the scalable and beneficial platform we have developed. This puts OPRX squarely in the strategic partner spot, which is something we've been working on for several years.\n\nWe hope to announce this type of relationship within the second half of the year, and we believe others will follow. Meanwhile, we're extremely encouraged by the recent progress we have made expanding our reach outside of the point of care. To start, we have completed the tech tuck-in of EvinceMed through which we acquired an industry-leading technology and a small team, which evolves our solution for specialty medications to further benefit doctors and patients, while greatly helping our client base. This additional technology starts to build out the connectivity with hubs, specialty pharmacies and retail pharmacies.\n\nThis ultimately expands our TAM and revenue growth potential, while increasing our reach across the patient journey. We have been talking about this for some time, and it's great to see it start to come together in a way which will affect top line, bottom line and ultimately help the relationship between doctors and patients. McKinsey recently shared their view that the growth in specialty drug spend is driving the forecasted 5% CAGR from 2021 to 2025 and this vertical integration moves OPRX squarely at the intersection of specialty workflow and distribution. In a similar vein, we recently established two partnerships.\n\nIn June, we announced exclusive partnership with equals 5, which substantially experience the breadth of our platform as equals 5, is the only healthcare provider, HCP level solution, providing targeted physician engagement across social media platforms. This partnership enables us to bring our novel approach to leveraging real-world evidence to engage HCPs on social platforms. This exciting new platform extension gives our pharma clients the ability to touch up to 84% of the prioritized HCPs on the social media platforms they utilize with specific content. Finally, we recently closed a partnership with Cooler Screens, which extends our reach to patients at the point of dispense at retail pharmacies, starting with Walgreens.\n\nWe are just getting started in retail and specialty pharmacy. But as we have spoken about, it's a priority, so we can be available in all areas of the patient's journey to help them start and stay on therapy. And with that, I'd like to turn the call over to our CFO and COO, Ed Stelmakh, who will walk us through the financial details for Q2. Ed?\n\nEd Stelmakh -- Chief Executive Officer and Chief Operating Officer\n\nThanks, Will, and good afternoon, everyone. As with all our calls, a press release was issued with the results of our second quarter ended June 30, 2022. A copy is available for you and may be downloaded from the investor relations section of our website. Additional information can be obtained through our forthcoming 10-Q, which will be filed later today.\n\nTurning to our financial results for the period. Our revenue for the quarter was $14 million, an increase of 3% over the $13.6 million from the same period in 2021. And our gross margin increased from 59% in the quarter ended June 30, 2021 to 64% in quarter ended June 30, 2022 as a result of solution and network partner mix. As we highlighted in our previous earnings call, there has been an increase in the percentage of activity flowing through channels with more favorable economics when compared to a year ago.\n\nGiven the macro environment we've already highlighted, we are updating our guidance for 2022, which now calls for revenue to come in between $62 million and $68 million. On a more positive note, we are updating our full year gross margin range from 57% to 60% to 59% and 62%, due to a favorable solutions mix and channel partner momentum, which we have built in the first half of 2022, and we expect to carry through the rest of the year. Our operating expenses increased from $7.7 million for the three months ended June 30, 2021 to $12.9 million during the second quarter of 2022. This increase in expense is primarily due to the investment in, and expansion of the OptimizeRx team to enable future growth, which also includes our acquisition of EvinceMed, which closed in April.\n\nProviding more color around our year-over-year increase in opex, nearly two-thirds of the $5.2 million total increase was tied to non-cash expenses, with the remaining amounts related to the full year impact of 2021 hires and the EvinceMed acquisition. We expect our cash-based opex run rate for the remaining quarters of the year to stay relatively consistent with second quarter 2022. We had a net loss of $3.9 million or $0.21 per basic and fully delivered share for the three months ended June 30, 2022 as compared to a net income of $0.4 million during the same period in 2021. On a non-GAAP basis, our net income for the second quarter of 2022 was $0.7 million or $0.04 per basic and fully diluted share outstanding, as compared to a non-GAAP net income of $1.8 million or $0.10 per basic and fully diluted shares outstanding in the same year-ago period.\n\nWe will continue to be fiscally prudent in our approach to investing for profitable growth. Now turning to our balance sheet. Cash and cash equivalents totaled $87.4 million on June 30, 2022, compared to $84.7 million on December 31, 2021. And we generated $4.4 million in cash flow from operations for the first six months of the year and $0.3 million during the second quarter.\n\nWe believe our strong balance sheet and cash flow favorably positions us to further expand our business solution offerings and drive profitable growth. Now I would like to turn to the company's KPIs that we introduced this past February to provide transparency, as well as quantifiable metrics that can be used to continue to communicate our story as our business grows and matures. Our average revenue per top 20 pharmaceutical manufacturer stayed relatively flat year over year at $2.4 million for the second quarter, despite adding two new top 20 customers over the last 12 months, which are still early in the relationship life cycle with us. As a result, we continue to gain ground with now 19 of the top 20 largest pharma companies in the world, which again represents the lion's share of the industry's commercial spending.\n\nIn addition, our ability to create tangible value for our clients, as well as growing demand for our solutions is reflected in our net revenue retention rate of 113% for the second quarter of 2022. Our operating model continues to demonstrate significant capability for leverageable growth with revenues per employee at $661,000 for the second quarter of 2022. This puts us firmly ahead of the technology industry back average, which is currently under $500,000 per FTE and highlights the strength of our operating model and the quality of the team we have built. We will continue to report on these KPIs on a regular basis throughout the year to ensure open and transparent communication with our shareholders.\n\nAnd now, with that, I would like to turn the call back over to Will. Will?\n\nWill Febbo -- Chief Executive Officer\n\nThank you, Ed. Operator, now let's move to Q&A.\n\nOperator\n\nThank you. [Operator instructions] And our first question comes from the line of Ryan Daniels with William Blair. Please proceed with your question.\n\nRyan Daniels -- William Blair -- Analyst\n\nThank you, guys. Thanks for taking the questions. Will, maybe one for you. I appreciate the detail on the three factors that are impacting the outlook.\n\nI'm curious if you can go into a little more nuance into the relative magnitude of each of those three as it relates to the outlook.\n\nWill Febbo -- Chief Executive Officer\n\nHey, Ryan, yeah, thanks. Thanks for calling in. Well, as you know, we've made a big shift over to specialty, and we did that for the reasons we've outlined, which is they're meaningful, the marketing spend is shifting that way. And so, when you -- in particular, you see launch delays, that does happen in this business.\n\nAnd when you're specialty focused, a lot of those launches are going to be specialty. So the good news is, we're talking to the right clients, and there's a little bit of a bottleneck on those approvals. But once those are through and we feel like they will be through, obviously, pharma is very incented to get those completed, and so is the FDA, frankly, because these are all medications that really impact patients' lives. So yeah, it was rather sudden and because we focused our time and effort on those medications where we have the longest relationship with, we saw some disruption there.\n\nBut strategically, it's absolutely imperative to stay focused on it, because it is where the marketing dollars will go, it is what our network is focused on. And frankly, the value proposition that we bring to the clients is strongest there. So a lot of communication going on and a lot of effort to work with the client through those. And as we say, we think it's largely a timing issue and not a foundational issue.\n\nRyan Daniels -- William Blair -- Analyst\n\nAnd so, with those, in particular, if that's the biggest impact, do you actually have contract agreements for when they've launched that you will be one of their digital marketing partners? Is it that -- your range?\n\nWill Febbo -- Chief Executive Officer\n\nYeah, I mean, keep in mind, we have MSAs with all of the top 19 pharmaceutical manufacturers, and we've got steady work going with the majority of brands within those manufacturers. So absolutely, these are included, they're part of the pipeline we're managing, and we've got an amazing team on those. So absolutely, they are in the flow in our backlog, so to speak, and pipeline, and it's actually pretty exciting. I mean, it's never good to disappoint in a quarter, we can recognize that.\n\nHowever, just an hour before this call, I'm on with a client talking about multi-brand discussions. So if I didn't see a lot of the direct interactivity with the clients, I would be concerned, I'd probably -- we would have used different language. But because we're seeing a lot of engagement, a lot of discussion, real partnership type discussions, those do take longer, but they're bigger and stickier and they'll bring a lot more value long term.\n\nRyan Daniels -- William Blair -- Analyst\n\nOK. That definitely is helpful color. And then, you mentioned the procurement taking a little bit longer too, as some of these contracts get bigger and it's probably somewhat related to this. But is there -- number one, anything you can do to standardize the procurement process? Or is it really just complex medical legal review of clients, number one? And then, number two, I guess, the follow-on there would be, as they do more of these programs, I assume it gets easier in the future to launch, because you've kind of gone through that med-legal review.\n\nSo it's that initial hurdle that might create an air pocket versus an ongoing issue. Is that fair? Thanks.\n\nWill Febbo -- Chief Executive Officer\n\nYeah, that's very fair. It does get easier as the legal departments get up to speed. Keep in mind, there is turnover across the board pretty much in every business, right, just given the economy and jobs, particularly in healthcare, you've got some expertise you're in demand. So yes, it does scale with comfort on the legal side.\n\nAnd frankly, the fact that they're looking at these bigger engagements and bringing in the right legal review is also a positive. It's frustrating because it always takes longer than you think, it should. But once you get through, you're through and then their partners. And frankly, you need that, right? Remember, this is a business -- we really created a space here with maybe one or two others in the space.\n\nAnd what I'm seeing is, pharma is really catching up to it. We had talked about 2020, everyone showing up at meetings in 2021, a lot of trying, really a big saturation, actually, a lot of different solutions coming to the market. And pharma is now sitting back and looking and saying, OK, who can scale, who has the platform, whose measurement is transparent. Let's do a deeper dive on the legal, because they always do.\n\nAnd the fact that they're doing all those things with us is positive.\n\nRyan Daniels -- William Blair -- Analyst\n\nI agree. OK. Very helpful Color. Thanks.\n\nWill Febbo -- Chief Executive Officer\n\nThanks, Ryan.\n\nOperator\n\nOur next question is from the line of Joy Zhang with SVB Securities. Please proceed with your question.\n\nJoy Zhang -- SVB Securities LLC -- Analyst\n\nHey, guys. Thank you for taking my question. Just a follow-up on an earlier question. Can you give us a sense of given that the novel drug approvals is a headwind, how much of your business is related to new drug launches versus engagements with existing brands?\n\nWill Febbo -- Chief Executive Officer\n\nYeah, Steve, do you want to take that one?\n\nSteve Silvestro -- Chief Commercial Officer\n\nYeah, happy to, Will. I think that I don't have an exact percentage basis for you of launch brand versus in-line brands. But what I can tell you is that when launch brands are delayed, in-line brand budgets are pulled back or paused for a period of time, and when those delays occur, it basically pauses the marketing spend until things are sort of moving in the right direction in terms of new launches. And franchises, meaning therapeutic areas are managing portfolios of assets and looking at assets that are currently in-line, that are approaching LOE, assets that are about to launch.\n\nAnd so, they're managing that budget over one or two or three different assets. So I think, the pause not only impacted launch brands, that have impacted in-line brands ability to continue to secure funding. And that was really the genesis of the challenge. But to answer your question more directly, I would say probably somewhere in the vicinity of 20%, 30% launch brands balance in-line brands.\n\nThose are rough estimates, but that's directionally correct.\n\nJoy Zhang -- SVB Securities LLC -- Analyst\n\nGot it. That's super helpful. And I guess, digging a little deeper into the FY '22 guidance, can you just talk to what kind of contract launch expectations is baked in? Do you expect to recover revenues from all of the delayed contracts? Or are you sort of factoring potential delays in the second half as well?\n\nWill Febbo -- Chief Executive Officer\n\nSure. So I'll start, but I'll hand it over to Ed or Andy on the stats around that. But look, we're, obviously, being conservative. We think we've talked about white space and upside, and we feel like that's all still there.\n\nAnd these disruptions happen, but at the end of the day, everyone's got to get back to business, and launches start to roll again. And the indications that are in our mix are really relevant and help patients quite a bit. So we do -- we're being conservative, this is the first year we've done guidance, it's terrible to have a disruption, but it's what we have now. And Andy, Ed, maybe you can talk to specifically sort of what we can see and break that apart a little bit as it relates to guidance.\n\nEd Stelmakh -- Chief Executive Officer and Chief Operating Officer\n\nJoy, this is Ed. Yes. So basically, just to compare what we saw Q1 when we initially gave guidance to where we are now. So initial guidance was based on about a 50% line of sight kind of sold and in the bank forward of revenues.\n\nAnd what we see today, we probably are looking at about 80% to 85%. So ample surplus comparisons for you. And we are being pretty conservative, as Will said, on any kind of upsells or buy ups in Q4. So we're trying to kind of be mindful of what we saw this quarter and baking that into our current kind of the forecast for the year.\n\nJoy Zhang -- SVB Securities LLC -- Analyst\n\nGot it. That's super helpful. Thank you.\n\nWill Febbo -- Chief Executive Officer\n\nYeah, thanks, Joy.\n\nOperator\n\nOur next question is from the line of Sean Dodge with RBC Capital Markets. Please proceed with your question.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nYeah. Thanks. Good afternoon. Maybe Ed, I just want to make sure I heard that last answer correctly.\n\nSo your guidance, I think you said initially assumed a 50% coverage on the range. And now, with the revision you're baking in about 85% coverage so you've got visibility on 85% of what you need to hit that target versus 50% that you had previously. Did I get that right?\n\nEd Stelmakh -- Chief Executive Officer and Chief Operating Officer\n\nYes, that's correct.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nOK. Great. And I guess -- so Will, you talked about some macro factors that have been issued. Is there anything you can share kind of more specifically about the sales pipeline? Has that been affected at all given these? Or is that still stable or growing? It's just as simple as it's taking longer to get things converted out of it?\n\nWill Febbo -- Chief Executive Officer\n\nYeah, that's exactly it. It's still solid. No relationships. This is not tied to us dropping the ball or a failed relationship or anything like that.\n\nWe've got high client satisfaction. And it's literally some launch delay, some decision delay just given some turnover by clients. And as they get bigger, you do go up in the decision tree and that does take time. When you're looking at multi-million dollar deals and you're connected to the franchise Senior Executive, it's a career decision, right? So everything is scrutinized more.\n\nGood news is, we've got the team, we're at that table, both Ed and I and Steve and Marion are frequently at that table. And that's a good thing. That just shows that pharma is actually taking this seriously, it's not just a nice to have tactic, but it is a true channel of communication with doctors and patients at point of care. And you have to remember, it's hard to hear this through not hitting our number, but we are one of the few that can do it at scale in the market.\n\nAnd they know that now, pharma knows that. And so, I would imagine we'll get back to our drum beat of growth as we get through this. And I think, it's going to get really exciting.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nOK. That's helpful. Thanks a lot.\n\nWill Febbo -- Chief Executive Officer\n\nThanks, Sean.\n\nOperator\n\nOur next question comes from the line of Eric Martinuzzi with Lake Street. Please proceed with your question.\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nYeah, I was wondering if there was any issues in the installed base. I know you highlighted the three major issues, but I'm flashing back to the last time we had this sort of shortfall. Thankfully, it was several years ago. But at that time, there were issues with, I think, a drug coming off branded and going generic was one issue.\n\nAnd the brand pulled in the spend that didn't originally planned. And then, another issue was an M&A transaction that sort of froze spending for both clients while they went through the integration of the two brands. So anything along those lines?\n\nWill Febbo -- Chief Executive Officer\n\nEric, it's Will. No, this -- these are the issues that we outlined, we've got a really good base and no M&A, as you've seen from the market. As we've talked about, no patent cliff issues in year. It's really a bigger spend taking longer, some launch delays and decision-maker shifts at our client base.\n\nBut no, net-net, nothing like in 2019 Q3, this is more macro. And frankly, for us, as a team, while macro is frustrating, we're just kind of putting our heads down and building through it. We've got the balance sheet to build through it. We've got even off what we would call our budget, still cash flow positive, still profitable, still highly relevant.\n\nSo yes, internally, team is very positive. We are moving past Q2, focused on getting back to growth. But no, none of these surprise patent or M&A disruptions.\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nOK. And then, it sounds like the team remains in place. There's not going to be any headcount moves here given the operating expense roughly in line for Q3 and Q4. Are you elsewhere in the business? Any focus on discretionary spending to optimize profitability? Or any other things non-personnel-related expense side?\n\nWill Febbo -- Chief Executive Officer\n\nNothing. No drama. We are -- we've always been really good at managing the money. And I would say now we have a more robust finance team, just more people with Ed's leadership.\n\nBut yes, we plan to scrutinize what we need to. But again, we are a growth company, there is a lot of opportunities. I think, with the market correction through the first half of the year, there is even more opportunities for us. So yes, we'll watch the money, but no dramatic changes just be vigilant like we always are.\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nAnd then, last question for me. It's never too early to be thinking about FY '23, assuming we are able to achieve that kind of a higher end of growth that you talked about that 10% growth in 2022. What's your outlook for acceleration from that in 2023?\n\nWill Febbo -- Chief Executive Officer\n\nYeah, I think, it will be considerable based on the conversations we're having. I think, I -- when I said it way back when we should be able to grow this business 20% to 30% every year. I think, there's only been one year where we didn't do that, and this year would be the second unless we can surpass it. But I wouldn't expect that for 2023, I would expect better growth.\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nThanks for taking my questions.\n\nWill Febbo -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nOur next question comes from the line of Marc Wiesenberger with B. Riley Securities. Please proceed with your question.\n\nMarc Wiesenberger -- B. Riley Securities -- Analyst\n\nFrom a high level, can you talk about the types of assumptions and maybe expectations that are embedded in your agreements that might impact customer ROIs and how they could differ across brands and customers? And kind of how do we think maybe about that factoring into any brand attrition, if at all? And also, do any of your deals have kind of performance incentives that could provide upside?\n\nWill Febbo -- Chief Executive Officer\n\nSure, Marc. Steve, do you want to start with that? And I'll add after you.\n\nSteve Silvestro -- Chief Commercial Officer\n\nYeah, Marc, thanks for the question. So basically, these ROIs are operated in testing control formats. So you've got a standard testing control batch looking at where the platform is deployed versus where it's not and measuring the script lift behavior with the physicians that are receiving the messages versus not. Obviously, much more intricate than that, but sort of giving you high-level cliff notes.\n\nThe ROIs are done by a third-party, they're validated and then sent back to the customer. So we work with the customer when we're setting up the methodology. There's an agreed-upon methodology, those are measured by the third-party and then the customer receives them and we sort of walk through it together. Right, to-date, we've had no disruption in any of the ROIs that have come back.\n\nThey've all been positive, as Will shared earlier on the call. Last few that we've received have been significantly impactful. And I think, the client satisfaction is going up, which is great to see. The things that come into play in an ROI calculation are the things that you're familiar with.\n\nSo it's just the cost basis of the program, the time that it runs [Inaudible] physicians that we see, messages, etc., and then the behavior on the other side. So nothing abnormal there. I think, the increase is that the efficacy of the programs in reaching the doctors is improving. And I think, as we run the programs longer, we're seeing the ROI get better and better.\n\nAnd I think that speaks to the algorithms being trained, the programs getting better, less tweaking them over time as we learn things and make them more effective. So that is the -- I think that's what I would say about the ROI.\n\nMarc Wiesenberger -- B. Riley Securities -- Analyst\n\nAppreciate that. Thank you. And then, I'm wondering, do you have a sense of how patient cohorts drive revenue across your business? And I guess, specifically related to age and type of insurance of the patient, because in the third quarter of last year, you announced an agreement with a top five pharma company related to a real-world evidence, affordability initiative. And with the impending legislation that caps out-of-pocket Medicare costs, how will that impact your real world evidence offering? And how important is that component, I guess, within the overall real world evidence solution?\n\nWill Febbo -- Chief Executive Officer\n\nYeah, I'll start and then hand it over to Steve. But the business that's really making a big difference for our clients is at enterprise level, right, Marc? So it's multiple solutions. Our lead horse is not what was financial messaging, although it's usually part of it. It's really designed at that sort of cohesive patient journey where you're building awareness, you're connected to the prescribing decisions and then you stay with that patient on their cellphone, so you can help them understand the side effects and deal with affordability as you referenced.\n\nAnd help with behavioral and understanding issues. So Steve, maybe you can talk to that particular program without names. But yes, it's a much more comprehensive solution set, which again is the differentiator. It's also why our ROIs continually go up, because you're ultimately just getting more touch points through that patient journey with the HCP, the doctor and the patient, which is very hard to do at scale.\n\nAnd before I hand it over to Steve, just remember it, Marc, when you talk about ROI, part of what pharma is looking at is, they see these high ROIs and everyone talks a high ROI game. And then, they say, OK, but can you do this at scale? Can you reach -- can I spend $20 million with you, and you get that similar ROI. And that's where you make a big difference and become a commercial partner, strategic partner. And we're starting to see that with a couple of our clients, and those take a little longer, but they're much more meaningful.\n\nSo I'll hand it over to Steve on that particular project as a reference point.\n\nSteve Silvestro -- Chief Commercial Officer\n\nThanks, Will. Marc, thanks for the follow-up question. So I think, what you're referring to specifically is sort of the downward pricing pressure in the Medicare space. And one thing that I would say to you is that most of the work that we do, most of what the pharma engages in its commercially insured patients.\n\nThere is a much more strict regulation that governs marketing to Medicare patients, and there is no marketing to Medicaid patients. And so, the vast majority of what we do is around commercially insured oriented patients. There are a couple of Medicare programs that are approved, which -- for which special dispensations have been allowed, and those manufacturers have gotten those special dispensations. But for the most part, it's commercially insured.\n\nAnd then, what I would say to you, even around the sort of Medicare patients is, the downward pressure ultimately is going to force more of a focus on volume, because pharma will be constrained to essentially get the same price capture that they've had in every script that's been written and so to maintain the same sort of level of trajectory on the profitability side, they're going to need to do more business in those areas. So the luxury of sort of being, I don't want to say, lacks of days ago, but taking kind of a non-show on approach to Medicare patients, that's not going to work if there's more pricing pressure. They'll need to focus on capturing every single patient that's eligible for a specific therapy where it's appropriate. And they've had the luxury of not needing to do that in the past.\n\nSo it will be interesting to see the dynamic change there. Of course, neither one of those really impacts what -- as Will said, what we're doing, because we're operating across franchises, across reimbursement vehicles. And in most cases, it actually represents more opportunity for us, because now they're going to need to innovate more and we sort of referenced that McKinsey article, McKinsey talked about it several times. But in these downward pricing pressure environments, more innovation comes to play, because they need to be more efficient in the way that they're approaching providers.\n\nMarc Wiesenberger -- B. Riley Securities -- Analyst\n\nGot it. Very helpful. And then, just a final one for me. If you could talk about the economics a little bit associated with the equals 5 deal, and should we think about -- and how should we think about maybe capacity constraints and ROI in that channel? And as you're moving beyond the point of care in the EHR, at least very incrementally right now, does this social offering provide any potential for DTC opportunities down the line? Thank you.\n\nWill Febbo -- Chief Executive Officer\n\nI'll start and, again, hand it to Steve. But what's -- what we've stated is, we want to be wherever doctors and patients are digitally, right? That's -- we want to be that person for that company for pharma. And we want to do it in a way that doesn't disrupt care, disrupt lives, be intrusive, but rather just help facilitate better care and patients start stand therapy. So I was -- I'm really excited about some of these other channels we're reaching out to.\n\nYou'll start to see the term omnichannel, which is used to reference multiple touch points, and the more we can get access to, the easier it is for our clients to spend more with us and do it in a holistic way connected to a patient journey. So Steve, maybe you can talk to the second part of that. But I think that's what's really exciting to me about, in particular, the equals 5 partnership.\n\nSteve Silvestro -- Chief Commercial Officer\n\nThanks, Will. I don't think that it will be a DTC play, Marc. It really is focused on HCPs. And the sort of the driving engine around that is the ability to look at specific HCPs in different environments, so social happens to be even more site environment and to be able to report back on how those HCPs engage with content.\n\nAnd I think that's sort of a critical element of being able to measure whether or not these campaigns are actually working and whether or not the technology that you're deploying is having a result coming back to the discussion around ROI. So I don't think equals 5 or the social environment as a DTC environment, although plenty of people, plenty of manufacturers advertise through Facebook and other mediums, and they use that as a DTC. That's not really our strategy here, our strategy really is focused on the HCP. However, having said that, the Cooler Screens effort is a DTC effort and that is right at point of dispense.\n\nSo when the patient goes in, picks up their script, add the pharmacy, they're getting the fill, there's an opportunity to continue to educate and work on the DTC side. So you did mentioned the Cooler Screens, but that's actually the DTC after that.\n\nMarc Wiesenberger -- B. Riley Securities -- Analyst\n\nAppreciate that clarification, and thanks for the color. Thank you.\n\nWill Febbo -- Chief Executive Officer\n\nThanks, Marc.\n\nOperator\n\nThe next question is from the line of Jeff Garro with Piper Sandler. Please proceed with your question.\n\nJeff Garro -- Piper Sandler -- Analyst\n\nHi. Good afternoon. Thanks for taking the question. I want to ask about the large deals and how we should think about timing.\n\nMore specifically, thinking about the timing between FDA approval and launch and then utilization of your services and whether the implementation period might be any longer than typically for some of these larger, more complex and tech-enabled deals.\n\nWill Febbo -- Chief Executive Officer\n\nYeah, great question. So we're very -- because we're so ingrained with the clients, we're actually working a lot of these things real time, because the assumption is they will be approved. And so, I would say the kickoff time is no longer than your typical start and go. As a matter of fact, when we start to build some of these algorithms around our RWD solution, a lot of the heavy lifting is done prior to launch.\n\nSo we're hopeful we can get those going even faster. And then, use the updates to fine-tune the algorithm for delivery of the message. But no, they -- we're not expecting them to be any longer nor are we expecting our close rate to change.\n\nJeff Garro -- Piper Sandler -- Analyst\n\nGreat. That's super helpful. And then, one more for me on the guidance. Just curious how the revised revenue guide, whether it still assumes the typical 4Q seasonality.\n\nAnd you mentioned some conservatism on kind of incremental buy-ups. And so, that kind of leads into the question of just visibility into year end budget flushes from your top 20 pharma clients?\n\nWill Febbo -- Chief Executive Officer\n\nYeah, look, it's early to talk buy-ups. You generally start to get rumblings of that at the end of Q3, early Q4. But generally, when you see any kind of slow or pullback, there is then more pressure to do more in the back half of the year, because of the use it or lose it budget structures, right? So too early to tell, but again, conservative range, but I would think it's more of a buy-up atmosphere than in previous years, at least more than last year.\n\nJeff Garro -- Piper Sandler -- Analyst\n\nThanks again.\n\nOperator\n\nThank you. We've reached the end of our question-and-answer session. I will turn the floor back to management for closing remarks.\n\nWill Febbo -- Chief Executive Officer\n\nThank you, everyone, for joining us on the call today. While we always push ourselves to grow faster and do not like the disruption of our historical growth rates due to launch delays, enterprise deal sizes and client turnover, the disruptions are temporary and in no way change our positioning or opportunity within the vast white space that we continue to sell into, which currently estimates a pharma digital TAM that is greater than $10 billion annually. We have an amazing team are profitable with positive cash flow and offer highly relevant solutions to our clients and partners. We encourage all our stakeholders to focus on the future and not view this disruption as permanent.\n\nOur expanded offerings remain very much in demand, and we have the opportunity now to cross-pollinate additional brands as a result of leadership moves within the existing franchises that we service. We are fully confident in our platform offerings, which remain best-in-class, while our expansive point-of-care network remains unrivaled in growing. This competitive moat puts us in a different class as we continue to move the needle with regard to addressing the challenges around patient access, adherence and affordability right at point of care and point of dispense. Equally important, we are continuing to build on a novel solution set with offerings that connect other stakeholders such as manufacturing reps with healthcare providers, enhance provider communications outside of the electronic health record and allow clients to stay with the patient throughout their complete care journey.\n\nWe continue to have a strong balance sheet and war chest that allows us to prudently explore innovative M&A opportunities. With the first-half market correction in our sector, we are seeing a significant increase in the level of strategic opportunities, which could further drive value to all our stakeholders. We look forward to seeing everyone again at the various investor conferences coming up and on our next update call in November. Stay healthy.\n\nOperator\n\nThank you, sir. Before we conclude today's call, I would like to provide the company's safe harbor statement that includes important cautions regarding forward-looking statements made during today's call. Statements made by management during today's call may contain forward-looking statements within the definition of Section 27A of the Securities Act of 1933, as amended and section 21E of the Securities Act of 1934, as amended. These forward-looking statements should not be used to make investment decisions.\n\nThe words anticipate, estimate, expect, possible and seeking and similar expressions identify forward-looking statements, they may speak only to the date that such statements were made. Such forward-looking statements in this call include statements regarding estimation of total addressable market size, market penetration, revenue growth, gross margin, operating expenses, profitability, cash flow, technology, investments, growth opportunities, acquisitions, upcoming announcements and the need for raising additional capital. They also include the Management's expectations for the rest of the year and adoption of the company's digital health platform. The company undertakes no obligation to publicly update or revise any forward-looking statements, whether because of new information, future events or otherwise.\n\nForward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified. Future events and actual results could differ materially from those set forth in, contemplated by, or underlying these forward-looking statements. The risks and uncertainties to which forward-looking statements are subject to include, but are not limited to, the effects of government regulation, competition, and other material risks. Risks and uncertainties to which forward-looking statements are subject to could affect business and financial [Inaudible] are included in the company's annual report on Form 10-K for the quarter ended December 31, 2021.\n\nThis form is available on the company's website and on the SEC website at sec.gov. Before we end today's teleconference, I would like to remind everyone that this call will be available for replay via webcast only starting later this evening, running through for a year. Please refer to today's press release for the replay instructions available via the company's website at www.optimizerx.com. Thank you for joining us today.\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nWill Febbo -- Chief Executive Officer\n\nEd Stelmakh -- Chief Executive Officer and Chief Operating Officer\n\nRyan Daniels -- William Blair -- Analyst\n\nJoy Zhang -- SVB Securities LLC -- Analyst\n\nSteve Silvestro -- Chief Commercial Officer\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nMarc Wiesenberger -- B. Riley Securities -- Analyst\n\nJeff Garro -- Piper Sandler -- Analyst\n\nMore OPRX analysis\n\nAll earnings call transcripts"
}