{
  "companyName": "Gap",
  "companyTicker": "GPS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/26/gap-gps-q2-2022-earnings-call-transcript/",
  "content": "Gap (GPS -1.05%)\nQ2 2022 Earnings Call\nAug 25, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. My name is Austin, and I shall be your conference operator today. I would like to welcome everyone to the Gap Inc. second quarter '22 earnings conference call.\n\n[Operator instructions] I would now like to introduce your host, Cammeron McLaughlin, head of investor relations. Cammeron, you may proceed.\n\nCammeron McLaughlin -- Head of Investor Relations\n\nGood afternoon, everyone. Welcome to Gap Inc.'s second quarter fiscal 2022 earnings conference call. Before we begin, I'd like to remind you that the information made available on this webcast and conference call contains forward-looking statements that are subject to risks that could cause our actual results to be materially different. For information on factors that could cause our actual results to differ materially from any forward-looking statements, as well as the description and reconciliation of any financial measures not consistent with generally accepted accounting principles, please refer to the cautionary statements contained in our latest earnings release.\n\nThe information included on Page 2 of the slides shown on the Investors section of our website, gapinc.com, which supplement today's remarks and the risk factors described in the company's annual report on Form 10-K filed with the Securities and Exchange Commission on March 15, 2022, and any subsequent filings with the Securities and Exchange Commission, all of which are available on gapinc.com. These forward-looking statements are based on information as of today, August 25, 2022, and we assume no obligation to publicly update or revise our forward-looking statements. Joining me on the call today are Interim Chief Executive Officer Bobby Martin; and Chief Financial Officer Katrina O'Connell. With that, I'll turn the call over to Bobby.\n\nBobby Martin -- Chief Executive Officer\n\nThank you, Cammeron, and good afternoon, everyone. It's a pleasure to speak with you all. I want to provide some brief remarks before turning it over to Katrina to cover our second quarter results and outlook. While we search for a new leader, I'm taking on the role as interim president and chief executive officer of Gap Inc., with a deep commitment to the company's success and in inpatients for change.\n\nHaving navigated the global retail industry serving millions of customers across brands and markets, I'm not approaching this work from the sidelines. To change the trajectory of our business, we need to take action. There are brands in our portfolio that are underperforming today. And like many other companies, the macro environment is testing us with simultaneous shifts in consumer behavior and increased cost pressures.\n\nWhile our elevated inventory and preferred margins are certainly current realities against unseen market conditions, they do not define Gap Inc.'s ability to capitalize on its strengths to win. We can and we should win in any environment. That is the goal, our goal and the management team and I are holding the company accountable for that. We are taking several immediate actions, including reductions in operating costs and the impairment of unproductive inventory to better optimize profitability and cash flow in the near term, which Katrina will share in detail in a moment.\n\nWhile these measures will help us in the short term, ultimately, they represent a down payment toward a larger pursuit. We must demand both a selling and a cost-conscious culture with a focus on the core levers that truly drive our business. Let me take a moment and comment on our brand. We remain bullish on Old Navy's particular for growth by delivering the democracy of style and service to a wide range of consumers.\n\nOld Navy is the No. 2 brand in apparel market share according to NPD Research, and that remains our foothold for acceleration and expansion. As you know, Haio Barbeito joined us at the beginning of August, bringing an authentic leadership style, backed by a strong track record of delivering growth through challenging times. Old Navy is working diligently to recover from recent missteps, and I'm confident, Haio is the right leader to bring the brand back to winning again.\n\nGap brands is continuing to shift its core business model by rightsizing the fleet, increasing online penetration and partnering for capital-efficient growth in North America, as well as around the world. During the quarter, Gap announced its partnership with Reliance Retail to bring Gap's modern American optimism to Indian consumers to a mix of store expressions and digital commerce platforms. On Banana Republic, Banana Republic is maintaining its focus on two simple ingredients, beautiful, high-quality products and an elevated customer experience, both online and in store. During the second quarter, Banana Republic launched a redesigned, product-led web experience, which supports its elevated brand positioning, further creating a differentiated and immersive experience for digital shoppers and, again, showcasing its product focus.\n\nThe early results have been favorable with strong consumer feedback, as well as conversion metrics. We believe Athleta has tremendous growth potential as it continues to drive brand awareness and establish authority in the active market. However, we are experiencing softness in the near term. We are quickly pivoting and reacting to meet her needs with performance lifestyle products while remaining true to our DNA.\n\nThat said, we continue to see a path toward delivering a mid-teens revenue CAGR over the long term as we capitalize on the continued secular shift and growth in the health and wellness categories broadly. I'm realistic about the hard work that lays ahead. We know what we need to deliver to our customers, and we know that it has to fully measure up. It has to be compelling.\n\nIt has to be worth the trip every time. I'm confident that our team has the capabilities needed to deliver what our customers and shareholders expect and what is needed for long-term profitable growth. And it will take an aligned focus on adopting organizational behaviors that will enable change and unleash our potential. Lastly, I'm sure that many of you have questions about our search for a permanent CEO, so I will briefly address them now.\n\nThe board is actively evaluating potential candidates, working swiftly and thoughtfully to ensure that we find the most qualified person for this role. We are focused on someone who can lead Gap Inc. from defense to offense, vitalize our creators while returning us to a position where we are gaining market share across our brands, a leader who can build upon the company's strong foundation, powerful assets, well-established values to further sell our omni platform and market leadership. Ultimately, a leader focused on delighting our customers through every experience and driving the change and momentum necessary to deliver value creation for our people and our shareholders over the long term.\n\nAnd with that, I will turn the call over to Katrina.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nThank you, Bobby, and thanks, everyone, for joining us this afternoon. As Bobby just discussed, we have four strong brands and leverage in the portfolio that will enable us to compete and win. However, the current execution challenges, combined with our volatile operating environment, are requiring us to move swiftly to manage the levers in our control and take the actions necessary to drive immediate and long-term improvements across our entire business. These actions include: one, sequentially reducing inventory through the second half of the year, including the impairment of unproductive inventory, as well as reducing future receipts; two, rebalancing our assortments to better meet changing consumer needs, aggressively manage overhead costs and the reevaluation of our technology and marketing investments in order to better position our model for the long term; and finally, fortifying our balance sheet in the face of uncertain macro trends and near-term execution headwinds.\n\nI will get into more details on these actions in a moment. So let me start with our second quarter results, as well as key drivers of our first half performance and share some color as we look to the remainder of the year. Starting with sales, total company sales of $3.86 billion were down 8% versus last year, or 7% on a constant currency basis. Coming off of peak inflation and the higher gas prices, particularly impacting the low-income consumer in June, we have seen an improvement in sales trends in July and into August, consistent with many other retailers.\n\nComparable sales were down 10%, a sequential improvement from the negative 14% comp reported in the first quarter, which was negatively impacted by the lapping of stimulus in the prior year. Store sales declined 10% from the prior year. As we look to the remainder of the year, we anticipate opening 30 to 40 Athleta stores, 20 to 30 Old Navy stores and continue to expect to close about 50 Gap and Banana Republic stores this year, bringing us to approximately 85% of our goal of closing 350 stores in North America by the end of fiscal 2023. Online sales declined 6% versus last year and represented 34% of total sales in the quarter.\n\nCompared to pre-pandemic levels in 2019, online sales increased 55%. Year to date, total sales were down 11% compared to last year and were down 5% relative to pre-pandemic levels in 2019. While we believe strongly in our ability to maintain core category leadership in the back half of the year, we are taking a more conservative posture as it relates to our sales outlook as we read the consumer response to the many changes we've made to product assortments, which are just taking hold and considering the uncertain macro environment, particularly the low-income consumer. Let me now provide sales color by brand, starting with Old Navy.\n\nSales in the second quarter declined 13% versus last year to $2.1 billion. Relative to 2019, Old Navy sales increased 6%. In the second quarter, Old Navy comparable sales were down 15%, representing a sequential improvement from the negative 22% comp last quarter. The year-over-year declines at Old Navy stemmed from continued previously discussed size and assortment imbalances.\n\nWhile we believe Old Navy's value positioning should enable it to attract a wide range of consumers, the brand is not immune to the pullback in spending by the lower income consumer, which we believe may all come out on some of the softness. So the team remains focused on adding balance and relevance to the assortment with broader end use, particularly dresses, pants, denim and woven tops, and improved fashion choices, which we believe will begin to see this fall and even more into holiday. We continue to lean into maintaining our leadership positions in categories we are known for, like denim, active and kids and baby. In addition, we remain on track toward optimizing our extended size offering in stores to better match demand late in the third quarter.\n\nWe also remain confident following supply chain disruption and inventory delays that our core sizes will be back in stock for late fall. Turning to Gap brand. Global sales in the quarter declined 10% versus last year to $881 million. Global comparable sales were down 7%, an improvement from the negative 11% comp reported last quarter.\n\nNorth America comparable sales were down 10%, a slight sequential improvement from 11% in the first quarter. Gap brand remained impacted by casual category softness, particularly mid-tops and casual shorts, while more relevant categories like dresses and pants showed better results given the shift in consumer preferences. The team is focused on fixing the category mix imbalances in fall and holiday. In addition, Gap outlet demand is experiencing near-term softness, which we attribute to continued pullback from the lower-income consumer.\n\nBanana Republic second quarter sales grew 9% year over year to $539 million. Comparable sales were up 8% during the quarter. Banana Republic maintains its focus on quality product, differentiated experiences and continues to capitalize on the shift in consumer trends while realizing continued benefits since last year's brand relaunch. Athleta sales grew 1% to $344 million, with comparable sales down 8%.\n\nAthleta posted an increase of over 37% in sales compared to 2019 prepandemic levels, reflecting the brand's continued progress in driving awareness and establishing authority in the women's active and wellness category. As we stated last quarter, we are focused on ensuring that Athleta strikes the right balance of active and lifestyle in its assortment mix to best meet the evolving consumer demand, which have shifted from athleisure toward work and occasion in the short term. While there has been a modest slowdown in the women's athleisure category, and Athleta is maintaining share in that market, we expect market share gains. We believe we had some print and color misses in our summer assortment, which drove some of the softness in the quarter.\n\nThe team has pivoted quickly to deliver a more cohesive color story across its assortment, including more elevated prints, and a higher penetration of on-trend styles this fall, which will better position the brand in the back half. We are confident that the brand will capitalize on the continued secular shifts in growth in the health and wellness categories broadly, and drive outsized growth over the long term. Now turning to gross margin. Reported gross margin in the second quarter was 34.5%.\n\nDuring the quarter, we wrote off $58 million of unproductive inventory, primarily styles and sizes at Old Navy. We expect that clearing's inventory will enable us to drive an improved consumer experience across all channels and better showcase the newness and merchandise that resonates most with our customer, while allowing us to better optimize our margins. Adjusted for the inventory impairment, gross margin was 36%, deleveraging 730 basis points from the prior year. Close to half of the deleverage stems from one-time or macro-related headwinds, while the balance reflects our increased promotional activity resulting from our current inventory challenges and assortment imbalances.\n\nLet me share some more specifics on these factors. First, we continue to navigate inflationary cost headwinds, which we estimate had an approximate 200-basis-point negative impact on margin. Second, consistent with our expectations, we realized an estimated $50 million of incremental airfreight during the quarter, which resulted in approximately 130 basis points of margin deleverage. And third, while we continue to benefit from our fleet restructuring efforts through lower ROD costs, which were below last year on a nominal basis, ROD deleveraged approximately 30 basis points, primarily as a result of the lower sales volume during the quarter.\n\nThe remaining deleverage of approximately 370 basis points stemmed primarily from higher discounting at Old Navy. Like so many others in our industry, we are managing through elevated inventory levels as a result of changing demand trends and shifting consumer preferences. Additionally, as you know, we've been navigating through product lateness and product acceptance issues, most notably at Old Navy, which has forced us to increase the level of discounting in an effort to better balance our assortment. Let me quickly frame up the drivers of our first half gross margin in order to contextualize the puts and takes as we look to the back half of the year.\n\nWhile there are factors in our control, and levers we are pulling to drive improvement, there are also gross margin dynamics where we have substantially less visibility as we look to the back half. First half adjusted gross margin was down 820 basis points year over year, driven by an estimated 300 basis points of airfreight deleverage, 220 basis points stemming from higher discounting, roughly 200 basis points of inflationary cost headwinds and roughly 100 basis points of ROD deleverage. As we look to the second half of the year, airfreight expense is expected to normalize, and we will be anniversarying last year's investments, resulting in roughly 400 basis points of leverage. The roughly 200 basis points of inflationary deleverage is expected to continue, and ROG is expected to be flat or delevered slightly.\n\nWhere we've seen the most significant variability versus our expectations is in the discount rate. While we are taking actions to rightsize inventory, we are also mindful of the uncertain and increasingly promotional environment clouding our visibility. We entered the third quarter with elevated levels of inventory and expect inventory growth to moderate as we move throughout the year as our actions take hold, we reduce receipts and begin to anniversary higher in-transit levels last year. By spring, we expect to begin to lean into our responsive levers, providing the flexibility to better align inventory levels with demand trends.\n\nNow turning to SG&A. In the second quarter, SG&A was $1.36 billion or 35.2% of sales, deleveraging 160 basis points from the prior year, primarily as a result of lower sales volume. Excluding the $35 million charge related to the Old Navy Mexico transition, adjusted SG&A as a percentage of sales deleveraged 120 basis points versus last year's adjusted rate. While we made significant SG&A investments over the last few years to help fuel our future growth opportunities, the current operating environment does dictate a moderation of these investments, as well as the implementation of distinct expense savings actions in the near term.\n\nWe will begin implementing later in the third quarter a reduction in overhead investments, including a pause on planned hiring and open positions among other actions. In addition, we are reevaluating our investments in marketing and technology. We firmly believe that marketing investments are a key contributor to Brand health and customer acquisition. But in light of the current operating environment, we are looking at specific opportunities to invest more prudently, focusing our spend on the most productive and highest return opportunities.\n\nWe also believe there's an opportunity to slow down more meaningfully the pace of our technology and digital platform investments to better optimize our operating profits. We will share more details as we implement these actions, and expect these initiatives to mostly benefit fiscal 2023, and help offset the incentive compensation that will come back into our forecast next year. Reported operating margin in the second quarter was negative 0.7%. On an adjusted basis, excluding the inventory impairment charge and Old Navy Mexico charge, operating margin in the second quarter was 1.7%.\n\nReported EPS during the second quarter was a loss of $0.13. Adjusted EPS was $0.08, which excludes the inventory impairment and Old Navy Mexico transition charge. The $50 million of estimated transitory airfreight expense in the quarter had a negative $0.10 impact to reported and adjusted EPS. As we look to the third quarter, we continue to expect a net benefit of approximately $85 million from the planned sale of our U.K.\n\nDC now that our European partnership model transition is complete. As previously communicated, this will have a positive impact on our reported earnings and will be netted out of adjusted earnings in the third quarter. While we're making progress, particularly on adjusting our assortments to better reflect shifting styles and evolving fashion across our brands, we know we have more work ahead of us. We're also navigating a unique set of circumstances, a CEO transition, new leadership at our largest brand, Old Navy, and several actions currently in flight toward rightsizing our inventory and our cost structure.\n\nOn top of that, the intensifying promotional background and signs of weak demand in the low-income consumer are making forecast precision increasingly difficult. That being said, we are committed to providing transparency as it relates to our forward outlook. We will continue to provide you with color on the factors that are most in our control, and come back with further details once we have greater clarity on the consumer response to our product and inventory actions, and once we have more of the work pertaining to our cost-saving initiatives complete. Now let me turn to the balance sheet and cash flow.\n\nEnding inventory of $3.1 billion was up 37% year over year. This includes nearly 10 percentage points of pack and hold inventory and 7 percentage points related to in-transit. More than half of the remaining increase is attributable to elevated levels of slow-turning basics and the remainder seasonal product. I'd like to provide a brief reminder on our pack and hold strategy and approach for managing basics.\n\nAs you may recall, we have utilized pack and hold strategies as an inventory management tool in the past, which has proven to be successful. While the use of cash in the short term, we are able to optimize our margin in the near term and benefit working capital next year as we buy lower receipts and sell through the pack and hold inventory. We're confident that we will be able to integrate our pack and hold inventory with future assortments as the majority of goods are carefully selected seasonal core items we routinely use to round out our assortments. Examples of these more timeless styles are basic shorts or short sleeve tees and tanks.\n\nWhile we've had some supply chain impacts, as well as product assortment missteps in the near term, we are focused on sequential inventory improvement and deeply committed to inventory productivity and getting back to our responsive levers. As discussed earlier, we've taken action to write off unproductive inventory in the second quarter and cut receipts across the assortment beginning in late fall and into holiday, positioning our brands to be able to take advantage of our reinstated responsive capabilities and chase into demand as we enter fiscal 2023. These actions are part of our focused approach to inventory planning for the remainder of fiscal 2022 and beyond. As we look to the remainder of the year, we believe that third quarter ending inventory growth will moderate substantially and are targeting negative inventories versus last year by the end of the fiscal year.\n\nQuarter-end cash and equivalents were $708 million. Year-to-date net cash from operating activities was an outflow of $207 million. Free cash flow was an outflow of $613 million, above our historical first half outflows, driven by our net loss and the timing of merchandise payments. As we look to the second half, we anticipate more normalized cash levels as we cycle the inventory timing effects of the supply chain challenges last year, as well as benefit from the actions we've taken to reduce receipts as we move through the back half and into fiscal 2023.\n\nWe have taken action to fortify our balance sheet and cash positions. We have cut or deferred some capital spending and reduced the number of Old Navy new stores slated for the back half of the year, and now expect capex of approximately $650 million for the year, compared to our prior expectations of $700 million. During the quarter, we completed an amendment and extension of our secured revolving credit facility, securing modestly improved pricing, while increasing flexibility and liquidity within our capital structure. We remain committed to delivering an attractive quarterly dividend as a core component of total shareholder returns.\n\nDuring the quarter, we paid a dividend of $0.15 per share. And on August 15, 2022, our board approved a $0.15 dividend for the third quarter of fiscal 2022. During the second quarter, we repurchased 5.7 million shares for approximately $57 million as part of our plan to offset dilution. We do not anticipate further share repurchases for the remainder of fiscal 2022 as we've completed our goal early of fully offsetting dilution for the year.\n\nIn closing, we've taken action in light of our executional challenges to rightsize inventory, reevaluate our investments, optimize cash management and taken a more conservative approach to our outlook. While we continue to navigate a difficult consumer environment and a promotionally competitive environment, we are confident in the actions we're taking and believe we are taking the right steps to position Gap Inc. back on its path toward growth margin expansion and delivering value for our shareholders over the long term. With that, we'll open up the line for questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions] Our first question is with Lorraine Hutchinson from Bank of America. Lorraine, your line is open.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Good afternoon. I was hoping to follow up on the comments you made about Athleta and see if you could expand on any of the actions that you plan to take to improve comp? And then also comment on profitability of that concept today, and where you think it can go? Thank you.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nI think what's important to note about Athleta is the following. First of all, according to NPD, the women's athleisure market in the quarter did slow. And Athleta did maintain share within that slower athleisure market. That said, we expect Athleta to be gaining share.\n\nAnd so as we've looked at the performance, I think there's a couple of things we'd point to. First of all, if you remember, they did have about 50% of their inventory sourced from Vietnam. And the supply chain issues from the back half of last year did continue to impact the performance in the first half of the year, whether it was late product or assortment imbalances that resulted from that that all did play through their performance as well. And then as we talked about, they did have some print and color that just didn't resonate well with the consumer.\n\nAnd so the team has definitely acknowledged that. And as you look toward the fall merchandise, I think it's a more focused assortment and a more balanced assortment with great product in the performance ware that they need to be delivering, as well as really versatile product in the lifestyle ware that we know they're using for some of the work and ability to sort of do everything in addition to working out. So we feel good about the actions they've taken, and know that they'll navigate through this shifting consumer and the supply chain issues over the long term.\n\nBobby Martin -- Chief Executive Officer\n\nNothing else for me, Lorraine. I think the real highlight there is it is product. And again, the fall product hitting soon and just underline again, my confidence as well that the balance with performance lifestyle, as well as we commented on saying toward to the DNA of that brand, I think we'll see results turn around the way we want them to. So we're eager to get into that.\n\nOperator\n\nOur next question is with Matthew Boss from J.P. Morgan. Matthew, your line is open.\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks. So two questions. I guess first, how would you separate the macro from the micro that you think that your business is facing? And maybe touch on what you think the drivers of improvement you've seen so far in August? And then, separately, Katrina, is there a way to speak to the quantity and composition of the inventory that you have today across your concepts? And just the time line to clear the excess inventory back to normalized levels in your view?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYeah, Matt. So I think I can start. I don't know, Bobby, if you wanted to say something first or I'm happy to dive in?\n\nBobby Martin -- Chief Executive Officer\n\nNo. I mean I think the comments around the macro, micro, I mean we'll do it on both ends. But I mean clearly highlighting that we have seen, I believe that the impact on the lower end consumer, there's been an impact there that's obviously affected trips, and the challenge of keeping conversion maximized is where we focus. The inventory transitions have been somewhat both macro and micro.\n\nBut, again, I think we've already talked about how we work to clear those things out. So we can come back, Katrina, I think, after you address the bigger question. We'll come back to that, if there's anything else to answer there for Matthew.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYeah. I mean I think what we said in our prepared remarks is that July and August trends are right in line with our prior expectations. In June, we did see a dip in performance really with peak inflation and peak gas prices. So we're pleased to see July and August come back to sort of about our prior expectations.\n\nTo Bobby's point on inventory, we announced that our inventory at the end of the quarter was up 37%. We said 10 points of that is pack and hold and seven points of that is in transit. And the balance is really sitting in slower basic product, which we can cut receipts and work down over time, as well as seasonal fashion. Seasonal fashion, as we head into Q3, is pretty in line with how we owned Q2.\n\nAnd so we'll see how that plays out, but could indicate some near-term pressure depending on how the customer responds to the content and how the customer overall is -- as well as what the promotional environment in the industry is. As we look forward, we said that ending of Q3, the inventory will moderate substantially as we were able to cut our holiday inventory and we start to reflow our basics. And then heading into next year, we expect inventories to be negative on a year-over-year basis. And the good news about spring and first quarter is, we've been able to stand back up our responsive inventory levers, which, on top of that negative inventory, will allow us to stay open and be able to chase back into trends.\n\nSo near term, inventory is higher than we'd like it to be. We did take the inventory write-off, and we think that helps, at least in third quarter, present the Old Navy inventory to the customer in a better experience. And then we have taken aggressive actions over the next six months to really get our inventory levels back down.\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat color. Best of luck.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question is with Bob Drbul from Guggenheim Partners. Bob, your line is open.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nHi. Great. Thank you. I guess, Katrina, on the SG&A, can you unpack your expectations a little bit more, just maybe on some numbers around Q3, Q4, at least how that help us model it for the remainder of the year, that would be helpful? Thanks.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYeah. Sure. Hi, Bob. As we look at SG&A for the year, our current outlook is that full year SG&A could be about $5.6 billion, which we acknowledge is just too high of a cost structure for the performance of the company, as well as for the current operating environment.\n\nAnd so while we've made tremendous progress on the restructuring of a lot of the fixed costs in the business through closing of stores and partnering of markets, which -- and selling of small businesses, which I know you guys are well familiar with, we have made strategic investments in marketing, building technology to support our digital growth and other areas of the business, as well as adding headcount. And in light of our performance and in light of the outlook, we are really committed, and I think that's what you've heard today, to putting in place real action against working that SG&A level down to a much more appropriate level. So more to come on the actual levers we will take. We are in the process of standing those actions up, and we will provide clarity on those actions as they happen.\n\nBut many of those actions will take place, like we said, the overhead actions in the third quarter and then more to come. But likely mostly those actions will impact 2023 given the timing in the year.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is with Brooke Roach from Goldman Sachs. Brooke, your line is open.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nGood afternoon, and thanks so much for taking our question. Our question is about the promotional levels that you saw in 2Q. Your outlook for promotion into 3Q and holiday and what your current plans are with regard to the discount rate on both a year-on-year basis and versus 2019? Do you feel like you're going to be in a better place with the Old Navy promotional activity into 4Q? And how should we be thinking about that promotional level overall in terms of recapturing the Old Navy brand margin as we look into 2023? Thank you.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYeah. Hi, Brooke. As we dimensionalize the first half margin, we were trying to be helpful in breaking out all the pieces since there's so much happening in the margin dynamics. So as we said in the first half, we saw a deleverage based on all the airfreight of about 300 basis points.\n\n220 basis points of the front half deleverage was discounting, so put that aside and let's talk about that in a minute. 220 basis points was inflation and 100 bps was ROD. So what we said as we move forward is -- the air becomes a benefit in the back half as we lapped last year's substantial air freight, so a 400-basis-point benefit. Inflation remains about the same at about 200 basis points, and ROD could be flat to slight deleveraged.\n\nSo I'll let you model what that means, but it means that we're leaving ourselves sort of a range in there that could be worse than less than the first half. It could be better than the first half. And I think that's where, again, we're focused on the actions we're taking to drive a different outcome everything from rechanging the assortment away from active and casual into more wear to work, the body-quality inventory changes we've made and the write-offs there to try and get the sizing back in place, and then really getting back to the true value proposition of Old Navy, which is jaw-dropping value on great fashion for the family. And all of that, we think we're better set up for.\n\nBut acknowledging as well that inventory in third quarter is still -- fashion inventory still relatively in line with second quarter and then it gets a lot better for fourth quarter. And I think the X Factor, too, as we said, Brooke, is, I mean you've been seeing the reports as well. The industry is a wash and inventory. And so we're just being careful, too, a little bit about what we will be navigating with others promoting.\n\nSo lots of dynamics, which is part of the reason why we've left that as sort of the open variable. But we will stay close as we read our own performance on product and pricing, as well as what's happening with the consumer and the competitive environment.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nThank you very much.\n\nOperator\n\nOur next question is with Dana Telsey from Telsey Advisory Group. Dana, your line is open.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you. Good afternoon, everyone. Obviously, you have a new leader at Old Navy. I'm just wondering as -- and he hasn't been there very long.\n\nBut just wondering, as you see the game plan to improve Old Navy whether it's in the size and assortment imbalances, what is the path that we should be looking for? And as you think about the core Gap brand, and the enhancements that could come there, what trajectory are you on now? And how do you see the leadership in terms of the role of CEO. Is that -- do you see that being fulfilled within the next six months? And is there any particular qualifications that you're looking for in the CEO role. Thank you.\n\nBobby Martin -- Chief Executive Officer\n\nYeah. Let me start, Katrina, and then you can come back on the back side. Again, Dana, to you and Yes. I always -- he's just barely three weeks in his job, but again, he's hit the ground running.\n\nAnd I think as we've talked about earlier, and I'll just highlight relative to the brand and what you might expect how he sees Old Navy, we appointed him really and he's the right balance, particularly with product focus, the premium and personal on customer experience, very strong, proven operator, and, again, manage that in challenging time. So understanding value and executing in the format that Old Navy serves, I think we'll see him really strengthen a lot of the category execution and so forth and make sure that we rightsize the assortment. But we're going to have to give him time. He's right now focusing on the next two quarters while also looking at the commitments and plans and product for spring and summer ahead.\n\nBut again, we just need to give him a little bit of time. Let me just shift on the back side, since you asked about the CEO search. Because again, I commented in my prepared remarks, and I'm sure a number of you are really wanting to understand what are we doing. And again, the board has commissioned the search.\n\nWe're well into it and looking to move this aggressively and as swiftly as we can, but, as you would imagine and expect, also very thoughtfully. And in terms of Gap, this is a very attractive company to lead. So we're seeing plenty of interest, but again, we want to make sure we put the right leader in place. And as we look at that, I mean, clearly, we are looking for a leader that will move Gap Inc.\n\nin total from defense to offense and position us back where we're seeing meaningful share gains across our brands. We're very strong, the foundation of this company and powerful iconic brands that we believe that we still own and compete with as long as we continue to move forward in the progress that we are, we're going to continue to build on those strengths. The well-established values of the company and our scale of our omni platform are things that we're going to be looking for in the next leader. So a very modern-minded transformative executive that, again, can, again, strengthening us back into our position of leadership, while also then moving us hopefully even toward newer existing categories and potentially diversification in areas that we feel might make sense.\n\nBut ultimately, as you would expect, a leader that we believe can deliver on what our customers expect. And again, what's going to drive the value creation that all of our shareholders expect. So more to come on that.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nNext question is with Mark Altschwager from Baird. Mark, your line is open.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nGreat. Thank you for taking my question. First, on the margin, obviously, a lot of headwinds impacting 2022. What are the areas where you have the greatest amount of visibility or greatest amount of confidence on marginal cash next year? And then separately, on Athleta, I'm curious if you could also speak to the company's current thinking on potential strategic actions there and whether there's been any change to that, making your approach into what we heard from you back in May? Thank you.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nHey, Mark, it's Katrina. I'm sorry, you were breaking up a lot, so I'm going to do my best with your questions. I'll go ahead and take the 2023 margin question, which is I think what you asked, and then maybe I'll let Bobby talk about strategic actions for the company. When I think about next year's margin, I think we have a lot of things to still work through.\n\nAnd so we'll have to owe that when we have more insight. The levers will be similar to the levers we've been talking about. I think the one lever we know is that, we don't plan to be using airfreight going forward. I think that's the one thing we know that it's an expensive lever, and we've created responsive levers back in the business so we shouldn't have to do that again.\n\nAnd then as it relates to inflation and some of these other areas of the business, I think it's too soon to comment on that. So we will be committed to providing color as we have more insights into 2023. And then, Bobby, I don't know if you want to talk about strategic options?\n\nBobby Martin -- Chief Executive Officer\n\nYeah, I didn't really -- I'm sorry, I didn't -- Mark, I didn't hear your question as you asked it.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nOK. Sorry for the bad connection, I'll try again here. Just with respect to Athleta, I'm wondering if there's been any change to the company's thinking with respect to strategic actions there since we heard from you in May?\n\nBobby Martin -- Chief Executive Officer\n\nYeah. No, look, I think what we will always be stating here, I mean, we're always looking at the best ways to bring value creation. And so we're constantly evaluating those things. The brands play a lot of strength off of the scalability of the company combined and so forth.\n\nBut Athleta is a brand that we're very proud of and have a lot of promise in. But again, the board is always constantly looking at options. So certainly, nothing to talk about, but always looking.\n\nOperator\n\nOur next question is with Oliver Chen from Cowen. Oliver, your line is open.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi. Thank you very much. As we think about the product assortment at Old Navy, which classifications and/or lack of classifications have the most opportunity? And it sounded like you said impact in terms of creative would be in the back half of next year just given the timing, is that a true statement? With respect to that question also, the good, better, best matrix, would love your thoughts on how you need to tackle that as you continue to refine the inventory? And then, Katrina, on the response of inventory plans, could you just be more specific about what you're talking about, and how it could help the financials with that programming in the fall? Thank you.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nSure. So on the Old Navy assortment, Oliver, what hasn't been working really, not just with Old Navy, but in general, is a shift away from the cozier categories like active and fleece, as well as like T-shirts and casual shorts. And so that's less about the product not being great and more about the fact that the consumer, as you know, is really buying a lot less of that this year and really wanting to spend more on things like dresses, pants, even dressier denim and woven tops, things that she can wear out to parties or to work. And so the pivot that we've been making at Old Navy, but also at Gap is really less of those casual categories and more of the going-out categories.\n\nAnd as we talked about, that is better in fall and much better by holiday. As far as the fashion elements that didn't resonate at Old Navy, that's really holiday that we're able to change the aesthetic more dramatically based on some of the learnings we had in first quarter. I know you asked about good, better, best. I think at Old Navy, maybe the best items got a little too high on the best side.\n\nAnd so the team will be looking at really making sure we have enough of the good and better product as we head in the spring, which is especially important as we navigate this consumer environment. And then on responsive, when we say responsive, we have a couple of levers that we use. First of all, we have vendor-managed inventory, which means we're working closer with our vendors to buy inventory on a more regular basis, and they hold it for us, and we pull it as opposed to buying so much in advance. And then platforming a fabric with our vendors that allows us to chase into styles and colors as we read the consumer.\n\nSo those are a couple of examples of where we'll get speed and flexibility back. But those levers, as you can imagine, when the manufacturing base was so disrupted, we're just not at our ability to leverage. So we're looking forward to getting that back as the manufacturing base has stabilized.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThanks, Katrina. Very helpful.\n\nOperator\n\nOur next question is with Simeon Siegel from BMC. Simeon, your line is open.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nHi. Thanks. I think that was me. Good afternoon, everyone.\n\nHope you're having a nice end to the summer. Sorry if I missed it, and I know you don't normally talk about it, but just given the orders of magnitude, any way to talk about Old Navy's AUR versus pre pandemic? And then maybe just how you're thinking about the Old Navy long-term revenue opportunity? Have you stress tested whether there might -- I just wondering if you might be better served, I think, some of the elevated revenues from recent years settle in a little bit to protect margins even on lower volume. And then just lastly, did you say if you're seeing any meaningful deviation in product category? I guess I'm wondering are you seeing the same athleisure softness at Old Navy? Thank you.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nWe didn't comment specifically on AURs by brand, but I would say, overall, while we're reverting on discount levels to last year, still, as a company, we are up to 2019 as far as our ability to be less discounted. So whether that's being aided by Banana Republic's turnaround, or we did do a significant amount of improvement in Old Navy over the long term, we are still seeing some stickiness on that discount rate improvement to 2019. Now we'll see how the back half plays out, but that's sort of so far what we've seen. And again, the reversion is really the year-over-year reversion to last year's big gains.\n\nRemind me of your second question, sorry?\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nJust thinking through, you stress tested volume versus margin and validated revenue from last year, whether that's the right base or whether you could do better, you can make more with less?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYeah. I mean I think it's a great question, Simeon. And certainly, one we'll tackle as we head into 2023. I think fundamentally, as you heard today, we are highly committed to inventory productivity as we move forward and making sure we have a much sharper view on tight inventories.\n\nAnd so finding that right balance between unit velocity and AUR and margin will be critical. And we'll have more to say about that as we think about the architecture for 2023. But we're early days in shaping what that looks like.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thank you. And then just the last one was -- and sorry, if I missed it. Did you talk about Old Navy athleisure, so that you talk about product category and whether you saw the similar softness there?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nSo I think, fundamentally, Active continues to be a massive business at Old Navy. They're dominant shareholders of Active -- and which is the true statement for Athleta as well. They continue to do a significant amount of their business out of Active. I think what we're seeing in both of those businesses or all of our businesses is really just a step back off of last year's massive growth based on the shift of the consumer now toward workwear.\n\nBut Old Navy's active business is still quite large and important and still quite healthy, just not as big growth as we had planned for before we saw this big shift in the consumer demand.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks a lot, everyone. Best of luck for the rest of the year.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nThanks, Simeon.\n\nOperator\n\nOur next question is with Paul Lejuez from Citigroup. Paul, your line is open.\n\nPaul Lejuez -- Citi -- Analyst\n\nThanks, guys. A couple of quick ones. The improvement that you saw in July and into August -- can you talk about that where you saw the biggest pickup by brand? And if that was promotionally driven or if you're happy with the margin performance Second, the $50 million write-off, where is that product, is you write that to zero? Was that destroyed? Is it still in stores? Just wanted a little bit more color there. And then just early -- or early thoughts, but talked on AUC for first half of '23? Thanks.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYeah. Thanks, Paul. As we said, July and August are sort of relatively in line with our prior expectations. We haven't commented on the margin component of that.\n\nI think, in general, you've heard a lot today about how we're thinking about margin. And so we'll let you work through your model on that. As it relates to the write-off, so most of that inventory is Old Navy inventory it's summer -- spring and summer fashion that we determined was going to be really hard to clear in the quarter as we moved into third quarter, combined with a lot of the extended size inventory that we've talked about before, really not resonating with customers. That will be taken out of Old Navy stores over the next couple of weeks as the teams are able to navigate the workload between back-to-school and pulling that inventory out of stores.\n\nWe have determined some level of recovery for that, and that's embedded in that $58 million. And then your last AUC, early days. I think certainly, in the first quarter, as we've been buying spring, we still see inflationary pressure, primarily coming from cotton, wage pressure, and freight and all that -- oil and all that other stuff, but more to come on where those buys settle and how that ends up settling through our financials.\n\nPaul Lejuez -- Citi -- Analyst\n\nOK. Thanks. Good luck.\n\nOperator\n\nOur next question is with Janet Kloppenburg from JJKR Research. Janet, your line is open.\n\nJanet Kloppenburg -- JJK Research Associates -- Analyst\n\nHi, everyone. I wanted to ask, Katrina, as you think about the brand positioning of Old Navy and the Gap in contrast to the dress-up trends, the casual positioning of both of those brands in contrast to the dress-up trends that we're seeing now, is there a thought to pivoting the brands to more formal dress up where work looks? What should we expect as the assortments evolve in the holiday season and into next year? Thanks.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYeah. Thanks, Janet. Certainly, we don't expect to broadly pivot the brand's DNA. I think by nature, those are casual brands, and that's how they've won.\n\nThat said, there are lots of elements within each of those brands, whether you think of dressed up denim or pants like the pixie pants or khakis at Gap, woven tops, outerwear, even sweaters that we believe we can put together and diversal looks that should take her from day and into night. And so think that's the commitment that the team has, is in the near term, they've been working on really rebalancing out of the casual into more of those looks. I think we all know that, right now, we have a little bit of a whipsaw from casual into work, and we want to be careful to keep the balanced DNA of both of those brands because I think we can win with both elements of products. So we'll stay balanced, but certainly, we'll be showcasing that more versatile dressed up look as we head into the back half of the year.\n\nJanet Kloppenburg -- JJK Research Associates -- Analyst\n\nThank you.\n\nOperator\n\nOur last question will come from the line of Marni Shapiro with Retail Tracker. Marni, your line is open.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nHello, everybody. Thank you. I actually want to follow up on a question that was asked, but you guys didn't answer if that's OK, and maybe I'm just calling something slightly more positive. You said trends picked up in July and into August.\n\nI'm curious if that was related specifically to Old Navy, less across the board? Was it driven by back-to-school in the kids' business? If you could just walk us through a little bit what those trends look like? And I know it's early innings for back-to-school and fall, but just have some idea as to where you're seeing the turn.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYeah, Marni, I mean we haven't said by brand, but I think that we continue to feel quite good about the fact that we have big and important denim and kids and baby businesses in both Gap and Old Navy. And we also have active wear, as we talked about, which we still think plays an important role in back-to-school. So back-to-school is a long season. We'll see how that plays out.\n\nBut we're also really pleased, as you've seen over the last couple of quarters with Banana Republic and with the way they've been competing on their repositioning and feel like they've done a great job. So more to come on where the quarter plays out. I think the trends are on our expectation, but we're remaining prudent in sort of what the outlook looks like. So we'll see how that all settles for the quarter and for the year.\n\nBobby Martin -- Chief Executive Officer\n\nKatrina, I think it's worth noting a seeing a little more positive pickup in the online penetration is well been encouraging.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nWell, best of luck for the rest of the back-to-school and fall season, guys.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nThanks, Marni.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCammeron McLaughlin -- Head of Investor Relations\n\nBobby Martin -- Chief Executive Officer\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nPaul Lejuez -- Citi -- Analyst\n\nJanet Kloppenburg -- JJK Research Associates -- Analyst\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nMore GPS analysis\n\nAll earnings call transcripts"
}