{
  "companyName": "Dollar Tree Inc",
  "companyTicker": "DLTR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/dollar-tree-inc-dltr-q2-2022-earnings-call-transcr/",
  "content": "Dollar Tree Inc (DLTR -1.08%)\nQ2 2022 Earnings Call\nAug 25, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the Dollar Tree, Inc. 2Q 2022 earnings conference call. Today's call is being recorded. At this time, I'd like to hand the conference over to Randy Guiler, VP of investor relations.\n\nPlease go ahead.\n\nRandy Guiler -- Vice President, Investor Relations\n\nThank you, operator. Good morning, and welcome to our call to discuss results for Dollar Tree's second fiscal quarter 2022. With me on today's call are executive chairman, Rick Dreiling; president and CEO, Mike Witynski; and CFO, Kevin Wampler. Before we begin, I would like to remind everyone that various remarks that we will make about our expectations, plans and prospects for the company constitute forward-looking statements under the purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995.\n\nThese statements are subject to risks and uncertainties, and our actual results may differ materially from those included in these forward-looking statements. For information on the risks and uncertainties that could affect our actual results, please refer to the Risk Factors, Business, Management's Discussion and Analysis of Financial Condition and Results of Operations sections in our annual report filed March 15, 2022, our Form 10-Q for the most recently ended fiscal quarter, our most recent press release and Form 8-K and other filings we make from time to time with the Securities and Exchange Commission. We caution against reliance on these forward-looking statements made today, and we disclaim any obligation to update or revise these statements, except as may be required by law. Following our prepared remarks, Mike and Kevin will take your questions.\n\nGiven the large number of those that would like to participate, I ask that you please limit your questions to one. I will now turn the call over to Rick.\n\nRick Dreiling -- Executive Chairman\n\nThank you, Randy. Good morning, everyone. Mike and I and our new board have been together for just over one quarter now. As planned and expected, change is underway, and we are moving at a fast pace.\n\nWe are entirely focused on taking the right steps to transform this organization for the long term through growing and improving Family Dollar and Dollar Tree. We are 90 days further down the road from our last earnings call, and the opportunity and action steps needed continue to become more clear. Our main priorities are our associates, the distribution network and supply chain, Family Dollar's pricing and the value proposition in both segments, store standards and technology. Additionally, and Mike will go into more detail, we have a great deal of work underway to improve the company's culture, designed to build an environment of accountability, empowerment, courageous leadership, transparency and fostering two-way dialogue.\n\nAnd we are orchestrating these changes in one of the most unique and dynamic environments I've experienced in my retail career. Inflation is at its highest in decades as shoppers are experiencing higher costs related to food, fuel, rent and more. Supply chains have been strained and inconsistent. Inventory levels are higher across retail, and consumer shopping patterns continue to zig and zag.\n\nLet me be very clear. We are not here to take half measures or to defer high return capital and operating investments in order to manage earnings. We are honed in on taking steps necessary to seize the great opportunity for us and deliver to our shareholders, our associates and our customers the great company they deserve. And by executing on this commitment, we will deliver the greatest possible risk-adjusted returns to our shareholders.\n\nWe will not waver from this strategy. You will hear from Mike and Kevin later in the call about some of the actions we're taking to fix Family Dollar. As you know, our new leadership team is taking shape, and the team is moving to accelerate actions to improve the business. The most notable action is our decision to move forward with price investments that began in July and will carry into the second half intended to close our historical GAAP and pricing to key competitors.\n\nWe believe this is a necessary action to provide the right value proposition and a foundational step to improve Family Dollar long term and that it will pay off handsomely. There is much more to do to enhance the results of Family Dollar, and you will hear about some positive improvements beginning to be made later in the call. That said, the refreshed team has been together for about a quarter, and we feel very confident in our ability to fix Family Dollar and materially improve its performance long term and in the process, create enormous value. We are a growth company.\n\nWe are making change happen to create long-term shareholder value and enable the next waves of profitable growth for Family Dollar and Dollar Tree. On behalf of our board, I want to thank each of our teams for their efforts on delivering very good results for the second quarter. I'll now turn the call over to Mike.\n\nMike Wytinski -- President and Chief Executive Officer\n\nThank you, Rick, and good morning, everyone. Thank you for joining us today. We are dialed in today from our Annual Field leadership summit. More than 1,000 leaders, including every district manager in the company, have gathered for several days to learn, collaborate and focus on all things Family Dollar and Dollar Tree.\n\nThis is our first large in-person meeting since 2019. The energy and excitement here makes me and each of us more inspired than ever. We will transform our culture and company, and we will do this together. Rick just mentioned that we are moving at a fast pace.\n\nThe theme of our leadership summit is, in fact, lead with speed. I want to publicly thank all of our participants for their commitment, dedication and focus while attending this great event. I'm proud to be part of your team. At these meetings, we typically talk about our company's strategy and share proof points of our collective successes.\n\nBut this year is different. This year, I'm speaking to our leaders about something no less important than strategy. It's our company's culture. Every retailer has a playbook when it comes to strategy.\n\nBut what sets the winning companies apart is their culture. Just as Rick mentioned, we are committed to developing a culture of accountability, empowerment, courageous leadership, transparency, and fostering two-way dialogue. We have recognized and acknowledged to ourselves that we have substantial opportunity for improvement in this respect. We have the courage to address this head on, and we would deliver the culture necessary to provide our associates, the customers and the shareholders the greatness they deserve.\n\nAlso at this summit, our field leaders got their first look at the initial holiday buys purchase for the new $1.25 price point. We are all excited by the compelling and relevant assortment sourced by Rick McNeely's Dollar Tree merchant team and are very confident our shoppers will be wowed by these new items and the great values over the upcoming holiday season. We are undergoing a period of change, exciting change, and we have accomplished a great deal and what I would call the first 100-plus days since our board was reconstituted. A few months ago, we announced a number of leadership changes.\n\nWe are actively engaged in recruiting leaders to the organization with the right perspectives, experiences and skill sets to help transform our company. The great opportunity before us has attracted the attention and interest of the strongest leaders in retail. In just a few months, we have already filled several key roles with exceptional talent, including Larry Gatta as Family Dollar's chief merchant, John Flanigan as our head of enterprise supply chain and Bobby Aflatooni now leads our enterprise IT department. This morning, we announced that Jeff Davis will be joining Dollar Tree as our new CFO.\n\nJeff has many years of experience as a retail CFO and spent nearly a decade in executive leadership roles with one of the largest retailers. And we have carefully reviewed a field of exceptional candidates for our COO and general counsel executive roles. The teams are gelling, and the new leaders are hitting the ground running. I look forward to sharing upcoming announcements as we round out the executive team for the next waves of growth and transformation for Dollar Tree and the Family Dollar business.\n\nIn light of the substantial leadership changes, I felt that we could deliver a more useful and productive event if we will defer our investor day from October until the spring of 2023. We will share more details on the event as it takes shape in the months ahead. Our second quarter performance reinforces the relevance of our brands for millions of households as they continue to face cost pressures across the board. The team delivered increases of 6.7% in sales, 14.2% in gross profit, 25.7% in operating profit and 30.1% in EPS while successfully navigating through another quarter of macro uncertainty.\n\nNow to Q2 performance by banner. I am pleased with the quarter delivered by Family Dollar team. The positive 2% comp represented an acceleration from Q1 on a one, two and three-year stack basis. A 3.3% increase in average ticket more than offset a 1.2% decline in transaction count.\n\nSame-store sales were relatively balanced throughout the quarter as monthly comps range from a positive 1.5 to a positive 2.5. Despite supply chain challenges and OTC-related categories, the consumables comp increased 4% for the quarter. Discretionary comps declined 4.1% as shoppers continued to manage through this inflationary environment. Compared to the prior-year's quarter, we saw 150-basis-point swing in product mix from discretionary to consumables.\n\nIn Q2, consumables represented 77.3% of Family Dollar sales compared to 75.8% in Q2 of 2021. The turnaround of Family Dollar is an enormous value creation lever, and it is getting a great deal of focus and attention. Components of the transformation include, as Rick mentioned, a focus on our people, the DC network and supply chain, pricing and the value proposition as well as our technology. Additional factors include enhancing our culture, elevating store standards, developing our private brands, improving category adjacencies, enhancing the product mix, optimizing vendor partnerships and much more.\n\nWe are pushing forward on each one of these fronts. We are still early in this journey, but I am enthusiastic about the progress we have made just in the last few months. I want to call out, in particular, the important initiative we have taken on our pricing at Family Dollar. With the recent price investments, we believe Family Dollar is now in a better competitive position on price than it has been for over a decade.\n\nWe will continue to refine the Family Dollar value proposition to drive store traffic and productivity, and we will fully expect to see great benefits from these and other actions over time. During the quarter for Family Dollar, we opened 95 new stores, renovated 257 stores and relocated 24 stores. We ended the quarter with more than 540 Combo Stores, which continue to resonate with the shoppers while driving more productivity and more profitability. Moving now to the Dollar Tree segment.\n\nThe Dollar Tree banner delivered another strong quarter. Among the highlights, a 7.5% comp, a 37.4% gross margin, 500 basis points above the prior-year's quarter and a 15.4% operating margin, more than 500 basis points over Q2 of last year. The 7.5% comp sales increase was driven by a 14.2% increase in average ticket partially offset by a traffic decline of 5.8%. Importantly, the consumable business at Dollar Tree was strong.\n\nConsumables, which represented 46.8% of the mix in Q2, comped at 7.9%, while discretionary increased 6.7%. The last time the consumable comp exceeded discretionary was at the onset of the pandemic in Q1 of 2020. This demonstrates the success we are seeing in key traffic driving categories where our merchants have been active in enhancing value, such as carbonated beverage, snacks and cookies and food. As a reminder, our reassortment consumables has been more immediate than the discretionary merchandise given the purchasing cycle, and our sales performance demonstrates that shoppers are reacting favorably to refine the value proposition.\n\nRenewed consumables momentum is a good indicator for our continued long-term health of the Dollar Tree banner. The discretionary side of the business was strong despite the negative impact of the limited global supply of helium, which hindered sales of balloon products and the party-related merchandise. Regarding cadence, similar to Family Dollar, comps were relatively balanced throughout the quarter with each month's comping increasing between 6.5% and eight and a half percent. During the quarter for Dollar Tree, we opened 32 new stores and relocated five stores, and we added multi-price assortment to another 697 stores, bringing the total to 2,170 stores as we head into the back half of 2022 and the important holiday season.\n\nI would like to speak to what we are seeing in the business as consumers continue to be burdened by levels of inflation not experienced in decades. Overall, sales performance remains in line with our expectations. And in fact, we have modestly increased expectations for Family Dollar for the back half. There are signs of trade down to our stores, and we are focused on the value proposition for both banners in this environment.\n\nLike many retailers, we are seeing a shift in consumable preferences as many shoppers are gravitating to needs-based consumables, which is impacting our margin through product mix. Our suppliers are being hit with -- by inflation as well. This, along with our commitments to competitive pricing and the value proposition, is expected to negatively impact our gross margins in the near term. Over time, we believe our business should be able to protect its merchandising margin from inflation effects.\n\nAnd regarding supply chains, from a sourcing perspective, a year ago, we had a backlog of thousands of containers we were working to get through the transpacific shipping lanes. This year, we have a small, manageable backlog. Kevin will go into more detail regarding our updated outlook for the back half of the year. Our outlook will be reduced with most of the guidance reduction related to the Family Dollar as we take action to improve that banner.\n\nOf the total, more than half of our guidance reduction is due to pricing actions taken at Family Dollar. The remainder is due to mix shift differences and inflationary cost increases on consumables at both banners. None of this dampens my enthusiasm for our long-term prospects. I'll now hand the call over to Kevin to provide more color on Q2 and our updated outlook.\n\nKevin Wampler -- Chief Financial Officer\n\nThanks, Mike, and good morning. For the quarter, consolidated net sales increased 6.7% to $6.77 billion, comprised of $3.57 billion at Dollar Tree and $3.19 billion at Family Dollar. Enterprise same-store sales increased 4.9%. Comps for the Dollar Tree segment increased 7.5%, and Family Dollar same-store sales increased 2%.\n\nAt both banners, the increase in average ticket more than offset the decline in transaction count as shoppers continue to consolidate trips as gas prices are significantly higher than a year ago. Gross profit improved 14.2% to $2.12 billion for the quarter. Gross margin was 31.4% compared to 29.4% in the prior-year's quarter. Gross profit margin for the Dollar Tree segment increased 500 basis points to 37.4% compared to 32.4% for the same period last year as a result of the net of the following.\n\nMerchandise costs, including freight, decreased 455 basis points primarily due to higher initial mark on, partially offset by higher freight costs and increased sales of lower-margin consumable merchandise. Occupancy costs decreased 50 basis points from leverage on the comp sales increase. Distribution costs decreased 20 basis points from leverage and higher capitalized amounts due to increases in inventory levels partially offset by higher hourly wages and higher DC maintenance and compliance costs. And shrink increased 20 basis points primarily from more favorable results in relation to accruals in the prior-year quarter.\n\nGross profit margin for the Family Dollar segment decreased 140 basis points to 24.7% compared to 26.1% for the same period last year. The factors include markdown costs increased 80 basis points due to higher promotional and price action markdowns. Shrink increased 45 basis points primarily from more favorable results in relation to accruals in the prior-year quarter. And merchandise costs, including freight, increased 15 basis points, primarily due to higher freight costs and higher sales of lower-margin consumable merchandise, partially offset by higher initial mark on.\n\nSimilar to Q1, consolidated selling, general and administrative expenses as a percentage of total revenue increased 100 basis points. The SG&A rate for the quarter was 24% compared to 23% in Q2 last year with Dollar Tree favorable to prior year, more than offset by Family Dollar and slightly higher corporate costs. For the second quarter, the SG&A rate for the Dollar Tree segment improved 30 basis points to 22% when compared to the prior-year's quarter. Payroll costs improved 90 basis points from leverage on the 7.5% comp and favorable development of workers' comp claims, partially offset by the annualization of minimum wage increases and investments in store payroll; other SG&A, which increased approximately 40 basis points, resulting from unfavorable development of general liability insurance claims; and inflationary pressure across several expense categories.\n\nFacilities costs increased 10 basis points primarily from higher utility and repairs and maintenance as we focus on improving store conditions. For the Family Dollar segment, the second quarter SG&A rate increased 200 basis points to 23% compared to 21% in the prior-year's quarter. Payroll expenses increased 70 basis points, primarily due to hourly wages and investment in store payroll and an increase in workers' compensation expense due to favorable accrual adjustments in the prior year, partially offset by lower incentive compensation expenses. Store facility costs increased 50 basis points, primarily from higher utility costs and an increase in repairs and maintenance expense as we focus on improved store conditions for our customers and associates.\n\nOther SG&A expenses increased 45 basis points due to higher legal fees, debit and credit card transaction fees, store supply expense and inflationary pressure across several expense categories. Depreciation and amortization increased 30 basis points related to elevated capital expenditures for store renovations and improvements. Corporate support and other expense as a percentage of total revenue was 1.5% compared to the prior-year quarter of 1.3%. The higher costs primarily consist of increased stock compensation costs.\n\nOperating income improved 25.7% to $505.4 million or 7.5% of total revenue in the second quarter, an improvement of 120 basis points compared to a year ago. Nonoperating expenses totaled $30.7 million, comprised primarily of net interest expense. The effective tax rate was 24.2% compared to 23.5% in the prior-year's quarter, resulting from higher state tax rates and lower work opportunity tax credits as a percentage of pre-tax income in the current year's quarter. Net income for the quarter improved 27.4% to $359.9 million or $1.60 per diluted share.\n\nThis compares to net earnings of $282.4 million or $1.23 per diluted share in the prior-year's quarter. Looking at the balance sheet. Combined cash and cash equivalents at quarter end totaled $689 million compared to $985 million at the end of fiscal 2021. Outstanding debt as of July 30 was $3.45 billion.\n\nThe company repurchased approximately 1.66 million shares at an average price of $141.67 in Q2 or $235.8 million under the share repurchase authorization. Compared to last year, inventory levels at Dollar Tree are up 59.7% in dollars due to increased capitalized freight and distribution costs, additional multi-price Plus inventory and a significant increase in import inventory in transit compared to the prior year. Total units per store are up approximately 20% to prepandemic Q2 2019 levels but are expected to normalize as we go through the back half of the year. The inventory is fresh and basic in nature and does not represent a significant markdown risk.\n\nInventory levels at Family Dollar increased 35.7% compared to Q2 last year due to increased capitalized freight and distribution costs and an increase in the average unit cost. Total units per store are below prepandemic Q2 2019 levels. Capital expenditures were $276.2 million in the second quarter versus $229.1 million in Q2 of last year. For fiscal 2022, we currently expect that consolidated capital expenditures will be approximately $1.4 billion.\n\nDepreciation and amortization totaled $193.5 million for Q2 compared to $176.1 million in the second quarter of last year. For fiscal 2022, we expect consolidated depreciation and amortization to be approximately $770 million. As we look to the back half of 2022, we see the following affecting our business. As Mike mentioned, we are accelerating price investments in our Family Dollar business.\n\nThese investments are designed to improve the value proposition for our shoppers and to drive traffic and store productivity. This investment has a near-term impact on profit, but we expect it to accrue long-term benefit. We have seen consumer purchasing shift based on economic conditions to a more consumable-based basket at both banners, which will negatively impact our expected mix and product margin. Dollar Tree's sales continue to be negatively affected by the global helium shortage.\n\nThis directly affects balloon sales, but also has a halo effect on the entire party department. In general, stores with helium are comping positive in the party category, while those without helium are running negative comps. The delta is a 10%-plus comp differential in one of our largest high-margin discretionary categories. Our over-the-counter categories are being negatively affected by our supply chain challenges.\n\nThis is creating a higher level of out of stocks in this category. We plan to continue to increase our investment in payroll in our stores in the back half. The labor market remains dynamic, and we are proactively addressing select markets to attract and retain associates. We are making investments in our stores and distribution centers through repairs and maintenance as well as compliance programs to ensure a great shopping and working environment.\n\nBased on these factors, diluted earnings per share for the full year is now expected to range from $7.10 to $7.40. This represents a $0.75 per share adjustment to the prior outlook based on the midpoint and is comprised of the following components. Roughly 60% of the change relates to the price investments at Family Dollar. An estimated 20% of the change relates to the margin impact of the mix shift toward needs-based consumables, projected to be a 300-basis-point shift at Family Dollar and a 150-basis-point shift at Dollar Tree in the back half.\n\nAgain, the majority of this impact is expected to be on the Family Dollar side of the business. We are experiencing some degree of inflationary-related product cost increases, especially in lower-margin consumables, primarily at Dollar Tree, contributing to approximately 15% of the guide adjustment. As we have for decades, we have the ability to alter or reassort product based on cost changes, but this can take a few quarters, hence the near-term profit impact. And a small component of the guide adjustment relates to other items including our commitment to improve store conditions.\n\nAs a result of the aforementioned factors, most notably our accelerated price investment, we are expecting Family Dollar to be approximately breakeven from a segment operating margin perspective in the second half, down from its first half margin of approximately 2%. Consolidated net sales for the year are now expected to range from $27.85 billion to $28.10 billion with slightly higher comps offset by slightly reduced square footage growth relative to prior guidance. We expect to deliver a mid-single-digit comparable store sales increase for the year comprised of a high single-digit increase in the Dollar Tree segment and a positive increase in the Family Dollar segment. Selling square footage is expected to grow by approximately 3.5%, down slightly from prior guidance due to the supply chain delays related to procuring equipment and fixtures for store openings.\n\nFor Q3, we estimate consolidated net sales will range from $6.75 billion to $6.87 billion based on a mid-single-digit increase in same-store sales for the enterprise. Diluted earnings per share for the quarter is expected to be in the range of $1.05 to $1.20 per share. Other considerations for our updated 2022 outlook include the following. Net interest expense is expected to be approximately $31 million in Q3 and $125 million for the year.\n\nOur outlook assumes a tax rate of 23.6% for the third quarter and 23.8% for fiscal 2022. Weighted average diluted share counts are assumed to be 224.8 million shares for Q3 and 225.4 million shares for the full year. Our outlook does not include any share repurchases. As of July 30, we had $2.25 billion remaining in our existing share repurchase authorization.\n\nAnd I'll now turn the call back over to Mike.\n\nMike Wytinski -- President and Chief Executive Officer\n\nThanks, Kevin. As we continue to navigate through this dynamic and somewhat uncertain environment, we are excited about the continued progress at Dollar Tree and the material positive changes beginning to be made at Family Dollar. At Dollar Tree, as it relates to our multi-price offering, the team is continuing to refine the $3 and $5 assortment and testing various concepts to enhance the program and build on the very positive long-term impact from our multi-price offering. For example, test of multi-price frozen foods are driving exceptional sales productivity as the new offering is delivering tremendous value and meeting family portion needs such as frozen meals, pizza and ice cream.\n\nAt Family Dollar, our Combo Store initiative continues to drive improved store performance at very attractive levels, in line with previous commentary. In fact, we are now exploring various sizes and formats in other markets beyond our rural target locations, pursued in our first iteration of the concept. Some of the initiatives to improve the business will take more time to produce an impact, notably in the supply chain and technology. That said, at Family Dollar, the work being done by Larry Gatta's merchandising and marketing teams has been remarkable and is beginning to be actioned upon more urgently.\n\nIn fact, we have made a number of enhancements to our H2 strategic store format. We refer to the new version as H2.5. Among the changes made to improve store productivity, customer satisfaction and to better support our store associates through efficiencies include: adding a linear footage, developing seasonal assortments as a focal point, utilizing deeper shelving on key consumable categories to enhance store efficiencies and improve in-stocks, expanding the direct-to-store delivery offering, enhancing space dedicated to snacks and increasing the beverage offering and optimizing the frozen food assortments. At our leadership summit, the merchandising team shared the field leaders a wide array of consumables and discretionary merchandising initiatives to drive traffic and sales at Family Dollar.\n\nOur marketing teams are currently focused on four key initiatives: refreshing Family Dollar's brand positioning, evolving to a more productive ad program, relaunching our Smart Coupon program and expanding our Boys & Girls Clubs of America partnership to be a good partner in the communities that we serve. We believe that these key initiatives are beginning to have an impact, and consumers are increasingly looking to our stores to meet their needs. We believe the time is right to accelerate actions to better serve customers by providing an exceptional value proposition. We will go into more details on these initiatives and broader plans to transform Family Dollar and continue delivering great success at Dollar Tree in the quarters ahead and at our investor day in the spring of 2023.\n\nAnd I want to briefly share a few initiatives that Bobby Aflatooni's IT team are focused on to provide better support for our stores. These include: improving DC and store in-stock service levels through refinement of our demand forecasting, allocation and replenishment systems for both banners; improving customer satisfaction and driving through enhanced ability to support more complex promotional offers, such as buy a product A and get a discount on the product B; supporting field leadership and store efficiencies with improved labor systems; and enhancing our enterprisewide data integration platforms. Before we go into Q&A, as I had previously announced, Kevin will be transitioning out of his role as Dollar Tree's CFO. Kevin has been instrumental in the company's growth and success since joining the organization in 2008.\n\nDuring Kevin's tenure, Dollar Tree has grown from 3,600 stores to more than 16,200 stores, from annual sales of $4.6 billion to more than $26 billion and from annual operating profits of $365 million to more than $1.8 billion. When Kevin joined Dollar Tree in December 2008, shares were trading at a split adjusted price of just $13 or $14 per share. I would like to publicly thank Kevin for his commitment, stewardship and significant contributions to Dollar Tree and its stakeholders over the last 14 years. Operator, we are now ready to take questions.\n\nOperator\n\nThank you. [Operator instructions] We'll take our first question from Chuck Grom with Gordon Haskett. Please go ahead.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey, thanks. Good morning. Rick, I'm curious, since you joined the company 90 days ago, what have been the biggest surprises for you, both positive and negative? And when you talk about steps to improve the store standards at Family Dollar and the DC network across both banners, can you elaborate a little bit more for us? And do you see any offsets in the P&L to help fund those actions?\n\nRick Dreiling -- Executive Chairman\n\nYeah, I'll start here and then turn it over to Michael. The positive, I have to tell you, the enthusiasm within the organization, and its willingness to embrace change. The interesting thing has been, there's not a lot of things we're talking about that people, Chuck, aren't shaking their head, yes, let's go get it done. So that, to me, is the foundation of this.\n\nAnd the company has made a major commitment to culture enhancement. In fact, we spent our near whole day just talking about how to manage people and how people need to be managed. And we spent a whole day just listening to people to hear what they're dealing with. Probably on the negative side, the pricing gap was a little bit larger than we thought.\n\nAnd we also believe this is a great time for customer trial, and we want to be right on our pricing. In terms of the supply chain side, we're looking at everything in the supply chain. We are assembling, I think Mike would agree, probably one of the best supply chain teams in the country. We have a lot of distribution centers that need to be updated and modernized.\n\nSo we're feeling really good on how we're approaching that. The IT side, information technology, I might classify as a little bit bigger surprise in that there's a lot of basic things that the operators and the merchants need and the supply chain needs. So with that, Mike, I don't know if you want to add anything?\n\nMike Wytinski -- President and Chief Executive Officer\n\nNo, I think Rick said it right. On the store side, I think the biggest thing is, is we're focusing the entire organization from a culture perspective on doing everything that we can do to make our store associates successful and enabling them to run better, cleaner, fuller stores. And we've -- I said -- I shared in my opening that we're here right now from our summit with -- every district manager in the country is here, and we are all aligned behind driving better store conditions. And that's going to entail in your question is, yes, we're going to continue to invest, and as Kevin said, into our property management and in everything we need to, to make sure our store conditions are the way -- to our standards for our customers, and we're committed to do that.\n\nAnd more importantly, our associates are enthusiastic, not only about the culture of supporting them and putting them at the center of everything that we do. But then they see the proof points of we're investing in pricing, we're improving our logistics. Larry is improving the merchandising, and they're seeing better assortment, more linear footage where the customers shop. And then I think Rick nailed it on the supply chain.\n\nWe're doing everything we can and turning all the leaves over to drive efficiencies and improvements and really ultimately to supply our stores more efficiently with the product they need and when they need it.\n\nOperator\n\nAnd we'll go ahead and move on to our next question from John Heinbockel with Guggenheim Securities. Please go ahead.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nYeah. I want to drill into pricing and investments at FD here, right. So how do you think the maturity of the price investments will play out, right? Immediately, it's deflationary, right, to comp until people recognize the benefit then traffic picks up. How does that play out? Is it more challenging in an inflationary environment to change your price perception? And then do you think most of the investments at FDO will be limited to '22, right, or do you think there's a bunch that -- other than just a wraparound, a bunch that will occur in '23 as well.\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah, thanks for the question. And like I said earlier, the time is right right now. And the reason we really looked at it is because we saw new customers shifting our way. In this inflationary environment, we think it's a perfect time to really change the customer's perception and what they're seeing in our stores because we're getting new customers and new eyes in our stores and our existing customers.\n\nThey're feeling pressured like they never have before. And in this inflationary environment, with the customer's wallet stretched, our consumers are relying on our stores to meet their budget goals. And we're seeing good demand trends. So this was really an ideal environment to begin to move more quickly than we previously anticipated to more fully meet the customers' value expectation, close the pricing gaps and win them as customers long term in this inflationary budget.\n\nWe think the time was right. We -- initially, we talked about it in our outlook, and we were going to do this over time, starting with, of course, our KVIs, the known value items. But then just as we saw the dynamic environment, the pressure on our customers and the inflation, we decided that now is the time to win these customers for the long term and get it right. And to your question, it's now.\n\nIt's we are. Like I said, we are in the best price position in over 10 years to the competitive market. So we're there. Now it's just managing it from here.\n\nAnd getting right on our promotions. And Larry is going to continue rocking the H2.5 in the assortment. So we're in a great place right now.\n\nOperator\n\nAnd we'll go ahead and move on to our next question with Matt Boss from J.P. Morgan. Please go ahead.\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks. So at the Dollar Tree banner, what was the cadence of top-line trends during the second quarter? Any color on August or just drivers of confidence in holding high single-digit performance in the back half? And then on Dollar Tree banner gross margin, could you just touch on any puts and takes in the back half of the year to consider and how you're thinking about multiyear gross margin at the Dollar Tree banner?\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah, thanks for the question. And as I shared, it was pretty stable throughout the summer at Dollar Tree on our comp, six and a half to eight and a half percent. And remember that, and Dollar Tree really does well around the seasons. And in the second quarter, the biggest season is graduation.\n\nAnd you heard Kevin say we were really impacted by helium supply in one of our largest categories. That really has a halo effect over party. So largest category, most profitability for Dollar Tree. So that was one of the impacts.\n\nOn the good news, the other big season is lawn and garden, and lawn and garden season was one of the top five categories. So when we had the product, our customer is responding very, very well. And then the other categories that did well is, as Kevin said and I said, the shift to consumables, and our merchants reassorted and reinvested in the consumable items to drive traffic. The other top five categories, again, were beverages, candy, snacks and cookies and food.\n\nSo our customers are responding very, very well. And early in -- it's really early into Q3, but we see so far this month trending better than Q2 at Dollar Tree and Family Dollar both. And as you think about the margins in the back, where we're at -- as Kevin shared, our inventory is up. But remember, this time last year, we had thousands of containers at origin, meaning it wasn't even at our system.\n\nIt wasn't even at the origin yet. So now all that is in our system. We're getting our seasonal on time. And it's also -- remember, our merchants at Dollar Tree bought for the back half at the $1.25.\n\nThe product is amazing. All of our district managers, regional directors, all of our field associates are here with us right now. And they see the exciting items, and they're thrilled. A, we've got the product when we want it.\n\nAnd B, newly assorted $1.25 will blow the market away, and our customers are going to respond well. And we're very excited about it. Kevin can kind of touch on some of the margin puts and takes in the back half.\n\nKevin Wampler -- Chief Financial Officer\n\nYeah. As you look at it, Matt, obviously, as we talked this year, freight, which was a big headwind last year, and to the first half of this year, we said it would still be a headwind as we annualized last year rates, and we've said that into the back half, then it starts to level out. We still see that. Obviously, with -- if diesel continues to move down, that will be helpful as well.\n\nBut again, I think as you look at the Dollar Tree gross margin rate, I think Q3 will be a little lower than Q2, but then you'll see it pop back a little bit in Q4, which is highly discretionary quarter for us. So that's kind of the trend you'll see. As I think about the multiyear gross margin, as you think about it, again, looking to build traffic, looking to -- as we build the -- again, really changing the stores. We now have 2,000 Dollar Tree Plus stores as we look at, again, continuing to further the assortment of the $1.25 price point.\n\nAnd then would look to see that the freight rates do start to come down and have an effect in next year. So there are some things that will play into that. A little early to really talk specifically. But I think those are kind of the moving pieces as we see them.\n\nOperator\n\nWe'll go ahead and move on to the next question from Robby Ohmes with Bank of America. Please go ahead.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nGood morning. Thanks for taking my question. I was hoping we could get a little more color. I think you mentioned trade down.\n\nAnd maybe some more discussion about the environment. The transactions were up at Walmart, Target and warehouse clubs. And I was just curious why the transactions are so much stronger versus being down at Family Dollar and Dollar Tree and if we should expect some improvement in the transactions. Thanks.\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah. We expect improvement in our transactions, especially as the pricing moves that we've made, the assortment changes that Larry Gatta and the merchants are making and bringing in some new adjacencies and our seasonal product that we have ready. Just a little pressure -- as you said, our customer is pressured like none other. And the good news is, is we're excited.\n\nWe see third-party data that we do have a lot of new customers coming into both banners over last year. And the majority of them are at a household income of $80,000 or higher. So we feel good about that. We also see a huge shift from cash into credit, which tells us the customer is pressured.\n\nAnd then inside the store, when they get in there, we've seen in the industry where private brands have outpaced national brands for 24 weeks in a row now, 24 weeks in a row. That hasn't happened in the last five years, that private brands has outpaced national brands. And that's the customer trying to stretch their dollar and manage their budget. And Larry and the team are working hard on our private brands, and we're seeing the same change inside of our store.\n\nAnd then they're even making decisions on form and function. We see them moving from liquid to powder detergent. We're seeing them even go without softener -- liquid softener in detergents. They're just choosing not to have softener.\n\nAnd those are the things that our customers are -- and the decisions they're making. And we think right now, with the price investments and the changes that Larry is making and our new assortment at Dollar Tree, we're in a wonderful position to meet their needs in 16,000 stores conveniently located where they don't have to drive far. We'll meet their needs and we're excited about it going forward.\n\nOperator\n\nWe'll take our next question from Scot Ciccarelli with Truist. Please go ahead.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nGood morning, guys. Scot Ciccarelli. So I wanted to revisit the question that I actually asked last quarter. So we know that, in general, retail turnarounds take longer, costs more than what people generally expect.\n\nAnd last quarter, when I asked about that, your comment was that for the investments for '22, it was all embedded in your outlook. So given the change this morning and the fact that you've now had more time to evaluate the improvements that need to be made, do you have a better view of how much more investment may be needed to get Dollar Tree and Family Dollar where you want them from an operational and technological standpoint?\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah. And Bobby is -- that's a great question. And our team is forming right now. And I think from an opex perspective, we're going to continue to invest in labor where we need to.\n\nAnd there will be payroll investments going forward. For this year, as far as we can see with the dynamic markets going on, it is embedded in our forecast. From the IT and supply chain, I think those are the two big ones. And what Bobby is looking at right now, the good news is, and I think Rick mentioned it, Bobby knows every one of our systems.\n\nAnd he knows exactly what he needs to do because he's done this before at other retailers, and he's worked with the two executives in supply chain and merchandising. So Bobby is working really hard. And I will owe you that number probably up in the spring when we have our investor day because that is going to be a longer-term outlook, and the majority of it is going to be in capex. And then the same thing with supply chain.\n\nWe're looking at what is the best way to deliver to our stores, what's the most efficient way to use our network to deliver our Combo Stores, our Dollar Tree Plus stores and, of course, our traditional Dollar Tree and Family Dollar stores. And John is working on that now and modeling it out, and we'll probably have more information on the spring as the -- as we have more knowledge from the two leaders. Our CFO that we just announced is going to be coming on board and will certainly have a say in it and will want to look at it. But those are the two big investments.\n\nBut in our opex and in our forecast, from a repair and maintenance and store conditions perspective, we have those embedded in and we will probably come back to you if there's any other longer-term initiatives that will impact that.\n\nOperator\n\nWe'll move on to our next question from Simeon Gutman with Morgan Stanley. Please go ahead.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey. Good morning, everyone. It's Simeon Gutman. For Mike and Rick, this is maybe more theoretical on timing and sequencing.\n\nIt looks like '23 may end up being more transitional, and that's part one of the question. Is that fair? Because some of these price investments will continue and then we're going to lap some of the multi -- or the breaking the buck at the tree. So if that's a fair assumption, how do you think about maybe speeding up investments, layering -- leaning in, I guess, for '23 to clear the path for '24?\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah. And in theory, I think you're right. But our pricing investment is in, and then we're just going to manage that going forward on that side of it. I think we will lean in on our investments on supply chain and IT, but these are things that take time just because of the amount of systems that you are touching.\n\nAnd as Rick said, it's our -- as our store and retail systems, as our supply chain systems and then our merchandising systems. So that will take time, and we will stage that over our capability. And then the supply chain will be -- as we roll out and open new distribution centers, that's when we will continue to rightsize our network and make decisions going forward. So we will continue to move with speed that will give us the highest return as quick as possible.\n\nOperator\n\nWe'll take our next question from Kate McShane with Goldman Sachs. Please go ahead.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for taking our question. It looks like the elasticity response improved again sequentially with the $1.25 change.\n\nJust wondered what your expectation for the response is for the second half and if that's changed meaningfully from what you were thinking when we last spoke to last quarter.\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah. No, I think the biggest change is the dynamic of the marketplace and the huge shift from discretionary to consumables, not the shift about our $1.25. We did some in-depth customer research and customer intercepts about Dollar Tree at the beginning of the quarter. And we really wanted to dig into our brand and the assortment and in-store experience.\n\nAnd I was shocked. Not one of them brought up price. Not one of them brought up the $1.25. They were all focused on clean, new assortments, seasonal and the service of the -- what they have when they're in the stores.\n\nSo I think the customers move beyond that because as we tested early on, they understand value more than ever. And in today's dynamics, they see that $1.25 is an exceptional value. That's why all these new items and consumables are all taking off. And why I'm excited about the back half -- and to your point, the second quarter did not really have any big season.\n\nDollar Tree is all about the seasons. We change like the leaves on the trees. Well, in the summer, the leaves aren't changing because you've got lawn and garden and then you've got graduation, and graduation was impacted by helium. On the back half, Kevin said we've got 2,000, 2,100 actually, Dollar Tree Pluses that we didn't have.\n\nSo that's going to be -- that's exciting about the back half. And then our inventory. We've got all of our seasonal inventory at $1.25. And they will rally around this seasonal merchandise, just like they did in the first quarter with Valentine's and Easter.\n\nWe expect some exciting things and great response from our customers because we're in a great inventory position. The value is spectacular. And then on the basic side, we've answered that on the consumables that we didn't have last year at this time. So I'm pretty excited about the back half of Dollar Tree.\n\nOperator\n\nWe'll go ahead and move on to our next question from Scott Mushkin with R5 Capital. Please go ahead.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nHey, guys. Thanks for taking my questions. So I just wanted to get into a little bit more about labor, some of the comments you said about labor and the labor competition and what kind of pressure that might put on you as you try to get that more where you want it to be.\n\nMike Wytinski -- President and Chief Executive Officer\n\nYeah, Scott, and thanks. Early on, we shared that we're investing over $195 million, just under $200 million in our payroll, the majority of it in our store associates and some of it in our DCs. We feel really good where we're at in our distribution centers. We've got all of our roles filled compared to this time last year where we didn't have open positions.\n\nWe are continuing to invest in markets in the stores and at retail stores, and we will continue to do that where we see the need. Looking out over the back half of the year, where we need to make adjustments is already in our forecast. So it's a dynamic environment. Now people are coming back to work a little bit just because of what's going on in the economy.\n\nSo I think that's going to shift a little bit, but we will continue to invest where we need to. And so far, in the next six months, looking for the rest of the year, we have what we need to invest in the forecast.\n\nOperator\n\nWe'll take our next question from Michael Montani with Evercore ISI. Please go ahead.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nHey. Thanks for taking the question. Just wanted to dig into a little bit further, if I could. The top kind of two to three drivers of traffic for both banners moving forward and kind of what the realistic time line to anticipate the shift.\n\nObviously, there's pricing actions you're doing at Family Dollar, but then prices have gone up at Dollar Tree. So just kind of talk about, if you could there, Rick and Mike, what gives you the confidence and what's the time line to get those things turned up?\n\nKevin Wampler -- Chief Financial Officer\n\nWell, go ahead, Rick.\n\nRick Dreiling -- Executive Chairman\n\nYeah, I was just going to say, I just got done saying the excitement on the Dollar Tree side. Our assortment and the investments we've made into the new $1.25 on the consumable side is driving traffic. And just to put that in perspective, we haven't seen that kind of improvement in consumables, which drives traffic since pre pandemic. So that's our investment, and that's how we're driving traffic, along with the unbelievable assortment coming up that they're going to see inside our store for the seasons coming up.\n\nUnlike anybody else, Dollar Tree -- the $1.25 is the best value, the best wow and the most excitement. And then on the Family Dollar side, this pricing, again, we just put ourselves in a position to be the best price to the market in over 10 years. That alone will drive traffic, not even mentioning what Larry Gatta and the merchants are doing with enhancing our H2.5 with a tighter assortment, more meaningful prices, take advantage of more linear foot, so getting more product on the shelf that the customer is looking for. And then getting seasonal upfront and center.\n\nSo I'm really excited about the moves that we've made. Now as you know, it takes time for the customer -- we've got new customers coming in that are recognizing it. And then over time, we will see and get credit for being priced right, better assortment, better position on the Family Dollar side. And Larry's -- and I mentioned purposefully on marketing, we've got four great marketing perspectives going on with our digital marketing, with our print ad, and Larry is really working on exactly what do we need to advertise that the customer responds to that drives traffic.\n\nSo those are all the levers that the merchants and Larry are pulling on the Family Dollar side, and I'm just thrilled about what we got going on on the Dollar Tree side to keep growing.\n\nOperator\n\nAnd our last question comes from Michael Lasser with UBS. Please go ahead.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks for taking my question. So Rick, you've been around the value retail space for a long time. Presumably, you came in and over the last 90 days, you said, look, we need to get Family Dollar price perception at a better spot in order to realize the full potential of this asset over the long run and we have this opportunity because Dollar Tree gross margins are expanding, and we can use that expansion to fund investments at Family Dollar.\n\nSo now the question is, with Dollar Tree exiting this year at a 37% to 38% gross margin rate and Family Dollar exiting this year with a low 20s gross margin rate, can Dollar Tree sustain the 37% to 38% gross margin rate over the long run? And can you rebuild Family Dollar's gross margin rate over the long run in order to generate a suitable return on these investments?\n\nRick Dreiling -- Executive Chairman\n\nI think the answer to that is we're very comfortable with where we are on the gross margin in Dollar Tree for the back half of the year and going forward. And I will say we are working our way with the vendor community, with vendor support and we anticipate that the Family Dollar margin will improve over time.\n\nOperator\n\nAnd with that, that does conclude our question-and-answer session for today. I would now like to hand it back over to our presenters for any additional or closing remarks.\n\nRandy Guiler -- Vice President, Investor Relations\n\nGreat. Thank you, Ali. Thank you for joining us for today's call. Our next earnings call for Q3 is tentatively scheduled for Tuesday, November 22.\n\nThank you, and have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRandy Guiler -- Vice President, Investor Relations\n\nRick Dreiling -- Executive Chairman\n\nMike Wytinski -- President and Chief Executive Officer\n\nKevin Wampler -- Chief Financial Officer\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nKate McShane -- Goldman Sachs -- Analyst\n\nScott Mushkin -- R5 Capital -- Analyst\n\nMichael Montani -- Evercore ISI -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nMore DLTR analysis\n\nAll earnings call transcripts"
}