{
  "companyName": "Nike",
  "companyTicker": "NKE",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/30/nike-nke-q1-2023-earnings-call-transcript/",
  "content": "Nike (NKE -0.29%)\nQ1 2023 Earnings Call\nSep 29, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, everyone. Welcome to NIKE, Inc.'s fiscal 2023 first quarter conference call. For those who want to reference today's press release, you'll find it at investors.nike.com. Leading today's call is Paul Trussell, vice president of investor relations and strategic finance.\n\nBefore I turn the call over to Mr. Trussell, let me remind you that participants on this call will make forward-looking statements based on current expectations, and those statements are subject to certain risks and uncertainties that could cause actual results to differ materially. These risks and uncertainties are detailed in the reports filed with the SEC, including the annual report filed on Form 10-K. Some forward-looking statements may concern expectations of future revenue growth or gross margin.\n\nIn addition, participants may discuss non-GAAP financial measures, including references to constant dollar revenue. References to constant dollar revenue are intended to provide context as to the performance of the business eliminating foreign exchange fluctuations. Participants may also make reference to other nonpublic financial and statistical information and non-GAAP financial measures. To the extent nonpublic financial and statistical information is discussed, presentations of comparable GAAP measures and quantitative reconciliations will be made available at NIKE's website, investors.nike.com.\n\nNow, I would like to turn the call over to Paul Trussell.\n\nPaul Trussell -- Vice President, Investor Relations and Strategic Finance\n\nThank you, operator. Hello, everyone, and thank you for joining us today to discuss NIKE, Inc.'s fiscal 2023 first quarter results. As the operator indicated, participants on today's call may discuss non-GAAP financial measures. You will find the appropriate reconciliations in our press release, which was issued about an hour ago or at our website, investors.nike.com.\n\nJoining us on today's call will be NIKE, Inc. president and CEO, John Donahoe, and our chief financial officer, Matt Friend. Following their prepared remarks, we will take your questions. [Operator instructions] And I'll now turn the call over to NIKE Inc.\n\npresident and CEO, John Donahoe.\n\nJohn Donahoe -- President and Chief Executive Officer\n\nThank you, Paul, and hello to everyone on today's call. Before we get started, I want to give a special shout out to the greatest of all time, Serena Williams, following her final tournament at the U.S. Open. Serena doesn't like to use the word retired, so I won't either.\n\nBut on behalf of the entire NIKE family and sports fans around the world, we're going to miss seeing her play. We're thrilled to see what she does next as she continues to serve as an inspiration and everything she does. Serena, on behalf of everyone at NIKE, thank you. Turning to our Q1 performance.\n\nOur teams continue to prove their ability to operate through volatility while also staying focused on the long term. For the quarter, our revenue growth was 4% on a reported basis and 10% on a currency-neutral basis, led by double-digit growth in our North America, EMEA and APLA geographies. I'm proud of our results this quarter as our brand momentum, culture of innovation and proven operational playbook delivered yet another quarter of strong revenue growth. Our brand strength continues to give us confidence in sustaining our top line momentum.\n\nThese results reflect our deep connection to consumers around the world as we keep them in the center of all that we do. Our consumer direct acceleration strategy enables us to create value around consumer creation, consumer demand in an entire marketplace fueled by the lifelong relationships we maintain. This significant momentum that we're seeing is fueled by structural tailwinds that continue to create energy for us. NIKE's growth is strengthened quarter by quarter by the expanded definition of sport, by the societal movement toward comfort and health and wellness and by the fundamental shift in consumer behavior toward digital.\n\nThese advantages, along with our scale, the strength of our portfolio of brands and the right strategy, renew our confidence in a more populated competitive landscape. As the world's largest sports apparel and footwear company, we are happy to set the pace in serving the consumer. At NIKE, our focus remains not only to grow market share but also to invest to grow the entire market. Our ability to expand the world of sport and our ability to create the future of sport itself is why I wouldn't trade NIKE's position with anyone.\n\nNow as you look at this quarter's strong results, we can see our brand momentum and global portfolio come to life. This is true across the three areas I'd like to walk through today, our brand that deeply connects with consumers fueled by authenticity and sport, our culture of innovation that drives a continuous pipeline of new products, and our competitive advantage across the marketplace as one of the few brands that can connect with and serve consumers at scale. So let's start with NIKE's strong brand and our connection to sport, which differentiates us all over the globe. Consumers continue to rate us their No.\n\n1 cool and No. 1 favorite brand as we connect directly and deeply with consumers worldwide. No matter the macroeconomic dynamics, no matter the competitive landscape, the NIKE brand, and indeed, all three of our brands, including Jordan and Converse, have created meaningful relationships with consumers across age, gender, ethnicity and more. This brand momentum is fueled time and time again by our athletes and teams.\n\nNo other brand in the world can match our roster as we help them perform at their very best. Just look at women's football this quarter. Two fabulous international tournaments ended with NIKE federations on top with England winning the Euro Champs and Brazil's winner of the Copa America. And what's particularly exciting is that these two wildly popular teams will compete in the inaugural Women's Finalissima, the first-of-a-kind women's match between the European and South American champions.\n\nThis historic match is slated for February 2023, and we can't wait. And speaking, we can't wait, we're very excited for the Men's World Cup later this year and the Women's World Cup next summer. This will truly be one of the greatest 18 months in footfall history, and NIKE will be there in full force. Now our brand strength and consumer connection will continue to be driven by storytelling through sport in a way that only NIKE can.\n\nIn tennis, I mentioned Serena's farewell to the sport at the U.S. Open, but the new generation made some noise there too. Carlos Alcaraz won the men's side at 19 years old become the youngest men's No. 1 ever.\n\nAlong with Frances Tiafoe and Jannik Sinner, the future of men's tennis was on full display, with NIKE proud to represent this next generation of exciting players. Also in the quarter, the Las Vegas Aces won the WNBA title, led by Coach of the Year Becky Hammon, Kelsey Plum and League MVP A'ja Wilson. And American football is now back. With the Swoosh won by all 32 NFL teams, and NIKE and Jordan representing 21 schools and college football top 25.\n\nAnd finally, in the Berlin Marathon last week, Eliud Kipchoge smashed his own world record, running the marathon in an incredible two hours, one minute and nine seconds while wearing the Alphafly Next% 2. Simply put, we have a roster of athletes, teams, leagues and federations that represents the very best in sport, creating inspiration for consumers worldwide. Let's move to innovation. As we've said before, NIKE's relentless pipeline of innovative product continues to create separation between us and our competition.\n\nToday, we have incredible momentum in key products and franchises across the spectrum of lifestyle and performance. And what excites us even more is the energy and anticipation we're feeling for the innovative product that's next in the pipeline. We're now starting to see the product that reflects our shift two years ago to our new consumer construct of men's, women's and kids, and the impact it's had is remarkable. We're also excited about how we'll be connecting this product to the consumer.\n\nToday, we're working toward being more seasonally relevant across the full assortment. So the energy we're creating from an innovation standpoint, when combined with how we plan to story-tell and connect it to the marketplace gives us immense confidence as we look ahead. Earlier, I mentioned this landmark 18 months for global football we've got coming up. We created a football boot to match the moment.\n\nSo during the women's Euro Champs this past summer, we debuted the Air Zoom Mercurial, which for the first time, adds a Zoom airbag to what was already our fastest football boot. This gives the footballer an even greater sense of snappy propulsive energy return. The new Mercurial and energy around it is NIKE at its best, as products, storytelling the marketplace and elite athletes come together to connect this innovation to consumers. And with our best boot ready for the biggest stages of the world's most popular game, not to mention a full lineup of Federation kits, we're thrilled about translating this energy into commercial opportunity.\n\nOur culture of innovation is fueled not just by what we make but also how we make it. We're always looking to increase the pace and precision of product creation. New VR design software and simulation tools allow our designers and engineers to collaborate in real time like never before. This transformative path to continuous new innovation is highlighted by the new Air Max Scorpion.\n\nThe Scorpion, which is an eye-catching shoe that offers our most Air ever in terms of pounds per square inch, followed a development timeline of just 18 months. In fact, our digital transformation investments directly led to Scorpion's breakthrough innovation within our iconic Air franchise. How did that happen? Well, thanks to computational design pioneered by NIKE for industrial design uses, Scorpion introduces a radical new system for airbags, moving from simple forms into complex new geometries for a unique underfoot sensation that has to be felt to be believed. And moving forward, we plan to accelerate the use of our industry-leading digital creation tools to bring new excitement to our biggest franchises.\n\nNow during last quarter's call, I mentioned a new platform that we believe has the potential to change the apparel industry. As some of you have seen with its launch last week, I'm talking about NIKE Forward, our biggest apparel innovation since Dri-FIT 30 years ago. NIKE Forward revolutionizes apparel creation to make premium sustainably minded product that offers brand-new comfortable sensation. The truth is NIKE Forward feels different because it is different.\n\nForward's being introduced in hoodies and crewnecks for men and women that feature raw cut pockets, minimal seams and a modern silhouette. And this innovative product is warm and yet lightweight with a future-forward look that consumers have responded to since its unveiling last week. And as the consumer focus on comfort continues to gain momentum, we see vast opportunity ahead for scaling forward in our entire performance-driven sportswear apparel business. So from performance to sportswear sustainability, NIKE has always married the art and science of product creation as we use innovation and design to connect with and inspire consumers all over the globe.\n\nMy third and final point today is our competitive advantage across the marketplace. We're continuing to accelerate against our One Nike Marketplace approach in which we directly connect with the consumer no matter where they shop and with each channel playing an integrated role in the consumer's overall journey. Now our approach starts with NIKE Digital as that's where most consumers begin their shopping journeys. And then, it's augmented by our strategic wholesale partners who share our vision to provide a consistent premium and seamless consumer experience.\n\nAnd last but not least, our remodel brand stores which continue to play the key role of supplementing where there are gaps in the marketplace, such as women's or Jordan. Now this quarter, we delivered NIKE Digital's highest net revenue quarter ever. We see consumers continuing to vote for NIKE Digital as the NIKE commerce app had its highest traffic in history during Q1. And we keep elevating our ability to serve these consumers.\n\nFor example, new membership tools we put in place last year in fiscal '22 that went live in Q1 create one-to-one connections at scale by delivering personalized consumer journeys and experiences which in turn drive first purchases and increased loyalty. And the SNKRS app continues to fuel energy to our growing audience of high-value members. We're bringing this community in almost daily flow of compelling content and product launches. In Q1, for example, SNKRS saw its most member entries ever for the Travis Scott AJ1 that dropped in July with a record 3.8 million member entries for just a single shoe, SNKRS continues to impress as it offers the perfect intersection of content, community and commerce.\n\nSecond, our partners are and will remain a vitally important part of our marketplace strategy. Partners enable us to serve consumers with expanded access, choice and convenience, and above all, letting us know and serve these consumers across the full marketplace. Today, we're seeing growth through our partners and improved retail sales. For example, back-to-school was strong as supply continued to improve and traffic and sell-through continued to accelerate.\n\nAnd as we continue to focus on giving consumers personalized experiences regardless of channel, the key remains connected membership. This model gives shopper the benefits of NIKE membership in partner stores, accelerating in-store conversion, engagement and improving customer lifetime value. Now as you know, connected membership again last year with DICK'S Sporting Goods before two of our key partners in Greater China joined in, TopSport and Pou Sheng. And today, we're very excited to announce that we're now extending connected membership to EMEA with Zalando and JD Sports as increased opportunities for connected data and inventory make us even quicker and more precise in jointly serving the consumer.\n\nIn fact, just two days ago, we hosted our first in-person, NIKE Partner Summit in over two years in which we brought to Beaverton, a group of 24 of our top retail partners, representing 76 countries. The summit was a great opportunity for us to accelerate into the future together with a unified vision and belief in partnership and collaboration. And it was clear that our partners were excited to get the sneak peek at our upcoming product, as well as getting a deeper dive in our strategy. NIKE will continue investing to deliver the very best brand in the industry to elevate our collective game with the right product experiences and unmatched storytelling through content and insights to help us win with the consumer.\n\nThese strategic partnerships are truly win-win with plenty of opportunities still ahead. And finally in our marketplace strategy, we continue to build a compelling retail footprint with our own brick-and-mortar fleet. As direct becomes an even bigger part of our business, we're investing in becoming a better retailer as we pursue our goal of becoming world-class in this space. In a dynamic retail environment, our global traffic is up, thanks in part to the unique NIKE experiences we offer across our assortment of retail concepts.\n\nFor instance, in July, we opened our first NIKE Rise store in EMEA, NIKE West London, following the success of NIKE Rise in China and Korea. All three NIKE Rise stores use real-time shopping insight and the community focus to deliver tailored in-store experiences for consumers. NIKE West London uses local sports, like football and running, along with data on the city and its athletes to create something that cannot be replicated anywhere else. In the end, our strong brand momentum speaks to our continued belief that these are times when strong brands get stronger.\n\nWe're supercharging how we serve consumers with innovation, direct connection and experiences that create lifelong relationships with our brands. There's never been a better time to be in the sport and wellness business, and I'm confident in our ability to not just stay at the front of the path but also to extend and expand our lead. And with that, I'll turn the call over to Matt.\n\nMatt Friend -- Chief Financial Officer\n\nThanks, John, and hello to everyone on the call. Our first quarter of fiscal '23 demonstrated again the deep consumer connection and strong demand for NIKE, Jordan and Converse. In a dynamic operating environment, we delivered top line results ahead of plan, more than offsetting foreign exchange headwinds. With industry-leading Digital growth, positive retail traffic in our stores and online, and more product available for consumers across the marketplace, the power of NIKE's portfolio continues to fuel business momentum.\n\nAt our core, NIKE is a growth company, built on a passion for serving athletes. 50 years later, this passion inspires consumers worldwide through our commitment to product innovation and our belief that sport can change the world. Today, NIKE's potential for growth has no limits as we create our future through a steadfast focus on serving the consumer. At the same time, we are closely monitoring an operating environment that continues to be disruptive.\n\nSo before discussing our first quarter financial results, let me provide a deeper view into the latest shifts we are seeing and the actions we are taking to manage our business for the long term. Over the past three years, we have leveraged our operational playbook to manage through supply chain disruption and COVID-related store closures. I could not be more proud of how our team continues to adapt to changing circumstances with a relentless focus on getting the right product to the right place at the right time. This quarter, it became clear to us that conditions in North America are shifting once again.\n\nEarlier ordering by retailers, driven by strong consumer demand and less predictable delivery timelines, had led to elevated inventory levels broadly across consumer goods. Then transit times began to rapidly improve with signals that further improvement may be coming. At the same time, consumers are facing greater economic uncertainty, and promotional activity across the marketplace is accelerating, especially in apparel. As a result, we faced a new degree of complexity.\n\nDemand for NIKE, Jordan and Converse continues to be uniquely strong with positive consumer response and high full price realization on fresh seasonal assortments and key product franchises. In September, month-to-date retail sales are up double digits versus the prior year, following a strong back-to-school season. However, our North America inventory grew 65% versus the prior year, with in-transit inventory growing approximately 85%. This reflects the combination of late delivery for the past two seasons plus early holiday orders that are now set to arrive earlier than planned and a prior year that was impacted by factory closures in Vietnam and Indonesia.\n\nAs a result, we are taking decisive action to clear excess inventory, focusing on specific pockets of seasonally late products, predominantly in apparel. While we expect this to have a transitory impact on gross margins this fiscal year, we believe this cost will be far outweighed by the benefit of clearing marketplace capacity to align seasonally relevant product, storytelling and retail experiences for the consumer. Time and again, this is how NIKE responds to adversity. We adapt, we compete and we accelerate forward.\n\nWith strong brand momentum, improving deliveries and a robust innovation pipeline, we're acting now to set the stage for future seasons of sustainable profitable growth. Looking ahead, we are especially excited about the breadth and depth of our product pipeline. This includes innovation platforms that break new ground in performance and sustainability. Women's apparel completely redesigned for fit, sensation and support.\n\nA renewed focus on serving everyday runners with the world's best running innovation across price points. A total refresh of our signature basketball line across brands. New sportswear collaborations with the leaders of youth culture and the next chapters of our most iconic product franchises. NIKE's authenticity as the champion for athletes and sport has always been one of our greatest strengths.\n\nOver the next 18 months, we'll drive consumer energy through new product and storytelling, in essence, doing what NIKE does best. NIKE's competitive advantages are also growing as the Consumer Direct Acceleration transforms our operating model, driving deeper and more direct connections through digital. NIKE membership serves as a catalyst for digital growth, driving greater engagement and higher lifetime value in our highest margin channel. This quarter, repeat buying members grew by over 30% with increased buying frequency and demand across total NIKE members.\n\nIn fact, many of our most important membership benchmarks, reflecting how well we convert, engage and retain buying members, are at near all-time highs. These trends give us confidence that we have a strong and loyal member foundation to drive digital growth ahead. Since fiscal '19, our digital business has nearly tripled to exceed $10 billion in revenue, representing 24% of total NIKE brand revenue in fiscal '22. Over this period, NIKE Direct gross margins expanded through the combination of rapid digital growth and improvements in channel margin profitability, ultimately fueling NIKE's overall gross margin expansion despite being partially offset by transitory headwinds experienced through the pandemic.\n\nWhile we continue to manage through short-term dynamics, these structural tailwinds give us confidence that we are making progress toward our long-term financial goals. Now let me turn to our NIKE, Inc. first quarter financial results. In Q1, NIKE Inc.\n\nrevenue grew 4% and 10% on a currency-neutral basis. This was led by 14% growth in NIKE direct and 8% growth in wholesale. NIKE digital grew 23% with double-digit growth across EMEA, North America and APLA, fueled by increasing traffic, higher conversion and growth in average order value. First quarter reported gross margin declined 220 basis points to 44.3%.\n\nThis was primarily due to elevated freight and logistics costs plus higher markdowns across the marketplace in North America and unfavorable changes in net foreign currency exchange rates. SG&A grew 10% in Q1, primarily due to wage-related expenses, strategic technology investments, increased NIKE Direct costs and increased demand creation expenses. Our effective tax rate for the quarter was 19.7% compared to 11% for the same period last year, primarily due to decreased benefits from stock-based compensation. First quarter diluted earnings per share was $0.93.\n\nFinally, inventories were $9.7 billion, up 44% compared to the prior year. Driven by volatility in transit times in North America, strategic decisions to buy inventory for future seasons earlier and lower inventory levels due to last year's factory closures in Vietnam and Indonesia. Now let's review the operating segments. In North America, Q1 revenue grew 13% and EBIT declined 4%.\n\nNIKE direct grew 13% versus the prior year, outpacing the broader market with double-digit in-store and digital traffic growth. NIKE Digital grew 19%, fueled by member demand and the NIKE app. Wholesale revenue grew low double digits with strong growth from strategic partners such as DICK'S and JD Finish Line, as well as our authenticated partners. NIKE continues to lead as the No.\n\n1 cool and No. 1 favorite brand in North America. We're driving momentum across key consumer and sport dimensions, including positive consumer response to the Pegasus 39, Invincible 2 and Infinity 3 in performance running, high sell-through and full price realization across key footwear franchises, such as Air Force 1, Dunk and the Air Max 270 and broad-based growth across men's, women's, kids and Jordan on improved inventory supply. As I previously discussed, we started to increase promotional activity in the first quarter and expect the broader marketplace to be promotional at least through the end of the calendar year.\n\nWe expect that total inventory in North America peaked in Q1, and we anticipate seeing sequential improvement over the year as we rebalance supply and continue serving strong consumer demand. As we prioritize a healthy pull market, we are confident that our brand strength and decisive actions positions us well to compete and to capture market share. In EMEA, we saw record results. Q1 revenue grew 17% on a currency-neutral basis.\n\nEBIT grew 11% on a reported basis, with broad-based growth and strong gross margin expansion driving the most profitable quarter in EMEA history despite significant foreign exchange headwinds. NIKE Direct grew 20% on a currency-neutral basis and NIKE Digital grew 46%. Running delivered solid growth with strong consumer response to the Pegasus 39, Invincible 2 and the Peg Trail 4. We also celebrated our most successful Mercurial launch ever and an unforgettable moment for women's sport at the European Championships, with our Never Settle, Never Done campaign driving over 450 million impressions.\n\nSince fiscal '19, EMEA gross margins have expanded by more than 500 basis points, with NIKE Digital increasing its penetration from 7% to 20%, nearly tripling its share of EMEA NIKE Brand revenue. This is another great proof point for how our consumer-led digital transformation is accelerating NIKE's growth and profitability. Next, I'll provide some color around our results in Greater China. In Q1, revenue declined 13% on a currency-neutral basis, and EBIT declined 23% on a reported basis.\n\nNIKE Direct declined 2% on a currency-neutral basis with a 5% decline in NIKE Digital. While COVID-related disruption had meaningful impact on store operations and retail traffic, business performance and inventory management are ahead of plan as we continue to proactively recalibrate supply and demand. Brand strength is our competitive advantage, with NIKE setting the pace as Chinese consumers' No. 1 cool and No.\n\n1 favorite brand, further extending our lead among teams. Product innovation remains a key differentiator with strong sell-through from the Alphafly Next% 2, the Pegasus 39, the G.T. Cut 2 and other performance products. Jordan Brand's momentum was another highlight with year-over-year growth, driven by a standout Luka 1 launch, key franchise strength and the energy of Jordan's 25th anniversary campaign.\n\nWe continue to deepen connections with Chinese consumers in locally relevant ways, from elevating the street dance community with hyperlocal product and storytelling to igniting youth basketball culture through the lens of the Chinese high school basketball league. With Gen Z member demand growing more than 25% versus last year on NIKE's digital platforms and the newly launched localized NIKE app already leading as the No. 1 brand shopping app, we're more encouraged than ever about NIKE's opportunity to serve Chinese consumers with distinct, premium and localized experiences. As mentioned last quarter, we are taking a cautious near-term approach in Greater China, given the ongoing risks of COVID-related disruption.\n\nHowever, our brand and business momentum gives us increasing confidence that NIKE's unique value proposition will fuel long-term growth in Greater China. As we turn to APLA, Q1 revenue grew 16% on a currency-neutral basis, and EBIT grew 4% on a reported basis. We delivered our third consecutive quarter of double-digit currency-neutral growth led by Southeast Asia and India and Korea. NIKE Direct grew 30% on a currency-neutral basis, led by 29% growth in NIKE Digital and 31% growth from NIKE-owned stores.\n\nOur Member Days offense continues to accelerate member engagement, tripling repeat buying versus the prior year. Women's continues to deliver outsized growth, with momentum in performance running, footwear, bras and sports style innovation footwear like Air Max. Performance fueled strong growth in men's with the launch of Pegasus, Infinity and Invincible in running and the Mercurial in global football. In addition, we have now transitioned our businesses in Argentina, Chile and Uruguay to a distributor model.\n\nNow I'll turn to our updated financial outlook for fiscal '23. To date, we continue to see strong consumer demand for our portfolio of brands across our geographies. We are closely monitoring consumer confidence and behavior, and ultimately, the implications of high inflation on consumer demand. We've managed through cycles like this before, and we know these are times to stay on the offense, leveraging our financial strength to prioritize a quicker return to a healthy pull market.\n\nIn this environment, strong brands set the pace and we are confident NIKE will emerge even stronger. We are focused on what we can control as we take a measured approach against an uncertain macro outlook. Accordingly, we will tighten up our second half buys and liquidate excess inventory more aggressively beginning in the second quarter, focusing the flow of new product to our strategic partners and NIKE Direct. Headwinds from foreign exchange have also shifted significantly in the last 90 days as the trend of U.S.\n\ndollar strengthening has accelerated. Based on current spot rates, net of hedging activity, we estimate the full year negative impact of foreign exchange on reported revenue and EBIT to now be approximately $4 billion and $900 million, respectively, creating a wide divergence in constant versus real dollar performance. We continue to expect currency-neutral revenue growth of low double digits versus the prior year, equating to reported revenue growth of low to mid-single digits versus the prior year, assuming 800 basis points of foreign exchange headwinds. We now expect gross margin to decline between 200 to 250 basis points versus the prior year.\n\nThis reflects approximately 150 basis points of annual impact from higher markdowns and higher off-price mix to liquidate elevated inventory, a second straight year of more than 100 basis points of headwinds from elevated freight and logistics costs, and foreign exchange pressure now a 70 basis point headwind on the full year. We now expect SG&A to increase high single digits as we prioritize investment in new transformational capabilities to serve consumers directly and at scale, partially offset by tighter expense control and limited headcount growth across the business. We now expect the fiscal '23 effective tax rate to be in the mid- to high teens range, primarily due to decreased benefits from stock-based compensation. For the second quarter specifically, we expect reported revenue to grow low double digits on strong consumer demand despite 900 basis points of foreign exchange headwinds.\n\nWe expect second quarter gross margins to decline approximately 350 to 400 basis points versus the prior year, the largest impact across the fiscal year as we discount out-of-season product more aggressively in a largely promotional marketplace. This will require higher markdowns in our own channels and through wholesale partners. The second quarter also compares to last year's record level of full price realization and includes headwinds from freight, logistics and other supply chain costs, as well as foreign exchange. As we look toward the rest of our fiscal year, we are confident in our strategy and in our opportunity ahead.\n\nWhile we expect circumstances to remain dynamic, we are optimistic as we continue to make progress toward our long-term financial goals. Our brand momentum is strong. The power of our portfolio is unrivaled, and our vision of NIKE's limitless potential is clear. On that note, I'd like to close by thanking our 79,000 NIKE, Jordan and Converse teammates around the world who serve our mission with a passion for sport and a culture of innovation unlike any other.\n\nThey represent our true competitive advantage and our greatest reason for confidence as we create NIKE's future. With that, let's open up the call for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Bob Drbul with Guggenheim. Your line is open.\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nHi. Good evening. A couple of questions. The first one is when you look at the inventory situation, and I guess specifically in North America, when do you think you will have recalibrated the supply/demand for NIKE? And I guess just wondering if -- what you think about the industry when you think the industry might also sort of be better in balance on the supply demand equation.\n\nMatt Friend -- Chief Financial Officer\n\nSure, Bob. Well, as I mentioned on the call, our inventory grew 44% this quarter, which was led by 65% growth in North America. And maybe just as a point of context because you're right, it is North America where we're focused, where we saw the most significant -- where we've seen the most significant volatility and disruption in the supply chain. In Greater China, as an example, our inventory was down 3% versus the prior year, and we feel quite confident about our inventory levels in EMEA and APLA.\n\nIn North America, in particular, we saw in-transit growth of 85%, and in-transit inventory now represents approximately 65%, so almost two-thirds of North America's total inventory. And that's really being driven by a couple of factors. The first one is the disruption that started over a year ago when our factories closed for almost 15 weeks in Vietnam, and for a lesser extent in Indonesia, and the decisions that were taken after that with regards to inventory that was in process to be made. Secondly, we've seen quite a bit of volatility in transit times.\n\nWe saw an increase in the second half of last year. And then, most recently, this quarter, we saw a significant improvement in transit times after we and many others had made the strategic decision to buy the holiday season earlier because of the longer transit times. So when we look at our overall inventory, we think that there's about 10% of the inventory that we're focused on in terms of trying to drive more accelerated liquidation. And while our inventory was high at the end of the first quarter, we do expect to see sequential improvement in inventory balances from here over the next three quarters.\n\nWe plan to compete, as I mentioned, in a more promotional environment. And given the macro uncertainty that's out there for the consumer, we're taking a more measured approach and we're tightening our inventory buys around the world based on some of the risks that could materialize in the second half. But we're confident that the actions that we're taking, which we started a bit in the first quarter and now we're more aggressively accelerating in the second quarter, are going to position us and our strategic partners very well for fiscal '24.\n\nJohn Donahoe -- President and Chief Executive Officer\n\nAnd Bob, I'd add on to the second, just part of your question around -- you're right, it's the entire industry. And so, we're entering the next 90 days and the remainder of this fiscal year with the same mindset we've had in the last two and a half years, which is through whatever period of turbulence we've got, we want to leverage our strengths to emerge in a stronger position than our competition at the other end of it. And so, in a promotional environment, brand strength matters. And so, we will be aggressive, as Matt said, on liquidating excess inventory but also coming hard with our key popular franchises to bring heat and energy to them in Q just like we did in Q1, like the Travis Scott AJ1, and that had very strong full price realization.\n\nAnd we got a very strong innovation pipeline that will still be coming hard and hard in Q2, Q3 and Q4. You saw in Q1, we had the Air Zoom Mercurial. We had the Air Max Scorpion, NIKE Forward. We've got a really strong innovation pipeline.\n\nSo we talk about the transitional and the structural. The transitional is navigating through the inventory situation. The structural is leveraging our competitive advantages so we emerge in a stronger position, and we'll be playing offense on both.\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nGreat. Thank you very much. Good luck.\n\nOperator\n\nYour next question comes from the line of Matthew Boss with J.P. Morgan. Your line is open.\n\nMatthew Boss -- J.P. Morgan -- Analyst\n\nGreat. Thanks. So maybe John, to that point, could you speak to the inflection in demand that you've seen in North America? What have you seen in early fall with full price selling? Does any of this change your pipeline of innovation? And how will you balance this pipeline looking forward of newness and technical innovation while, at the same time, taking the aggressive inventory actions that you've outlined?\n\nJohn Donahoe -- President and Chief Executive Officer\n\nWell, Matthew, it's just as Matt said earlier. So we see strong consumer demand in North America currently, right? There's no signs of any softness. It was relatively promotional in August but strong, strong into the first couple of weeks of this quarter. And so, we, again, talk in terms of transitional and structural.\n\nOn a transitional basis, as Matt said, we're going to work through the excess inventory to get to a full marketplace as fast as we can and try to do it in an intelligent way to take share. And as my predecessors used to say, through a few competitive elbows along the way. And then, our innovation agenda is still going to continue full speed ahead. And consumers are responding to innovation and compelling storytelling.\n\nAnd that's been true. That's true in Running. That's true with the Peg 39 and the innovations coming and our Running line are excellent over the next year. We're very excited about Pegasus, Invincible, Infinity, the entire, what we call the Must-Win 6.\n\nWe have a great basketball portfolio coming. You've seen the LeBron 20, right, launched, already hard to get, if not sold out. And LeBron 20 and what's beginning a real refresh of our entire basketball signature line, both in NIKE and Jordan. We've got, in women's fitness, we got a very strong Alate bra is out with very good early consumer response and our entire tights line will be coming in and full bra line in this coming fiscal year.\n\nAnd then, Air Max Scorpion was the starting point in the lifestyle basis, we have a strong Air Max pipeline over the next six to 12 months. And so, we're going to be going full speed ahead on those with strong and compelling storytelling. And it's kind of a balance. We think those are the structural things that set us up to gain long-term share while we're navigating through the short-term, short-term industrywide excess inventory.\n\nMatt Friend -- Chief Financial Officer\n\nI might just add, Matt, that when we look at our performance in Q1 and then to date in September, we're seeing double-digit growth in retail sales. And we're bringing what we call fresh assortments, so new product into market. We are seeing strong consumer demand, strong average weekly sell-through and high full price realization. And I think the distinction here that we're trying to make is a distinction between footwear strength and seasonally appropriate product and innovation and late-arriving apparel that has been impacted from the factory closures a year ago, and some of the decisions made around what to continue to make and bring to market and then what's been impacted by transit times.\n\nAnd so, we're really focused on trying to clear through that late off-season apparel inventory that we have predominantly in North America, but we do have a little bit of it in EMEA and APLA as well. We continue to see strong month-to-date sales in EMEA and APLA as well. So our brand momentum is pretty clear around the world, and we continue to be encouraged as we see the way the consumer is responding to a greater availability of supply than we've been able to have over the past year.\n\nOperator\n\nOur next question comes from the line of Paul Lejuez with Citi. Your line is open.\n\nPaul Lejuez -- Citi -- Analyst\n\nOK. Thanks, guys. Curious how you're thinking about the international markets. Curious what your -- curious what the promotional levels look like in those markets.\n\nAnd how do you think about balancing the sales gross margin of closing? More likely to go for market share in the international markets versus the margin? If you can maybe share your thinking on international, anything outside of North America.\n\nJohn Donahoe -- President and Chief Executive Officer\n\nMaybe Matt, I'll just make one comment and then -- you're going to hear a key theme over and over to -- our highest priority is building our long-term competitive position. And that's what we've been doing. So whether that's in China coming out, we are very enthusiastic about the signs we're seeing in China and coming with a full wave of innovation and storytelling and hyper-localized innovation and storytelling, we think, will serve us well in China. As Matt mentioned, EMEA and APLA, strong consumer demand with a strong pipeline.\n\nSo our ultimate goal, the way we're prioritizing is what's going to enable us to improve our competitive position and build that deeper relationship with consumers that, with a direct connection, surrounded by membership that allows us to have a lifetime relationship with those consumers. And then, Matt, you can comment on some of the details.\n\nMatt Friend -- Chief Financial Officer\n\nYes. I'll just give you a couple of specifics in a couple of geographies, Paul. In EMEA, as I mentioned, we saw significant gross margin expansion again this quarter and a very high level of full price realization. And so, our performance and our approach in that marketplace has been one that's driving growth and profitability.\n\nAnd that strength has been true across channels, so in our own channels but across the wholesale channel as well. When we look at Greater China as an example, where we know that the marketplace has been more promotional because of what's transpired with regards to the COVID-related disruption that everybody is facing in that marketplace, we overdelivered our plan in Q1. And that wasn't just in our financial results. We saw stronger retail sales across the marketplace than we had planned.\n\nWe were able to liquidate more units than we planned, and we saw a higher full price realization in Greater China than we had planned. And as a result of that, we're increasingly confident that our inventory will be normalized by the end of this coming quarter and in a position to compete on a full-price basis. The last thing I would probably just say, and I sort of alluded to it in my prepared remarks, but NIKE is at its best when we are able to bring together product, storytelling and a retail experience for the consumer. And when you look at the depth and breadth of our product portfolio and the way that we dimensionalize our products for the consumer, it's a competitive advantage for us that makes our brands stand apart relative to others.\n\nWhen we think about the way we're going to navigate the excess supply and liquidation relative to the way that we're trying to maintain a full-price marketplace for the new inventory that's flowing in, we're prioritizing the flow of new products to our strategic partners and to NIKE Direct. And so, we'll use our factory stores. We'll use digital a little bit in order to liquidate some of this excess apparel, and we'll use other partners in wholesale to liquidate it. But we will -- we are focused on ensuring that the holiday product at the starting season that's arriving on time is going to be set in the marketplace in our strategic partners so that we can put our best foot forward with the consumer.\n\nOperator\n\nYour next question comes from the line of Alex Straton with Morgan Stanley. Your line is open.\n\nAlexandra Straton -- Morgan Stanley -- Analyst\n\nGreat. Thanks so much for taking my question. I wanted to just hit on macro fears, which are obviously top of mind for investors right now, particularly as it relates to potential recession. Can you just talk about what your guidance assumes as it relates to any potential recession? And can you just remind us how NIKE has performed in previous periods of economic pressure, as well as if you've seen any signs of trade down so far within the business?\n\nJohn Donahoe -- President and Chief Executive Officer\n\nYes, Alex, we again will repeat some consistent things. We're coming off a strong quarter and we feel very good about our competitive position, and we have not yet seen any signs of slowdown. That said, we don't have any crystal ball around the external factors, whether it's FX, whether it's inflation, whether it's the impact of energy prices on consumer spending. And so, Matt will talk a little bit about the assumptions we have built in to our second half.\n\nBut what we're focused on is what we can control, which is staying on the offense. And we believe that we can meet consumer demand regardless of the macro demand, meet consumers and gain share through this period. And so, whether that's in a promotional environment in North America in the next six to 12 months, or that's in EMEA, APLA, in China, as we discussed, we feel like we can have better price realization and use our strong brand strength and product innovation to gain share during this period.\n\nMatt Friend -- Chief Financial Officer\n\nYes. And I just would add specific to the guidance that, as John mentioned, in the first quarter, we exceeded our own internal plan with double-digit currency-neutral growth. My guidance for second quarter was continuing to see strong consumer demand with reported revenue growth growing low double digits and 900 basis points of foreign exchange. And given where we sit today, we're confident in the next -- the plan we have for the next 90 days and the way that the consumer is responding.\n\nWe're closely monitoring consumer confidence. And to give you an example, we've seen double-digit growth in retail sales in EMEA in Q1 and in -- sorry, not in Q1, in September season to date. But we're seeing some softness in the U.K., and it's being more than offset by strength across the rest of the EMEA portfolio, in France, Germany, Italy, Spain, etc. And so, we're taking a measured approach to the second half.\n\nAnd that specifically relates to the way we're planning inventory. For us, the decisions we take and the commitments we make to inventory end up mattering most in the context of the way that we look at the Forward plan. And our full year forecast of low double-digit currency-neutral growth, given our performance in Q1 and what we anticipate for quarter two, is reflecting a more modest growth rate in the second half. And that's us taking a measured approach.\n\nAt the end of the day, like John said, we're going to focus on the consumer and leverage the operational playbook that we have. There are some very specific things we're doing with regards to excess inventory in North America. But we're going to keep our -- keep focused on the consumer. And we're confident that to the extent that something more significant happens, we're taking some of the right actions now in order to position us well in that scenario.\n\nOperator\n\nYour next question comes from Brian Nagel with Oppenheimer. Your line is open.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nGood evening. Thank you for taking my questions. So a couple of questions. First off, with regard to China.\n\nIs there something you can point us to, to maybe help us understand better or help us frame better the underlying demand -- the underlying healthy demand in that market? The reason I ask, you talked about it qualitatively. We see that numbers are still something, but that's been primarily a function of the ongoing COVID disruption. So is there something more quantitative that we can see that really help us understand the underlying demand? And then the second question I have. I know there's been a lot of questions on inventory already.\n\nBut as you think about this sort of say, pocket of excess inventory that's now in the system, is it simply just delayed? Or is there something else that encourages you to want to clear it as opposed to just work it through over the normal course of time at full price?\n\nJohn Donahoe -- President and Chief Executive Officer\n\nSo Brian, how about that? I'll take the first and you take second? Thanks, Brian, for the question. On China, as you know, we've got a very strong local team there, led by Angela Dong, and they're doing a remarkable job navigating through this dynamic situation with the temporary COVID closures. And our hope is that that gets better over time. So that's -- but that's a factor that -- it's a little like inflation.\n\nWe can't completely predict it. And the great news is our team there is showing great agility navigating through, again, what we're calling a transitional environment. But structurally, we see some very encouraging signs of consumers. In fact, I was talking to Angela last night.\n\nAnd she's very clear that they're seeing Chinese consumers are emerging from these lockdowns with a real hunger for innovation, quality and energized storytelling. And that's particularly around sport, that's what -- that's we do best. And so, they're responding to our strong flow of global innovative product. G.T.\n\nCut sold out, as Matt mentioned. Alphafly Next% sold out. But even more what they're responding to is when they take a global innovation and hyper-localize it. So the Peg 39, a hyper-localized into a gel design.\n\nOur dance pack, they hyper-localized. And as a result, they're having the lowest markdowns in the industry. And we're building a hyper local-brand voice there. The NIKE mobile app and SNKRS are now fully localized, which allows us to both in live streaming and other ways, deliver a very localized consumer journey and consumer experience.\n\nAnd Matt mentioned some of the storytelling in his remarks around the Jordan 25th anniversary and what we're doing with high school basketball that it is connecting with consumers. And so, we continue to be the No. 1 cool and favorite brand. And that is -- we are strengthening with young consumers and Gen Z consumers on that.\n\nAnd so, I don't know if there's quantitative. What is clear is that the Chinese consumer is ready to come back into the market, and what they're looking for is innovation, quality and storytelling. And we feel that plays well to our positioning into our opportunity. So we're optimistic.\n\nMatt Friend -- Chief Financial Officer\n\nYes. And I would just say -- I would add that when we referenced that China grew ahead of our plan, 13% decline was better than we were anticipating in light of the fact that our team was planning for disruption, given the episodic closures by city that are occurring. Now given the performance that we saw in the quarter, we saw retail sales across the overall marketplace increase relative to our plan aligned with that. And what I would say, Brian, is that this encouragement that we've been noticing for the past three quarters is really giving us confidence from across the marketplace that while we've been navigating through some near-term issues, that NIKE is positioned to grow in Greater China.\n\nAnd the fact that we're moving quickly to move through an inventory will be a competitive advantage for us in that marketplace, and we're ready to compete beginning next quarter. And so, we've got a great team, as John mentioned, and we think that we're toes-on-the-line ready to serve the consumer in the ways that we've talked about. I think on your second question on pockets of excess inventory, I think that was a more broad question. That wasn't for China.\n\nWhat I would basically tell you is this. Because we had late product arriving for the spring, summer and fall seasons, because of the disruption that we've seen in North America and then the decisions of early order holiday and to have that arrive earlier, we effectively have a few seasons landing in the marketplace at the same time. Because we have a portion of that inventory being seasonally out of relevance, we've decided to take that inventory and more aggressively liquidate it so that we can put the newest and best inventory in front of the consumer in the right locations. So that's where we're focused.\n\nIt's predominantly apparel. It's in North America predominantly. And that's where our focus and attention is. And when we look at our full year guidance, it's a 150 basis point annual impact, which we believe is transitory.\n\nIn other words, we will incur it this year in order to be able to move that inventory through. And then, we've got a foundation for growth and expanded profitability in fiscal '24 pursuing a full-price innovation -- sorry, full-price realization against our new product and innovation pipeline.\n\nPaul Trussell -- Vice President, Investor Relations and Strategic Finance\n\nWe have time for one last question.\n\nOperator\n\nYour last question comes from the line of Michael Binetti with Credit Suisse. Your line is open.\n\nMichael Binetti -- Credit Suisse -- Analyst\n\nHey, guys. Thanks for taking our questions here. Matt, I was just wondering if you -- to clarify one simple thing, you said North America inventory peaked in first quarter. Could you clarify that the total company inventory starts to decline on a year-over-year basis after this? Maybe some of the visibility you have into the back half related to how you're building it after your comment that 2Q will be the low watermark on gross margins.\n\nAnd then, John, I know it's a very different macro but the comments you guys just made for fiscal '24 and beyond. Any reflection on the five-year targets that you gave us a year ago, some of the growth rates and year-over-year margin opportunities as we get past this year relative to that plan?\n\nMatt Friend -- Chief Financial Officer\n\nWell, as it relates to inventory, Michael, the answer -- you don't usually get a yes or no question, but the answer to your first question is yes. We do expect total inventory to improve as we go from the first quarter. So I highlighted North America because that's obviously the geography where we've seen this most significant increase. But we do expect to see it reduce.\n\nAnd then, as it relates to -- reduce on a dollar basis. And then, as it relates to the margin impact, the second quarter will be the largest impact. We do expect that there will be some residual liquidation that takes place in the third quarter. And like I said just before, the total annual impact we see as a transitory 150 basis point cost to effectively liquidate the inventory that we want to liquidate and serve the marketplace with the fresh holiday product and then looking forward that we see.\n\nJohn Donahoe -- President and Chief Executive Officer\n\nAnd Mike, on the second part of your question, it's -- I'm really glad you asked that because it gets to why we're so focused on the medium to long term because we do believe there is some very strong structural advantages that come into play. It's directly connecting with consumers, is critical to serve consumers going forward to have that direct connection, use our membership program to translate what has been a transactional relationship into a lifetime relationship of value, whether it's through directly or through our partners. And with our movement toward Direct, both Digital and our monobrand brand stores, as Matt has said, each quarter, there is a structural benefit to our margins. And so, it has -- it's good for consumer, it's good for competitive position and it's also good for our margins.\n\nAnd so, that's why we're staying ruthlessly focused on it. That's why you see our digital growth rates still continue to be quite strong, and we will continue to move ahead on our marketplace strategy. So we continue to be confident in the five-year macro outlook that -- and guardrails Matt put out there. The exact timing of those, I think we're a little bit out of the game.\n\nWe're trying to predict year in and year out, given how dynamic it is. But the structural things that we've laid out in our strategy, we believe, are strong today.\n\nMatt Friend -- Chief Financial Officer\n\nAnd still achievable.\n\nJohn Donahoe -- President and Chief Executive Officer\n\nAnd still achievable.\n\nPaul Trussell -- Vice President, Investor Relations and Strategic Finance\n\nThank you for the question, Michael. And thank you, everyone, for joining us today. We look forward to speaking with you next quarter. Take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPaul Trussell -- Vice President, Investor Relations and Strategic Finance\n\nJohn Donahoe -- President and Chief Executive Officer\n\nMatt Friend -- Chief Financial Officer\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nMatthew Boss -- J.P. Morgan -- Analyst\n\nPaul Lejuez -- Citi -- Analyst\n\nAlexandra Straton -- Morgan Stanley -- Analyst\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nMichael Binetti -- Credit Suisse -- Analyst\n\nMore NKE analysis\n\nAll earnings call transcripts"
}