{
  "companyName": "Owl Rock Capital Corporation",
  "companyTicker": "ORCC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/owl-rock-capital-corporation-orcc-q3-2022-earnings/",
  "content": "Owl Rock Capital Corporation (ORCC -0.34%)\nQ3 2022 Earnings Call\nNov 03, 2022, 10:00 a.m. ET\n\nOperator\n\nHello and welcome to the Owl Rock Capital Corp. Q3 2022 earnings conference call and webcast. At this time, all participants are listen-only mode. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt's now my pleasure to turn the call over to your host, Dana Sclafani, head of investor relations. Please go ahead, Dana.\n\nDana Sclafani -- Head of Investor Relations\n\nThank you, operator. Good morning, everyone, and welcome to Owl Rock Capital Corporation's third quarter earnings call. Joining me this morning are chief executive officer, Craig Packer; our chief financial officer and chief operating officer, Jonathan Lamm; and other members of our senior management team. I'd like to remind our listeners that remarks made during today's call may contain forward-looking statements, which are not a guarantee of future performance or results and involve a number of risks and uncertainties that are outside the company's control.\n\nActual results may differ materially from those in forward-looking statements as a result of a number of factors, including those described in ORCC's filings with the SEC. The company assumes no obligation to update any forward-looking statements. Certain information discussed on this call and in our earnings materials, including information related to portfolio companies, was derived from third-party sources and has not been independently verified. The company makes no such representations or warranties with respect to this information.\n\nORCC's earnings release, 10-Q, and supplemental earnings presentation are available on the Investor Relations section of our website at owlrockcapitalcorporation.com. With that, I'll turn the call over to Craig.\n\nCraig Packer -- Chief Executive Officer\n\nThanks, Dana. Good morning, everyone, and thank you all for joining us today. We are pleased to report very strong results and are announcing today a number of shareholder-friendly initiatives that reflect this strength. Our net investment income in the third quarter was $0.37 per share, up $0.05 from last quarter and roughly 20% in excess of our previously declared $0.31 per share quarterly dividend.\n\nThis is the highest quarterly NII we have earned since the first quarter of 2020. We are very pleased with this significant growth in earnings, which was largely driven by the pull through of higher rates on our investments. We have seen a dramatic move in base interest rates with SOFR up roughly 350 basis points this year. The impact of this move drove our third quarter results and will further increase earnings in the fourth quarter.\n\nThe earnings power of our portfolio is strong and growing. We are announcing today that we expect to earn at least $0.39 of net investment income per share in the fourth quarter. This estimate assumes a continuation of the very low repayment environment we have seen, and any increase in repayment activity in future quarters would provide further upside to NII. We are putting out this guidance because we have clear visibility on the impact that elected base rates will have on fourth quarter NII, and we are confident in our portfolio.\n\nThe credit quality of our borrowers remains strong, which is seen in the consistency of our internal portfolio ratings and average marks of our investments, as well as the 2.5% increase this quarter at NAV per share to $14.85. We're also announcing several capital actions to ensure that our shareholders benefit from this earnings momentum. First, we are increasing our regular quarterly dividend. Our board has declared a fourth quarter dividend of $0.33 per share, up $0.02 from our third quarter dividend of $0.31 per share.\n\nWe also want to ensure our shareholders benefit from the consistent earnings we expect in excess of our regular dividend going forward, and as such, we are introducing a new quarterly supplemental dividend in addition to our regular dividend. For the third quarter, our board has declared a supplemental dividend of $0.03 per share. Jonathan will discuss the framework for this dividend in more detail later in the call. Assuming the supplemental dividend is constant in the fourth quarter, the combined $0.36 per share dividends would generate an annualized yield of 12% at ORCC's current trading levels.\n\nWe believe the increase in the regular dividend and the addition of the supplemental dividend is a balanced approach to maximize distributions to shareholders. The increase in our regular dividend reflects our confidence in the earnings power of the portfolio and positions us to evaluate further increases in the future. While the supplemental dividend provides additional predictable cash flow to shareholders. Our fundamentals are strong and we are increasing shareholder distributions.\n\nOur stock continues to trade at a significant discount to NAV. As a result, we are also announcing that ORCC and Blue Owl employees each intend to purchase stock in the open market to take advantage of this discount. First, ORCC's board authorized a new $150 million repurchase program, which replaces our previous program. Second, Blue Owl employees have opted to participate in an investment vehicle that intends to buy an additional $25 million of ORCC's stock.\n\nIn the near term, the company plan and the investment vehicle intend to purchase $75 million of stock in aggregate, a portion of which will be executed under programmatic 10b5-1 plans so they are able to continue buying after the trading window closes. Our board and the Blue Owl employees believe it is an attractive time to be buying ORCC's shares, and we value this alignment between the company, Blue Owl employees, and our shareholders. I would also like to spend a minute on the economic outlook. Given the current Fed monetary policy environment, market consensus expectations indicate we will enter a recessionary environment in the near to medium term, and we are well prepared for that outcome.\n\nA recession in conjunction with a higher rate environment will likely cause increased pressure on borrowers in the leveraged finance market and elevated levels of credit challenges. As we have said many times since inception, we have been an upper middle market lender. We believe this approach positions us well coming into this environment, that our companies will fare better than most. Our borrowers are large with an average EBITDA of approximately $160 million and benefit from strong competitive positioning.\n\nWe believe larger companies are able to generate more stable results as they benefit from deeper customer relationships and increased pricing power with suppliers. They have greater financial flexibility, often benefiting from non-core assets they can sell to enhance liquidity or delever and are often strategically important in their market, making them attractive to acquirers. We have always focused on investing in stable, non-cyclical, annuity-light businesses in sectors like software, insurance brokerage, and healthcare. Our investments are primarily personal loans and are supported by significant equity cushions with an average loan to value ratio of roughly 45%.\n\nThe vast majority of our investments are supported by sophisticated financial sponsors who provide both operational and financial resources, which is particularly valuable in evolving economic conditions. We recognize that some companies will have challenges over the life of our investment and have built a robust portfolio management process, which allows us to proactively identify areas of concern and to work directly with our borrowers to understand and mitigate issues. To date, we have not yet seen evidence of economic weakness in our borrower's operating performance. Across our 180 portfolio companies.\n\nThe vast majority saw top line revenue growth in their latest financial reporting with an average increase in revenues of 7% and EBITDA of 4% quarter over quarter. Of course, we are not just looking at the current performance of our borrowers. We're also looking forward and are acutely focused on the impact of a higher rate environment on cash flows. We have broad and various sensitivity analyses looking at implied interest coverage in a period where higher rates are sustained and reflected in a full year of cash flows.\n\nEven in these scenarios, we believe that the vast majority of our borrowers will maintain adequate interest coverage cushions. In addition, most of our borrowers are entering this period with ample available liquidity and we believe most would benefit from additional sponsor support, if needed. So while we are we remain vigilant, we take great comfort that our portfolio was built to endure challenging times, and we believe any defaults or ultimate losses in the portfolio will be manageable, especially in light of our material -- of our materially higher earnings trajectory. With that, I'll turn it over to Jonathan to provide more detail on our financial results.\n\nJonathan Lamm -- Chief Financial Officer and Chief Operating Officer\n\nThanks, Craig. We ended the third quarter with total portfolio investments of $12.8 billion, outstanding debt of $7.2 billion, and total net assets of $5.8 billion. Our NAV per share was $14.85 versus our second quarter NAV of $14.48, an increase of 2.5%. This increase was driven by the continued strong credit performance of our borrowers in a relatively flat spread environment.\n\nAt quarter end, our net leverage remained within our target range at 1.18 times net debt to equity, a slight decrease from last quarter. Repayment activity remained low in the third quarter, which drove a modest quarter of originations given the portfolio is fully invested. We also ended the quarter with liquidity of $2.1 billion, well in excess of our unfunded commitments of approximately $1 billion, roughly half of which are revolvers. Turning to the income statement.\n\nOur net investment income was $0.37 per share, $0.06 above our previously declared third quarter dividend of $0.31 per share. As Craig mentioned earlier, our board declared a $0.33 per share regular dividend for the fourth quarter, which will be paid on or before January 13, 2023, to shareholders of record as of December 30th. This $0.02 increase, in addition to the $0.03 supplemental dividend, represents a 16% increase in our quarterly distributions. I'd like to spend a few minutes discussing the framework for the new supplemental dividend, which was also laid out on Page 17 of our earnings presentation.\n\nThe supplemental dividend will be variable each quarter, calculated as 50% of NII in excess of our regular dividend, rounded to the nearest penny and subject to certain measurement tests. It will be approved by our board, announced with quarterly results and paid in the following quarter. So for the third quarter, our board declared a supplemental dividend of $0.03 per share, which is 50% of the difference between our NII of $0.37 per share and our previously declared $0.31 per share third quarter dividend. This supplemental dividend will be paid on December 15th to shareholders of record on November 30th.\n\nAs a result, ORCC shareholders will receive a dividend eight times a year. We are also accelerating the dividend payment date going forward to roughly 15 days from the record date, which will allow us to deliver income to shareholders in a more timely manner. Turning to our balance sheet, we have a flexible balance sheet with a well-diversified financing structure. With only 50% of our liabilities exposed to rising rates, our weighted average total cost of debt remains low at 4.3%, and we have no maturities until April 20, 2024.\n\nFrom an earnings perspective, we are experiencing a meaningful benefit from rising rates on our investments, which is driving materially higher interest income. In the third quarter, the average base rate for our portfolio was roughly 2.3%, which reflects a mix of base rate elections and effect for the quarter. We have this ability that our average base rate will increase in the fourth quarter as the elections made as of September 30th have already increased the beginning average fourth quarter base rate to approximately 3%, with the likelihood that it will further increase during the quarter as more resets take effect. Looking forward, holding all else equal, we expect each additional hundred basis point increase in our effective base rate from the third quarter's rate of 2.3% generate approximately $0.04 per share or a roughly 11% increase in quarterly NII after considering the impact of income based fee.\n\nWith that, I'll turn it back to Craig for closing comments.\n\nCraig Packer -- Chief Executive Officer\n\nThanks, Jonathan. The current market opportunity for direct lending is probably the best we have seen since we started Owl Rock in 2016. Public markets are effectively shut and sponsors are primarily turning to direct lenders. On new loans, we're typically earning more than 11% with extended call protection, attractive leverage profiles, and credit protections for high quality, strategically important companies.\n\nGiven our scale and resources, we're continuing to see solid deal flow and having excellent competitive success in leading highly attractive investment opportunities. The opportunity has further swung our way and we expect that to continue. However, in our discussions with shareholders, we know the topic on their minds is not the market opportunity, but rather the dynamics driving ORCC's share price, which currently trades at a significant discount to net asset value. Often this gets framed to us when shareholders ask, is there something we are missing? We believe the answer is no and that there is a disconnect between where ORCC is trading relative to the fundamental credit quality of the portfolio and the future earnings power available for distribution to shareholders.\n\nTo put this into context, the current ORCC valuation is implying a default rate of more than 20% on the entire portfolio and a 60% recovery rate. This default rate would be a far worse default rate than the 10% default rate that the leveraged loan market experienced in the great financial crisis. In a downturn, any credit challenges would typically first show up in the form of amendment requests and additional capital needs from our borrowers. To date, we have not seen any increase in activity that would indicate heightened stress on our portfolio companies.\n\nWe are not seeing any increase in amendment requests, any increase in requests for extra funding or revolver draws or any requests to pick loans for performance reasons. Our watch list remains around 10% for about 15 companies, where its stood for the last two years. Although we had one small additional non-accrual this quarter, our non-accruals remain much lower than the industry average. We are extremely careful in our evaluation of accrual status, and I would highlight that 90% of our loans are marked at 95 or higher.\n\n100% of our borrowers are current on their interest expense and we have no loans that are in unsecured covenant violation. Another key data point for the health of our portfolio is our quarterly valuation process and corresponding marks. We have previously highlighted our consistent practices since inception, but feel it bears repeating now. Every quarter, we use a third-party valuation firm to mark every name in our portfolio.\n\nThey provide a valuation point, not a range. The marks on our investments largely increased this quarter, reflecting the continued strong credit performance of our borrowers and relatively flat market spreads. In addition to the stability of our investments, there is also clear evidence of the improving earnings power of our portfolio. Our portfolio level asset yield has increased to 10.2%, up over 200 basis points from the beginning of the year and will further increase with higher rates.\n\nOur earnings this quarter well exceeded expectations and we have put out guidance for a further increase in the fourth quarter. Of course, a weakening economy will create some portfolio issues. We do not expect to, nor we'll be perfect. We will see some challenges and could see default pick up from the current levels, which are at historic lows.\n\nHowever, we believe these issues will be manageable and the significant increase in earnings we are experiencing will more than offset any modest pickup in losses. We are also very proud to have paid the same regular dividends since our IPO, even through COVID, and are excited to take this step today to raise our dividend, which we believe we can comfortably cover going forward. In the light of ORCC's earnings trajectory, we think the addition of the supplemental dividend enhances our distribution profile, while leaving us flexibility to evaluate further increases in our regular dividend if performance warrants it. Further, we are pleased to demonstrate the commitment and alignment between the company, Blue Owl employees, and ORCC shareholders through the new share repurchase initiatives.\n\nSince inception, we have successfully delivered on the objectives we laid out for the company. Our returns continue to improve, generating an ROE of over 10% in the third quarter, up 100 basis points from last year, and our credit performance has been one of the best in the space with a loss rate of less than 15 basis points per year since inception. In aggregate, we hope these comments and the actions we are taking convey the high level of confidence we have in the outlook for ORCC and underscores our continued commitment to deliver value to our shareholders. With that, I will thank you for listening and we'll open the line for questions.\n\nOperator\n\n[Operator instructions] Our first question today is coming from Mickey Schleien from Ladenburg Thalmann. Your line is now live.\n\nMickey Schleien -- Ladenburg Thalmann and Company -- Analyst\n\nYes. Good morning, everyone. Craig, thanks for your in-depth, prepared remarks. It's very helpful.\n\nI want to ask a high level question in terms of the volatility in this market environment and how that may be impacting the amount of demand and the sort of demand for your capital. Clearly, you've been very successful in disintermediating other channels, and my sense is that if anything, that's except [Audio gap]. Very helpful. Thank you.\n\nCraig Packer -- Chief Executive Officer\n\nSure. Good morning, Mickey. You cut out at the end. But I think I got the gist of your question.\n\nSo you're right. I mean, we think this is maybe the best environment we have seen since we started the business. The public markets are shut. It's well-reported that the banks are sitting on $50 billion of leveraged finance inventory that they were unable to sell.\n\nAnd therefore, they are very unlikely to want to underwrite new deals. And if they do, the terms will be really difficult to accept. And so really, I think most, if not all opportunities, the private equity firms are working on are coming direct to direct lenders. And fortunately, where we -- we feel like we're at the top of that list and we're getting called on pretty much every opportunity out there.\n\nAnd we get to pick and choose the ones that we find the most attractive. We are -- we have capital across our platform. And although it is a decreased bite size from our peak, it's more than almost any other lender out there. And so we're using it in a selective manner for attractive credits.\n\nWe're getting wider spreads. Today, we're getting routinely 700 over, SOFRs. We're earning more than 11% on unitranche investments. We're getting more fees, more call protection, just general better structures.\n\nSo -- and there are enough deals for us to be very active. There certainly is not the same level of deal flow that we saw prior to the market volatility. But since all the deals are coming in direct lending, there's more than enough demand for our capital and frankly, our conversations with the private equity firms, they wish we had more capital. They are giving us the opportunity to do as much as we would like in each deal and that's sort of pushing us to allocate our scarce capital to their deals.\n\nSo it's a great environment. ORCC is fully invested at this point. We're going to continue to stay in our target leverage range. And so our deployment out of ORCC specifically is going to be driven as much as anything by repayments, which remain very modest.\n\nBut across the Owl Rock platform, this is a very active time in some of our ramping funds where we are putting out a considerable amount of capital.\n\nMickey Schleien -- Ladenburg Thalmann and Company -- Analyst\n\nI appreciate that, Craig. That's really helpful. And in your prepared remarks, you said that, by and large, the portfolio is not really showing signs of consistent credit problems. But you did have this one new nonaccrual.\n\nAnd I was wondering if that was idiosyncratic or is there something that that company's facing the other portfolio companies that you've invested in may start to see as we go into next year?\n\nCraig Packer -- Chief Executive Officer\n\nSure. So walk around is we put on nonaccrual to about an $85 million position. I think the issues there are specific to that company. I don't think there's any read through to other portfolio companies.\n\nThey are a supplier of affordable, ready-to-assemble home furnishings. So think TV stands for consoles. They were impacted by two things. One, supply chain issues.\n\nAnd two, they really benefited from COVID and stay-at-home. And while we had underwritten that, that would -- that return to work would impact them, I think it impacted them to a greater extent than we had expected. So, no, no particular read through to the rest of the rest of our portfolio. And we're going to continue to work with the company and the sponsors there, but we felt at this point it was appropriate to put it on nonaccrual.\n\nMickey Schleien -- Ladenburg Thalmann and Company -- Analyst\n\nI understand. That's helpful. That's it for me this morning. I appreciate your time, as always, and congrats on a very good quarter.\n\nCraig Packer -- Chief Executive Officer\n\nThanks, Mickey.\n\nOperator\n\nThank you. Next question today is coming from Robert Dodd from Raymond James. Your line is now live.\n\nRobert Dodd -- Raymond James -- Analyst\n\nHi, guys. Yes, so just on the theme of -- I mean, congratulations on the quarter and the continued dividend program, etc. But on the theme of credit, I mean, 10% of the portfolio on your internal watch list, Walker Edison, was one of your most marked down assets. So it's been well flat in advance of going on nonaccrual.\n\nBut can you give us any more color about any themes of, I mean, probably just inflation, etc., etc., in the tail of the portfolio? I think you said that the vast majority of fine? That means one minus the vast majority, there were some incremental problems. Can you give us any color on what the themes are there? And you said you're not seeing amendment requests. When do you think that might start to happen?\n\nCraig Packer -- Chief Executive Officer\n\nSure. Look, I don't want to I don't want to skip the headline. The vast majority of our companies are doing really well. 7% revenue growth, 4% EBITDA growth.\n\nAnd that's really the message. We certainly have companies that have had issues, and it's really the same group of companies this quarter that would have showed up a year ago or 18 months ago. So the issues are not different than they were because the companies have idiosyncratic things going on in their business. I will certainly acknowledge that there is margin pressure in the companies.\n\nThere is strong demand, I think, across the board. The economy remains strong, but there is margin pressure, which depending upon the company, depending upon the sector, will show up as increased labor costs, increased supply chain, increased commodity prices, what have you. And so there's some margin pressure throughout the portfolio. And that's why EBITDA is not growing as fast as the revenues.\n\nWe're not seeing -- and so when's it going to show up? I mean, I hope it never shows up. We're not seeing declining results, but we understand that the Fed is quite clearly committed to addressing inflation. They're going to keep raising rates until inflation comes in line. And at some point, I think most people and we certainly would expect that to cause an economic contraction.\n\nAnd so when that happens it stands to reason that will pressure some of our companies on. They are certainly paying higher -- much higher interest rates. They don't have as much cushion as they did and so that will start to pressure. I -- so -- the answer to your question is you tell me when the economy will slow.\n\nAnd that was when we'll see a pickup in amendments and the like. I don't -- I just don't know. Second quarter, third quarter, it's just guesswork at this point, but it's not any different guesswork for us than it is for any other lender or any other lender out there. But I will tell you, it's -- the portfolio and the companies are doing, I think, meaningfully better than the way our stock is trading.\n\nOur stock is trading as if we're having lots of issues in the portfolio, and we are not.\n\nRobert Dodd -- Raymond James -- Analyst\n\nI understood. Yeah, I think all the sentiment on the economy is credit is doing a lot better than the stock market, makes it look like so. One more follow up over time, kind of flipping the other way on what's going to happen. Prepay activity and repayments, obviously, yet again I expected that and your guidance assumes that that continues for Q4.\n\nHow long do you think that can persist? I mean, people can essentially -- do you think we're likely to see some rebound in that next year, or is it just going to persist as long as there's a lack of clarity in economic outlook. Any ideas there? Any color?\n\nCraig Packer -- Chief Executive Officer\n\nSure. We obviously track carefully the maturities of our borrowers and there's not a significant pickup in maturities in the next year or really even the year after. So there's not a contractual reason why we should see repayments pick up. I think it's going to be driven by, by, by just a general resumption in M&A activity, which is going to -- I would expect to happen when there's just a little more clarity out of the course of the rate environment and the economy.\n\nI think right now most private equity firms, they have lots of capital but they're looking at the same factors we're talking about. And they'd like to pay less for companies because they're taking into account some of this near-term uncertainty. Sellers don't want to sell for less. And so they're -- this isn't really an ideal time to put a company up for sale because you don't want to take less.\n\nAnd I think they perceive that whatever issues we're going through now are going to be relatively manageable in duration. And so there's a bit of a standoff. It's a typical ebb and flow in an M&A cycle. It's nothing profound.\n\nAt some point, you get clarity on the economy, clarity on rates. And I would expect the M&A activity to pick up. So, again, I -- I'd just be totally guessing, but by the second or third quarter of next year, could you see that and by sort of by the back half of next year, are we seeing repayments pick up? It's certainly possible. But we just to be clear, that's -- for ORCC's earnings, that's all upside.\n\nWe've baked in like really low repayments for the foreseeable future in all of our commentary on guidance and the tone that we've struck and the dividends that we're paying. And so to the extent we get that, that's all going to improve NII and fall to the bottom line.\n\nRobert Dodd -- Raymond James -- Analyst\n\nGot it. I appreciate it. Thank you.\n\nCraig Packer -- Chief Executive Officer\n\nThanks, Robert.\n\nOperator\n\nThank you. Next question today is coming from Ryan Lynch from KBW. Your line is now live.\n\nRyan Lynch -- Keefe, Bruyette and Woods -- Analyst\n\nHey, good morning. Nice quarter, guys, and really appreciate the very thorough, prepared comments over your business. One question I did have was if we look at your guys prepared comments regarding kind of the interest rate environment, you're talking about spreads increasing and getting wider, which is providing a more attractive investment opportunity. But yet in the quarter, your overall portfolio was written up and I believe it was written up mostly just kind of overall increase in fair values of your debt portfolio would -- which would assume, I think, the fair value valuation process assume maybe tighter spreads in the valuation process.\n\nSo I'm just trying to square those two. Why was the portfolio overall written up pretty meaningfully, which obviously is a good thing, but I'm trying to understand why the portfolio was written up this quarter pretty meaningfully.\n\nCraig Packer -- Chief Executive Officer\n\nSure. So just as a reminder, I -- Ryan, I know you know this, but for the broader group, we used the same process this quarter as we have every single quarter since our IPO, or frankly, since the inception of Owl Rock even when we were a private BDC. We use a third-party evaluation firm. They mark every name every quarter since inception.\n\nSame methodology, same practices, same discussion. As you know, when we make a new investment, it goes in at our cost basis. Typically, call it, 98, 98.5, depending -- if there's no change to the credit performance or market spreads that loan while accrete to par over the life of the loan. So there's general upward trajectory on the marks of all of our names, all else equal, because they're marching toward their maturity.\n\nThe valuation firm that we work with looks at a number of market indices to make the judgments about the market spread in addition to the credit performance. And they look at the same metrics that they've looked at since inception. In the second quarter, you'll recall public spreads, which is -- which are the most visible, are meaningfully wider, about 150 basis points wider. And public loan prices were off about five points.\n\nSo meaningful move in the second quarter. In the third quarter, I know this is -- may surprise some that don't stare at these market indices every day, spreads were basically flat in the public markets in the third quarter. Depending upon what index you look at, instead of 150 basis point move, it was a less than 15-basis-point move wider. And public loan prices were basically flat quarter over quarter.\n\nOur book continues to have really strong credit performance. And so given that strong credit performance, most of our loans not only March -- continue to march to par, but some of them were improving credit performance and had a bump a bit more than that. So basically the march to par in a relatively flat spread environment resulted in a move on asset prices of about a point, which is not a dramatic move, but I recognize that there are others out there that had modest NAV decreases. So our asset prices are up about a point we had in leverage, get a 2.5% increase in NAV.\n\nThe average mark and our portfolio is about 97, so you have some frame of reference. So it was in a relatively spot -- flat environment for market indices, good credit performance. You saw a modest increase in NAV of 2.5%.\n\nRyan Lynch -- Keefe, Bruyette and Woods -- Analyst\n\nOK, understood. Thanks for going through that under that exercise. The other question that I had was just on the share repurchase. I'd love to hear your framework of where you guys see that the allocation of capital to the share repurchase today at these sort of valuations.\n\nIn the past, you guys have had a share repurchase in place. It didn't have, I believe, the programmatic features that you have in this new share repurchase. So it gives you more flexibility. But I assume you have to sort of set levels that you want to be purchasing -- repurchasing shares at -- given the current market opportunities to deploy capital, which has obviously gotten better over the last six months, where do you view share repurchases in comparison to opportunities to deploy capital? And how does that change if your valuation would increase higher from here or lower from these levels?\n\nCraig Packer -- Chief Executive Officer\n\nSure. So we replaced our previous program of $100 million with a new $150 million program. And as you know, we're introducing a programmatic element. And the reason for that is, and we get asked this a lot, why haven't you bought stock? We are like every public company, there are windows where we were able to buy stock in their windows where we can't.\n\nAnd frankly, the windows -- the window where -- well, if you look in the past year and we don't disclose the windows, but I will I will share with you that when the windows have been open, the stock has traded at a relatively higher multiple of NAV and the more lower valuation periods have coincided with when the window is closed, which is frustrating. And so when we put in place this new program, we wanted to address that. And by putting in the programmatic piece to it, that allows us to buy stock even when the window is closed. And we have to, as you're as you're alluding to, we've got to put some metrics around that terms of volume and price.\n\nAnd so we will do that and we will give ourselves the flexibility to take advantage of the weakness in the stock. Generally, when the windows have been open, stock is traded at 0.9 NAV or higher. Today we're about 0.8 NAV or higher. So I won't be specific to draw conclusions from that, but it's a lot a lot more attractive now than it has been when the windows have been open before.\n\nIn terms of just some directional sense, at 0.8 of NAV, that's about a 12% yield. We're in diversity comment and today we're able to extend first term loans at about a 12% yield. And so there is -- you could you can make an argument in both directions on the relative attractiveness, keeping the permanent capital, making new investments versus buying back the stock. At 0.9 of NAV, it's 11%.\n\nSo certainly in this environment, I think I think most shareholders would say you'd rather have a great assets at 12 and buy the stock at 11. If you go below 0.8, obviously, you get to quickly get to 13, 14%. But I will say this. We're really frustrated by where the stock trades.\n\nHopefully that's clear in our actions and what we're doing. And we are -- we have given visibility on earnings performance. And while there are attractive investment opportunities, we think it's important that we also address the stock price, and the stock buyback as a way to do that. And so we're not going to shy away from it either.\n\nI would also add that, as I've said, we've got employees of Blue Owl are also going to buy shares in the stock and there's a lot of -- it is totally optional program that we got a very high participation rate in and they obviously know the portfolio quite well. So hopefully it's all read as a sign of confidence in what we're doing.\n\nRyan Lynch -- Keefe, Bruyette and Woods -- Analyst\n\nOK, understood. I think that makes a lot of sense. And I think that does show a nice vote of confidence from the team. That's all for me.\n\nI appreciate the time today.\n\nCraig Packer -- Chief Executive Officer\n\nThanks, Ryan.\n\nOperator\n\nThank you. [Operator instructions] Our next question today is coming from Kevin Fultz from JMP Securities. Your line is now live.\n\nKevin Fultz -- JMP Securities -- Analyst\n\nHi, good morning and thank you for taking my questions. I just want to dig into the investment landscape a bit more. Given the evolution of market conditions over the past three to four quarters. I'm curious if you could talk about how that has translated to deal pricing leverage for improved documentation in deals you're originating right now compared to six to 12 months ago?\n\nCraig Packer -- Chief Executive Officer\n\nSure. As I said a bit ago, but I'm happy to spend a little more time on it, it's a terrific environment for us. These are some of the best investment opportunities that we've seen in six years. In terms of spreads, and I will -- it's hard to be precise about this, but call it nine months ago, spread on unit tranche term loans was as tight as 550 over.\n\nToday that spread is more like 700 over. It depends on the credit. Some are wider, some are 675 over, but let's call it 700 over. Obviously, the base rate nine months ago was 1%.\n\nWe're at our 4s. So that was 6.5%. Today, it's 4%. So it's -- that's 11.\n\nIt's almost double. Just by taking the break, the spread and the base rate. In addition, before we were getting maybe to two -- 2.25 points in fees. Today, we're routinely getting as much as three.\n\nPreviously, our call protection was maybe 1.01 for a year and then it would go down the par. Obviously, we don't want to extend capital today only to get repaid in a short period of time. So we are consistently getting call schedules of 1.03, 1.02, 1.01, which means if a loan gets repaid in, say, the second year, we get another two points of return. So that adds another 1% annual -- annualized.\n\nBut I think the most important part -- point is not the economics. The economics are really attractive, but we're also able to get really good leverage profiles and document structures so that we're making great investment decisions. And so it's harder to be to generalize. It depends on the credit but just on the margin, there's less capital for each deal.\n\nWe're all underwriting to recession environments, and we're just making sure that everything we're doing is kind of work in this higher interest rate environment in terms of leverage and cash flow and covenants and structure and all the things that we do every day. And so I think this vintage is extremely attractive and -- both for the economics and for the structure.\n\nKevin Fultz -- JMP Securities -- Analyst\n\nThat's all really helpful, Craig. And then a follow up, I appreciate the detail you provide on a typical borrower profile around how revenue, EBITDA, and interest coverage are trending. Can you provide an update on where portfolio company leverage is currently and how that has changed over the past few quarters?\n\nCraig Packer -- Chief Executive Officer\n\nSure. I can -- we can call you separately with, like, precise numbers, but generally it's in the low to mid sixes of leverage, give or take, and the interest coverage is about two and a half times.\n\nKevin Fultz -- JMP Securities -- Analyst\n\nOK. That's helpful. And thank you for taking my questions and congratulations on a really nice quarter.\n\nCraig Packer -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Next question today is coming from Kenneth Lee from RBC Capital Markets. Your line is now live.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nHi. Good morning and thanks for taking my question. Just a follow-up question on an early one around the deal flow. You talked about seeing a solid deal flow.\n\nJust wondering how that squares with a potential slowdown in M&A activity. What's driving the deal flow there? Thanks.\n\nCraig Packer -- Chief Executive Officer\n\nSure. I think that the single-most active pocket for deal flow is in the technology area, in software, which is a sector that we really like and have. It's our largest sector across our platform in the largest single sector within ORCC. But as folks probably know, we have several other funds that invest exclusively in technology.\n\nAnd so what you're seeing is private equity firms are looking at some really attractive businesses that are publicly traded with very predictable contractual revenue streams, significant growth, very sticky business models. And their stocks have traded off to the point where there are attractive, take private, candidates. There's been a number of these. I won't go through them all in this call.\n\nI think folks are generally aware of them and we are a leader in providing financing for those take privates. And so it's an area that we really like. We think there's some of the very best credits. They have an even lower loan to value than our typical deal.\n\nInstead of 45%, many of them has 30%, 35%, some less than that 20%, 25%. We get even wider spreads than what we've been talking about, good covenant packages. We think they're an area you need domain expertise to be able to underwrite. We have it and we're doing it.\n\nAnd so that's -- and these deals are large. They're $1 billion, $2 billion, $3 billion at a clip. And so in an environment where many direct lenders don't have as much capital as they did before, and we do, we can write very substantial checks for those deals. And we have been doing that to great success.\n\nThe other area where you're seeing activity is the sponsor's existing portfolio companies doing add-on acquisitions, and they're coming to us for more modest amounts of capital to help them continue to grow even in this environment. A lot of those deals don't make the newspapers. They're small, hundred million here, $150 million there for existing portfolio companies, but obviously that's the power of incumbency. And we have at this point, we've got 300 companies where they're a lender.\n\nAnd so they're coming to us to provide that capital. What's interesting about that dynamic is, I would say, pretty routinely when we provide that additional capital most of our loans will have some type of MFN structure, essentially where we are repricing the existing loan that we already have in conjunction with pricing that incremental capital for the acquisition. And so you're seeing, and you saw this quarter spreads in our portfolio widened again for the fourth quarter in a row, because we're able to get increased spread on our existing book just by being willing to extend additional capital and sort of taking advantage of that of that MFN provision. So there's plenty to do.\n\nAgain, ORCC itself doesn't have a lot of capital to put out, so it just doesn't take much to flow. But across the platform, we're finding robust opportunities and find ourselves in a leadership position and most of the deals are happening.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nGotcha. Gotcha. Very, very helpful there. Just one follow up, if I may.\n\nAnd this is also another follow up on an earlier question about the unrealized gains. And you mentioned during the valuation process, a lot of it is driven by much stronger credit performance. I assume that the credit performance is being driven by the revenue and EBITDA growth that these portfolio companies have been seeing, or are there any other factors to note that?\n\nCraig Packer -- Chief Executive Officer\n\nSo the single biggest driver of the unrealized gain is just the lapse of time for credit, even if it's doing flat that we were just accreting the loan that's marked below par on average loans in 97. We're just accreting at the par. If the entire credit performance of the portfolio was flat and the markets are flat or NAV will go up. That is the driver.\n\nHowever, we've certainly had companies that continue to do well within that subset, and so they may go up modestly more than the average. But the message is not that we're making some aggressive judgments about how strong companies are doing. The message is we have a large portfolio of performing loans that we feel really confident get repaid at par at their stated maturity and they're going -- and we're going to continue to create them to par. And then some of our outperformers will mark up more than that.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nGotcha. Very helpful. Thanks again.\n\nCraig Packer -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. We've reached the end of our question-and-answer session. I'd like to turn the floor back over to management for any further or closing comments.\n\nCraig Packer -- Chief Executive Officer\n\nThank you so much, everyone, for joining. This was a really important quarter for us. We put a lot out there in terms of rising dividends, forward guidance, buybacks, and the like. We welcomed calls and follow ups if folks want to talk more about it.\n\nPortfolio's doing really well and we want to make sure we're accessible. And if you have any questions or concerns please do reach out. We'd love to have a chance to chat. And with that, I hope you all have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDana Sclafani -- Head of Investor Relations\n\nCraig Packer -- Chief Executive Officer\n\nJonathan Lamm -- Chief Financial Officer and Chief Operating Officer\n\nMickey Schleien -- Ladenburg Thalmann and Company -- Analyst\n\nRobert Dodd -- Raymond James -- Analyst\n\nRyan Lynch -- Keefe, Bruyette and Woods -- Analyst\n\nKevin Fultz -- JMP Securities -- Analyst\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nMore ORCC analysis\n\nAll earnings call transcripts"
}