{
  "companyName": "Airbnb, Inc.",
  "companyTicker": "ABNB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/airbnb-inc-abnb-q3-2022-earnings-call-transcript/",
  "content": "Airbnb, Inc. (ABNB 0.32%)\nQ3 2022 Earnings Call\nNov 01, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and thank you for joining Airbnb's earnings conference call for the third quarter of 2022. As a reminder, this conference call is being recorded and will be available for replay from the investor relations section of Airbnb's website following this call. I will now hand the call over to Ellie Mertz, VP of finance. Please go ahead.\n\nEllie Mertz -- Vice President of Finance\n\nGood afternoon, and welcome to Airbnb's third quarter of 2022 earnings call. Thank you for joining us today. On the call today, we have Airbnb's co-founder and CEO, Brian Chesky; and our chief financial officer, Dave Stephenson. Earlier today, we issued a shareholder letter with our financial results and commentary for our third quarter of 2022.\n\nThese items were also posted on the investor relations section of Airbnb's website. During the call, we'll make brief opening remarks and then spend the remainder of time on Q&A. Before I turn it over to Brian, I would like to remind everyone that we will be making forward-looking statements on this call that involve a number of risks and uncertainties. Actual results may differ materially, expressed or implied, in the forward-looking statements due to a variety of factors.\n\nThese factors are described under forward-looking statements in our shareholder letter and in our most recent filings with the Securities and Exchange Commission. We urge you to consider these factors and remind you that we undertake no obligation to update the information contained on this call to reflect subsequent events or circumstances. You should be aware that these statements should be considered estimates only and are not a guarantee of future performance. Also during this call, we will discuss some non-GAAP financial measures.\n\nWe provided reconciliations to the most directly comparable GAAP financial measures in the shareholder letter posted to our investor relations website. These non-GAAP measures are not intended to be a substitute for our GAAP results. With that, I will pass the call to Brian.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nAll right. Well, thank you, Ellie, and good afternoon, everyone. Thanks for joining. Q3 was another record quarter despite macroeconomic headwinds.\n\nWe had nearly 100 million Nights and Experiences Booked, which is up 25% year over year; gross booking value was $15.6 billion, this is up 31% year over year; revenue grew 29% year over year to $2.9 billion, our highest ever; and when you exclude foreign exchange, our revenue increased 36% year over year. Now we also had our most profitable quarter ever. Net income was $1.2 billion. And this is up $400 million from a year ago.\n\nNow this represents a 42% net income margin. Adjusted EBITDA was $1.5 billion, also our highest ever. And we generated $960 million of free cash flow. In fact, over the last 12 months, we generated $3.3 billion in free cash flow.\n\nWhat our Q3 results demonstrate is that Airbnb continues to drive growth and profitability at scale. And even with the macroeconomic uncertainties, we believe that we're well-positioned for the road ahead. Now why is this? Well, new use cases such as long-term stays and nonurban travel are here to stay. And this is because millions of people now have the flexibility that they didn't have before the pandemic.\n\nAt the same time, we've seen recovery in urban and cross-border travel, two of our strongest segments before the pandemic. And just like during the Great Recession in 2008, when Airbnb started, people today are especially interested in earning extra income through hosting. Now during the quarter, we saw a number of positive business trends. First, guest demand on Airbnb remains strong.\n\nGlobally, we exceeded 90 million guest arrivals during the quarter, and this is another record. Now even with macroeconomic headwinds, Nights and Experiences Booked increased 25%. And during the quarter, we also continued to see longer lead times, supporting a stronger backlog for Q4. Second, guests are increasingly returning to cities and crossing borders.\n\nBoth segments continue to accelerate. Cross-border gross nights booked increased 58% compared to a year ago. High-density urban nights booked grew 27%. And now even as these two segments return, demand for domestic and nonurban travel remains strong.\n\nThird, guests continue to stay longer on Airbnb. Over the last year, we've seen many companies require their employees to return to the office. And at the same time, long-term stay remain 20% of our total gross nights booked on Airbnb. And finally, fourth, our host community continues to grow.\n\nWe believe there are several factors that are driving this growth. The first reason is demand drives supply. For instance, in Q3, as guests were returning to cities, we saw urban supply accelerate. Second, since Airbnb in 2008, hosts have consistently turned to Airbnb to earn extra income.\n\nIn fact, since 2008, hosts on Airbnb have earned $180 billion in our platform. Third, over last year, we made several product improvements to help onboard and support our hosts. But we're not stopping there. On November 16, we're going to introduce an all-new super easy way for millions of people to turn -- to Airbnb their homes as part of our winter release.\n\nWe're also delivering a major upgrade to AirCover that provides even more top to bottom protection for every host. Now with these upgrades and more, we aim to unlock the next generation of hosts and improve the experience for more than 4 million people that are already hosting. So just to recap, we had a record Q3, Nights and Experiences Booked were our highest Q3 ever, revenue and adjusted EBITDA were record high, free cash flow was $950 million. And in the last 12 months, we generated $3.3 billion in free cash flow.\n\nSo with that, Dave and I look forward to answer your questions.\n\nOperator\n\nThank you. [Operator instructions] And we'll take our first question from Lloyd Walmsley at UBS.\n\nLloyd Walmsley -- UBS -- Analyst\n\nThanks. Two, if I can. First, just the classic kind of macro question. Anything you guys are seeing globally, any pockets where you're seeing weaker trends in bookings or ADRs that would be kind of early warning sign that you'd flag heading into next year? And then second one, you guys have talked a little bit about starting to invest again in experiences.\n\nI guess if we step back, how should we think about the cost growth outlook heading into 2023? And are you -- is there anything you're doing in light of just questions around macro to kind of keep a lid on costs heading into next year? Thanks.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nAll right. Thanks, Lloyd. Dave, why don't I answer these and then you can go at a high level and you can go specifically into the booking side of the question. But Lloyd, what I'm going to do is I'll answer it at a little more of a high level.\n\nSo one of the things that we've seen is despite a lot of consumers pulling back on spending, the one area that I haven't seen them pull back on as much is travel. And in particular, like travel, where you can go and see your friends, see your family, more inspirational type of travel. In other words, meaningful travel, not just mass travel. And I think the reason why is just because many people are now working from home, the mall is now Amazon; the movie theater is now Netflix, people still want to get out of the house.\n\nThey still want to have memories. They still want to have meaningful experiences. And I think that's why they continue to turn to Airbnb. And so just like people continue to travel this quarter, we expect really strong demand for Airbnb next year.\n\nAnd again, the new use cases are sticking. In other words, a fifth of our nights booked are for longer than a month and half of our nice booked are longer than a week. And this has basically been a boon because of the flexibility that people have and being able to essentially work from home or have a hybrid work lifestyle. At the same time, our urban and cross-border businesses are incredibly strong because of the value that we provide.\n\nAnd we think that value and having great deals is going to be a key driver as the economy slows down. On the supply side, I just would remind everyone that we started Airbnb in 2008 during the Great Recession. And at that time, many people were turning to Airbnb to earn extra income. And so we think this will be also a great time for millions of people to consider hosting, which is why we're focused on this on November 16.\n\nSo we're feeling really positive about the path forward. With regards to experiences, to answer your question very simply, the great thing about experience is we don't have to have very much incremental investments to make this work. It's really just a matter of incorporating experiences more into our existing marketing and incorporating experiences more into our existing products. So I don't think you'll see that in the P&L from a cost perspective next year at all.\n\nDave, feel free to take -- anything else you want to add.\n\nDave Stephenson -- Chief Financial Officer\n\nYeah. I'll just double click a few areas. We're just doing incredibly well despite the macroeconomic environment. We saw continued strength in Q3.\n\nThe Q3 nights experiences grew 25% year over year, and our revenue grew 29% year over year. And as we stated, it's actually 36% growth year over year, excluding the impact of foreign exchange. And what we're seeing in Q4 is not seeing any overall changes in booking behaviors in our guests. Four weeks in this quarter, we're seeing really strong promising trends in cross-border, renewed interest in urban stays, stabilizing cancellations and just strong future bookings.\n\nAnd that, we included in our guidance here. Our guidance for Q4, we're anticipating revenue growth between 17% and 23%. And that's 23% to 29%, excluding the impact of foreign exchange. And maybe I'll just take a minute to double click here because one of the things we're seeing is the difference in the behavior that we had last year.\n\nIf you actually go back to 2019 historic rates, we're actually seeing stable to increasing demand for bookings here from Q3 into Q4. The decel that we see from Q3 into Q4 is really a hard comp on Q4 last year where we had really strong demand after Delta and before Omicron. And so this is really kind of a hard year-over-year comp. If you go back and compare back to 2019, we're seeing stable to increasing demand across the globe.\n\nAnd actually if any areas to highlight, and you see it in our letter, is that APAC had some of the stronger growth, 65% growth in APAC. And excluding China, APAC is now kind of above 2019 level. So that's been kind of the last major region to kind of return to 2019.\n\nLloyd Walmsley -- UBS -- Analyst\n\nOK. Thank you.\n\nOperator\n\nWe'll move next to Naved Khan at Truist Securities.\n\nNaved Khan -- Truist Securities -- Analyst\n\nYeah. Thanks a lot. Is there anything worth calling out in terms of incremental demand for European sales from travelers outside of Europe, given the decline in the currencies in that area? And then the other question I had is just on advertising. Can you share anything in terms of ROI on the advertising dollars? And are you seeing more opportunities to deploy these more broadly?\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah, Naved. Why don't, Dave, you take these? I can round up the answers.\n\nDave Stephenson -- Chief Financial Officer\n\nSure. In terms of European demand, we are seeing strong European demand from places like the U.S., where the dollar is stronger than the euro. It's not a material part of the business, so it's hard to see it impact the overall materiality given just the size of our business being in 220 countries and regions around the world. And conversely, the European travel is going to be maybe less likely to come, say, to the U.S.\n\nwhere the U.S. dollar is so strong. So there's some offset in there. Overall, the impact of foreign exchange isn't as large on the business because of the regional impacts.\n\nMore people kind of travel either domestically or within their own regions. And then in terms of advertising ROI, we're really pleased with our approach to the marketing strategy that we've had. Our brand marketing results are delivering excellent results overall with a strong rate of return. And it's been so successful that we're actually expanding to more countries.\n\nAnd so that's what still be seeing over the course of the next year, is to expand more countries to support our brand advertising.\n\nNaved Khan -- Truist Securities -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe'll go next to Nick Jones at JMP Securities.\n\nNick Jones -- JMP Securities -- Analyst\n\nGreat. Thanks for taking the questions. I guess first, I guess when we look at kind of U.S. to international travel, is the strength in U.S.\n\ndollar maybe helping drive more interest in going overseas? And then the second question on durability of kind of ADRs. Is elevated home prices maybe making hosts less likely to lower the rate at which they're willing to take kind of from here? I mean, are these going to be maybe more durable than we think? Thanks.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nDave, why don't you take the first question? I can take the second.\n\nDave Stephenson -- Chief Financial Officer\n\nYeah. Again, as I just said, on the U.S. International, we clearly do have a strong U.S. dollar, which enables Americans to travel abroad quite well, and we're seeing nice strength there.\n\nBut again, that part of the business is not so large as to have a material impact on the overall business because you also have some of the offsets of weaker currencies, not necessarily travel in the U.S. Again, more of the travel is domestic and intra-regional, that's what's really going to kind of drive things and more of the foreign exchange issues are not as pronounced within the given region.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nAnd I think just regarding elevated home prices and what that does to average daily rate on Airbnb, I mean just to zoom out, people come to Airbnb because they can find a great value. And you can often get significantly more for your money than a hotel room. You can often get an entire home with a lot of amenities. And continuing to deliver value is going to be really important for the next travel season.\n\nAnd that means that we need to make sure we have really competitive prices. And that means that we need to give tools for host, more tools for them to be able to better price their listings. So one of the things we're doing is we're going to continue to move toward a more all-in pricing, where when you see pricing, instead of seeing more of a nightly rate, you're going to see a little bit more of a fully loaded rate. And then our search ranking is going to prioritize great value and great deal for the fully loaded price.\n\nI think this will really help hosts understand what they're charging and then we're going to give them more tools so they can see and understand what their all-in pricing is for guests and we're going to provide more discount tools and other features to allow host to remain competitive. And if we do all these things, I believe we'll be even more competitive from a pricing standpoint than we are today.\n\nNick Jones -- JMP Securities -- Analyst\n\nGreat. Thanks, Brian.\n\nOperator\n\nWe'll take our next question from Brian Fitzgerald at Wells Fargo.\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nThanks, guys. I think you'll have more to say about supply with the upcoming winter release, but just wondering if you could talk about what you see as continuing pain points for hosts. Brian, maybe just talk to that a little bit. And maybe also structural drivers around supply like local regulations and zoning.\n\nThanks.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah, yeah. Yeah, so let me dive into this because this is a pretty important topic. Just to zoom out, we have a global network where demand drives supply. And that means that where we see our highest growth of bookings is also typically where we see our highest growth of supply.\n\nAnd just to give you an example, this past quarter, approximately 35% of our new available hosts had started as guests. So this is a really strong network where guests become host, and hosts, as they get more bookings, they tend to tell their friends about it, and then we get more supply that way. And so this is, I think, one of the things that's really, really important. But beyond that, obviously, we want to be very aggressive about recruiting more host to Airbnb because this is a great time.\n\nAnd because of the softening economy, we think increasingly now more than ever before, people are interested in putting their homes on Airbnb to make supplemental income. So to answer your question, what are the pain points? I would highlight too, as we've talked to people that are considering hosting, they've told us two things. The first thing they said is that they want it to be easier to get started. They need help getting started, becoming a host.\n\nThe second thing is they're a little nervous about having strangers in their house. And so we have tackled both of these. On November 16, as part of our winter release, number one, we're going to unveil an all new super easy way for millions of people to put their home on Airbnb. I'm pretty excited about this.\n\nWe've been working on this for quite a while. Second, to make people feel comfortable about having other people in their home, which will unlock a lot more everyday people putting their real homes on Airbnb, we are going to be providing some huge upgrades and improvements to AirCover for hosts. If we do these two things, I think we're going to help unlock significantly greater amounts of supply, which is already on top of the momentum that we have and we've seen in Q3. Maybe the final thing I'll just say is in addition to adding more supply in Airbnb, the Holy Grail is pointing demand to where we have supply because I know night globally on Airbnb, are we ever close to 100% occupied.\n\nIt's just a matter of pointing demand to where we have supply. And this is the whole theory around Airbnb Category, that instead of hoping people type in the place you have available supply in the search box, you can then come and have more of a browse experience where we highlight homes that are available. So this is our holistic strategy. As far as pain points as far as like from a regulatory standpoint, I mean, one of the things we've seen is a redistribution away from very large cities kind of to everywhere.\n\nAnd a lot of cities and a lot of local communities have been actually reaching out to us because they can see the economic opportunity we provide. So we're working really, really closely with these markets, but we're feeling very optimistic about our supply for 2023.\n\nDave Stephenson -- Chief Financial Officer\n\nJust to double click on a couple of Brian's points because I think it's really important. Because of these partnerships that we've had with local governments, especially on tax collection, we've delivered more than $6 billion in tourism-related taxes to local governments. I mean this is a material amount of money. And collecting -- remitting taxes, we do it in over 30,000 jurisdictions around the globe.\n\nAnd I think in terms of like zoning regulations, we believe that the reasonable regulation actually normalizes hosting. And when you normalize hosting, it can really be a foundation for future growth. So we actually think that you do this in a reasonable way, and it will actually be a tailwind to growth in the future.\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nGot it. Thanks, guys.\n\nOperator\n\nNext, we'll move to Brian Nowak at Morgan Stanley.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nThanks for taking my questions. I have two. The first one is just to maybe try to cut the business a little bit different way, what can you tell us about sort of your growth in active bookers or active stairs versus spend per booker that's sort of driving the business right now? And how have those cohorts that came in during COVID, how have they aged versus COVID which is cohorts you had prior to COVID. And then the second one, Brian, you made so many improvements to the platform over the years from unflexible and trying to load balance supply and demand, etc.\n\nWhat can you tell us about the conversion of traffic now versus where it was, say, in 2019?\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nAll right. Awesome. Yeah, Dave, do you want to take the first question?\n\nDave Stephenson -- Chief Financial Officer\n\nYeah, in terms of the active bookers, I think you kind of step back and look at the marketing approach that we've had since pre-COVID and that we really has accelerated in COVID in a sense has been to continue to focus on the overall brand of Airbnb and to be less reliant on search engine marketing. We've been incredibly effective at that 90% of our traffic remains direct or unpaid which is driving a great return on investment for kind of new active bookers. And so I think the return that we're getting on new has been quite good. And in terms of the cohorts of new, we're actually seeing that the cohorts that are coming in since COVID are actually as strong, if not even stronger than they were in prior to COVID.\n\nThe people that are willing to kind of travel right now and experience Airbnb have -- are really sticky, and the cohorts are as strong if not stronger than we saw previously.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nSorry, I just want to answer about conversion of traffic for unflexible. So yes, at a high level, conversion on a year-over-year basis is up. But I would actually generally say, Brian, that we actually think about it even more broadly. When we launched Airbnb Categories, for example, one of the goals was not just increased conversion, but was actually to increase traffic.\n\nAnd there's a scenario where you can increase traffic, initially conversion can go down because you are a little bit more in the inspiration business. And there were people who are coming and they're dreaming and planning travel. So you really want to look at conversion over a longer period of time. But we have actually seen metronomic improvements in our conversion rate.\n\nBut stays -- listings in Airbnb Categories since we launched on May 11 have been viewed more than 300 million times and with homes they would have never otherwise have known existed. So we're really excited about the progress we're making between Airbnb categories, which is really bringing a lot more traffic to Airbnb, pointing demand where we have supply, bringing us top of funnel. AirCover for guests, which is making people feel more assured about their experience and allowing a more consistent form of reliability. I think that we're going to continue to see a step change in improvement in the product from a guest experience.\n\nAnd this, of course, will continue to lead to greater conversion.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nGreat. Thank you, both.\n\nOperator\n\nWe'll go next to Doug Anmuth of J.P. Morgan.\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nThanks for taking the question. I have two. First, Brian, I know you talked about strong growth in new hosts, and a lot of them seeing new income opportunities. But within that, is the macro environment and interest rates, is that putting any pressure on second homes in your view? And then secondly, if you could talk a little bit about the early returns on the spring update categories.\n\nIs there anything you can add just around conversion rates or what you might be seeing in incremental bookings? Thanks.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah, Doug, I mean, I'll let Dave fill in, in more detail. But at the highest level, I think it's actually pretty simple. In -- as the economy slows down, I think people are looking for more ways to make either supplemental income or like greater yield on the assets they have. And so we generally see a slow in the economy as a moment when more and more people are going to be presumably turning to Airbnb for hosting.\n\nAnd so whether it's second homes or primary homes, I think there's going to be a pretty big opportunity for us. And we just want to make sure that we provide great tools for people so they continue to list on Airbnb. As far as some of the metrics we've seen, again, as I said, conversion has steadily picked up. Homes and Airbnb experiences have been viewed more than 300 million times.\n\nWe're seeing us continue to spread out bookings to more and more markets, which is a bit of the holy grail, to point demand where we have supply. With AirCover for guests, which is another very important upgrade that we made, because this is -- AirCover for guests really addresses a bit of the Achilles' heel of Airbnb, which is on the one hand, we have this incredible one-of-a-kind home. Other hand, one of a kind can be variable in consistency. And so what we've seen with AirCover is we provide protection in the unlikely event that a host cancels or you get to a home and it's not as described.\n\nAnd we've seen, since we've launched AirCover for guests, NPS is up and probably even more importantly, rebooking rates when a guest is dissatisfied, is also up. And so if we can do these two things: on the front end, continue to be more in the inspiration business, point demand where we have supply. On the back end, make sure that Airbnbs are meeting your expectations. And in the rare event that they don't, we make it right, then these are going to continue to unlock significantly greater growth for us in the year ahead.\n\nDave Stephenson -- Chief Financial Officer\n\nJust to double quick on the strong -- the second home impact question. If you go back and think about the 4 million hosts that we have, we have a very different business than many others. So 90% of those hosts are individual hosts. They're the people that own a first -- a primary home or maybe a secondary home.\n\nAnd a big strength of our business, we saw this in COVID, is that people, even during an economic kind of shock period, they don't get rid of their primary home. They don't get necessarily rid of their secondary home, which is very different than professional hosts that maybe are doing an arbitrage of exact cost of ownership and return on the investment they can get on that specific property versus other alternatives. And so I think that this helps buffer any of those kind of impacts on our businesses, that individual host community.\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nThank you.\n\nOperator\n\nWe'll go next to Justin Post at Bank of America.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. One quick one. When you say ADRs could face some pressure.\n\nIs that quarter over quarter or year over year in Q4? And then much bigger picture, solid bookings for 31% growth. Guidance probably implies well over 20 in Q4. How do we think about the backlog for '23 on revenues or associate that with potential revenue growth next year? Thank you.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nAll right, Dave, I think you can take this one.\n\nDave Stephenson -- Chief Financial Officer\n\nSure. On the year over year for Q4 -- the Q4 pressure ADR is year over year. In terms of the backlog for '23, it's a little early to tell, but really, what we're seeing is continued strong demand for travel overall. Like I said, when you look back to historic levels of growth back to 2019, we're seeing stable to increasing demand.\n\nWe have strong bookings on the books for Q4, but then there will be fewer on the books yet for it kind of tails off into 2023. So it's a little early to say. But we're seeing no hints of a decline in people's demand and willingness to travel. It's just a little early to extrapolate much further.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe'll move next to Mario Lu at Barclays.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thanks for taking the questions. First one is for Brian. You mentioned earlier this one that redesigning pricing and better transparency is a top priority for you.\n\nHow much of an uplift could this be to conversion potentially? And what changes should we expect to see?\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah. Hey, Mario. Yeah. Just to give a little more context to those listening about pricing.\n\nRight now, we have pricing that is primarily displayed on a nightly rate. Hosts can then choose to add a cleaning fee, and then Airbnb adds service fees. And one of the things that we've been hearing from guests, and we heard it loud and clear, is that people would like a little more transparency about what they're actually paying when they first get to Airbnb. And so we are working on redesigning how pricing works on Airbnb, so people better understand the total price they're going to pay the moment they arrive at Airbnb, and it's not a surprise to them.\n\nSo I think the north star for us on this matter is transparency. I think the benefit of this is going to be -- we also want to make it easier for a host to understand what they're charging. And sometimes, hosts tell us that they're not aware of what guests are paying because as you know, we add a guest service fee on top of the price that the hosts charge. And occasionally, hosts that they are charging more than they intended to.\n\nAnd so we are updating some of the tools to make it easier for hosts to understand what they're charging, and this will allow them to be more competitive. In addition to that, we're going to be updating our search ranking algorithm. We've been making some refinements to prioritize home that offer a better value. And of course, when a guest checks out, they leave a five-star rating.\n\nOne of the questions we ask is on a scale of one to five, how good of a value was this, and homes that offer a great value are going to be prioritized higher in search results. And in addition to that, we're going to continue to develop new discounting tools, discounting tools like seasonal discounts, weekly discounts, peak season discounts and really tools to make hosts more competitive. If we do all this, I do believe the prices will get even more competitive. And one of the things we know is obviously as the prices get more competitive, conversion rate goes up, and as conversion rate goes up, bookings go up.\n\nAnd just the final thing to say is we'll have some updates on this soon. I'll be in making some announcements soon.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thanks, Brian. And just one on the operational take rate. I believe it's still above 14% and has not changed much over the past few years.\n\nSo firstly, one, is that correct? And if so, what are your thoughts on adjusting up or down in the future to drive demand?\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah, it's a great question, Mario. I'll start and Dave, you can feel free to jump in. We do not have an intention to increase take rate. I mean this is a company that, obviously, in the last quarter, did more than $1 billion in net income, nearly $1 billion of free cash flow.\n\nSo I think there's a lot of levers to increase monetization on Airbnb, but I don't think we have to increase take rate to do that. In other words, there's opportunities like to allow additional services to host that we could charge for, and we think they pay for that we can do. So there's a lot of ways to increase the take rate on Airbnb. There are going to be some areas where we can probably optimize and improve take rates and potentially lower a little bit like on long-term space.\n\nIf you're booking a place for two, three, four months, we think conversion rate might go up if we were to lower the take rate a little bit. But I don't think this would cut into our current business. I think that might actually keep more bookings on the platform. So we are going to continue to look at some optimization, but we think that we provide a great value.\n\nAnd I think if we make some of these pricing and discount changes in the coming future, I think the value on Airbnb will get even better. We're going to remain disciplined on our expenses. And there's a lot of monetization opportunities going forward. But our general view is if we're going to charge more, we should provide more.\n\nThat's our North Star.\n\nOperator\n\n[Operator instructions] We'll go next to Bernie McTernan at Needham & Company.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. Thank you for taking the question. I realize that you guys are saying you're not seeing any negative impact yet from the macro on the consumer. But as you think about different scenarios playing out and the potential impact of a recessionary environment, is there any cohort or demographic data that you see from your consumers that makes you think Airbnb could be more resilient than broader travel?\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nI mean I could answer that high level, and Dave, you can go in. I mean it's a very great question. One of the things we noticed during the pandemic -- one of the lessons of the pandemic is I think Airbnb is the most adaptable business model in all of travel. And the reason why is we're not just a European business, we're not just a North American business.\n\nWe are a truly global business. We're in 100,000 cities all over the world. We're not just a vacation rental business. We're also an urban business, also a cross-border business.\n\nWe're not just a family business. We're also popular with millennials, Gen Z and retirees at nearly every type of price point. So I think that however travel demand changes, we'll be able to adapt. And that's one of the great things about our model.\n\nIt's a global network, guests become hosts. Most hosts are regular people that tell their friends about Airbnb, which is why when a market occupancy increases, it tends in itself create more supply. So these are some of the reasons why we feel very, very excited about our ability to continue to adapt given this challenging macroeconomic environment. Dave, I don't know if you want to add anything to it?\n\nDave Stephenson -- Chief Financial Officer\n\nYeah, I'll just double click. I mean, it's just a great value that we provide, right, that can people can pick anything from -- from budget to luxe. And if a person has a certain kind of budget constraint, they can choose to maybe get a slightly smaller place or place with fewer amenities, maybe they're go further out, like they can adjust the type of home they want based on their budget. And I think Airbnb has such a diversity of offerings that that enables them to do it uniquely with us, which is very different than the flexibility they might have in hotels.\n\nOperator\n\nWe'll move next to James Lee at Mizuho.\n\nJames Lee -- Mizuho Securities -- Analyst\n\nGreat. Thanks for taking my questions. And when we spoke with hoteliers in general, I think they're planning to keep the ADRs high and with reduced staffing levels. So just curious what you're thinking, does that present an opportunity for you to price your product more dynamically to demand and gain share? And also considering -- are you also considering a price structure change charging guest fees given the tighter consumer budget? Thanks.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah, James. Yes, I think that as we give more tools to host to be able to dynamically price, they can be more competitive. And as they are more competitive, then we will continue to gain more share. So anything that allows greater value allows for more share.\n\nWe don't -- we're not -- other than changing how pricing will be displayed to make it more transparent, intuitive and to continue to offer better value, we're not actually looking at a fundamental change to our pricing structure.\n\nOperator\n\nWe'll move next to Richard Clarke at Bernstein.\n\nRichard Clarke -- Bernstein -- Analyst\n\nHi. Thanks for taking my questions. Just wondering, based on the commentary you're seeing urban coming back, how normal are we in that mix at the moment? And can you possibly quantify what the ADR headwind might be as urban continues to come back? And then maybe just the same question regionally, you're more skewed to the North American market than you were pre COVID. Is that because those use cases are a bigger factor in North America? Or do you expect further changes in the geographical mix over time as well?\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah, Dave. Do you want to take this one?\n\nDave Stephenson -- Chief Financial Officer\n\nSure. In terms of like urban coming back, it just continues to be a higher and higher percentage of our overall mix. It's not quite back to where it was in 2019, and it may never quite be because we see such great strength in our nonurban. But urban is strengthening each quarter, and so that's the trend that we're seeing on the urban side.\n\nAnd I think it's actually similar on the cross-border international side. We're not back to where we were in kind of 2019 level. Gross nights were like 48%, were cross-border back in 2019. And what we've just seen is a cross-border continues to be a greater, greater percentage every quarter, but we're not quite back to where we were in 2019.\n\nOperator\n\nWe'll move next to Mark Mahaney at Evercore ISI.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thanks. Let's see. David, could I ask you just the over-earning question.\n\nThat the free cash flow margins are truly very impressive. Just you really see them, you've been at 40% plus or roughly for the last three quarters on a trailing 12-month basis. What would cause those margins to go materially higher or lower from here? Or is there a reason to think that they're roughly sustainable? And then can I just ask about categories? I know somebody asked about this earlier. But Brian, these features can sometimes take quite a long time to kind of get broadly used and adopted and they can have a major impact.\n\nAnd I think this is one of those that could. How long do you think it's going to take for Categories to be kind of widely adopted used and really start impacting and helping people better match up that supply -- all the supply you have with the demand that's out there. Thanks.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nAll right. So we have two questions. I think, Dave, you can take the first one, and then I'll take Categories.\n\nDave Stephenson -- Chief Financial Officer\n\nExcellent. So yeah, the free cash flow, I'm really proud of our delivery of the free cash flow and the free cash flow margin. So thanks for calling it out. I mean we've just made substantial improvement in the overall profitability of our business, right? We've radically adjusted our marketing expenditures to be substantially lower.\n\nWe've made metronomic improvement in our variable costs. We're seeing great leverage in our fixed costs. We're being incredibly disciplined in our fixed cost growth, and that will continue going forward. And so all of those will be tailwinds to being able to maintain or even increase our free cash flow margins over time.\n\nAs average daily rates could moderate next year, that does put a little bit of a headwind toward our margins. But I think the improvements in our variable costs and the fixed cost leverage should enable us to maintain or even increase free cash flow margins over the longer term. What we'll continue to have is greater expansion in free cash flow margin. Some of the things that Brian talked about a little bit ago would be kind of incremental services or activities that we add for guests or hosts over time.\n\nAnd there's no immediate announcements of major changes that you should anticipate in '23, but know that that is a focus for us, and over a more extended period, will drive incremental revenue for us and incremental margin.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYes. And to answer your other question about the kind of timing for wide adoption of Airbnb categories, it's a great question. I think just to kind of zoom out, customers of travel have been, as you know, trained over the last 25 years to search a certain way. And that way is to go to a website, there's a search box, you type in where you want to go and you search.\n\nAnd then what you get is a list of results. You refine the results, you compare sometimes the different websites, different apps and then you make a booking. And I think this is going to be a multiyear transition to retrain kind of customers about how they can search for travel on Airbnb. But I think we're going to start to see some really great momentum next year.\n\nAgain, we're already seeing people discover homes they never knew existed. We're seeing a lot more people engage with categories. The homes and categories have been viewed more than 300 million times, we're going to continue to be making improvements to this every single year. We have some upgrades coming out in two weeks in November.\n\nAnd of course, you're going to see some upgrades beyond that as well. So I think this is a really great opportunity for us. And again, because we're a little more concentrated in vacation travel, the business travel, and because people are increasingly more flexible when they travel, we think they're going to be much more open to ideas from Airbnb. And part of this is idea of me becoming more at the top of the funnel.\n\nThe way the travel funnel used to be, if you go to one website to figure out where to travel, these are typically travel content sites. Then you go to the next site, typically to book your flight, and then the third thing you do is get your hotel or get your housing. So Airbnb was kind of step three. And we'd like Airbnb to go from kind of step three to step one.\n\nThis is going to take some retraining for everything to go from step three to step one, but I think there's definitely a line of sight to getting there.\n\nOperator\n\nWe'll go next to Stephen Ju at Credit Suisse.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nOK. Thank you. Hi, Brian. So you guys took off you -- you guys took out the China supply but maintained your outbound business.\n\nIt's probably a little bit too early to tell and there probably isn't a lot of outbound happening as of yet. But is there anything we should worry about from a customer acquisition funnel or retention standpoint because the Airbnb use case for, I guess, the Chinese traveler is going to get reduced to, I guess, international only versus what was previously domestic plus international? Thanks.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah, Stephen. I mean the crown jewel of our China business was always, and we thought always was going to be the China outbound business. And the reason why is the take rate was higher for the outbound business than it was for the domestic business. the inventory is more unique.\n\nThere's less competition and the average daily rate is a lot higher. So the outbound business was always the price part of our business, and that's what we're focused on. Now as you know, not a lot of people are leaving the country right now, but we want to be prepared for when they do. And they eventually will, of course.\n\nAnd so the two things we're doing to prepare is, number one, we're going to be continuing to invest in our brand in China. And number two, if people are traveling and they're leaving China, they're going to other countries, and we would call these the corridor countries. And the primary place they're first probably going to go is intra-region. So they're presumably going to be going to Southeast Asia, Korea, Japan, eventually, they'll go a little further to Europe and then they'll presumably come back to the United States, especially maybe the kind of some of the coastal cities.\n\nAnd this is kind of how I think travel may recover. And so what we need to do is make sure we have enough supply in these corridors and continue to invest in our brand in China. And I think by only having an outbound business, we can actually focus all of our investments just on that, and it actually makes a lot more cost effective, a lot more efficient. And one thing I've learned is the more focused we are, the more likely we are to achieve our results.\n\nSo that's what we're feeling. We're actually feeling really confident about the prospects for China. It's just going to be a longer like payoff than -- because of the fact that not a lot of people are leaving the country and traveling right now.\n\nOperator\n\nWe'll go next to Eric Sheridan at Goldman Sachs.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks for taking the question. Maybe a two-parter, if I can, on investment strategy. Obviously, we have a lot of technology companies that are talking about slowing hiring, possibly pruning talent out of their organizations. How do you think that positions you to possibly upgrade talent within the organization, Brian? And how are you thinking about hiring goals over the next sort to 12 to 18 months? And then the second part of the question is, obviously, a slow in the economy would not be like the existential crisis that travel felt in spring of 2020.\n\nBut what's your broader philosophy of investing through a soft patch in the economy or more closely aligning revenue growth with expense growth if you did see a soft patch over a couple of quarters? Thanks so much.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah. Hey, Eric, good to talk to you. Yeah, let me just recap how we think about expense management and investment. Before the pandemic, we were essentially a nearly breakeven business doing like a little under $250 million in loss from an EBITDA perspective.\n\nAnd of course, when the pandemic hit, we lost 80% of our business, and we completely changed our cost structure. And out of that crisis, we made a decision. And the decision we made is we weren't going to wait for another crisis, another weakened economy or a recession to change how we invest or run the company. So we were going to be lean regardless of the economy.\n\nIn other words, we were going to go from the Navy to the Navy Seal, a small, lean, elite group. And so we're a small team, we're functionally organized. We're only slightly more than 6,000 people in the beginning of this year before, obviously, the economy took a turn for the worst, we still only had a plan to hire 7% to 8% more employees. In other words, we had a plan to be really profitable, and we were planning for a storm.\n\nAnd so we have not had to change anything about our hiring plans. We don't intend to change anything about our hiring plans in the next 12 to 18 months regardless of the economy because one of the lessons we've learned is the smaller we are, the more nimble we are, the faster we can move. And not only can we be more profitable, we can actually grow faster. And we've been actually more productive than we ever were in our history.\n\nWe've made more than 150 upgrades in innovation across the core service. So we are still really aggressive about trying to attract the best of our generation to this company, but that doesn't mean hiring a lot of people. We are really embracing being a lean organization, which is partly our functional structure. We're not a business organization where you'd have four marketing departments.\n\nWe have one functional organization, and so that allows us to be quite a bit leaner. And I guess that goes to your other question, which is slowness in the economy. Well, regardless of what happens to the economy, our model is highly adaptable. We have a very low expense base.\n\nAnd we're pretty efficient with marketing. We spent a lot less on marketing than our competitors, and the vast majority of our traffic is direct. So whatever happens to the economy, I think we're in a pretty good position where we won't have to change the way we run the company. But I think we've proven if we ever have to, of course, we will.\n\nBut I don't expect for us to have to make a lot of changes because of how much cash we're generating because of how lean we already are.\n\nDave Stephenson -- Chief Financial Officer\n\nAnd if I double-click on one area is that we announced our Live and Work Anywhere policy this year, and I think that has enabled us to hire the best people in the world regardless of where they live. And so to Brian's point about hiring fewer, more senior, more experts in areas, this has clearly been able to make sure that we're getting the best talent in the world.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah. And maybe the last thing I'll just say is I think that we learned a lot of lessons probably a year or two earlier than a lot of other tech companies because we were hit so hard so early. But I think the adversity, the challenge we had just made us a much more focused, a much better company. And one of the commitments we made is we're never going to forget the lessons from the pandemic.\n\nWe're never going to lose our discipline. Because the more disciplined we are, the more focused we are, not only to become more profitable, but we actually innovate faster. And so those principles are here to stay.\n\nOperator\n\nWe'll move next to Ron Josey at Citi.\n\nRon Josey -- Citi -- Analyst\n\nGreat. Thanks for taking the question. Maybe a bigger picture question first, Brian, and then Dave, one for you on just guidance. Just I think, Brian, you were talking maybe intra-quarter about AirCover being a major franchise going forward.\n\nClearly, we'll hear more about this in the winter release. But just talk to us about how air cover might expand longer term. We clearly see it for guests, for hosts. We know we'll have more updates here in the next week or two.\n\nBut just bigger picture, how you see it as a franchise. And then, Dave, just on guidance, I think in the letter, we mentioned longer lead time for bookings, stronger backlog for 4Q. Just trying to understand how that might compare to where we were maybe in prior periods at the same time. Thank you.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nAll right. I'll take the first one, Ron. So yes, questions around kind of the longer-term strategy around AirCover. And maybe the way to explain AirCover, let's just take -- as an analogy, let's take Amazon.\n\nSo my recollection of Amazon, this will go back maybe 20 years, is 20 years ago, Amazon, even back then, their core retail business was an amazing product. They had the most amount of selection on the Internet, and they have the lowest prices. But the problem with Amazon is they had an Achilles' heel. And the Achilles' feel was they were competing with walking in a store and taking something out at that moment.\n\nAnd so one of the things they created was Amazon Prime, which was obviously addressing the core Achilles' heel, which was shipping. I think every business has to understand what its potential weakness is. I think the great thing about Airbnb's model is we similarly have probably the widest selection of accommodations, and everything we have is truly one of a kind at a great value. But our challenge is, unlike a hotel, we don't control the inventory, and it cannot structurally always be as consistent.\n\nWe can't expect every property. So AirCover similar for consistency, addresses something similar to what Prime did for Amazon with shipping, which is to say, what if we could take this off the table, this question of consistency. And on the host side, the protections have led to a huge increase in NPS. Our NPS for AirCover for a host is over 60.\n\nAnd this is after something happened to your home. So clearly, this was a huge hit. And it was so popular that we decided to bring it to guests. And I think where this can go is over the coming years, we can offer increasingly more protection, more coverage for more different use cases.\n\nAnd I think the North Star for AirCover is if a listing was -- most of our inventory is only in Airbnb. But let's say a home was on two different websites, Airbnb and another website, we want AirCover to be so compelling that just by having AirCover alone, it'd be reason to go direct and book on Airbnb and not book anywhere else. And we're going to continue to make improvements every single year, and I want AirCover to be the gold standard for customer service for our category. And that's what we're really focused on.\n\nAnd then down the road, there may be opportunities to offer like a paid version of this or some other type of membership program, but that would be down the road, but it's a very popular customer request.\n\nDave Stephenson -- Chief Financial Officer\n\nAnd then in terms of -- to answer the question on guidance, too. On the guidance, articulation of the longer lead times for bookings and just the Q4 bookings that we have already on the books for the rest of this quarter is just to indicate that we have stable to accelerating demand for growth and demand from our guests around the world. It's that we are not seeing a softening in that demand, especially when you look back to historic levels of 2019, that any of the deceleration in revenue growth between Q3 and Q4 is largely due to the uniqueness of the 2021 timing of growth between Delta and Omicron. So I just think it just shows the stability of people wanting to get out of their homes, wanting to travel, regardless of the macroeconomic uncertainties.\n\nOperator\n\nWe'll move now to Deepak Mathivanan at Wolfe Research.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGreat. Thanks for taking the questions. Just a couple of quick ones. So first, there's been a lot of press recently about how occupancies on the platform are down for certain house hosts.\n\nIs it just anecdotal or seasonal, or were there is anything more to it? I mean your 4Q guidance is pretty strong, but just trying to understand how much of this is just kind of noise out there. And then second question, maybe for Brian. Long-term stays is stabilizing near 20% of the mix on the platform, even as sort of your room nights is growing pretty nicely. You've talked about sort of like the flexibility and lifestyle for many people keeping this -- or helping this growth.\n\nBut curious whether there is also like a bigger macro drivers like maybe rental markets being very difficult right now that's helping this trend. Just kind of trying to understand how much you're reaching already into the addressable markets beyond travel currently.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah, I can -- I'll take both, and then Dave can feel free to dive in, especially on the bookings. I mean, I think our -- just to answer your question on whether bookings are down for a hosts, I mean at the macro level, at the high level, they're not down. And I mean, I think the Q3 results speak for themselves. There are anecdotal descriptions of some hosts, bookings are down, some hosts, bookings are up.\n\nAnd this -- there's many possible explanations for this. It's just that travel is continuing to change. One of the other things though is that our search rank algorithm is prioritizing all-in pricing and hosts with the best value. So it's possible -- that might be one possible explanation.\n\nBut again, it's primarily what we've seen is anecdotal. And it really depends -- you really have to take it on a case-by-case basis. But overall, obviously, bookings are up. In fact, it's a record quarter.\n\nNow with regard to long-term stays beyond travel, I mean, Deepak, I would just say that we've only scratched the surface. A fifth of our nights booked are for stays longer than a month, and this is before making some really big fundamental improvement to this product and this category. And I think in the coming years, flexibility is here to stay. I think more people are going to work remotely or in a hybrid way five years from now than they do today.\n\nI think increasingly, fewer people are going to have one-year leases, not to say no one will, but more and more people are going to value the flexibility and want to live in different places. And we think there's a real opportunity. And one of the things we're going to also see over the coming years isn't just that and live in different parts of the United States, but people are going to choose to live for short periods of time abroad in different countries. So we think we're going to start to see more long-term cross-border business, too.\n\nSo there's a lot of opportunities here. And we are going to be making some upgrades to our long-term stay business to tap into this large market. I mean the largest expense that most people have in their life is their housing, it's their housing costs. And we've built many of the tools and features that you would need to provide for a longer-term stay offering already.\n\nBut we're going to continue to make improvements. And as we do, I think we'll continue to take more and more of that market.\n\nOperator\n\nNext, we'll move to Lee Horowitz at Deutsche Bank.\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nGreat. Thanks. So building on the comments earlier about expense growth. Given that your advertising strategy has moved away from, say, purely demand linked performance advertising and more toward longer-dated ROI investments and brand advertising.\n\nHow do you think about actively flexing down your advertising spend in a perhaps a tougher macro environment versus investing into that environment to continue to teach the customers -- retrain the customers about your ever-expanding product set?\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nDave, do you want to start with this?\n\nDave Stephenson -- Chief Financial Officer\n\nSure. I mean if you look at our actual advertising strategy and the amount of money we're spending on it, it's going to be relatively flat from '22 over '21, and you should anticipate similar marketing as a percentage of revenue in '23. And so we can certainly flex it in line with revenue. We'll be kind of mindful of that.\n\nBut we've already kind of hit this new kind of lower overall rate. And what we've actually seen is, to the extent that we're keeping it flat even as we grow, it's because we're actually seeing such success that we're wanting to be able to invest in other countries. Certainly, we can moderate that over time, but we're already so low that I wouldn't anticipate us dropping it dramatically in face of substantial headwinds over growth, but we can flex it with the revenue within a reasonably a few hundred basis points here and there.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nAnd I'll just say -- just to jump in. I mean, we don't really think of marketing as a way to buy customers because, obviously, as we've mentioned, more than 90% of our traffic is correct or organic. And so the main thing is we take a full funnel approach to marketing. And actually the top of the funnel is PR in communication.\n\nAnd we think that's one of the biggest drivers of our traffic is PR. And then brand marketing is actually important. And actually, we think a bit more like product marketing. We want to educate people about our new features.\n\nSo right now, we're advertising and educating people about Airbnb Categories and AirCover. And then we think of performance marketing as more of a way the laser in to balance supply and demand rather than a way purchase a large amount of customers. And that's essentially the way we think about marketing. And this allows for a very efficient, very dynamic approach to marketing that should get more efficient every single year.\n\nOperator\n\nAnd we'll take our final question from Brad Erickson at RBC Capital Markets.\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nHey, thanks. Just had a few follow-ups. First, nights came up just a bit light of where we all had it forecasted. So obviously, that's on us.\n\nBut I guess, in cases where you are maybe seeing a little bit of nights booked softness, are you seeing those hosts make any moves on price? Or are your pricing tools sending any message to those hosts about making moves? Just curious if you look to affect some elasticity in the event of any pockets of softness. And then second, Dave, I know you spoke to this just a minute ago on the backlog, but asked in a different way. Are you basically saying that you're seeing booking windows expand more than prior years here as we start out Q4? Thanks.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nYeah, Brad, I'll take the first question. I think Dave can take the second. Yeah, I mean, what we do see is that many hosts do bring their prices up or down as demand goes up or down. That being said, I think there's opportunities for us to have more dynamic tools and give more visibility that would make prices even more competitive.\n\nTo answer your question, they do, many hosts do adjust their prices, but I think host probably adjust their prices less frequently than hotels. And so in periods of time where prices are generally coming down in the industry, we might be a little bit slower. But as we build more tools to provide more dynamic changes, we'll be -- continue to be more competitive. And I'll let Dave take the next question.\n\nDave Stephenson -- Chief Financial Officer\n\nYeah. Well, a couple of things. One thing is we are not focused on optimizing just night side. I think nights is an important measure, and it's an important driver of kind of overall demand.\n\nBut we could also drive a lot of nights and looking and try to just drive them toward lower rate nights. Like we're trying to drive a balance of making sure that we have nights growth and revenue growth. And revenue growth obviously pays the bills. And so we're seeing strong growth in the business.\n\nI'm very happy with our Q3 results. And on forward guide, like you said, I think we're seeing stable to increasing demand, and we're just really impressed with the resiliency of guests and their willingness to travel and interest in traveling Airbnb. And I guess it goes back to the backlog, too, is that the reason why we kind of highlight is just that people are having confidence in travel. So what we're seeing is that, yes, the booking windows are up year over year.\n\nThere are a little bit -- there's some seasonality in that. So they're actually booking windows a little bit down from Q3. And so as -- the lead times are just up from historical levels because the people are confident in being able to travel. I think that's the important thing you should take away.\n\nOperator\n\nAnd that concludes the question-and-answer session. At this time, I'll turn the conference back over to Brian for any concluding remarks.\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nAll right. Well, first of all, thank you all for joining today. I just want to recap and just say we're incredibly proud of our results, and I believe we're incredibly well-positioned for the future ahead. I hope you all join us in two weeks for 2022 winter release, you'll be able to watch it right from our homepage on Wednesday, this is November 16, 8 a.m.\n\nEastern. Thank you all, and I'll see you then.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEllie Mertz -- Vice President of Finance\n\nBrian Chesky -- Co-Founder and Chief Executive Officer\n\nLloyd Walmsley -- UBS -- Analyst\n\nDave Stephenson -- Chief Financial Officer\n\nNaved Khan -- Truist Securities -- Analyst\n\nNick Jones -- JMP Securities -- Analyst\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nMario Lu -- Barclays -- Analyst\n\nBernie McTernan -- Needham and Company -- Analyst\n\nJames Lee -- Mizuho Securities -- Analyst\n\nRichard Clarke -- Bernstein -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nStephen Ju -- Credit Suisse -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nRon Josey -- Citi -- Analyst\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nMore ABNB analysis\n\nAll earnings call transcripts"
}