{
  "companyName": "Zumiez",
  "companyTicker": "ZUMZ",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/zumiez-zumz-q3-2022-earnings-call-transcript/",
  "content": "Zumiez (ZUMZ -0.46%)\nQ3 2022 Earnings Call\nDec 01, 2022, 5:00 p.m. ET\n\nOperator\n\n[Operator instructions] Good afternoon, ladies and gentlemen, and welcome to the Zumiez Inc. third-quarter fiscal 2022 earnings conference call. At this time, all participants are in a listen-only mode. We will conduct a question-and-answer session toward the end of this conference.\n\nBefore we begin, I'd like to remind everyone of the company's safe harbor language. Today's conference call includes comments concerning Zumiez Inc. business outlook and contains forward-looking statements. These forward-looking statements and all other statements that may be made on this call that are not based on historical facts are subject to risks and uncertainties.\n\nActual results may differ materially. Additional information concerning a number of factors that could cause actual results to differ materially from the information that will be discussed is available in the Zumiez filings with the SEC. At this time, I will turn the call over to Rick Brooks, chief executive officer. Mr.\n\nBrooks?\n\nRick Brooks -- Chief Executive Officer\n\nHello, and thank you, everyone, for joining us on the call. With me today is Chris Work, our chief financial officer. I'll begin today's call with a few remarks about the third quarter before handing the call to Chris, who will take you through our financial results and outlook in more detail. After that, we'll open the call to your questions.\n\nThe economic headwinds we discussed at the end of the second quarter continued to impact our business in the third quarter. Compared to the year-ago period when consumers were flush with record levels of savings due to U.S. stimulus and child tax credit measures, we've seen a dramatic shift in consumer sentiment across the retail landscape. As inflation levels remain elevated, we continue to see a pullback in our consumers' discretionary spending.\n\nThis industrywide softness has led to an increasingly promotional domestic environment, with consumers appearing to trade down to less expensive options. In addition to these challenges, our international concepts are also faced with a major headwind this quarter as they saw their very solid currency-neutral growth completely offset by unfavorable foreign currency movement. These demand and currency dynamics, along with inflation-driven cost and expense pressures, made for a very difficult operating environment compared to the year-ago period. When we spoke to you at the end of the second quarter, we assumed that these difficult trends impacting the broader retail sector will continue to intensify into the third quarter.\n\nWe remain flexible and agile as the quarter progressed, focusing on the areas of the business that we can control to help offset some of the ongoing pressure. While results were down significantly year over year, we were able to deliver sales and EPS results that were better than our most recent outlook provided in early September. Some bright spots during the period included, we exceeded our sales expectations this quarter as the back-to-school season played out slightly better than expected in the U.S. We saw sales growth of 13.8% year over year in our European and Australian markets on a currency-neutral basis.\n\nAnd while negative currency fluctuations masked this on a reported basis, we are pleased to see the continued efforts of our teams operating our international concepts. Product margins decreased only 40 basis points compared to the year-ago period despite an increasingly promotional retail environment and increased mix pressure as our international entities continue to grow in share. Overall expense management was strong with majority of our loss to prior year, driven by the top-line sales decline. Our model continues to be highly sensitive to sales fluctuation, with sales increases showing a large flow-through to the bottom line and a reverse impact during a sales downturn.\n\nInventory was managed well with an overall foreign exchange adjusted increase of only 6.3%, driven primarily by our international entities with larger store growth, while U.S. inventory was up only 1.3%. Earnings per share of $0.36 in the third quarter was higher than our guidance, driven primarily by flow-through on incremental sales. And substantial work was completed on our long-term initiatives, including the opening of 35 new stores since the same time last year, with nearly half of those stores furthering our international expansion.\n\nLooking ahead, we expect continued top- and bottom-line pressure because of the current economic environment and remain cautious in our near-term outlook that Chris will share shortly. While business trajectory is soft in the short term, we remain very confident in the long-term outlook for Zumiez. As a management team, we remain focused on building and positioning the business for long-term sustainable growth. For over 40 years, Zumiez has endured multiple business and fashion cycles, emerging each time a stronger and more profitable company.\n\nFor example, in 2008 and 2009, we saw annual comparable sales down 6.5% and 10%, respectively, only to be followed by comparable sales increases of 11.9%, 8.7%, and 5% over 2010, '11, and '12, respectively. This outcome through one of the most challenging economic periods in recent memory should inspire confidence in the resiliency of our flexible, customer-centric strategy and the strong brand and culture that will position Zumiez well for driving shareholder value once the economic environment becomes more favorable. As we like to say, periods of significant change create opportunities. And companies that have the right people, strategies, and resources in place can take advantage of times like this to advance their brand and their business.\n\nObviously, the operating environment in 2022 has proven to be one of the more difficult periods in our industry. But the original philosophies, goals, and ideals on which we built this business remain the same and will serve us as well today as they did during the last major economic downturn. With that, I'll turn the call to Chris who will discuss the financials. Chris?\n\nChris Work -- Chief Financial Officer\n\nThanks, Rick, and good afternoon, everyone. I'm going to start with a review of our third-quarter results. I'll then provide an update on our fourth quarter-to-date sales trends before providing some perspective on how we're thinking about the remainder of the year. Third-quarter net sales were $237.6 million, down 17.9% from $289.5 million in the third quarter of 2021.\n\nThe year-over-year decrease in sales was primarily driven by the benefits from domestic stimulus in the prior year, as well as increased macroeconomic headwinds as inflation weighted on consumers' discretionary spending during the current year quarter. Growth was also negatively impacted by 200 basis points related to unfavorable changes in foreign currency. From a regional perspective, North America net sales were $206.3 million, a decrease of 19.9% from 2021. Other international net sales, which consists of Europe and Australia, were $31.3 million, down 2.3% from last year.\n\nExcluding the impact of foreign currency translation, North America net sales decreased 19.6% and other international net sales increased 13.8% compared with 2021. From a category perspective, all categories were down in comparable sales from the prior year during the quarter, with men's being our most negative followed by hardgoods, women's, accessories, and footwear. Third-quarter gross profit was $82 million, compared to $114.7 million in the third quarter of last year. Gross margin as a percentage of sales was 34.5% for the quarter, compared to 39.6% in the third quarter of 2021.\n\nThe 510-basis-point decrease in gross margin was primarily due to lower sales in the quarter, driving deleverage in our fixed costs, as well as rate increases in several areas. Store occupancy costs deleveraged by 250 basis points on lower sales volumes. Web shipping costs increased by 100 basis points. Distribution center costs deleveraged by 70 basis points.\n\nBuying and private label costs deleveraged by 40 basis points. Product margins decreased by 40 basis points. And shrink increased by 30 basis points in the quarter. SG&A expense was $71.5 million or 30.1% of net sales in the third quarter, compared to $74.8 million or 25.8% of net sales a year ago.\n\nThe 430-basis-point increase in SG&A expenses as a percent of net sales resulted from the following: 220 basis points in our store wages tied to both deleverage on lower sales, as well as wage rate increases; 120 basis points related to other store operating costs, primarily impacted by lower sales levels; 90 basis points in nonstore wages; and 30 basis points in corporate costs. These increases were partially offset by a 70-basis-point decrease in annual incentive compensation. Operating income in the third quarter of 2022 was $10.4 million or 4.4% of net sales, compared with $39.8 million or 13.8% of net sales last year. Net income for the third quarter was $6.9 million or $0.36 per diluted share.\n\nThis compares to net income of $30.7 million or $1.25 per diluted share for the third quarter of 2021. Our effective tax rate for the third quarter of 2022 was 27.9% compared with 25.5% in the year-ago period. The tax rate in the quarter is inflated due primarily to the allocation of income across entities and the exclusion of net losses in certain jurisdictions. Turning to the balance sheet.\n\nThe business ended the quarter in a strong financial position. We had cash and current marketable securities of $141.1 million as of October 29, 2022, compared to $338.1 million as of October 30, 2021. The $197 million decrease in cash and current marketable securities over the trailing 12 months was driven primarily by share repurchases of $183.1 million, resulting in a reduction of our shares outstanding over the last year of 17.5%. We also had capital expenditures of $24.7 million, partially offset by cash generated through operations of $26.6 million.\n\nAs of October 29, 2022, we had no debt on the balance sheet and continue to maintain our full unused credit facilities. We ended the quarter with $177.2 million in inventory, up 1.2% compared with the $175.1 million last year. On a constant-currency basis, our inventory levels were up 6.3% from last year. Overall, while slightly more aged, our North America inventory is healthy and continues to sell at a favorable margin.\n\nInternationally, our inventory is more current than the same time last year, and we have seen margins improve during the quarter. Total sales for the 31-day -- sorry, now to our fourth quarter-to-date results. Total sales for the 31-day period ended November 29, 2022, decreased 23.9% compared to the same 31-day period in the prior year ended November 30, 2021. Comparable sales for the 31-day period ended November 29, 2022, were down 24.8% from the comparable period in the prior year.\n\nFrom a regional perspective, net sales for our North America business for the 31-day period ended November 29, 2022, decreased 27.7% over the comparable period last year. Meanwhile, our international business decreased 4% versus last year. Excluding the impact of foreign currency translation, North America net sales decreased 27.4% and other international sales increased 7.7% compared with 2021. From a category perspective, all categories were down in comparable sales for the fourth quarter to date.\n\nMen's was our largest negative category, followed by hardgoods, accessories, women's, and footwear. With respect to our outlook, I want to remind everyone that formulating our guidance involves some inherent uncertainty and complexity in estimating sales, product margin, and earnings growth, given the variety of internal and external factors that impact our performance. With that in mind, we are currently expecting the total sales for the fourth quarter of fiscal 2022 will be between $258 million and $265 million. Consolidated operating profit as a percent of sales for the fourth quarter is expected to be between 3.4% and 4.7%.\n\nAnd we anticipate diluted earnings per share will be roughly $0.36 to $0.51. Now, I want to give you a few updated thoughts on how fourth-quarter guidance rolls into our fiscal '22 results. With the first three quarters of 2022 behind us, we remain cautious in how we're looking at the full year given the operating environment and the current headwinds we are facing. Inclusive of the fourth quarter guidance, we anticipate that total sales will be down in the 20% to 21% range in fiscal '22 compared to 2021.\n\nIn fiscal 2021, we achieved peak product margins once again, representing our sixth year in a row of product margin expansion. As we have moved through the first three quarters of the year, we have closely managed inventory and seen only a modest decline in product margin despite inflationary pressures, a promotional environment, and mix pressures between categories and across countries. We continue to believe we will see some product margin erosion in the fourth quarter and are planning the fourth quarter to be down approximately 50 basis points from the prior year in our current guidance. We continue to manage costs across the business.\n\nHowever, with our current sales projections, we are anticipating deleverage across the fixed cost of the business. We currently anticipate that fiscal 2022 operating margin will be between 2.6% and 3% based upon the drop in sales, inflationary cost pressures, and the return to normal for items like mall hours, travel, and training and events. Diluted earnings per share for the full year is currently planned to decrease less than operating profit related to the share repurchase earlier in the year. We currently anticipate 2022 diluted earnings per share to be between $0.85 and $1.\n\nWe are currently planning our business assuming an annual effective tax rate of approximately 33%. We are planning to open approximately 33 new stores during the year, including approximately 16 stores in North America, 13 stores in Europe, and four stores in Australia. And we expect capital expenditures for the full 2022 fiscal year to be between $27 million and $29 million, compared to $16 million in 2021, with most of the increase tied to the addition of stores in 2022. We expect that depreciation and amortization, excluding noncash lease expense, will be approximately $20.8 million, down 3% from the prior year.\n\nAnd we are currently projecting our share count for the full year to be approximately 19.4 million diluted shares. With that, operator, we'd like to open the call up for questions.\n\nOperator\n\nThank you. [Operator instructions] Please stand by while we compile the Q&A roster. And today's first question will come from Sharon Zackfia with William Blair. Please go ahead.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nHey, good afternoon. I guess two questions. You've obviously kind of kept the pedal to the metal here on development. And I know historically, it's definitely paid off to grow during times like now.\n\nBut I wonder, just given the severity of the slowdown that we're seeing, if you're kind of maybe rethinking what you might do in '23 with the potential for rents to even get more favorable if the consumer continues to weaken and the retail environment stays shaky. And then secondarily, I just wanted to kind of ask about the fourth quarter outlook, because I think it does imply kind of a 23% to 26% year-over-year decline. But you do have easier comparisons in December and January than you had in November. I think your sales were like up double digits November last year and then got weaker as the quarter went on as a lot did with omicron.\n\nAre you seeing something that makes you just even more nervous even against those easier comparisons as we go into December and January and, again, kind of counterbalancing that as well with the early holiday sales we saw in October, November last year? I know that was like a 300-part question, and I apologize.\n\nRick Brooks -- Chief Executive Officer\n\nAll right. Thank you, Sharon, for those questions. I'll take the first one and let Chris take the second one. So, your first question, are we rethinking around our growth initiatives for 2023 relative to where the business is at, well, of course, we are.\n\nI think that's a natural aspect of what we're going to do. And of course, 2023, we don't know where '23 is going to end up. We're not prepared to talk about that today. But I think a natural expectation would be that, yes, we'll have these conversations with our board about what our plan is, where the opportunities are and where the most crucial investments are.\n\nNow, I think the good news here, from my perspective, Sharon, is we've been through these cycles many times, and we know how to manage through them. I think we're pretty good at managing through them. There's a -- I think we can talk about why they appear to be so severe for us, particularly relative to sales. But on the bottom line, we're all going to be pretty comparable.\n\nWe're just getting to the bottom line differently because of the nature of our business. We don't have to discount as much on the top line because of the nature of our business relationship with our brand partners. So, yes, we are. We'll rethink those things.\n\nBut I will tell you that there are -- we are committed to pushing forward our long-term initiatives. Our long-term strategies that are about meeting consumer expectations over the long term and where we really believe we have to adapt and evolve our business significantly. And there are a number of critical areas we're going to do that. And a lot of them aren't actually very capital-intensive from that perspective as to how we allocate our resources and deploy some capital relative to technology.\n\nBut there are some critical things we've got to do, I think, in that respect to make sure that when we emerge from this, which we will emerge from this cycle, as we always have from these tougher cycles, we're going to emerge stronger, better and be able to gain more market share. So, I think you'll see us potentially moderate some growth. Again, we're not ready to talk about that today. That is an ongoing discussion with our board.\n\nBut we're going to remain prudent and prudently disciplined about investing in the things we really believe are going to drive the business forward in terms of, again, what we have to do to meet future consumer expectations as we're defining them and as our long-term strategies and initiatives address those expectations.\n\nChris Work -- Chief Financial Officer\n\nSure. And to your second question just around Q4 and the outlook and how we're thinking about the decline in sales and then matching that up against the comparison to what we saw last year, I think where we stand here is when we reported to you after back-to-school, we were a little more optimistic about where Q4 would come out and how the sales trends. And clearly, we believe as a full-price, full-margin retailer, we're seeing more pressure than others, especially as we've been able to generally hold price. So, I think when we look at our consumer and we look at kind of savings rates declining and credit card spending increasing and a real move to value, not to mention the impact of inflation on them in other areas of their life, as well as retail and then just that pressure we've talked about throughout the year for that discretionary dollar, whether it be restaurants, travel or other areas of just cost of living.\n\nSo, I think we put all that together in our thought process, Sharon, in coming up with the sales plan of $258 million and $265 million was really to say let's stay true to this run rate because this was a little below where we thought it would be for November. So, we kind of took this run rate forward, especially pretty much across all of our entities. We assumed a little bit better in Europe. As you may recall, in Europe last year, there were some closures in one of our important markets in Austria that happened right toward the end of November and into October, right up to Christmas pretty much.\n\nSo, we assumed a little bit of run rate there and then really tried to just kind of think that that's what our consumer might be feeling as we move through the quarter. So, that's how we planned the quarter on the sales side.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nOK. Thank you.\n\nRick Brooks -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. One moment for our next question. And that will come from the line of Mitch Kummetz with Seaport. Please go ahead.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nYes. Thanks for taking my questions. I'll just ask them one at a time. I was curious on the comp.\n\nSo, on the quarter-to-date comp, is there any way you can kind of talk about the period of Black Friday through Cyber Monday, if that was any better than what the quarter-to-date is or if it's pretty much in line?\n\nChris Work -- Chief Financial Officer\n\nSure. I'll take that question. And the answer is it's pretty much in line. I think when we looked at the quarter and we've, obviously, as you would expect, sliced and diced this quite a few ways, trying to kind of think through how this is coming together.\n\nI think what's different as we went through the quarter in this Black Friday weekend compared to the same Black Friday weekend last year is we did run product margin gains pretty meaningfully. Last year at this time, we were trying to move through some inventory, and it just had a bigger impact on margins, some of the promotion we had last year. But overall trend line was pretty consistent across the quarter, week to week, and the main difference being how product margin performed over the holiday weekend.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. And then on the quarter-to-date, you guys gave us sales and comp for that period. Do you know what that is on a three-year?\n\nChris Work -- Chief Financial Officer\n\nI don't have it on a three-year off the top of my head.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. Do you know if the full year -- or the full quarter guide assumes kind of a similar three-year for the full quarter versus quarter to date? You probably don't. No, that will be -- OK. A couple of last things.\n\nRick, you talked about the trading down that you're experiencing. Can you just maybe elaborate a little bit more on how you're addressing that? When you think about maybe your mix of product and brands and particularly if there's any sort of trying to elevate the exclusive brand side of your business?\n\nRick Brooks -- Chief Executive Officer\n\nSure, Mitch. I'll be glad to. We are -- what we're seeing in this situation -- I feel on the whole pretty good about our core consumer. And even over the Black Friday weekend, we saw our -- what I consider to be good signs about our core consumer.\n\nWe saw much higher conversion rates and much larger basket sizes. We saw our core consumers staying true to doing business with us. But what we are seeing in reflective, if that is, is the mix of penetration to our private label is significantly -- our private level significantly growing. So, this clearly reflects the way that we can convey value for that core consumer.\n\nAnd it's resonating, it's working, because again, the penetration of private label is up significantly year to date and even higher here in the fourth quarter-to-date period. It's been gaining throughout the year. So, to me, Mitch, that is the way through what we're doing in bundling and price points and two-for deals and all the things we're doing, how we use private label. It does two things.\n\nFirst, it delivers value for our customer. And second, it helps us on the margin side of the business again, because private label drives higher margins on our branded partners. Now, on the branded side, we are reluctant, as you know, Mitch, when we have brands that have equity and have real value that it can sell at full price, we're reluctant to do markdowns because we think it's a disservice to our brand partners. And I tell you, our brand partners feel the same way.\n\nSo, in there, we're trying to be disciplined about how much we buy, how we move through product for our brand partners, how we work with our brand partners in terms of flowing the product to make sure that we're not getting in overstock situation with them. And we -- don't get me wrong, we'll be aggressive if we own too much, and we'll take markdowns and move through the product. But the goal is to manage it and to basically drive markdowns to where we need to liquidate, whether it be seasonal product or, again, these things that haven't worked out is kind of how we're approaching it. But we don't want to destroy brand equity for our brand partners either.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nThat's helpful, Rick. And then maybe one last question. Just on the skate business. I know that's been more difficult over the last probably six quarters or so.\n\nI mean, it kind of rebounded before COVID, and then it accelerated with COVID. And you saw the kind of penetration levels go from, I think it was like 11% in 2018 up to 19% in maybe it was 2021. I'm curious if at this point, maybe like on a trailing basis, is the penetration of hardgoods kind of backed down to levels where was that before kind of the rebound and acceleration? Or is it still above where it was for that period?\n\nRick Brooks -- Chief Executive Officer\n\nYeah. It's a good question, Mitch. And as you saw in Chris' comments, he commented that skate hardgoods were our second largest declining department. And remember that it's a relatively small percent of sales.\n\nSo, that still tells you about -- something about the scale of the diminishing sales in that department on a relatively small mix of our sales and its position as the second largest declining department. So, we haven't hit bottom yet is my message for you is what we're seeing at this point. We're getting down to all-time lows at this point, Mitch. But there's no doubt, as you said, that 2021, the penetration was significantly above our all-time highs for penetration of the skate hardgoods department.\n\nSo, we're definitely giving that back up relative to, as you said, the recovery to start in skate hardgoods in '19 and how -- what the pandemic did to accelerate significantly, I think, pull forward of demand. So, now we're giving it back. And that's just the way our business works, right? Things trend up. Things trend down.\n\nAnd particularly, we've seen that skate cycle many times. I think what we're seeing this time, though, is a massively accelerated cycle. And now we're taking a bit of pain as we fall back to what -- where we're going to bottom out. And we may stay at a bottom for a period of time, so the losses will diminish, and then we'll start to cycle back up at some point.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. All right. Thanks for that update. Yeah, go ahead.\n\nChris Work -- Chief Financial Officer\n\nAnd, Mitch, just to clarify on the growth curve, it was -- 2018 was 10%, 2019 was 13%. And then 2020 was our peak, we got all the way to 19%. I think that's when we really saw outsized skate sales during the closures in the 2020 year. And then last year, it was 15%.\n\nSo, still very, very healthy to where we've been. And the current run rate would be trending at our lowest that we've had for quite some time. So, we are expecting that to continue to decline, as Rick said.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. Thanks for that, and good luck for the holidays.\n\nOperator\n\nThank you. [Operator instructions] And one moment for our next question, that will come from the line of Corey Tarlowe with Jefferies. Please go ahead.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nHi. Good afternoon, and thanks for taking the question. So, maybe if you could just start, could you talk about within margin -- obviously, there's a bunch of puts and takes, but some of those puts and takes might stick throughout -- from the third quarter into the fourth quarter and then perhaps into the next year. And then some of those might go away, right? So, could you maybe talk about what you see sticking versus what you see going away as it relates to the margin headwinds that you've faced this year?\n\nRick Brooks -- Chief Executive Officer\n\nJust so I'm clear, Corey, is that -- you're talking about product margins or gross margins? Or where are we talking about here?\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nI think it would be -- probably be most helpful to get perspective on gross margin with things like freight, commodity cost pressures, etc.\n\nChris Work -- Chief Financial Officer\n\nSure. Well, let me take a crack at it, and then I'll let Rick add in anything that he might want to. I think if you're talking about gross margin, I think that the most important thing is obviously just to start with product margin and just think about where we're at. And as we've said in our prepared remarks, we've run six years of product margin gains through 2021.\n\nSo, we were at all-time highs for us across all of our entities. So, now, as we kind of transition into 2022, what's really interesting is we have seen this sort of push to private-label apparel, right? And actually, over the last six years, at least coming into 2021, we did see private label actually declining. We saw a branded cycle that really drove the last six years of product margin, which is kind of counterintuitive to what you would expect, but it's really just what our customer was looking for and how our buyers were able to work with the brands to build the product margin up. So, I think when I think about kind of what moves forward from here, we -- if we continue to see that private label push, we will have some stickiness in where product margin goes.\n\nThe second piece with product margin that I think is really important to note is all of our international entities, Canada, Europe, and Australia, all performed below the U.S. in product margin. And they are also the bigger growth areas of our business at this point. So, we're seeing margin expansion across those concepts.\n\nI think they're doing a really good job working with brands in each region as they gain scale, being able to push higher levels of margin, and also seeing things like private label increase as a percent of their businesses. So, as we see the international entities grow and drive scale, we hope over time that will also drive product margin and drive it closer to our U.S. margin levels. Now, there will be some mix shifts in the midterm as we see the international sales grow as a percent at a slightly lower margin.\n\nBut overall, we think that can be a benefit over the long term. So, I think you kind of start there. And then as we think down kind of through the other components of gross margin, the next biggest item is occupancy. This is really a story of deleverage.\n\nAs you know, our sales are down and down meaningfully to not only 2021 but even 2019 levels. And so, as we think about that, this is one of the bigger areas of our deleverage. So, our teams have worked extremely hard with our landlord partners and trying to manage this expense and I think done a really good job. But with the sales declines we've had, it still becomes a deleverage item.\n\nSo, as we think longer-term gross margin, this is about growing sales and therefore being able to leverage the fixed cost associated with occupancy. The other big costs, as you pointed out in your question, is shipping and where shipping has been. We have seen increased cost of shipping. We are working very hard on different strategies to minimize that across both the inbound, but probably more importantly on the B2C that falls into gross margin.\n\nAnd I think as we can continue to drive sales and work with our carriers, this is something we can hopefully manage to get more leverage out of that line item as well as we move forward.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGreat. That's very helpful. And then maybe to just double click on inventory, it seems like those are -- that's in a relatively good spot versus kind of where maybe you initially expected. Could you just talk a little bit about that, how you feel that's positioned as we head through the key holiday period for most of the retail here?\n\nChris Work -- Chief Financial Officer\n\nSure. Yeah. I think on the inventory side, we feel good about where our teams are with inventory. We've talked about in our prepared remarks about $177 million in inventory, it's up 1.2% to Q3.\n\nIt's pretty in line with where we actually ended Q2 as well. We were up 1.1% in Q2. Obviously, we're getting a little bit of FX benefit there, but we're down 3.3% to 2019 as well. So, I think if you kind of put all that in perspective, the levels are managed pretty well in regards to what's happening across the retail landscape.\n\nI think entity by entity, North America is slightly more aged but continues to be at a very healthy margin. Our international inventory is in a better spot than where we were a year ago, much more current than last year. And as we mentioned in our remarks, we're seeing margin gains there. I think the important thing with inventory, as we kind of think about how we're managing it and our business strategy here, is really how we're thinking about the business overall because we're doing the work, as you would expect, to kind of line ourselves up with a lot of the retail market.\n\nAnd our strategy is just a little different. I mean, we're really focused on full price, full margin that requires in a cycle like this that you have to be really nimble in how you manage your inventory so that you can be opportunistic in your buys and really see what's working with the customer. So, our teams are really pushing that. And then at the end of the day, I think this is probably part of why our sales may look a little softer than others because we're really holding price.\n\nAnd I think as you kind of line that up, I'm not sure we're a whole lot different on the bottom line than other people, but we just have not seen the product margin declines that we've been reading about across the market. So, I think we -- that's really the strategy of what we're doing. The last piece probably being, just remembering for us in particular how important the screenables business is to our business. Obviously, it's a quicker turn business.\n\nIt's something we can move on in a big way as we see things work, and we're focused on managing that piece as well. So, I think on the inventory side, going into Q4, we feel good about where we're at. I think our guidance sort of implies -- we did say margin would be down about 50 basis points. But in relation to what we're seeing in the market, I think that's a pretty strong and definitely strong in relation to kind of a multiyear look.\n\nIf you were to do a three-, four-, five-year look at our product margin over time, I think you'd feel really good with kind of where we're standing. And overall, I just commend our buyers across all of our companies across the world. Just they've done a great job managing inventory in a very difficult cycle.\n\nRick Brooks -- Chief Executive Officer\n\nAnd I just want to add that, Corey, that, again, we're thinking about this long term. We have to manage effectively through these short-term challenges. And in doing that, when I say effective, part of that is managing our brand. And that's how our brand, as a Zumiez brand, ties in with our multi-branded strategy, emerging branding strategy, which is about price integrity for brands that have real equity for consumers.\n\nSo, this is where, again, we might get to -- we might have better product margins in this environment. It might mean a little tougher on the sales line sometimes. But as Chris said, we get about the same place as everyone else. We're just doing it differently.\n\nAnd I'd like to think the way that we're doing it is a better long-term strategy and approach for the benefit of both us and the discipline around pricing for our business, but the discipline around pricing for our brand partners, too, because we're not eroding their brand equity.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nThat's great. Thank you very much for all the color, and best of luck.\n\nRick Brooks -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. I'm showing no further questions at this time. I will now turn the call back over to Mr. Rick Brooks for any closing remarks.\n\nRick Brooks -- Chief Executive Officer\n\nAll right. Thank you very much. As always, we appreciate your interest. And as I said in the commentary, I just want to reiterate how confident I am in how we're positioned in the marketplace, our understanding of our consumer, what their behaviors that we're trying to solve for here as we look into the next few years, the next three to five years.\n\nI want to tell you that we have the strategies and initiatives in place the right investments, as commented on Sharon's question, to move those initiatives and strategies forward so that when we get through this cycle, we're going to come out stronger than we've ever been and we're going to gain market share. So, I remain really confident about our positioning. We've managed through cycles like this before. We're experienced doing it.\n\nAnd we're going to come out this other side stronger, better, and bigger. So, thank you, everyone. We look forward to talking to you in March.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRick Brooks -- Chief Executive Officer\n\nChris Work -- Chief Financial Officer\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nMore ZUMZ analysis\n\nAll earnings call transcripts"
}