{
  "companyName": "Taiwan Semiconductor Manufacturing",
  "companyTicker": "TSM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/13/taiwan-semiconductor-manufacturing-tsm-q3-2022-ear/",
  "content": "Taiwan Semiconductor Manufacturing (TSM -1.99%)\nQ3 2022 Earnings Call\nOct 13, 2022, 2:00 a.m. ET\n\nJeff Su\n\nGood afternoon, everyone, and welcome to TSMC's third quarter 2022 earnings conference call. This is Jeff Su, TSMC's director of investor Relations and your host for today. TSMC is hosting our earnings conference call via live audio webcast through the company's website at www.tsmc.com, where you can also download the earnings release materials. If you are joining us through the conference call, your dial-in lines are in listen-only mode.\n\nThe format for today's event will be as follows. First, TSMC's vice president and CFO, Mr. Wendell Huang, will summarize our operations in the third quarter 2022, followed by our guidance for the fourth quarter 2022. Afterwards, Mr.\n\nHuang and TSMC's CEO, Dr. C.C. Wei, will jointly provide the company's key messages. Then we will open the line for Q&A.\n\nAs usual, I would like to remind everybody that today's discussions may contain forward-looking statements that are subject to significant risks and uncertainties which could cause actual results to differ materially from those contained in the forward-looking statements. Please refer to the safe harbor notice that appears in our press release. And now I would like to turn the call over to TSMC's CFO, Mr. Wendell Huang, for the summary of operations and the current quarter guidance.\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nThank you, Jeff. Good afternoon, everyone. And thank you for joining us today. My presentation will start with financial highlights for the third quarter 2022.\n\nAfter that, I will provide the guidance for the fourth quarter. The third quarter revenue increased 14.8% sequentially in NT dollar, or 11.4% in US dollars, as our third quarter business was supported by strong demand for our industry leading 5-nanometer technology. Third quarter gross margin increased 1.3 percentage points sequentially to 60.4%. Slightly ahead of our guidance, as we enjoyed a more favorable foreign exchange rate and cost improvement efforts.\n\nTotal operating expenses accounted for 9.8% of net revenue as compared to 10% in the previous quarter. Operating margin increased 1.5 percentage points sequentially to 50.6%, mainly due to better operating leverage. Overall, our third quarter EPS was TWD 10.83, and ROE was 42.9%. Now, let's move on to revenue by technology.\n\n5-nanometer process technology contributed 28% of wafer revenue in the third quarter, while 7-nanometre accounted for 26%. Advanced technologies, which are defined as 7-nanometer and below accounted for 54% of wafer revenue. Moving on to revenue contribution by platform. Smartphone increased 25% quarter over quarter to account for 41% of our third quarter revenue.\n\nHPC increased 4% to account for 39%, IoT increased 33% to account for 10%. Automotive increased 15%, to account for 5% and DCE decreased 2% to account for 2%. Moving on to the balance sheet, we ended the third quarter with cash and marketable securities of TWD 1.5 trillion. On the liability side, current liabilities decreased by TWD 38 billion, mainly due to the decrease of TWD 116 billion in short term loans, partially offset by the increase of TWD 70 billion in accrual liabilities and others.\n\nLong-term interest bearing debt increased by TWD 88 billion mainly as we raise TWD 60 billion of corporate bonds during the quarter. Our financial ratio, accounts receivable turnover days decreased one day to 36 days. Inventory decrease -- inventory days decreased five days to 90 days, primarily due to higher wafer shipment during the quarter. Now, let me make a few comments on cash flow and capex.\n\nDuring the third quarter, we generated about TWD 413 billion in cash from operations spent TWD 266 billion in capex, distributed TWD 71 billion in fourth quarter '21 cash dividends and raise TWD 60 billion from corporate bond issuances. Overall, our cash balance increased by TWD 43 billion to TWD 1.3 trillion at the end of the quarter. In US dollar terms, our third quarter capital expenditures total TWD 8.75 billion. I have finished my financial summary, now let's turn to our current quarter guidance.\n\nBased on the current business outlook, we expect our fourth quarter revenue to be between $19.9 billion and $20.7 billion US, which represents 0.4% sequential increase at the midpoint. Based on the exchange rate assumption of $1 to TWD 31.5 gross margin is expected to be between 59.5% and 61.5%, operating margin between 49% and 51%. This concludes my financial presentation. Now, let me turn to our key messages.\n\nI will start by making some comments on our third quarter and fourth quarter profitability. Compared to the second quarter, our third quarter gross margin increased by 130 basis points sequentially to 60.4% mainly due to a more favorable foreign exchange rate and cost improvement efforts, despite continue inflationary cost pressures. Compared to our third quarter guidance, our actual gross margin exceeded the high end of the range provided three months ago, as our guide was based on exchange rate assumption of $1 to TWD 29.7, whereas the actual third quarter exchange rate was $1 to TWD 30.32. This created about 80 basis point difference in our actual third quarter gross margin versus our original guidance.\n\nWe have just guided our fourth quarter gross margin to be flattish sequentially to 60.5% at the midpoint, as a more favorable exchange rate assumption will be offset by a lower capacity utilization rates. As a reminder, six factors determined TSMC's profitability, leadership technology development and ramp up, pricing, cost reduction, capacity utilization, technology mix and foreign exchange rate. Looking ahead to 2023, we face challenges from entry ramp dilution, higher year-over-year increase in depreciation cost, rising inflationary cost semiconductor cyclicality and overseas fab expansions. To manage our profitability in 2023, we are working closely with our customers to support their growth and continue to strategically and consistently sell our value.\n\nWe are also working diligently on our internal cost improvement. Excluding the impact of foreign exchange rates of which we have no control over and taking the other five factors into consideration, we believe a long term gross margin of 53% and higher is achievable. Next, let me talk about our 2022 capex. As I have stated before, every year our capex is spent in anticipation of the growth that will follow in future years.\n\nThree months ago, we said our 2022 capex will be closer to the lower end of our TWD 40 to TWD 44 billion range. Now, we are further tightening up this year's capital spending and expect our 2022 capex to be around $36 billion. About half of the change is due to capacity optimization based on the current medium term outlook. And the other half is still to continue to delivery challenges.\n\nOut of the around $36 billion capex for 2022, between 70% to 80% of the capital budget will be allocated for advanced process technologies, about 10% will be spent for advanced packaging and mask making and 10% to 20% will be spent for specialty technologies. Looking ahead, we will continue to manage our business prudently given the near term uncertainties and adjust and tighten up our capital spending where appropriate. That said, our commitment to support customer's growth remains unchanged. And our discipline capex and capacity planning remains based on the long-term structure and market demand profile.\n\nWe will continue to work closely with our customers to plan our long-term capacity and invest in leading edge and specialty technologies to support their growth while delivering profitable growth to our shareholders. Now, let me turn the microphone over to C.C.\n\nC.C. Wei -- Chief Executive Officer\n\nGood afternoon, everyone. First, let me start with TSMC's more resilient near term demand outlook. We concluded our third quarter with revenue of TWD 613.1 billion or $20.2 billion, supported by strong demand for our industry leading 5-nanometer technologies. Moving into fourth quarter 2022, we expect our business to be flattish, as customers are ongoing inventory adjustment is balanced by continue ramp up of our 5-nanometer technologies supported by smartphone and HPC applications.\n\nWe expect our full year gross in 2022 to be mid 30% in US dollar terms. On the demand side, we continue to observe softness in consumer end market segment. Other end market segments such as data center and automotive related remain steady for now for TSMC. But we start to see the possibility of adjustment unrolled.\n\nOn the inventory side, our customers and the supply chain continue to take action to adjust their inventory. We expect the semiconductor supply chain inventory to pick in third quarter this year and start to reduce in fourth quarter this year. We also expect it will take a few quarters, so first half 2023 to rebalance to a healthier level. While the ongoing inventory correction will also affect TSMC, we expect our business to be less volatile and more resilient than the overall semiconductor industry during this period.\n\nSupported by three key factors that are TSMC's cost raise in the foundry industry. First, our technology leadership and differentiation is much stronger today as compared to previous years. This enable TSMC to win business and enables our customer doing business in high end markets, despite the semiconductor cyclicality. Secondary, through our comprehensive design ecosystem and optimize the process technologies, we are able to address and capture the structure increase in demand for computation and build a strong portfolio in high performance computing.\n\nThird, our strategical relationships with our customers are long term in nature, and we continue to work closely with our customer and technology development, capacity planning and pricing to support their long term demand and growth. As a result, we continue to see strong demand for our leading node except N7 and steady demand for our differentiated specialty technologies and mature node. Looking ahead to 2023 with a successful ramp up of N5 N4P, N4X and the upcoming ramp of N3, we're continue to expand our customer product portfolio and increase our addressable market. There's one other ongoing semiconductor inventory correction will affect the first half 2023 utilization rate.\n\nWe expect our business to be supported by stronger demand for our differentiated and leading advanced and specialty technologies, and for 2023 to be a growth year for TSMC. Next, let me talk about the N7 and 6 demand outlook. Due to end market weakness in smartphone and PCs and customer's products scheduled delay starting 4Q this year, our N7, N6 capacity utilization, will not be as high as it has been in the past three years. We expect this to persist for a few quarters through first half 2023 as the semiconductor supply chain inventory takes a few quarters to rebalance to a healthier level, and we have adjusted our N7, N6 capex accordingly.\n\nWe believe the N7, N6 demand is more a cyclical issue rather than structural and we expect our N7 N6 demand to pick up in second half 2023. Longer term, we continue to work closely with our customers to develop specialty and differentiated technology and are confident to drive additional wave of structural demand to backfill our N7 N6 capacity over the next several years. The 7-nanometer family will continue to be a large and long-lasting node for TSMC. Now I will talk about our N3 and N3E status.\n\nOur N3 is on track for volume production later this quarter with good year. We expect a smooth ramp in 2023, driven by both HPC and smartphone applications. Our customers' demand for N3 exceeds our ability to supply partially due to the ongoing tool delivery issues, and we expect entry to be fully utilized in 2023. We expect N3 revenue in 2023 to be higher than N5 revenue in its first year in 2020 and for N3E to contribute mid-single-digit percentage of our wafer revenue in 2023, as our overall revenue base is much larger today than in 2020.\n\nN3E will further extend our N3 family with the enhanced performance power and yield, and offer complete platform support for both smartphone and HPC applications. N3E development is progressing ahead of plan, and volume production is now scheduled for second half 2023. Despite the ongoing inventory correction, we observe a high level of customer engagement at both N3 and N3E with a number of tape-outs more than two times than that of N5 in its first and second year. Thus, we are working closely with our tool supplier to address toward delivery challenges and prepare more 3-nanometer capacity to support our customers with strong demand in 2023, 2024 and beyond.\n\nOur 3-nanometer technology will be the most advanced semiconductor technology in both PPA and transistor technology when it is introduced. We are confident that N3 family will be another large and long-lasting node for TSMC. Finally, let me talk about the future driver of leading node adoption. TSMC's ambition is to be the trusted technology and capacity provider for the global logic IC industry for years to come.\n\nOur job is to help our customers unleash their innovations and enable them to capture greater value and win in their end markets. As the industry continues to pursue scaling, it is true that damage shrink is slowing down and becoming more challenging for everyone due to rising process complexity. However, it is also true that demand for energy-efficient computing is accelerating in an intelligent and connected world as technology is becoming more pervasive and essential in people's lives. The semiconductor industry value in the supply chain is increasing, and the value of technology platform is expanding beyond the scope of geometry shrink alone and increasingly toward greater power efficiency.\n\nAs a result, our customers value much more than simply transistor cost. System performance and power efficiency has become key motivation for customers who adopt our leading node technologies. By working closely with our customer and technology development, our N3 and N2 will deliver full node stride in performance and power benefits while offering the industry's most advanced transistor scaling. We expect strong demand for our leading node technologies, driven by both smartphone and HPC applications to fuel our long-term revenue growth of 15% to 20% CAGR over the next several years in U.S.\n\ndollar terms. With our leadership in both leading-edge process technology and 3D solutions, TSMC's technology cadence remain constant to deliver the value of our technology platform. We will continue to extend our overall competitiveness and technology leadership while delivering a predictable technology cadence that help our customers to enhance their product competitiveness and grow their market well into the future. This concluding our key message, and thank you for your attention.\n\nJeff Su\n\nThank you, C.C. This concludes our prepared statements. Before we begin the Q&A session, I would like to remind everybody to please limit your questions to two at a time to allow all the participants an opportunity to ask questions. Should you wish to raise your question in Chinese, I will translate it to English before our Management answers your question.\n\n[Operator instructions] Now let's begin the Q&A session, operator can we please proceed with the first participant on the line.\n\nOperator\n\nYes, Jeff. The first one to ask questions Gokul Hariharan from J.P. Morgan. Go ahead, please.\n\nGokul Hariharan -- JPMorgan Chase and Company -- Analyst\n\nYes, good afternoon and thanks for taking my question. Congrats on the great results, especially on the margins. So the first question is on N7 and N6, this utilization slack that we are observing. Could we give a little bit more detail on why that is happening and why we think this is short-lived, a couple of quarters issue and we get a pick back in the utilization in the second half of the year? And I think last time we saw, this was for 28-nanometer, but that lasted for a much longer period of time.\n\nSo could you also give us some kind of comparison with what happened back in 28-nanometer and why this is going to be very different? And maybe a little bit more color on what are the areas of backfill demand for N7 and N6 as the high-end smartphone processors and HPC start to move on to N5 and then N3. That's my first question.\n\nJeff Su\n\nOK, Gokul, let me please allow me to summarize your first question. So Gokul's first question is on N7 and N6. He wants to understand what is driving the utilization slack. Why do we believe it is short-lived and that the demand for N7 and N6 can pick up in the second half? And then also on the little bit longer-term outlook, why we believe that N7 can be backfilled, and it will not be like N28 a few years ago with a few years of underutilization.\n\nC.C. Wei -- Chief Executive Officer\n\nWell, Gokul, maybe answer your question first on the why demand dropped. Demand dropped because of market becomes soft. As we said, in the weakness in the smartphone and PCs. And also a big factor is our customers' product schedule delay.\n\nAnd all in all, put all together, so we think that our utilization has been affected in fourth quarter this year and all the way to the first half of 2023. For the longer term, we continue to work closely with our customers. And actually, let me also say that this is a cyclical issue. So it will pick up anyway.\n\nAnd we believe we will pick up in the second half of 2023. And for the longer term, we continue to work closely with our customers to develop specialty and differentiated technology to drive additional wave of structural demand from consumer, RF, connectivity, etc., and other application to backfill our N7, N6 capacity and so for the next several years. That's all I --\n\nJeff Su\n\nDoes that answer your first question, Gokul?\n\nGokul Hariharan -- JPMorgan Chase and Company -- Analyst\n\nYes. My second question would be on the capex outlook. Now that we bring down the capex slightly for 2022, could you talk a little bit about what is the outlook direction for 2023 at least, if not absolute numbers, but just direction? Are we going to be flattish or it's likely to be going down? Second is, also, could you also give us an update on the schedule for the new fabs, Cauchon, Kumamoto, Nanjing, and Arizona? Is there any change in the schedules in terms of these fabs coming into production? Thank you.\n\nJeff Su\n\nOK, thank you, Gokul. So Gokul's second question is on capex and capacity. So first, he wants to hear, of course, he says that we have tightened up our capex in 2022. So he is asking for 2023 directionally, is there an indication of 2023 capex? And then he would also like an update on our expansion plans in Guosheng, Nanjing, Arizona, and Kumamoto.\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nOK, Gokul, let me answer you the first part. For 2023 capex, it is too early to comment. We will provide you with a specific guidance in January. However, as we said, we have tightened up our 2022 capex to reflect the current medium outlook, as well as two delivery issues.\n\nLooking ahead to 2023, we will continue to be careful and manage our business prudently given the near-term uncertainties. We will adjust and tighten up our capital spending where appropriate, but we will continue to work closely with our customers to invest for the long-term structural market demand profile to support their growth.\n\nC.C. Wei -- Chief Executive Officer\n\nWell, let me answer the second part of Gokul's question. Gokul, you asked about the progress of our Arizona fab, Nanjing fab, and the Gaozong. And let me say that Arizona fab work will continue and on schedule. There's no doubt about it because this is a N5 family which still have a very strong demand.\n\nAnd for Nanjing we just get our one-year authorization for 28-nanometer expansion. So it is on schedule also. For Gaozong, initially, we planned two fab at the beginning of 28-nanometer expansion and the N7. Now N7 has been adjusted.\n\nAnd so but 28-nanometer expansion is continued and on schedule.\n\nJeff Su\n\nAnd also Kumamoto.\n\nC.C. Wei -- Chief Executive Officer\n\nOK. Also the Japan fab is on schedule to meet the customer's demand.\n\nGokul Hariharan -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you very much.\n\nJeff Su\n\nAll right, thank you, Gokul. Operator, can we move on to the next participant, please.\n\nOperator\n\nThe next one to ask questions is Bruce from Goldman Sachs. Go ahead, please.\n\nBruce Lu -- Goldman Sachs -- Analyst\n\nThank you for taking my questions. So my first question is regarding to the HPC, which is a key growth driver for TSMC for the coming years. However, with the reason U.S. new restriction to China, what do you think about the HPC demand moving forward.\n\nWhat kind of impact is going to see a slowdown from China? Or are you going to see the collaboration from the non-China side?\n\nJeff Su\n\nOK, so Bruce's first question is on HPC. He notes HPC, we have said repeatedly, will be TSMC's key growth driver and main engine in the next few years. He wants to know, I believe, Bruce, the impact of the recent U.S. regulations, does that affect the overall HPC demand or the overall profile.\n\nIs that correct?\n\nBruce Lu -- Goldman Sachs -- Analyst\n\nYes, what's the impact from this new restriction to TSMC and overall industry?\n\nC.C. Wei -- Chief Executive Officer\n\nOK, let me answer that. Bruce, it's based on our initial reading and feedback from our customers. The new regulation set the control was called at very high-end specification, which is primarily used for AI or supercomputing applications. Therefore, our initial assessment is the impact to TSMC is limited and manageable.\n\nWe will continue to closely monitor the situation to ensure that we are all in full compliance with all the rules and regulation. And for the longer term, it's too early to really assess all the true impact or influence, but we will give you the update in the following earnings call.\n\nBruce Lu -- Goldman Sachs -- Analyst\n\nOK, understand that. Thank you. So my next question is regarding to the cyclical nature for the 7-nanometer. But we also noticed that most of your other nodes, the capacity utilization rate is still at a very, very high level or at least much better than 7-nanometers as management mentioned.\n\nWhy is 7-nanometer so cyclical? Because maybe because you guys are too big, you have to industry or what is the difference between your 7-nanometers and your other nodes?\n\nJeff Su\n\nOK, so Bruce's second question is looking at N7 specifically. He wants to know our other nodes seem -- the utilization still seems to be holding up well. So why specifically N7 is more cyclical and utilization is not as high as it has been. Is that correct, Bruce?\n\nBruce Lu -- Goldman Sachs -- Analyst\n\nYes.\n\nC.C. Wei -- Chief Executive Officer\n\nOK. It just happened that most of my smartphone and PCs customer are using N7 and N6 node. And it just happened, the market weakness in the smartphone and PC happening at the same time. And also other customers or product schedule delay, all in all, that's why it becomes lower utilization rate as compared with other node.\n\nIf you want to compare with the N5 or compare with the 28-nanometer, our orders are very -- is still at a very high demand, and we will continue to enjoy the higher market share.\n\nBruce Lu -- Goldman Sachs -- Analyst\n\nI want to dig in a bit because we get used to like TSMC will manage your customers' product and overall outlook even with some tape-out you can make it out with someone else. But anything different with this time that 7-nanometer, you cannot have as good as your other nodes?\n\nJeff Su\n\nSo Bruce wants to still understand why the 7-nanometer utilization cannot be as high as the other nodes if we work closely with customers, and is well planned.\n\nC.C. Wei -- Chief Executive Officer\n\nWell, again, Bruce, we work closely with our customers, but our customers get caught in this inventory correction and the market downturn. They didn't know this one, probably two quarters before. And at the beginning of this year, they will still give us a very high number of their forecast. And it just happened, it just happened.\n\nBut as we said, we believe this is a cyclical issue. And it will pick up. But before that, it probably will take a few quarters.\n\nBruce Lu -- Goldman Sachs -- Analyst\n\nI see, understand. Thank you. We just get too used to it to be like -- to expect TSMC always deliver a much better result.\n\nC.C. Wei -- Chief Executive Officer\n\nI understand.\n\nJeff Su\n\nOK. Thank you, Bruce. Operator, can we move on to the next caller please.\n\nOperator\n\nNext, we have Randy Abrams from Credit Suisse.\n\nRandy Abrams -- Credit Suisse -- Analyst\n\nYes, OK. Thanks for taking my question. I wanted to ask a two-part first question. You mentioned in the prepared remarks about HPC and auto continue to be stable, but seem to signal it may change.\n\nIf you could give your view how you see inventory levels and some of the forward demand outlook from those areas. And the second part, I just want to see if we could get a bit better visibility on first half first quarter, how do you see it versus normal seasonal? And then for the trough, do you expect first quarter could be the bottom, or do you see the trend that we could be toward the second quarter?\n\nJeff Su\n\nOK, so Randy's question is really looking at again from the end demand segment. Data center and automotive, we say are remaining steady at TSMC for now. He wants to understand though, what is the outlook down the road, and what does that mean for inventory levels? And then secondly is also he wants to see if we can provide some more granularity about first quarter outlook versus seasonality and whether we think the first quarter can be the bottom for the industry. Is that correct, Randy?\n\nRandy Abrams -- Credit Suisse -- Analyst\n\nYes, that's correct.\n\nC.C. Wei -- Chief Executive Officer\n\nOK, let me answer this one. Of course, we say that so far, our customers give us their demand forecast -- so the data center and automotive related are still steady. But now the market becomes solved and will take a more conservative way in our planning for 2023. And that's why we say that we don't rule out the possibility.\n\nThey might have some correction also, but we did not see it right now, to be frank with you. And for the inventory correction in 2023, all we want to say is like that. We expect probably 2023, the semiconductor industry were likely to decline. But TSMC also is not immune, we believe our technology position, strong portfolio in HPC and longer-term strategic relationship with customers will enable our business to be more resilient than the overall semiconductor industry.\n\nAnd that's why we say in 2023 still a growth year for TSMC and the overall industry probably will decline.\n\nRandy Abrams -- Credit Suisse -- Analyst\n\nOK. Again, and I'll ask a quick follow-up, and then the second question. I guess just a sense because it's still very firm in fourth quarter, if you're seeing a pretty meaningful falloff into first quarter, like some years 10%. 2019 declined over 20%.\n\nSo just trying to get a rough feel of the type of decline factoring you're gaining some content and share. That's fell to the first. And then the second question, actually, just on gross margin because of a lot of headwinds, I think, Wendell, you talked about. If you could give -- just on a couple of these depreciation factoring the recent capex, how much up and whether it's also front end or more back half loaded given the 3-nanometer ramp.\n\nAnd then for the start-up costs for N3 if you expect similar to N5, given smaller percent of revenue, how much dilution from N3? Thank you.\n\nJeff Su\n\nOK, Randy. So let me summarize. So, Randy, quick, I think we will not comment on the first quarter, but I think we can make some comment just sort of in terms of the overall inventory picture in looking into next year.\n\nC.C. Wei -- Chief Executive Officer\n\nWell, actually, if you ask my opinion on the inventory picture and the inventory correction, it's too early to provide a specific number. However, the inventory correction were likely see its biggest impact sometimes in the first half 2023.\n\nJeff Su\n\nOK, and then the second part related to the gross margin, maybe Wendell can address what is the outlook for depreciation next year, some of the -- and then is it front or back-end loaded? And also what type of dilution we expect from 3-nanometer as it ramps in 2023.\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nOK, Randy. For full year depreciation for next year, it's too early to talk about that. But this year is mid-single-digit increase year on year. But next year, we expect it will likely to be meaningfully higher.\n\nWe will give you the guidance in January. As to the dilution from N3, it will be between two to three percentage points on a whole year basis on our gross margins.\n\nRandy Abrams -- Credit Suisse -- Analyst\n\nOK, and actually, one follow-up. Do you think on a single quarter with the inventory correction, do you expect to keep the 53 and above factoring were coming from a very high level even through that first half inventory correction?\n\nJeff Su\n\nRight. It is too early to talk about 2023, gross margin including quarter over quarter. But even with all these cost challenges, we believe our structural profitability can be maintained, and we are confident to deliver a long-term gross margin of 53% and higher. OK.\n\nRandy Abrams -- Credit Suisse -- Analyst\n\nOK, great, thanks.\n\nJeff Su\n\nThank you, Randy. Operator can we move on to the next participant, please.\n\nOperator\n\nNext one to ask questions, Charlie Chan from Morgan Stanley.\n\nCharlie Chan -- Morgan Stanley -- Analyst\n\nGood afternoon, and thanks for taking my questions. So my first question to management is about whether the company consider a share buyback because the company seems to suggest recent inventory correction is just a cyclical, you're still very positive on the long term. And I think the share price really revealed comes long-term value, right, also shareholders' value. So I'm not sure if a company wants to do share buyback or cash returns?\n\nJeff Su\n\nOK. So Charlie's first question is that although there's cyclicality, the long-term outlook appears good. Would the company consider doing a share buyback?\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nYes, Charlie, we constantly review all the different options of returning cash to shareholders. For share buyback, at this moment, we are not considering it. We think our cash on hand will be better kept to invest in our capital expenditure to make a better return for our shareholders.\n\nCharlie Chan -- Morgan Stanley -- Analyst\n\nOK, understood. Thank you. And also, my second question is also about the U.S. sanction impact? I know the company said that NPAs limited and the long-term impact remains to be seen, right, but my question is about your -- the China market to TSMC, is that as strategic as before after these events?\n\nJeff Su\n\nOK, so Charlie, second question, he wants to know with the recent U.S. regulations and the impact, how do we see the China market? Is it still a strategic market for TSMC? Is that correct, Charlie?\n\nCharlie Chan -- Morgan Stanley -- Analyst\n\nYes, meaning whether -- how this company think about China for TSMC's long-term picture, how important it is to China going forward?\n\nC.C. Wei -- Chief Executive Officer\n\nCharlie, I would like to say that every region is important to TSMC. However, let me say that, under the condition of work compliance with all the rules and regulations, TSMC will continue to serve all the customer all over the world. That's our position.\n\nCharlie Chan -- Morgan Stanley -- Analyst\n\nOK, including China?\n\nC.C. Wei -- Chief Executive Officer\n\nAll the customers.\n\nCharlie Chan -- Morgan Stanley -- Analyst\n\nOK, got it. Thank you. Those are my questions. Thank you.\n\nJeff Su\n\nThank you, Charlie. Operator, can we move onto the next participant, please.\n\nOperator\n\nNext one to ask questions, Sunny Lin from UBS.\n\nSunny Lin -- UBS -- Analyst\n\nHi, thank you for taking my questions. Congrats on the steady performance. My first question is on the geopolitical tensions. I wonder, given some of the considerations regarding the geopolitical issues, how would you evaluate a longer-term impact from customers potentially diversifying from Asian foundries? And how are you managing the risk? Thank you.\n\nJeff Su\n\nOK, so Sunny's first question is that given the geopolitical tensions, how do we evaluate the long-term impact and the risk of customers using other foundries? Is that correct, Sunny?\n\nSunny Lin -- UBS -- Analyst\n\nCorrect. Thank you.\n\nC.C. Wei -- Chief Executive Officer\n\nSunny, we still believe the most important is in is a technology leadership, manufacturing and our customer trust. And so in different locations, manufacturing or whatever, we still think that technology leadership is the most important thing. And so that's our strategy. We make it simple, the technology, manufacturing and customer trust.\n\nSunny Lin -- UBS -- Analyst\n\nGot it. And so a quick follow-up. Is that going forward, should we assume an acceleration of your overseas expansions just to diversify the production site, i.e., if there could be a fab built in Europe?\n\nJeff Su\n\nOK, so Sunny's second question then, does that -- can we assume that we will continue to increase the overseas global footprint expansion and also particularly in Europe?\n\nC.C. Wei -- Chief Executive Officer\n\nWell, we will continue to increase our overseas portion in manufacturing based on customers' need, in fact, based on the business opportunity and also based on the operations efficiency and economics. And so whether we are going to be in Europe, we are in preliminary evaluation and to not rule out any possibility. Again, I would like to say the decision were based on customers' need, business opportunities, operational efficiency and the cost economics.\n\nSunny Lin -- UBS -- Analyst\n\nGot it, thank you. I actually have a second question on HPC. So with the increasing usage of chiplets, how would you manage the risk in the case that some dies are made at the other foundries and that have production issues and therefore, impacting the production at TSMC as well? Thank you very much.\n\nJeff Su\n\nSo, Sunny, second question is with increasing usage and adoption of shipments -- sorry, chiplets in HPC, how would we manage the risk in case I think Sunny you're saying it dies at other companies or places have production issues, would how do we manage the risk of that impacting TSMC?\n\nC.C. Wei -- Chief Executive Officer\n\nSunny, in fact, we would like our customer manufacturing every chip inside TSMC for sure. But if there is a case that they have to use other companies' dies, we will work with our customers closely and minimize all the risk that some goes by. That's what we are doing right now.\n\nSunny Lin -- UBS -- Analyst\n\nGot it. Thank you, that's very helpful. Thank you.\n\nJeff Su\n\nThank you, Sunny. Operator, can we move on to the next participant, please.\n\nOperator\n\nRight now, we have Laura Chen from Citi.\n\nLaura Chen -- Citi -- Analyst\n\nThank you, for taking my question. I appreciate that if you can share with your latest plan in your Nanjing fab. Like C.C. already mentioned, you got the license for the 28-nanometer in Nanjing.\n\nSo I'm just wondering that do you also need a license for the 16-nanometer in the Nanjing fab? And also going forward, what's your trend of your operation in China? That's my first question. Thank you.\n\nJeff Su\n\nOK, so Laura's first question is about Nanjing fab and our plans. She notes that we have received the one-year authorization. So our 28-nanometer expansion continues as planned. Her question is, do we also need a license for the 16-nanometer that we have in Nanjing? And then also her -- also what is our long-term future expansion plans in China.\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nSunny, let me answer the first part.\n\nJeff Su\n\nLaura.\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nSorry, it's Laura. Let me answer the first part. The one-year authorization that we received cover the Nanjing facility. So it's both the 28 and 16.\n\nLaura Chen -- Citi -- Analyst\n\nOK, great. Thank you.\n\nJeff Su\n\nAnd then the second part is what is our long-term expansion plans for China?\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nOK. As C.C. said, we will be operating -- serving all the customers under the condition that we will fully follow in compliance with all the rules and regulations.\n\nLaura Chen -- Citi -- Analyst\n\nOK, that's very clear. My second question is also about the fab globally in the longer term. We know that in overseas operation, usually, they will have a much higher operational cost. So how would that impact the TSMC's long-term margin trend in our view, or maybe you can give us some information about your estimate of the percentage of the margin in different region or the cost difference comparing to Taiwan?\n\nJeff Su\n\nOK, so Laura's second question is around our expansion of our global manufacturing footprint. She wants to know that overseas fabs, are the costs higher? Do we have a breakdown how much the cost difference is in Japan, U.S. versus Taiwan? And then overall, with overseas expansion and if there are higher costs, how does this impact our long-term profitability and margin?\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nOK, Laura, let me answer this question. The initial cost of overseas fabs are indeed higher than TSMC's fab in Taiwan. And it's mainly because of higher labor costs in different layers of the supply chain. We continue to work closely with the U.S.\n\ngovernment, as well as with our customers and supply chain partner to manage and minimize the cost gap. Now through these efforts, we believe we can continue to earn the proper return and deliver the long-term gross margin of 53% and higher.\n\nLaura Chen -- Citi -- Analyst\n\nOK, that's very clear. Thank you very much.\n\nJeff Su\n\nThank you, Laura. Operator, can we move on to the next participant, please.\n\nOperator\n\nNext one to ask questions is Rolf Bulk from New Street Research.\n\nRolf Bulk -- New Street Research -- Analyst\n\nThank you for taking the question. I was hoping you could give some more context around the 3-nanometer tool shortages that you mentioned. Is that primarily lithography, and then specifically EUV related, or do you also see shortages in other tool segments? Thank you.\n\nJeff Su\n\nOK. So Rolf's first question is around 3-nanometer and the tool shortages. He wants to know if this is very -- just specific to lithography tools and EUV specifically, or is it more I guess, broad-based?\n\nC.C. Wei -- Chief Executive Officer\n\nLet me answer the question. Actually, it's more broad based because of our demand is high -- and certainly, the photo lithography tool is included and one of the most important one.\n\nRolf Bulk -- New Street Research -- Analyst\n\nThank you. That's reasonable. As my follow-up question, it would be great to get an update on your N2 notes, which your current visibility is now it's still on track timing-wise and is there anything you can share on how you think about yields of N2 versus N5 and N3 at the same stage of development?\n\nJeff Su\n\nOK, so Rolf's second question is on N2. He would like an update. Are we still on track? What is the timing for N2? And also if there's any update on yields as compared to N3 and N5 at similar stage.\n\nC.C. Wei -- Chief Executive Officer\n\nOK, I said before, N2 is a very deep quarter one, but our progress so far, so good. Actually, it's a little bit ahead. And we are going to have a mass production introduced in 2025. And our customers' engagement so far are very -- let me say that, comparable with the N3, N5.\n\nAnd the status today is very comparable to the N5 and also N3. So we are happy to see that our progress so far.\n\nJeff Su\n\nDoes that answer your question, Rolf?\n\nRolf Bulk -- New Street Research -- Analyst\n\nThank you very much.\n\nJeff Su\n\nThank you, Rolf. OK. Operator, let's move on to the next participant, please.\n\nOperator\n\nNext one, we have Charles Shi from Needham & Company.\n\nCharles Shi -- Needham and Company -- Analyst\n\nGood afternoon. Thank you for taking my questions. I have two, both on capex. The first question is really -- and I understand you're not here to guide 2023 capex.\n\nBut I think a few years ago, you did provide some long-term capex, a range of capex when your long-term CAGR guidance was 5% to 10%. And you think 10 to 12 billion capex is going to support that long-term CAGR. I think you just reiterated your long-term CAGR to be 15% to 20%. Do you kind of have a similar range of capex for us to think about over long term? Again, I'm not asking you about '23 capex year.\n\nJeff Su\n\nOK, so Charles' first question is about -- really, I think, Charles, you're asking about capex correlation with growth. So he notes that. In the past, we have said our long-term growth would be 5% to 10%. So during that period, we said we would spend between TWD 10 billion to TWD 12 billion.\n\nSo without asking about 2023 specifically, Charles wants to know, now we believe we will grow between 15% to 20% CAGR in the next few years. What type of capex range does that imply or should he assume? Is that correct, Charles?\n\nCharles Shi -- Needham and Company -- Analyst\n\nYes, correct.\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nOK, Charles, I think it will be -- let me try to answer this question from the capital intensity point of view. When we invest heavily to capture the future growth, the capital intensity will be high like last year and this year. But if the growth slows down, the capital intensity may become lower. Now longer term wise, we think that a normal reasonable capital intensity may be somewhere between mid to high 30 percentages longer-term-wise.\n\nCharles Shi -- Needham and Company -- Analyst\n\nThe second question is about very near term into the next quarter basically because you just slashed your 2022 capex, I mean from what you guided one quarter ago by about 4 billion. If I hear correctly, half of that is can be attributed to the tool delivery issues. But the other half, can you clarify a little bit, because you kind of said it's about capacity optimization. Is that the kind of like a 2 billion reduction in capex, mostly a reduction of the equipment spending, or is it something else you are reducing here and trying to improve the capital capacity optimization here? Thank you.\n\nJeff Su\n\nOK, so Charles' second question is on the capex and he is asking we have now guided to around 36 billion versus close to 40 billion last time. We have said half of it is related to tool delivery and the other half is capacity optimization for the midterm demand outlook. So his question is with the capacity optimization is this mainly also a reduction in tools, or is there some other issue right? Is that correct, Charles?\n\nCharles Shi -- Needham and Company -- Analyst\n\nYes, correct. Thank you.\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nOK. Charles, I think the -- you're right that the half of that difference comes from tool delivery issue. The other half is the capacity optimization by that, and that's because of the current uncertainty in market conditions. So we're tightening up our capital budget.\n\nAnd it relates to the whole capacity. It's including tools, including the other stuff within the capex. Yes, and it's mainly N7.\n\nCharles Shi -- Needham and Company -- Analyst\n\nThank you very much.\n\nJeff Su\n\nYes, it's tools and also as C.C. and Wendell mentioned, some of the adjustments we have made to our N7 and N6 capacity and capex due to the aforementioned reasons. Thanks. OK, thank you, Charles.\n\nOperator, can we move on to the next participant.\n\nOperator\n\nNext one, we have Brad Lin from BofA Securities. Go ahead, please.\n\nBrad Lin -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much for taking my questions. First of all, congratulations on the strong earnings, and my first question is about, well, if we look at the loan pages of the new regulations from the U.S. on China, it can be really broad and with the -- of course, with the key on the supercomputing. But however, given the wide variety and also wider application of chips that TSMC makes, isn't it, in theory, difficult to identify and make sure the chipset is business compliant with the regulation, or will there be some extra costs and overhead costs by that which wish you notice in the future? Thank you.\n\nThat's my first question.\n\nJeff Su\n\nOK. So Brad's first question is with the new U.S. regulations, he knows it's very long and very wide in scope. So he is wondering if it's very hard to interpret and therefore, will this result in greater overhead cost for TSMC to ensure that we are and continue to be fully compliant with all the regulations.\n\nC.C. Wei -- Chief Executive Officer\n\nWell, actually, although it's rule is about more than 100 pages, but initial region and feedback from our customer, actually, the regulation is very simple to be understood like control switch hold at a very high-end specification. For example, like 600 bit per second bandwidth or those kind of things, it's very easily to be understood, and we continue to work with our customers to make sure that we fully comply with the regulation.\n\nJeff Su\n\nAnd so Brad would also like to know, Wendell, from a financial standpoint, will we incur more overhead cost as a result?\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nAt this moment, we don't think so.\n\nBrad Lin -- Bank of America Merrill Lynch -- Analyst\n\nI see, thank you very much. Just a slight follow-up because the regulation is just aiming at the first supercomputing, but I know in a supercomputer, definitely, there are some -- still some low-end chips used inside. So if we happen to make those, and we are not sure that it is going there when we produce them with that, will that cause some confusion or bring some trouble to us?\n\nJeff Su\n\nSo Brad's second question is in a super computer, there may be very specific high-end restrictions, but there's also companion chips, other chips used. Would that cause us an issue?\n\nC.C. Wei -- Chief Executive Officer\n\nThe company achieved, there is no restriction or no regulation at all. So we reran on our customer to work with their own customer for that kind of a product.\n\nBrad Lin -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you very much. And then maybe, if I may, second question will be clearly, many countries would like to build their own foundry or their own domestic supply chain. We have learned that the cost will be a major downside.\n\nSo my question would be can we charge different pricing that's basically demanded by our clients, right? So with higher costs, if they want to buy from U.S. or buy from Europe, can we charge a higher pricing if that's based on the node? And also, if we think about the bright side, would you please share how TSMC could well utilize these kind of opportunities to strengthen our competitiveness in the long run? That will be my all questions.\n\nJeff Su\n\nSo Brad's second question is about he notes that many countries would like to have domestic semiconductor manufacturing. TSMC, we are, as C.C. said, also increasing and expanding our global manufacturing footprint. So with higher cost, will we be able to charge a higher price? I guess that is essentially his question.\n\nC.C. Wei -- Chief Executive Officer\n\nActually, TSMC's pricing is strategic and consistent, and all I can say is we will continue to see our value. The values come from the technology manufacturing, and also that our relationship with our customers, whether it is in a different country or a different place, it's not in our consideration. Again, I would like to say we'll continue to see our value and our pricing is strategic. OK?\n\nJeff Su\n\nOK. Thank you, Brad. Operator, can we move on to the next participant, please.\n\nOperator\n\nNext one, we have Mehdi Hosseini from Susquehanna International.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nYes, thanks for taking my questions. I also have my first multipart question. I'm just looking at your customers' inventories that are on a days of inventory are at a 25-year high. And it seems based on your commentary that the demand forecast, especially looking at the first half, has weakened.\n\nSo it seems to me that the inventory correction is going to sustain to Q2 and more slightly, your shipment would be declining sequentially in Q1 and Q2. Just looking at your customers' inventory, is that a realistic view of the first half? Because you also highlighted the fact that inventory correction is going to sustain throughout the first half. And we're not asking for a guide, I'm just trying to better reconcile your customers' inventory with your comment. And I have a follow-up.\n\nJeff Su\n\nOK, so Mehdi's first question is on inventory. He notes customers' inventory levels are very high. We have talked about our observation from an industry level that demand is softening in consumer segment. And so his question is what is the outlook and do we expect the inventory correction, I guess, to be more notable as we go into first half '23.\n\nIs that correct, Mehdi?\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nYes, and particularly, you've always had your wafer shipment up in Q2, but I think '23 could be an exception, and it could probably decline. And that's how I explained my question. So the question is could wafer shipment decline in Q2 for the first time in many, many years.\n\nC.C. Wei -- Chief Executive Officer\n\nWell, Mehdi, our current forecast, actually, our supply chain inventory will peak in third quarter this year. And we observed that the inventory will start to reduce in the fourth quarter -- last quarter of this year. And we expect we will see the biggest impact in the first half, actually, first half of 2023. The detail of the first quarter, second quarter or something like that, we are not ready to share with you yet because of -- we continue to work with our customer and to understand their demand.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nAnd if I may have a quick follow-up to that? Does that imply that your customer focus changing so rapidly that we have to wait for January pulse to get the final read on the first half?\n\nJeff Su\n\nNo, Mehdi. I think we have always in the past, we will guide for 2023 and talk about 2023 outlook in first quarter during the January conference, right? But I think C.C. has already said that with the inventory correction, we expect our business to be more resilient during both the down and upturn given our technology leadership, and that 2023 is a growth year for TSMC, OK? We will not comment further on first quarter or second quarter.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nAnd my second question has to do with depreciation that was down in Q3, down year over year and Q-over-Q. And this is despite the fact that capex was up 65% in 2021. Does that have anything to do with tool optimization? And to that extent, as the second part of the question, would you consider converting 7-nanometer to five and three?\n\nJeff Su\n\nSo, Mehdi's, second question first is depreciation, why it is down Q-on-Q and year on year. And then also, would we consider converting capacity?\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nOK. Mehdi, the depreciation, we look at it from a whole year point of view. For this year, as I mentioned, we expect it to be up year on year by mid-single digits of -- and for next year, it will be meaningfully higher, meaningfully higher, but we will share with you more in January. Please understand that every year, there are depreciation newly going into the depreciation table and also there are depreciation coming off of the depreciation table.\n\nSo what you're looking at is the net result. As to converting N7 capacity to N5, as we mentioned earlier, N7 demand issue is cyclical rather than structural. So at this moment, I don't think we have that kind of plan.\n\nJeff Su\n\nThank you, Mehdi. In the interest of time, operator, maybe we can take the last -- the questions from the last two participants, please?\n\nOperator\n\nYes, sir. Next one to ask a question, Patrick Chen from CLSA. Go ahead, please.\n\nPatrick Chen -- CLSA -- Analyst\n\nThank you for taking my questions. You talked about 2023 to be still a growth year. Would you say that growth is pretty much the same compared to what you expected a quarter ago or it is lower? And if so, what's driving this lower growth expectation?\n\nJeff Su\n\nOK, so Patrick's first question is about 2023. Is the growth that we see for 2023, how does it compare versus our expectation for three months ago for 2023? And what is driving this?\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nYes, well, I think it's too early to talk too much about the 2023, but we maintain our statement that 2023, we still expect as a growth year, OK?\n\nJeff Su\n\nDo you have a second question, Patrick?\n\nPatrick Chen -- CLSA -- Analyst\n\nOK. Yes, that's very helpful. And maybe a follow-up. If I may, any leading indicators that you are monitoring that could help you or help us determine the growth outlook aside from monitoring the clients' wafer orders?\n\nJeff Su\n\nOK, so Patrick's second question is looking with inventory correction. He wants to know if there's any leading indicators that we can look at or he should look at to see when indication that the cycle is bottoming.\n\nC.C. Wei -- Chief Executive Officer\n\nThat's really hard to answer your question. Actually, if you look at the whole industry, that's from the smartphone and PCs, and you read all the quarterly report from our major player, you can change that one to go up and one is the downturn. So we definitely have some information. Internally, we do the analysis, and today, we are taking a very conservative way for our planning.\n\nThat's all I can share with you.\n\nPatrick Chen -- CLSA -- Analyst\n\nThank you. And I guess that's what we've been doing as well. But obviously, we don't have a crystal ball. Well I don't have any further question.\n\nThank you for taking my questions.\n\nJeff Su\n\nOK, thank you. Operator, can we take the last participant, please?\n\nOperator\n\nYes, the last one to ask question is Frank Lee from HSBC. Go ahead, please.\n\nFrank Lee -- HSBC -- Analyst\n\nThank you. I wanted to ask, I guess, a question on your N3, N3E. Is the ramp for both nodes going to be around the same time, or is there going to be some difference in scheduling?\n\nJeff Su\n\nOK, so Frank's first question is on the ramp for N3 versus N3E, is it at the same time.\n\nC.C. Wei -- Chief Executive Officer\n\nOK. Actually, it's not at the same time. Right now, we are ramping up by N3. And N3E is supposed to be one-year apart, but because of the progress so well, so we might pull in a little bit for two or three months, that's all.\n\nSo they are still not at the same time.\n\nFrank Lee -- HSBC -- Analyst\n\nOK, and my second question is, I know you've related your margin -- long-term gross margin target being unchanged. But I guess given the headwinds you're seeing now through the first half of next year with the currency move already gone up quite a bit, utilization rates dropping. Is this -- are you going to see any potential change in the pricing strategy? I know I can't comment too specifically, but you have seen some price increases in the last 12 months or so. So from going forward, with the pricing strategy still be relatively unchanged given the change in the overall market environment?\n\nJeff Su\n\nOK, so Frank's second question is related to pricing with the inventory correction and with some of the cost challenges, he wants to know, will there be any changes to our pricing strategy during this correction. Is that correct, Frank?\n\nFrank Lee -- HSBC -- Analyst\n\nYes.\n\nC.C. Wei -- Chief Executive Officer\n\nOK, Frank, let me answer the question. Again, I want to stress that our pricing actually is a strategic and consistent. So you say that do we have any plan to change it? No, it will be consistent. And not based on any cycle or opportunistic.\n\nAnd we actually -- most importantly, we always work closely with our customers to provide our value and to help them to win their own end markets.\n\nFrank Lee -- HSBC -- Analyst\n\nRight -- no, I'm not suggesting there's an opportunistic pricing, but I just get a market situation has changed for your clients who are probably going through a more difficult time. Would there be some change to the strides to help align with them as well? Or would they largely still be the same policy that we've seen?\n\nC.C. Wei -- Chief Executive Officer\n\nWe stay the same. We are consistent.\n\nFrank Lee -- HSBC -- Analyst\n\nOK. Thank you.\n\nJeff Su\n\nThank you, Frank. All right. This concludes our Q&A session. Before we conclude today's conference, please be advised that the replay of the conference will be accessible within one hour from now.\n\nThe transcript will become available 24 hours from now, both of which will be available through TSMC's website at www.tsmc.com. Thank you for joining us today, and we hope you will join us again next quarter. Goodbye, and have a good day.\n\nDuration: 0 minutes\n\nJeff Su\n\nWendell Huang -- Vice President and Chief Financial Officer\n\nC.C. Wei -- Chief Executive Officer\n\nGokul Hariharan -- JPMorgan Chase and Company -- Analyst\n\nBruce Lu -- Goldman Sachs -- Analyst\n\nRandy Abrams -- Credit Suisse -- Analyst\n\nCharlie Chan -- Morgan Stanley -- Analyst\n\nSunny Lin -- UBS -- Analyst\n\nLaura Chen -- Citi -- Analyst\n\nRolf Bulk -- New Street Research -- Analyst\n\nCharles Shi -- Needham and Company -- Analyst\n\nBrad Lin -- Bank of America Merrill Lynch -- Analyst\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nPatrick Chen -- CLSA -- Analyst\n\nFrank Lee -- HSBC -- Analyst\n\nMore TSM analysis\n\nAll earnings call transcripts"
}