{
  "companyName": "H&R; Block",
  "companyTicker": "HRB",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/hr-block-hrb-q4-2022-earnings-call-transcript/",
  "content": "H&R Block (HRB -0.57%)\nQ4 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to H&R Block's year-end fiscal 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question-and answer session. [Operator instructions].\n\nI would now like to hand the call over to vice president, investor relations, Michaella Gallina. Please go ahead.\n\nMichaella Gallina -- Vice President, Investor Relations\n\nThank you, operator. Good afternoon, everyone, and welcome to H&R Block's full year fiscal 2022 financial results conference call. Joining me are Jeff Jones, our president and chief executive officer; and Tony Bowen, our chief financial officer. Earlier today, we issued a press release and presentation, which can be downloaded or viewed live on our website at investors.hrblock.com.\n\nOur call is being broadcast and webcast live, and a replay of the webcast will be available for 90 days. Before we begin, I'd like to remind listeners that comments made by management may include forward-looking statements within the meaning of federal securities laws. These statements involve material risks and uncertainties, and actual results could differ from those projected in any forward-looking statement due to numerous factors. For a description of these risks and uncertainties, please see H&R Block's annual report on Form 10-K and quarterly reports on Form 10-Q as updated periodically with our other SEC filings.\n\nPlease note, some metrics we'll discuss today are presented on a non-GAAP basis. We reconcile the comparable GAAP and non-GAAP figures in the appendix of our press release and presentation. The content of this call contains time-sensitive information accurate only as of today, August 9, 2022. H&R Block undertakes no obligation to revise or otherwise update any statements to reflect events or circumstances after the date of this call.\n\nWith that, I will now turn it over to Jeff.\n\nJeff Jones -- President and Chief Executive Officer\n\nThank you, Michaella. Good afternoon, everyone, and thanks for joining us. Fiscal 2022 marked another year of strong performance, continuing the multiyear trend of improved results. We delivered another great tax season and achieved meaningful milestones in our Block Horizons journey, including a record year in small business; launching our new mobile banking platform, Spruce; and more than tripling the use of virtual tools among tax clients.\n\nAs a result of the strength in our business, we are pleased to also announce another increase to our dividend and a new share repurchase authorization. I'll begin, as usual, by discussing the progress we've made across our strategic imperatives, share more on the tax season, and then Tony will provide details on our results and discuss our fiscal 2023 outlook. In small business tax, we are delivering exceptional results. We saw strong growth in both assisted and DIY clients as well as improved mix, which led to a double-digit revenue increase this tax season versus last year.\n\nOur various client acquisition and retention efforts are working, including enhanced marketing efforts and the introduction of an advanced certification for tax professionals. In addition, we're building out our bookkeeping and payroll offerings and testing new services. Overall, it was a record year, and we're focused on building upon the momentum we saw in fiscal '22.  Turning to Wave. We had another solid year of performance.\n\nRevenue grew 28% over last year and average revenue per user, or ARPU, continue to accelerate on both a sequential and year-over-year basis. I'm excited about the ongoing innovation, including the development of a unified mobile experience that will strengthen Wave's product ecosystem. We acquired Wave three years ago, and it has since achieved important financial and operational milestones. As such, founder and CEO, Kirk Simpson, believed it was the right time to hand over the reins to a new leader to take Wave into its next phase of growth.\n\nI want to thank Kirk for his leadership and many accomplishments. Importantly, Kirk was instrumental in selecting our new leader, Zahir Khoja. Zahir was formerly the general manager of North America for Afterpay, where he led the company's rapid market expansion. Previously, he was the executive vice president, global merchant solutions and partnerships at Mastercard.\n\nHis significant fintech, management and product development experience make him an excellent fit to lead and scale the business, and I'm excited for this next chapter of Wave. Overall, small business continues to execute, and I'm pleased with the progress we made in fiscal '22. Moving to financial products. We're focused on driving innovation within our mobile banking platform, Spruce.\n\nWe've had four new app releases since the January launch, streamlined the sign-up process and made enhancements to the existing credit score feature to help clients understand how it's calculated and how they can improve it. As of June 30, we have 160,000 sign-ups and $83 million in customer deposits. As a reminder, we introduced clients to Spruce only in the DIY channel at launch to learn and gain customer insights.  Now that we're outside of tax season, we are continuing to innovate the feature set, test customer acquisition and prepare for the launch in the assisted channel next tax season. Our Block Experience imperative, which is all about blending digital tools with human expertise, continues to drive a better experience for our clients.\n\nFor example, our technology investments enable clients to be served fully virtually to fully in-person and everything in between. During the 2022 tax season, virtual uptake from clients more than tripled. Embedded machine learning in the DIY user interface is producing a better experience for customers by streamlining the time to complete their return. And we are better anticipating when to offer a DIY user help from a tax pro, which adds expertise to maximize their outcome.\n\nOur new innovative fulfillment network enables tax pros with capacity to process a return from anywhere in the country regardless of location, which results in our clients being more quickly served and better leverages our tax pro availability. This was one of the reasons we saw strong tax pro productivity this season. Our enhanced virtual technologies have the added benefit of providing efficiencies for the business. We have begun reducing our existing square footage without closing stores as most of our tax pro training is now online, and we no longer have a need for large conference rooms in many offices.\n\nWe've also tested dropoff only locations this year to better leverage the fulfillment network, serve clients quickly and optimize staffing. Finally, robotic process automation, or RPA, have streamlined highly manual back-office processes, eliminating nearly 40,000 human labor hours in fiscal '22 alone. As you can see, we continue to achieve significant milestones in our Block Horizons journey, and I'm very pleased with our trajectory. Turning now to results.\n\nWe finished the year strong in both the Assisted and DIY channels, serving more clients than typical in the May and June period. We exceeded our guidance on both revenue and EBITDA and continued our multiyear trend of creating value for shareholders. Since 2019, the last normal year prior to the pandemic, our performance speaks for itself. We have grown total clients, grown assisted market share, grown revenue and EBITDA more than 12% each and reduced shares outstanding by 21%, leading to adjusted EPS growth of nearly 50%, and we've grown the dividend.\n\nStepping back over double that time frame, since 2016, we have grown adjusted EPS by approximately 110%. We emerged from the pandemic much stronger as a company and are on a path of growth. In summary, it was another great year for H&R Block, delivering on our purpose to provide help and inspire confidence in our clients and communities everywhere. I'm excited about the momentum in the business, the strength of our capital allocation and where we are headed.\n\nTony will now share more on our financials and outlook.\n\nTony Bowen -- Chief Financial Officer\n\nThanks, Jeff, and good afternoon, everyone. Our results continue to be strong, and I'm happy to be here today to share more detail. I'll begin with a review of our fiscal year '22 results, provide an update on the ongoing strength of our capital allocation practice, discuss our outlook for fiscal year '23, and our thoughts on how we delivered total shareholder return over time. As a reminder, the prior year included the end of tax season '20, which was extended to July 15 of that year.\n\nThat causes our results to decline when you compare fiscal year '22 to the prior year. In fiscal '22, we delivered $3.46 billion of revenue, which decreased 3.5% or $125 million over the prior year. When normalizing prior year results for the tax season impacts recognized in July of 2020 and the impacts of Emerald Card stimulus, total revenue increased by $165 million or 5%. Total operating expenses were approximately $2.7 billion, an increase of approximately 1% or about $21 million primarily due to higher marketing and technology costs, partially offset by lower depreciation and amortization and bad debt.\n\nWe continued our efforts of identifying savings to fund our investments and our expense management remains strong. EBITDA was approximately $890 million, a decrease of 15% or about $162 million. Compared to the normalized prior year, EBITDA increased by 9% or about $75 million. Interest expense was approximately $88 million, a decrease of about $11 million or 11%, driven by lower draws this year on our line of credit, partially offset by the $500 million of notes we issued last June.\n\nAs planned, in the fourth quarter, we paid off the $500 million, 5.5% maturing notes that were originally due in November, which will result in material savings given the new notes we issued at a 2.5% interest rate. Pretax income was $659 million, compared to $797 million in the prior year, and our effective tax rate was 14.9% compared to 13.4% last year. Compared to the normalized prior year, pre-tax income increased by $99 million or 18%. Turning to share repurchase.\n\nWe bought a total of 23 million shares for $550 million this year at an average price of $23.84. This was 13% of our shares outstanding. And today, we announced another share repurchase authorization that I will share more about in a moment.  Earnings per share from continuing operations decreased from $3.67 to $3.26, while adjusted earnings per share from continuing operations decreased from $3.94 to $3.51. Compared to the normalized prior year, adjusted earnings per share increased from $2.97 to $3.51 or 18%.\n\nIn fiscal '22, we acquired 125 franchise locations. We view this as a good use of capital given that we were able to repurchase locations at attractive EBITDA multiples and integrate the businesses into our existing company operations. We believe we can continue to acquire franchise locations, which, as we previously shared, can contribute approximately one point of growth annually to our top line.  Regarding Sand Canyon, two long outstanding litigation matters, which we refer to as the homeward cases, were recently fully resolved in Sand Canyon's favor as reported in our Form 10-Q last quarter. We feel great about this outcome for Sand Canyon and do not plan on providing regular updates going forward outside of our disclosures in Forms 10-K and 10-Q and other SEC filings, unless there is material news to share.\n\nSwitching gears. We have a long track record of generating significant cash flow and returning value to shareholders through dividends and share repurchases, which helped drive earnings-per-share growth. As we have shared, we believe free cash flow yield, defined as free cash flow divided by market capitalization, is an important metric for our company.  Despite the increase in our market cap in recent months, our fiscal year '22 free cash flow yield remained strong at approximately 13%, which is more than double that of the S&P 500. Because of the momentum and strength in our business, we are pleased to further enhance our capital allocation by announcing another increase to the quarterly dividend to $0.29 per share or more than 7% growth and a new share repurchase authorization of $1.25 billion, which is effective through fiscal year 2025.\n\nSince 2016, we have increased the dividend by 45% and retired nearly one-third of our shares outstanding. In total, we returned over $2.7 billion to shareholders in that time frame, and we will continue to drive ongoing value with these practices. Let me now turn to our fiscal year '23 outlook. Given the rollback of the child tax credit for this upcoming year and an expected increase in our effective tax rate from the mid-teens to the low 20s, we are pleased to provide an outlook with top line growth, EBITDA that outpaces revenue growth and EPS that grows even faster.\n\nWe expect revenue to be in the range of $3.535 billion to $3.585 billion. We expect to generate EBITDA of $915 million to $950 million from growing the top line and leveraging our fixed cost structure. As I just shared, our effective tax rate is expected to be approximately 22%. We are also adding EPS guidance, which more holistically captures the value we are creating.\n\nFor fiscal year '23, we expect adjusted earnings per share to be in the range of $3.70 to $3.95. On that note, let me share more about how we are driving EPS growth and how we think about total shareholder return. We believe we can grow revenue 3% to 6% annually over time, driven by the many levers we have in place, including about a point from the steady industry growth, a couple of points of modest, low single-digit price increases, a point from franchise buybacks and nearly a point from Wave. From there, we have additional upside with our Block Horizons imperatives.\n\nWe then have the opportunity to grow EBITDA at a rate of nearly one and a half times that of revenue due to the leverage in our fixed cost structure. After layering on opportunistic share repurchases, we see a path to double-digit earnings-per-share growth annually through 2025. On top of the P&L expansion, we continue to grow our quarterly dividend, which we have paid since Block became public in 1962. As Jeff shared, over the last six  years, we have grown adjusted EPS 110% or a CAGR of 13%.\n\nYou can see that H&R Block has had multiple strong years of performance, and I'm more excited than ever about what is in front of us. With that, I'll turn things back over to Jeff for closing remarks.\n\nJeff Jones -- President and Chief Executive Officer\n\nThanks, Tony. Before closing, I want to reiterate just how pleased I am with our performance in fiscal '22 and the path we are on. We had another great tax season, achieved significant Block Horizons milestones and continue to return value to shareholders through our capital allocation practice. Our success is made possible by the collaborative efforts of our entire organization.\n\nThank you to our steadfast tax professionals, franchisees and associates who embody our purpose every day to provide help and inspire confidence in our clients and communities as well as the team at Wave, who continue to execute and drive innovation. My sincere thanks go out to the team for another great year, and I look forward to all that lies ahead of us as we continue to build on this momentum in fiscal '23.  Now operator, we will open the line for questions.\n\nOperator\n\n[Operator instructions]. Our first question comes from the line of Scott Schneeberger of Oppenheimer & Co. Scott Schneeberger, your line is open.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nThanks very much. Good afternoon, everyone. Great job and excellent that you add to this long-term evergreen guidance. Very much appreciated.\n\nI think I'll start out, Tony or Jeff, just asking what is implicit in the 2023 guidance? Tony, I appreciate the breakdown of kind of the long-term revenue growth and then taking it down the P&L, but what are fundamentally the areas where you think you're really going to grow in this coming year specific to the year? Thanks.\n\nTony Bowen -- Chief Financial Officer\n\nYes, Scott, thanks for the question. I mean it really starts with strength in the tax business as the start. I mean we've talked about it's a healthy industry. It grows about 1% over time, and we expect that going into '23.\n\nWe also expect to continue to take moderate price.  Obviously, we're in a high inflationary environment, but we've talked about we think that we can take low single-digit price increases. We've earned that right based on customer feedback over the last several years. Franchise buybacks will continue to be a driver of revenue. We executed about 125 locations this year.\n\nWe think we'll be in that ballpark going into next year. Obviously, Wave growth will be additive as well. We're planning to launch Spruce in the assisted side of the business, which will be additive to revenue. So all those pieces working together, continued performance in small business tax, which we've seen over the last several years, all those pieces working together obviously driving the revenue side and then leveraging our fixed cost structure, as we've talked about, obviously, variable costs will go up.\n\nWe are offsetting inflation that's hitting us from a comp perspective, from a wage perspective. But overall doing a really good job of managing expenses, which is allowing us to grow EBITDA faster than revenue. And then EPS has obviously has the leverage as well as additional share repurchases. So all of those pieces together are the core components of our outlook.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nGreat. Appreciate that. And then curious, you had good visibility back in May, the last time hosting a public conference call and providing a financial update. But it looks like there's going to be some activity after the tax season deadline this year.\n\nThat was pretty elevated. I imagine we get it in your 10-K when that comes out, but could you speak a little bit to what you saw after the tax season deadline with regard to volumes and pricing across the assisted and the DIY channel? Thanks.\n\nJeff Jones -- President and Chief Executive Officer\n\nYes, Scott, this is Jeff. You're absolutely right. And we did what we could to position ourselves given that business that remained. In the Assisted business, we kept more offices open.\n\nWe had more tax professionals working. Obviously, that's a strength to be able to be open, obviously, to capture that volume. And we saw continued strength in our NAC trends. We met last time.\n\nNAC was up about 8%, and that continued in that period following the tax season closing. In DIY, we saw some improved performance in the DIY business. We also saw a benefit from late season pricing in NAC. I think that moved from about 3% to 6%.\n\nSo just really across the board, the team continued to execute well given the business that remained in the market, and that shows up in the strength of our results.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nGreat. Thanks. I will turn it over.\n\nJeff Jones -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of George Tong of Goldman Sachs. George Tong, your line is open.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nHi. Thanks. Good afternoon. In the 2022 tax season, net average charge in assisted, as you mentioned, increased 8% and two-thirds of that was driven by complexity mix.\n\nCan you outline your NAC assumptions embedded in next year's guidance and? And the likelihood that complexity reverses next year given some of the factors that lifted 2022 complexity should taper, such as crypto and retail trading?\n\nJeff Jones -- President and Chief Executive Officer\n\nYes, George, absolutely. So we -- first of all, I would say we feel very good about our value proposition in the assisted business. We're seeing that in multiple ways as we've spoken about. And you're exactly right, the NAC increases was about a third price and two-thirds mix from complexity.\n\nThat's -- think about that headwind as a couple of points of revenue, and that's real. The rest of our plans have been built around offsetting that. Again, we think we can offset some in price again with this low single-digit price increases, and then the growth in the other parts of the business that Tony just outlined.  But that is the headwind, but we feel really good about the momentum in the business and the strength of our plans to be able to offset that.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nGot it. And you touched a little bit on this earlier, but can you explain in more detail your assumptions around industry growth for next year in assisted and DIY? And how you expect market share to perform at H&R Block in both of those categories as it did in DIY?\n\nJeff Jones -- President and Chief Executive Officer\n\nYes. Obviously, we're coming out of just some really crazy years in terms of industry performance and the ups and downs and all the things that we've been speaking about.  Sitting here today, we're not aware of any major changes in the tax code that's going to create some new piece of noise. And so when we look at the macro factors, we see the industry kind of going back to its historical CAGR of 1% to 1.5%. And for us, there are two things that we expect.\n\nOne is continued strong performance in the assisted business, and that means continuing to hold or grow market share. Again, over the -- since '19, we've grown market share in assisted about 40 basis points and feel really good about that performance. You may remember DIY on our last call was one area where we weren't pleased. Despite the fact that we've done a really nice job with pricing, meaningful revenue growth, we feel really good about the way we're driving more DIY clients to human health, but returning DIY to share growth is a top priority.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nVery helpful. Thank you.\n\nTony Bowen -- Chief Financial Officer\n\nThanks, George.\n\nOperator\n\nThank you. [Operator instructions]. Our next question comes from Kartik Mehta of Northcoast Research. Kartik Mehta, your line is open.\n\nKartik Mehta -- Northcoast Research -- Analyst\n\nHey, Jeff and Tony. Jeff, maybe just a little bit on Wave. I know that's been growing relatively well. And I know you had talked about, at some point, getting to profitability.\n\nAs you look at FY '23, kind of what's your expectations as far as Wave maybe revenue growth goes and what that could mean from an EBITDA standpoint?\n\nJeff Jones -- President and Chief Executive Officer\n\nYes. So a number of things in there, Kartik. So first of all, obviously, we feel good about Wave's growth. Since we bought the company, it's continued to perform very well every year.\n\nSo on the top line, as we've said, that's contributing about one point of growth to Block. But it is still losing money despite improving its operating losses, which is hurting us on the EBITDA margin line. So the transition from Kirk to Zahir, this is at the top of his list is coming into the company, really understanding how we can accelerate growth and how we can accelerate our path to profitability. We still have not put a target date for him when that has to happen because we want to really continue to push growth, and that's what he's coming into the job focused on.\n\nSo we'll have more to update as we continue to watch the business, but that's where we stand.\n\nKartik Mehta -- Northcoast Research -- Analyst\n\nAnd, Jeff, I know you commented a little bit on real estate, at least in terms of shrinking some of the footprint -- at least square footage in an office. But I'm wondering if virtual grows, what's your outlook for the next two, three years in terms of what could happen to office and if there's an opportunity there?\n\nJeff Jones -- President and Chief Executive Officer\n\nYes. So I would connect three dots here. One is the consumer adoption of virtual tools, the second is the changes to operating model to be able to complete returns from any location, and the third is the reduction in real estate. And so the -- what you've heard of us talk about real estate has been about locations.\n\nBut because we're now testing operating models, where there are drop-off only locations, or there are locations serving people outside of that location, the focus on square footage, we think, is really important. And so the first steps we've started to take are to reduce the square footage where we know it's just simply not being utilized anymore, especially given our training model. For years, we've had large training rooms in offices. And now that we're delivering our training virtually, that's a low-hanging fruit and square footage, which obviously helps us on the rent line.\n\nSo those three things really have to work together. And we're making great progress. But the thing I'd remind the team about all the time is this is a once-a-year purchase frequency. So we're increasing the adoption of the virtual tools, but we have to continue to make that habit for the consumer, while we perfect the operating model changes and we start tackling the low-hanging fruit in real estate.\n\nSo we do see opportunity, but it will be over many years.\n\nTony Bowen -- Chief Financial Officer\n\nYes. And Jeff said it, but just the opportunity is really on reducing square footage versus reducing points of presence. We think the points of presence are helpful. It allows for walk-in traffic.\n\nIt allows for new client acquisition. But if we can reduce the number or the size of each of those offices, that's really where the savings will come to play.\n\nKartik Mehta -- Northcoast Research -- Analyst\n\nThank you, brother. Really appreciate it.\n\nJeff Jones -- President and Chief Executive Officer\n\nThanks, Kartik.\n\nOperator\n\nThank you. At this time, I'd like to turn the call back over to Michaella Gallina for any closing remarks.\n\nMichaella Gallina -- Vice President, Investor Relations\n\nThanks, Latif, and thanks, everyone, for joining us today. We look forward to speaking with you again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichaella Gallina -- Vice President, Investor Relations\n\nJeff Jones -- President and Chief Executive Officer\n\nTony Bowen -- Chief Financial Officer\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nKartik Mehta -- Northcoast Research -- Analyst\n\nMore HRB analysis\n\nAll earnings call transcripts"
}