{
  "companyName": "Agora, Inc.",
  "companyTicker": "API",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/agora-inc-api-q2-2022-earnings-call-transcript/",
  "content": "Agora, Inc. (API -4.40%)\nQ2 2022 Earnings Call\nAug 15, 2022, 9:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to Agora Inc.'s second quarter 2022 financial results call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference call is being recorded. I'd now like to hand the conference over to Ms. Fionna Chen, head of investor relations. Thank you.\n\nPlease go ahead, ma'am.\n\nFionna Chen -- Head of Investor Relations\n\nThank you, operator. Good evening, everybody; good morning for people in Asia, and thank you for joining us for Agora's second quarter 2022 earnings conference call. Our earnings results press release SEC filings and a replay of today's call can be found on our IR website at investor.agora.io. Joining me today are Tony Zhao, our founder, chairman, and CEO; Jingbo Wang, our CFO.\n\nReconciliations between our GAAP and non-GAAP results can be found in our earnings press release. During this call, we will make forward-looking statements about our future financial performance and other future events and trends. These statements are only predictions that are based on what we believe today, and actual results may differ materially. These forward-looking statements are subject to risks, uncertainties, assumptions, and other factors that could affect our financial results and performance of our business, and which we discuss in detail in our filings with the SEC, including today's earnings press release and the risk factors and other information contained in the final prospectus relating to our initial public offering.\n\nAgora remains under no obligation to update any forward-looking statements we may make on today's call. With that let me turn it over to Tony. Tony?\n\nTony Zhao -- Founder, Chairman, and Chief Executive Officer\n\nYes. Thanks, Fionna, and welcome, everyone, to our earnings call. Our revenue for the quarter was $41 million, a decrease of 3% year over year and an increase of 6% quarter over quarter, bringing us back on the growth track after regulatory change in the K-12 acquisition sector in China. During this quarter, 33,000 new applications were registered on our platform.\n\nAt the end of June, our number of active customers exceeded 2,800, adding over 400 compared to one year ago. In the U.S. and international markets, demand for our real-time engagement platform remains strong. Our revenue for this segment recorded a 63% increase compared with the same period last year with a dollar-based net expansion rate consistently above 130% since 2021.\n\nFollowing our announcement of the promotion of several key executives in May, I'm confident that we are well-positioned to enhance our go-to-market efficiency and expand our platform globally. In recent months, we have witnessed a strong response to our sub-second interactive live streaming product globally. We believe this product has the potential to disrupt the traditional CDN-based live streaming market as we can deliver live streaming experiences and lower latency in a highly synchronized fashion with only a moderately higher cost. We already have several benchmark customers in the sports and gaming live streaming sector.\n\nPowered by this product, our customers can create a wide range of engaging and interactive experiences for their end users such as chat among audiences and in-game live betting. For example, MBC Group, the largest media country in the Middle East and North Africa, uses this product on their social gaming platform WIZZO to offer game players high-quality interacted live streaming and it has become one of the biggest attractions of the WIZZO platform. With Agora-powered live streaming in place, MBC has already seen a 10% increase in new user growth. And Pulse Asia's leading video live streaming platform Polo Live is also powered by this product.\n\nWe provide the platform's technology platform powering live streaming and interactive features that enable content creators, entertainers, and influencers to forecast interactive live streaming to their audience and monetize directly through consumer transactions from their fans. We believe this product will substantially enlarge our total addressable market as more and more live streaming platforms with legacy technology embrace our sub-second live streaming solutions. Next, onto our new products. In U.S.\n\nand international markets, we beta-released Agora Chat, which is a powerful tool for developers to add messaging to any application. Agora Chat provides comprehensive features and functions, such as rich media messages, message translations, user presence, and type indicator, chat history export, content moderation, and much more. Agora Chat has the broadest compatibility with operating systems and third-party development frameworks among similar messaging API products in the market. It is also very easy to use, especially for those who are already using our real-time video and voice product.\n\nThrough a few lines of code, developers can similarly create an immersive and engaging experience for their end users to send messages, emojis, and multimedia files from within their real-time engagement sessions. I'm also glad to say that Agora Chat is the perfect demonstration of the business synergies from our integration of Easemob over the past year. By combining Easemob experience in providing messaging APIs in Asian market with Agora's industry-leading global infrastructure, we're able to offer a highly competitive product for customers in the U.S. and international markets.\n\nNow, let's move to our business update in China. Revenue from China in this quarter recorded a 1% quarter-over-quarter increase as a shortfall in K-12 academic tutoring sector was more than compensated for by the growth in other sectors. Our revenue in sectors other than K-12 continues to grow healthily with an approximately 13% increase compared with the same period last year. Our leading market position in China is once again demonstrated by IDC's recent published report on the video cloud market in 2021.\n\nAccording to the IDC report, Agora maintained its No. 1 position RTC solutions in China, with a market share greater than the next seven companies combined. Agora also recorded the largest revenue growth among all players. In China, we formed a partnership with the China Audio-Video Copyright Association, also known as CAVCA, the only association approved by the National Corporate Administration to undertake collective rights management for copyright and related rights in video and audio works in China.\n\nThrough this partnership, we are now able to provide a one-stop solution for our customers to manage their use of music work in their live streaming sessions and more importantly in full compliance, with the latest corporate laws and regulations in China. Under our digital rights management system that covers more than 100,000 music works in high definition, each and every usage of these works in our customers' application is now possible. Our customers can choose from paying per usage for a flat fee with unlimited access, and copyright owners will then be duly compensated. We believe our partnership with CAVCA and this one-stop solution bring profound value to our customers and will help make our MetaKTV a go-to product for delivering immersive real-time key experience in the networks.\n\nBefore concluding my prepared remarks for this quarter, I would like to invite all of you to attend our RTE 2022 Conferences. The North American Conference will take place from October 10 to October 12, and you are welcome to join either online or in-person in San Francisco. The Asia-Pacific Conference will be held online from October 21 to October 24. We expect to bring the brightest minds in the business and technology field to explore the future of voice video Internet of Things metaverse and more.\n\nWith that, let me turn things over to Jingbo who will review our financial results.\n\nJingbo Wang -- Chief Financial Officer\n\nThank you, Tony. Hello, everyone. Let me start by first reviewing financial results for Q2 and then I will discuss our outlook for the fiscal year of 2022. Total revenues were $41 million in the second quarter of 2022, a decrease of 3.2% year over year, and an increase of 6.2% quarter over quarter.\n\nAs we mentioned, in previous earnings calls, our revenue growth in this quarter was negatively impacted by the new regulation on K-12 academic tutoring sector in China. Our revenues from this sector were approximately $1 million in the second quarter of 2022, compared to $12 million from the same period last year. On the other hand, our growth momentum in other geographies and sectors remained solid in this quarter. In particular, revenues from the U.S.\n\nand in international markets grew 63.2% year over year and 13.4% quarter over quarter to $18.6 million in Q2, representing 45.4% of our total revenues. Our trailing 12 months constant-currency dollar-based net expansion rate is 95%, excluding Easemob. Specifically, expansion rate was about 130% for the U.S. and international business, which remains strong and healthy; and approximately 80% was China business, which was negatively impacted by the K-12 sector.\n\nMoving on to cost expenses. For my following comments, I will focus on non-GAAP results, which exclude share-based compensation expenses, acquisition-related expenses, amortization expenses of acquired intangible assets, and income tax related to acquired intangible assets. Non-GAAP gross margin first quarter was 65.8%, which was 4.3% higher than Q2 last year, mainly driven by technical and infrastructural optimizations. Non-GAAP R&D expenses were $27 million in Q2, up 30% year over year, as we continue to hire talented employees and strengthen our R&D team.\n\nNon-GAAP R&D expenses were 56% of total revenues in the quarter, compared to 49.2% in Q2 last year. Non-GAAP sales and marketing expenses were $10.9 million in Q2, up 16.8% year over year, mainly attributable to teams' expansion and increased advertising and event expenses, as we continue to step up our go-to-market efforts globally. Sales and marketing expenses represented 26.6% of total revenues in the quarter, compared to 22.1% in Q2 last year. Non-GAAP G&A expenses were $7 million in Q2, up 23.1% year over year, mainly due to team expansion and expected credit loss provisions.\n\nG&A expenses represented 17% of total revenues in the quarter, compared to 13.3% in Q2 last year. Non-GAAP operating loss was $17.8 million translating to a 43.4% non-GAAP operating loss margin for the quarter, compared to operating loss margin of 22.3% in Q2 last year. Exchange loss was $5.3 million in Q2, mainly due to U.S. dollar appreciation and an increase in the balance of RMB-denominated cash and short-term investments held by our subsidiaries in Hong Kong with functional currency in U.S.\n\ndollar. The anticipation of funding RMB to subsidiaries in mainland China, in addition, U.S. dollar appreciation adversely affected our revenue in China by approximately 4%. Now, turning to the update on land use right purchase.\n\nAs we announced on June 28, we entered into an agreement to acquire the land use right for approximately 42,000 square meters of land in the riverside area of Yangpu District, Shanghai through a joint venture with two independent third parties. We hold a 46% equity interest in the joint venture. The aggregate reconciliation for acquiring the land use right is approximately RMB 2.5 billion. And we had fully paid our share of reconciliation in July.\n\nWe plan to build a new headquarters on our premises. Turning to cash flow. Operating cash flow was negative $23.8 million in Q2, compared to negative $8.3 million last year. Free cash flow was negative $24.2 million, compared to negative $11.5 million last year.\n\nMoving on to the balance sheet. We ended Q2 with $641 million in cash, cash equivalents, and short-term investments, compared to $718 million at the end of Q1. Net cash outflow in the quarter was mainly due to free cash flow of negative $24.2 million deposit paid for land use right purchase of $34.2 million, cash paid for long-term investment of $4.2 million, and share repurchase of $12.2 million. By the end of Q2, we repurchased approximately 9.7 million of our Class A ordinary shares, equivalent to approximately 2.4 million ADS for approximately $19.8 million, representing 10% of our $200 million for the share repurchase program.\n\nNow turning to guidance. COVID-19 is still an unprecedented variable to our business model where historical experience may not apply. Our guidance on full year revenues reflects various assumptions that are subject to change based on uncertainties and related to the impact of the COVID-19 pandemic. With that, for the full year 2022, we maintain our previous guidance of total revenues for the full year, are expected to be in the range of $176 million to $178 million.\n\nIn closing, we are proud of our execution in the quarter under very challenging macroeconomic environment. Thank you to the entire Agora team for your hard work and everyone attending the call today. Hope you are all healthy and safe. Let's open it up for questions.\n\nOperator\n\nThank you. [Operator instructions] Please stand by while we compile the question-and-answer roster. [Operator instructions] Our first question comes from the line of Yang Liu from Morgan Stanley. Yang, your line is open.\n\nPlease ask your question.\n\nYang Liu -- Morgan Stanley -- Analyst\n\nThank you for the opportunity. I have two questions here. The first one is, can management update us in terms of the overseas market demand for RTE, especially the demand from start-ups? Because on the positive side we see a good pickup in terms of the new customer this week -- this quarter, but on the negative side, we also, from time to time, hear that the overall overseas funding environment is getting tougher and a lot of start-ups cannot lose equity or risk funding in the market. So, could you please update us in terms of what Agora is seeing on the demand? And the second question is the gross margin because we see a very good pickup in gross margin this quarter, what should be the outlook in the second half of this year? Do you think this is a structural or sustainable trend or is it helped by some one-off benefits?\n\nTony Zhao -- Founder, Chairman, and Chief Executive Officer\n\nI'll take the business trend on our customers' fundraising etc. Overall, we do hear some start-ups talking about fundraising getting harder and the valuation is much lower now, but we don't have a strong impression of difficulties from our customer base. We have a very diverse customer base from large to very smaller ones. In some individual cases, we see things like customers slow down their own hiring, delay the rollout of new products or features, or become more sensitive to infrastructure costs, etc.\n\nI believe this is normal, given the challenging market environment we are in today. In terms of impact to our own business, despite the challenge I mentioned just now, we see that overall trend of adoption of real-time engagement technology by developers and users remain strong, especially for the global market. This is why we still achieved strong revenue growth in Q2 in the U.S. and international markets with revenue up 63% year over year.\n\nWe will continue to monitor the situation closely and see how it pays off.\n\nJingbo Wang -- Chief Financial Officer\n\nOK. I'll take the second question on GP margin. So, in the past six quarters since beginning of 2021, our back-end engineering team has really worked very, very hard to optimize infrastructure costs and improve our architectural design, so that the same task consumes less server and less resources. This has resulted in a very significant reduction in our COGS per minute of video or voice call delivered.\n\nAnd this is why, despite them have an annual decrease in average selling prices of about 10% to 15%, which is normal for cloud services like ours, we were still able to improve our non-GAAP margin from 58% in Q2 or in Q1 last year to 65% in Q2 this year, which is more than 7% improvement. So I guess that's the most important reason. There was also a small one-off factor in this quarter. Easemob has a small private cloud business which has lower GP margin.\n\nThis quarter, many of their private cloud projects are delayed due to the COVID situation in China. And this actually had a positive impact on the GP margin because the revenues were delayed. Looking forward, further COGS optimization will be harder and new products such as the integrated CDN will have lower GP margin. So, we do not expect GP margin to increase significantly in the near future.\n\nIt will likely fluctuate from quarter to quarter in the second half.\n\nYang Liu -- Morgan Stanley -- Analyst\n\nThank you. Just one very quick follow-up here. Could you please update us in terms of the gross margin in China and in global market? Are they quite still now, or is there still a gap between these two markets?\n\nJingbo Wang -- Chief Financial Officer\n\nYeah. So latest number we see there is no gap six quarters ago. GP margin in U.S. and international market was quite a bit lower and now it's obviously at parity.\n\nThere's no difference between the two markets.\n\nYang Liu -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Bing Duan from Nomura. Please ask your question. Bing, your line is open.\n\nPlease go ahead.\n\nBing Duan -- Nomura -- Analyst\n\nHi. Sorry. Hi. Good morning, management.\n\nSo I have two questions. One is about the trend of the operating expense. Can you give us more colors on the second half, especially, about the R&D and the sales and marketing expense, the expense ratio as compared to the first half? And the second question is about a follow-up on the overseas market growth. Can you give us some more color about the revenue and/or volume breakdown by application or by the vertical segments? And do we see any of the negative impact as more people are getting back to work? Thank you.\n\nJingbo Wang -- Chief Financial Officer\n\nOK. So, the first question on expenses, you're right, as you can see in the financial statements, the fastest-growing segment of our expenses is R&D. We have always invested a lot, very heavily, in R&D in the past and will continue to do so in the future because ultimately this is where is the foundation of our competitor business. But on the other hand, we acknowledge the challenging macroeconomic environment in the U.S., in China, and other markets as well.\n\nSo, we do intend to become more focused when it comes to R&D. For example, product-wise, we will focus on products where we see strong demand such as sub-second live streaming, as Tony mentioned in his opening remarks, where we have a strong advantage such as special audio. And we'll really focus on resources on these kinds of promising products. And customer-wise, we will focus on large customers and the small group of really innovative customers who can help us drive our road map and be the future of real-time engagement.\n\nAnd in terms of the organization, we will streamline our internal processes and bring our engineers closer to our customers. So, all these initiatives will improve our R&D efficiency. And hopefully, as our revenue scale, we will see that percentage drop in the second half. In terms of sales and marketing, the increase in sales and marketing expenses were mainly due to our expansion in U.S.\n\nand international markets. In China, actually -- part of -- was mostly flat. We think that sales and marketing expenses overall will continue to increase in dollar terms, but the pace will slow down and as our revenue scales to also drop as a percentage of revenue. I want to add another point on the G&A expenses.\n\nSo, in the past three to four quarters, our G&A expenses were negatively affected, but we expected quite loss from customers in the K-12 sector in China. And now, with that behind us, we expect G&A to also drop in dollar terms in the coming quarters. So, that's on expenses. In terms of U.S.\n\nand international market, I think overall we see growth from many different geographies and verticals. Strong as well. I'll highlight a few stronger ones in this quarter. We saw very strong growth from the Middle East, Southeast Asia, and North America.\n\nAnd in terms of vertical, education, media, e-commerce, and social generated the majority of the incremental usage platform. And you mentioned the kind of back-to-work situation. It's true that the back-to-work trend has impacted use cases such as remote collaboration and virtual events, virtual exhibitions, that kind of use case. But in use cases like education and e-commerce, actually, we'll continue to see very strong demand and we are particularly excited about opportunities in media and e-commerce because these are the verticals where historically they were underpenetrated by those types of engagement technology, but we certainly have a lot of room for adoption in the future.\n\nAs Tony mentioned, our sub-second, low-latency live streaming product only got started to be adopted in the sports live streaming space. So, now people are using this technology to podcast live sports games. And we believe there's huge potential for growth in the future. So, overall, we don't think it's driven by two particular use cases.\n\nWe see very strong adoption across many different regions' use cases.\n\nBing Duan -- Nomura -- Analyst\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Allen Li from J.P. Morgan. Allen, your line is open. Please go ahead.\n\nAllen Li -- J.P. Morgan -- Analyst\n\nYes, thanks, management, for taking my question. My question is on competition. So, we know that some large platforms have shifted their focus from revenue growth to profitability, so just wondering if this is also the case, for private competitors. And could you give us an update, on the competitive landscape and also the pricing trend in the mass market? Thank you.\n\nTony Zhao -- Founder, Chairman, and Chief Executive Officer\n\nWe don't see much change compared to last quarter's competition landscape. As you mentioned, the large cloud providers, as we heard, also, they reduced their investment in our field actually maybe partially, due to their effort to shift the focus to more profitability instead of just revenue growth. On private sector, I think there are similar trends where companies all kind of look more on profitability, instead of just growth. But overall, there's no huge change compared to last quarter.\n\nAllen Li -- J.P. Morgan -- Analyst\n\nAll right. Thank you.\n\nOperator\n\n[Operator instructions] We have a follow-up question from the line of Yang Liu from Morgan Stanley. Please ask your question.\n\nYang Liu -- Morgan Stanley -- Analyst\n\nJust one very quick follow-up in terms of FX. I think management mentioned, that the China part of the business have a few percentage of the FX negative impact in the second quarter. And currently, given the sustained strong U.S. dollar, do you think this kind of a trend or this kind of impact will continue in the second half? And also in terms of the full year guidance, management retains is unchanged, but does it mean that actually, the company needs to deliver a little bit more than expected to reach the number given the FX headwind?\n\nJingbo Wang -- Chief Financial Officer\n\nYeah. So, for Q2, if the U.S. dollar-RMB exchange rate state where it was at the end of Q1, we would have a major nearly $1 million more in revenue that impact for Q2. So, when we give the full year guidance, we're assuming a constant FX exchange rate at where it was at the end of Q2.\n\nSo, we are not factoring in any further appreciation of U.S. dollar. And you're right, to deliver the same guided revenue, we need to work harder. The full year impact, if it stays where it is now, it will be close to $5 million.\n\nSo that means, we need to make $5 million more.\n\nYang Liu -- Morgan Stanley -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question comes from the line of Boris Svend from Bernstein. Boris, your line is open. Please go ahead.\n\nUnknown speaker\n\nHi. Good morning. Thanks for taking my question. This is Boris Svend from Bernstein speaking.\n\nI have two questions I would love to ask. The first is regarding, I think, the gross margin performance. I think it's very positive to hear about the reengineering and the cost opportunity. Just wanted to check, is this a one-off, or is this something that can be continued to gain in terms of further efficiencies on an ongoing basis? And the second question I had was broadly in the same vein around R&D.\n\nI would like to hear a little bit more about, how do you think about R&D and your investments in R&D going forward. Because it seems like you have a lot of good use cases. But does this mean that R&D continues to grow or when should we start getting efficiencies in R&D over time? Thank you.\n\nJingbo Wang -- Chief Financial Officer\n\nOK. The first question on GP margin, as I explained, the improvement since 2021 was mostly due to the engineering effort to -- also a procurement effort, but mostly engineering effort to optimize the technical design, so that to do the same thing we need less server or bandwidth resources a bit more. We'll continue to optimize the design. But there is this diminishing return of the optimization.\n\nSo, it will get harder. It's not like internet always gains the same amount of improvement over time, so it will get harder. And that's why we're not guiding kind of a higher GP margin. And in addition, as I mentioned before, our strategy is really to keep a healthy GP margin instead of trying to maximize GP margin whenever we can, so that we can keep enough competitive pressure our competitors as well.\n\nSo that's on GP margin. In terms of R&D, it's true, we are both investing for today and investing for the future. As we expand globally, we see more use cases, we see more regions, more different macroenvironment, so we need to invest to really optimize the performance there. But we also made a lot of investments for the future.\n\nAnd we expanded our R&D team so much, almost eight times in the past two years. Obviously, there are a lot of inefficiencies. So, looking forward, we will -- as I said, right, we'll be more focused and we'll work hard to remove some of the efficiencies. So, in simple terms, we do not expect R&D to continuing to drive as we expand our operation globally.\n\nAnd there should be actually a very strong operating leverage because a lot of the technology, a lot of the products we build can be leveraged across different use cases and across geographies. When we do the education solution we built in China, or we go to Eastern Europe or we go to South Asia, actually, it's essentially the same product with very little modification. So, actually, we're seeing, in the end, there will be a lot of R&D leverage. So, again, we do not expect R&D Q2 rise [Inaudible] revenue.\n\nOperator\n\nAll right, Boris. Do you have any follow-up questions?\n\nUnknown speaker\n\nThank you for that. That's very, very, very positive. Would you be in a position to maybe guide us on how are you thinking about the sort of the long-term, steady-state R&D and maybe sales and marketing?\n\nJingbo Wang -- Chief Financial Officer\n\nWe've always guided that for this business. We see that the long-term R&D would be somewhere around 30% of revenue which is high compared to most SaaS or PaaS businesses because we see really a very sophisticated technology. That's why we will maintain this relatively high level of R&D for even longer. And sales and marketing on the other hand should be lower given all the advantage we gained through R&D.\n\nSo, we think that will stay at around 20% in the longer, but that's not for the longtime steady state, if not this year, next year.\n\nUnknown speaker\n\nOK. Thank you very much. Thank you.\n\nOperator\n\nThank you. [Operator instructions] There are no further questions. I'll now turn the call back to the management team for closing remarks.\n\nFionna Chen -- Head of Investor Relations\n\nThank you, operator, and thank you, everybody, for attending our call today. As a reminder, the recording in the earnings release will be available on our website investor.agora.io. And if there are any questions, please feel free to email us. Thank you.\n\nJingbo Wang -- Chief Financial Officer\n\nThank you. Bye-bye.\n\nTony Zhao -- Founder, Chairman, and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nFionna Chen -- Head of Investor Relations\n\nTony Zhao -- Founder, Chairman, and Chief Executive Officer\n\nJingbo Wang -- Chief Financial Officer\n\nYang Liu -- Morgan Stanley -- Analyst\n\nBing Duan -- Nomura -- Analyst\n\nAllen Li -- J.P. Morgan -- Analyst\n\nUnknown speaker\n\nMore API analysis\n\nAll earnings call transcripts"
}