{
  "companyName": "Digital Realty Trust",
  "companyTicker": "DLR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/digital-realty-trust-dlr-q3-2022-earnings-call-tra/",
  "content": "Digital Realty Trust (DLR -1.02%)\nQ3 2022 Earnings Call\nOct 26, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Digital Realty third-quarter 2022 earnings call. Please note this event is being recorded. During today's presentation, all parties will be in a listen-only mode. Following the presentation, we will conduct a question-and-answer session.\n\n[Operator instructions] I would now like to turn the call over to Jordan Sadler, Digital Realty's senior vice president of public and private investor relations. Jordan, please go ahead.\n\nJordan Sadler -- Senior Vice President, Public and Private Investor Relations\n\nThank you, operator, and welcome, everyone, to Digital Realty's third-quarter 2022 earnings conference call. Joining me today on the call are CEO, Bill Stein; and president and CFO, Andy Power; chief investment officer, Greg Wright; chief technology officer, Chris Sharp; and chief revenue officer, Corey Dyer, also on the call and will be available for Q&A. Management may make forward-looking statements, including guidance and underlying assumptions on today's call. Forward-looking statements are based on expectations that involve risks and uncertainties that could cause actual results to differ materially.\n\nFor a further discussion of risks related to our business, see our 10-K and subsequent filings with the SEC. This call will contain non-GAAP financial information. Reconciliations to GAAP net income are included in the supplemental package furnished to the SEC and available on our website. One important item to note this quarter, while Teraco's results are consolidated into our financial statements since closing on August 1, we have excluded the platform's contribution from leasing backlog and other portfolio statistics that will be cited on this call and within our third quarter earnings materials.\n\nBefore I turn the call over to Bill, let me offer a few key takeaways from our third quarter. First, we achieved another quarter of record bookings, led by robust demand within the greater-than-a-megawatt segment. Second, the signs of improvement in our core portfolio continued to emerge in the quarter with 120 basis point sequential improvement and base data center revenues on a constant-currency basis. Third, with the closing on our investment in Teraco, we cemented our position as a leading provider of colocation and connectivity in South Africa.\n\nAnd lastly, our management team guided by decades of experience remains focused on navigating the current environment and maximizing the opportunity that lies before us. With that, I'd like to turn the call over to our CEO, Bill Stein.\n\nBill Stein -- Chief Executive Officer\n\nThank you, Jordan, and thank you, everyone, for joining our call. The world has experienced significant change so far in 2022, and Digital Realty is adapting to that change. Our business continues to be levered to powerful long-term secular demand trends, broadly driven by ongoing digital transformation and the growth in IT and data as our record leasing results underscore. We also have an unmatched global operating footprint that is supported by a strong development pipeline that allows us to capture opportunities wherever they may emerge.\n\nAs you all understand, global capital markets have become extraordinarily volatile and interest rates have risen sharply from historic lows to levels that we have not seen since 2008. At the same time, the U.S. dollar has strengthened against the euro to levels not seen in nearly 20 years. While you've had to look back over 30 years to find the last time the dollar was this elevated against the pound or the yen.\n\nThis volatility is being driven by a number of factors from a global economy emerging from the pandemic to the war in Ukraine and, of course, the heightened resolve of central bankers to tap down on elevated global inflation. And while the underlying fundamentals of our business remain strong and fortune can indeed favor the brave, experience has taught us that an ounce of prevention is worth a pound of cure. And we feel that it is most prudent today to adapt to the current environment by, one, prioritizing and sharpening the lens through which we view new investments to ensure that we are focused on the most strategic transactions that offer the highest potential risk-adjusted returns; two, by pressing our newly gained advantage on pricing and improving our internal growth profile and the longer-term durability of our cash flows; and three, by enhancing liquidity to ensure that we have the capital to meet the commitments that we have made to our customers while maintaining a comfortable cushion. With over 300 data centers around the world and a revenue base of over $4.5 billion, Digital Realty remains focused on how to best position ourselves for the long run.\n\nOur third quarter results were strong with a record $176 million of new bookings, making the third time in the past four quarters that our bookings have exceeded $150 million. Core FFO per share was $1.67 despite stiff FX and interest rate headwinds. On a constant-currency basis, we see evidence of the turn that is starting to take shape in our core portfolio. Digital Realty's global platform enables us to capture demand wherever it emerges.\n\nNorth America was the standout this quarter with our largest deals landing in the region. Multinational companies are using platform digital to enable digital transformation across multiple regions and metros globally. A good example of this is a large multisite enterprise build-to-suit transaction signed with a top-five financial services company that was inked in the quarter. Looking ahead, sales activity remains healthy as the secular trends driving data center demand remain in place.\n\nEnterprises continue their digital transformation with a growing preference for hybrid cloud architecture while cloud and connectivity providers continue to expand their infrastructure to better serve their customers around the world. But the world is changing. We are seeing sales cycle lengthen and global uncertainty extends decision times. Importantly, we are pushing prices higher to reflect tightening supply and rising costs.\n\nAdmittedly, some of the deals this quarter have been in process for many months and do not fully reflect today's environment. Today, new leases are being priced to reflect current market conditions. And while this will likely be in an iterative process, we expect the strong secular trends driving demand toward third-party data centers to continue for years to come. Andy will provide further color on our results and our outlook shortly.\n\nDuring the third quarter, we successfully completed the acquisition of a majority interest in Teraco, a leading carrier and cloud-neutral data center and interconnection services provider in South Africa. Teraco is a gem. With seven data centers across three metros and robust interconnectivity including more than 22,000 cross connects, seven cloud on-ramps, and direct access to seven subsea cables with more on the way. Teraco co has plenty of room to expand and is expected to generate some of the best growth within our portfolio.\n\nTeraco uniquely enhances our position in EMEA, complementing our existing operations in Eastern Africa through iColo, Western Africa through Medallion, and in Europe and the Mediterranean with Interxion, Altus IT, Lamda Helix, and our newest JV with Mine in Israel. These are all highly connected assets that leverage subsea cable landing and brings the world closer together, linking Europe, Asia, the Middle East, and Africa. Consistent with that strategy, we recently acquired land on the Greek island of Crete to create an interconnection hub in the Eastern Mediterranean to complement our existing hub in Marseille, along with developing hubs in Barcelona and Israel, which will feed additional traffic into Greece, the Balkans, Turkey, and Northern Africa. We expect that this highly differentiated project will generate strong double-digit returns while enhancing the value of our existing facilities in the region.\n\nMoving to our dispositions in the quarter. We sold a noncore mixed-use data center property in Dallas for $206 million and reached an agreement with digital core REIT to sell a 25% interest in our Frankfurt data center campus for $140 million with an option to acquire up to 90% of the same campus plus a 90% share of one of our Dallas data centers in a larger transaction valued at approximately $750 million. Both transactions are subject to unitholder approval with a vote expected for November. Funding organic new market entry through the disposition of stabilized facilities is our preferred source of capital.\n\nIt enables us to leverage platform digital to capitalize on value-creation opportunities and harvest capital once those facilities have stabilized. We also favor joint ventures like the one in Israel, where we leverage the local knowledge and expertise of our partner and pair that with PlatformDIGITAL to expand our global footprint and to better serve our customers. Before turning it over to Andy, I'd like to update you on our ESG success shown on Page 3 of our earnings presentation. We were honored to be recognized by GRESB as the sector leader for technology and science category in the Americas for the second consecutive year, maintaining our five-star rating from this leading investor-driven ESG benchmarking organization.\n\nWe are proud of our ESG-related efforts. And while the awards and recognition are nice, we are focused on ESG because our customers demand it, and because quite simply, it is the right thing to do. We are committed to minimizing our impact on the environment while delivering sustainable growth for all of our stakeholders. With that, I'd like to turn the call over to Andy to take you through our financial results.\n\nAndy Power -- Chief Financial Officer\n\nThank you, Bill. Turning to Page 5. As Bill noted, we signed record bookings of $176 million, with a $13 million contribution from interconnection during the third quarter, excluding the results from Teraco. The greater than a megawatt business in the Americas was the big driver of this quarter's record leasing at nearly $100 million signed.\n\nSub-one megawatt-plus interconnection accounted for 24% of the record quarterly bookings while the shell portion of a large multisite enterprise build-to-suit deal fell into our other category. Importantly, as we've discussed, we have meaningfully shifted our cadence toward further insulating our portfolio from the effects of inflation through the addition of CPI-based escalators into our new leases. While more than 95% of our portfolio includes rent escalation causes, less than 20% are specifically tied to CPI, while the balance are fixed. And our highest leasing volume quarter ever, we were able to achieve CPI-based escalators on 40% of the leases signed in the quarter, which demonstrates our resolve and our customers' acknowledgment of this important factor.\n\nThe balance of our leases signed in 3Q include fixed rent escalators. Moving on to markets. In North America, Portland and Dallas were particularly strong with large deals landing in each of those metros, while demand in Northern Virginia also remained high. In EMEA, totals were consistent with expectations, with particular strength in Paris, while San Paolo led in LatAm and Osaka led the APAC region.\n\nThese deals drove additional starts within our development pipeline, which grew to over 400 megawatts, but is also now more than 60% pre-leased mitigating much of the risk related to this capital spend and providing significant visibility into future revenue. As Bill touched on in his remarks, we signed four leases in the quarter with a large multinational financial services customer that has fully embarked upon its digital transformation journey. This large multi-site, multi-market build-to-suit transaction drove the upside in our greater than one megawatt North America leasing and also served to increase our development pipeline sequentially while reducing our anticipated yields. Importantly, this deal is structured as a yield on cost development supported by a long-term triple net lease to a strong investment-grade credit with fixed escalators, which serves to insulate Digital Realty from construction costs, and operating expense volatility.\n\nExcluding this transaction, our development life cycle average yield will be closer to the yield we presented last quarter. During the third quarter, we added another 103 new customers, continuing the 100-plus new logos we've added each quarter since the closing of the Interxion transaction two and a half years ago. Key customer wins in the quarter include a Global 2000 luxury goods maker is expanding its capabilities on PlatformDIGITAL to add data exchange with its strategic cloud providers to its existing capabilities. A Global 2000 multinational technology manufacturer is expanding its hybrid IT capability in multiple metros across two global regions with PlatformDIGITAL.\n\nA Global 2000 retailer is rationalizing its data centers and joining Platform Digital as part of its hybrid IT architecture to have greater proximity to a key cloud service provider while enhancing both performance and ecosystem benefits. A Global 100 top insurance company is rationalizing its data centers and moving to PlatformDIGITAL to gain strong access to two leading cloud service providers. Landing with us as a new logo in 4Q '21, a Global 2000 U.S. energy provider expanded into two more metros with Digital Realty as it continues to rearchitect its network as part of a long-term hybrid IT transformation.\n\nAnd a Global 2000 aerospace and defense contractor is rationalizing its data center portfolio while supporting the rearchitecture of its network and interconnecting with cloud providers on PlatformDIGITAL. Turning to our backlog on Page 7. The current backlog of signed but not yet commenced leases grew to $466 million by quarter-end as our record signings were partially offset by $90 million of commencement. The lag between signings and commencements moved up to 17 months for the leases signed in the third quarter due to the large multisite enterprise build-to-suit deal discussed by Bill a moment ago.\n\nExcluding this deal, our sign to commence live was under eight months, consistent with our historical average. Approximately 25% of our record backlog is slated to commence in the fourth quarter. While another 45% will commence in 2023, split fairly evenly throughout the first and second halfs of next year. Moving on to Page 8.\n\nWe signed $154 million of renewal leases during the third quarter that rolled down 0.5% on a cash basis. Renewal rates for sub-one-megawatt renewals were positive across each region and up 3.1% overall, demonstrating the criticality of these deployments and the differentiation of our facilities. This product segment has historically experienced steadily positive renewal rates and cash renewal rates have steadily increased throughout this year. After two consecutive three-plus percent bumps in 1Q and 2Q, the cash mark-to-market was weighed down by the greater than one-megawatt segment in the third quarter.\n\nDespite this result, we are confident in a slightly positive cash-releasing spread for the full year 2022. Importantly, we are encouraged by the general trajectory of market rents across our product line. We expect that the dislocation and volatility of capital markets coupled with rising costs and the reduced availability of power in several markets, including the world's largest market, Loudon County, Virginia, is constraining the ability to bring on new data center capacity despite the secular demand for data center infrastructure. With regard to power delivery in Northern Virginia, we are continuing to work with the primary power provider to ensure appropriate allocations with an acute focus on capacity needed to support our customers in this market.\n\nWe have an incredibly unique footprint in Loudon and a set of capabilities that we are working to tap into in order to take advantage of this backdrop of continuing tightening market fundamentals. In terms of operating performance, total portfolio occupancy rebounded by 80 basis points sequentially, driven by the strong commencements. These improvements in our occupancy come despite our active intention to grow our global colocation inventory in order to meet the growing demand of our expanding customer base. Same capital cash NOI growth fell 7.3% in the third quarter, negatively impacted by another 480-basis-point FX headwind.\n\nThis is disappointing on the surface but once the noise is removed, the improving operating picture that we have been painting starts to emerge. On a constant-currency basis, data center operating revenue, rental revenue interconnection was actually up 10 basis points year over year and improved by 120 basis points sequentially, demonstrating the turn that has started to take hold in our core operations. The sequential step-up was supported by a 50-basis-point occupancy improvement over the second quarter, along with the benefits of the positive releasing spreads we've seen year to date. Turning to our risk mitigation strategies on Page 9.\n\n56% of our third quarter operating revenue was denominated in U.S. dollars, with 21% in euros, 6% in Singapore dollars, 5% in British pounds, and 2% in Japanese yen. The U.S. dollar continued to strengthen over the last few months, negatively impacting same capital revenue growth by 530 basis points and NOI growth by 480 basis points year over year, as shown in our constant-currency analysis on Page 10.\n\nThis strong headwind contrasts with typical FX impacts of 50 to 100 basis points in either direction during the periods with more normal FX volatility. While the outsized depreciation of the euro this year has been a major driver of the headwinds for our P&L, it also represents the lion's share of our development pipeline. To be clear, we are operating and then investing locally rather than repatriating proceeds into U.S. dollars.\n\nOur operations, investment pipeline, and funding in locally denominated debt serve as a natural hedge. As we discussed on our call last quarter, given the growth of our global portfolio, along with heightened FX volatility, we took a closer look at our hedging strategy during the third quarter and executed additional swaps to mitigate our remaining FX exposure. In August, we executed a U.S. dollar-to-euro currency swap against an existing $1 billion tranche of 2027 notes outstanding.\n\nAnd in late September, alongside our 550 million U.S. dollar bond, we swapped those borrowings in the euro and Japanese yen, which also reduced the effective interest rate on those five-year notes to just 3% versus the 5.55% coupon achieved via the offering. In terms of earnings growth, we reported third-quarter core FFO per share of $1.67, which is 1% higher on a year-over-year basis and 3% lower sequentially due to the negative impact of FX, higher interest and operating expenses and the initial dilution we incurred from the closure of Teraco, which is consistent with the forecast we provided last quarter. On a constant-currency basis, core FFO was 6% higher year over year but down $0.01 sequentially.\n\nThe reported core FFO underperformance versus our prior expectation for the quarter was purely a function of greater-than-expected FX headwinds. Looking forward, we expect core FFO per share will remain under pressure from stiff FX headwinds given the appreciation of the U.S. dollar, though this should be offset by core growth. As you can see from the bridge on Page 11, we expect FFO will remain flat sequentially in the fourth quarter as FX and interest expense headwinds are partly balanced by NOI growth.\n\nAccordingly, we've adjusted our underlying guidance assumptions to reflect the continued pressures of FX and interest rates. We are also updating our core FFO per share guidance range for the full year 2022 to $6.70 to $6.75, reflecting a $0.075 per share adjustment at the midpoint of the range. Importantly, due to the sharper-than-expected move in interest rates since our last call, we are reducing our constant-currency core FFO per share range by $0.025 at the midpoint to a new range of $6.95 to $7 for 2022, which represents approximately 7% growth over 2021. We expect currency headwinds could represent a 400 to 500 basis point drag on full-year 2020 revenue and core FFO per share growth.\n\nA review of our leverage is on Page 12. Our reported leverage ratio at quarter-end was 6.7 times, while fixed charge coverage is at 5.5 times. We drew $400 million down from last September's forward equity offering as part of our funding for Teraco. So, pro forma for the remaining forward equity and adjusting for our full quarter's contribution from Teraco, our leverage ratio drops to 6.4 times while pro forma fixed charge coverage is 5.7 times.\n\nWhile leverage is above our historical average, we have bolstered our liquidity to ensure that we have the capital in hand to fund our committed development spend throughout the end of next year and maintain a comfortable cushion. Since our last earnings call, we have raised or received commitments for approximately $2 billion of debt capital at an effective blended average of just over 3%. These include more than $650 million of term loan commitments received subsequent to quarter-end. With cash and forward equity outstanding totaling more than $700 million, we have increased our current available liquidity to approximately $3 billion.\n\nWe expect to see leverage moderate back toward our longer-term target over time through a combination of noncore dispositions, joint ventures of core holdings, lease-up of available capacity, and the retention of free cash flow. As Bill discussed, the current capital markets environment and increased cost of capital have led us to sharpen our lens and prioritize new investments to those that are the highest strategic merit and offer the best potential risk-adjusted returns. Our financial strategy includes a diverse menu of available capital options while minimizing the related cost of our liabilities. The execution against this financing strategy reflects the strength of our global platform, which provides access to the full menu of public as well as private capital and enables us to fund our strategic objectives.\n\nAs you can see from the chart on Page 13, our weighted average debt maturity is about five and a half years, and our weighted average coupon is 2.4%. Approximately three-quarters of our debt is non-U.S. dollar-denominated, reflecting the growth of our global platform. More than 80% of our net debt is fixed rate and 97% of our debt is unsecured, providing the greatest flexibility for capital recycling.\n\nFinally, we have no meaningful near-term debt maturities and a well-laddered debt maturity schedule. We repaid the remainder of our 2022 debt earlier this month and have only a small Swiss bond maturing in 2023. This concludes our prepared remarks, and now we'll be pleased to take your questions. Operator, would you please begin the Q&A session?\n\nOperator\n\nWe will now open up the call for questions. [Operator instructions] And our first question will come from Jon Atkin of RBC. Please go ahead.\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nThanks very much. I wondered if it's possible to kind of frame the magnitude and the timing of the capex associated with all the leasing that you did during the quarter. And then maybe to kind of bring it home to the $3 billion in liquidity that you talked about sources of funding that incremental capex.\n\nAndy Power -- Chief Financial Officer\n\nHey, thanks, Jon. So, if you look at our development life cycle, it kind of lays it out region by region, and it has called, let's say, starts with a, call it, just $3.8 billion of, call it, approved projects. And that includes all the leases signed during the last quarter, as well as some projects that are not leased because it's only 60% pre-leased, roughly. If you kind of break that down over the next, call it, five quarters, you're spending about $2.7 billion of that.\n\nAgain, that is not all contractual spend. Only a portion of that is tied to customer contracts. So, if you exclude the, call it, assumptive or speculative spend, you call it closer to $2 billion. The $3 billion of liquidity I mentioned, that includes, call it, really, two parts, $1.7 billion of cash and revolver capacity and then $1.2 billion of the undrawn equity forward and new U.S.\n\ndollar term loan commitments in hand. So, that total just about $3 billion of contractual committed committee liquidity right now. That is everything we have at this minute. We're also continuing with our normal game plan of noncore dispositions, call it $1.5 billion over several quarters, as well as joint ventures on core holdings.\n\nSo, we feel pretty good about being able to fund this attractive growth for our customers.\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nAnd then secondly, on the 17-month metric that you mentioned in the earnings release and in the script about kind of essentially book-to-bill. And then putting that in the context of what Bill said about elongated sales cycles, how much of that is due to perhaps the lack of server availability on part of the customers or from your standpoint, delays in power procurement or ability to construct just given supply chain which is facing data center infrastructure?\n\nAndy Power -- Chief Financial Officer\n\nI would parse those in two topics, and I'd say coincidentally look like they're connected. What the long -- the extended book-to-bill really was our largest transaction was with a large multinational financial services customer. It's been in the works for -- really since the very beginning of this year. It's across four different locations.\n\nIt's incredible. It's very flatter to be part of their digital transformation, which is really going to cloud in a hybrid IT fashion. And given those projects are literally at land stage, we're designing to their specifications. That is what's extending that out.\n\nAnd if you carve those four transactions with that customer out, you really had a normal book-to-bill cycle. I think I'll let Bill comment on what he referenced in terms of, call it, what we're seeing in terms of the business in terms of some elongated sales cycle, though.\n\nBill Stein -- Chief Executive Officer\n\nIt's a little bit elongated, Jon. But as Andy said, if you were to strip out the four build-to-suits that are in this quarter, the effect on the book-to-bill this quarter would be minimal.\n\nOperator\n\nThe next question comes from Frank Louthan of Raymond James. Please go ahead.\n\nFrank Louthan -- Raymond James -- Analyst\n\nGreat. Thank you. Have you guys increased pricing on cross-connects as well? And if so, what is sort of the -- how much have you raised that? And what percentage are on the new pricing? And then going forward, you're fairly creative as far as the getting the effective rate on your financing down close to 3%. Is that -- what sort of expectation do you have, what sort of financing you can get going forward? Do you think you can keep it around that level? Thanks.\n\nAndy Power -- Chief Financial Officer\n\nThanks, Frank. Maybe Chris and I M&A cross-connect pricing and pricing dynamic overall. I would remind you we are essentially have been putting together some critical puzzle pieces through our M&A and have been aligning our cross-connect pricing across various regions, including the latest and greatest addition to PlatformDIGITAL with Teraco, the leading platform across South Africa. So, it's not necessarily a uniform step shift, but we have been investing in that platform, bringing more value to our customers, and driving commensurate increases in prices.\n\nBut, Chris, anything you want to add on cross-connect prices or data points there?\n\nChris Sharp -- Chief Technology Officer\n\nYeah, absolutely. Thanks for the question, Frank. A couple of points, right? We definitely take a customer-led approach on aligning value to the overall reach and overall offering they're able to provide them. I would echo Andy sentiment that like in the Westin Building, I think we've talked about it a couple of quarters ago, where we're driving that consistency of our overall interconnection products and capabilities in that market to really just delivering more value and you're going to start to see more revenue pick up in the next year on being able to uniformly bring that into the overall PlatformDIGITAL delivery capabilities.\n\nI'd say this next piece is more probably pointing to your question in EMEA, right, where we've been talking for some time now about increasing those prices and that's been performing great. And I think that's something that you'll continue to see growing, which is represented in the interconnection numbers that we put up this last quarter. So, you'll see that performing, you know, I think, much better over the course of the next year here.\n\nAndy Power -- Chief Financial Officer\n\nAnd just not to leave you without any numbers in terms of rate or growth increases. I mean, the ranges are pretty wide, but it's anywhere from called low mid-single digits to some -- definitely some outliers that are in the teens at the very least. I think the overall pricing environment is probably even more relevant to the heart of your question, though. We are continuing to see improving pricing power across our platform, whether it's in our, let's call it, less than megawatt enterprise colocation footprint.\n\nWe're, I'd say, call it, 10% to 15% sequential pricing changes in many markets and also seeing similar type of increases in the larger plus than a megawatt as well. In relation to your second question, I mean, big kudos to the Digital Realty Finance Capital Markets team, I mean, really call it staying nimble and acting fast in a volatile environment and really bringing together, call it, what is the $2 billion of capital in, call it, 60 days. We've also been tapping into call it incremental FX hedgings, given the more volatile FX world and a more global business. And we've been able to, call it, get our cost of capital, call it, roughly 3%.\n\nI don't -- I'm not sure that's a permanent number where we go from here. We've had, call it, the most rapid increase in the U.S. Treasury in 40 years or Fed funds rates in 40 years. But we're definitely using all the tools in our toolkit to maximize those menu of options and drive down the cost of our capital.\n\nFrank Louthan -- Raymond James -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThe next question comes from Dave Barden of Bank of America. Please go ahead.\n\nDave Barden -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks so much for taking the questions. I guess first question would be, Andy, can you walk us through how this bubble of lease renewals in 2023 is going to work out? I guess on supplement Page 23, 15% of annualized rent is coming due next year. You've had some success with positive lease renewing spreads year to date, and it'd be helpful to kind of get some comfort level there.\n\nAnd then I guess the follow-up would be, I think we were hoping to get some comfort on what your understanding with Dominion and Northern Virginia energy availability would be in the development pipeline on a go-forward basis, and if you could kind of share what your latest thinking is there. Thanks.\n\nAndy Power -- Chief Financial Officer\n\nThanks, Dave. Maybe I'll take them in reverse order because I think the second question ties a little bit into your first question. So, as a broader reminder, literally, I think it was 90 days ago to the day, we got the, call it, the newer news from Dominion on the pinch point in Eastern Loudon County on power deliveries. I can tell you we're a regular dialogue with the power company on a path forward.\n\nBut I would say also that the essence of the initial messaging remains intact that there's just going to be significantly less power provided to ongoing development in this region until 2026. The feedback we've received is that 2026, which should be back to more normal practices. So, this is not a permanent thing. It's due to transmission not generation, and that's what they've expressed to us.\n\nBut between now and then, it's going to be less supply in the biggest highest -- consistently high demand market. What that means and what we're seeing, and I alluded to it earlier is that the pricing power pendulum is shifting back toward us. And it's nice to be I believe, the largest incumbent, we call it, 500 megawatts of in-place capacity and just under, I think, 200 call it, coming due contractually expiration-wise in the next three years. When it comes to available capacity, we're -- we've sold quite well in that market.\n\nWe probably in hindsight, I wish we didn't do so well, but who knew this was going to come? I don't think any market participants really expected this. We do -- ourselves are not completely bearing and we do have a 200-megawatt parcel in Manassas that is to date in unaffected zone that -- which is really nice to have in times like this. And while I cannot guarantee it right now, I think we're optimistic that the responsible parties in Loudon will work with Digital to deliver on behalf of those customers that have signed contracts to grow with us and are sitting in our backlog. Turning to your second question, the pricing power pendulum again, I think, is continuing to move in the favor of the providers given that demand has been robust for so long, and the outlook is looking to be -- continue to be such and the supply has just been absorbed.\n\nYou pointed out the 15%, which is like less than a megawatt piece of our exploration schedule. I mean, that's -- in times like these, when prices are moving your friend, it's nice to have more bites at the apple to continue to ensure commensurate value is generated for our contracts. So, I feel that is usually our most network-dense sticky portion that consistently on the front end of our exploration schedules. I feel pretty darn good about that in terms of not only retention but price action.\n\nAnd I think even the PC didn't mention in the larger the megawatt, I think that my commentary around Northern Virginia and other tightening markets, I think, will also continue this trend of more positive cash-releasing spreads, which were positive in the first two quarters this year and remain positive on a full-year basis for 2022.\n\nOperator\n\nThe next question comes from Michael Rollins of Citi. Please go ahead.\n\nMichael Rollins -- Citi -- Analyst\n\nHi. Thanks for taking the questions. So, with some of the comments on demand but also a lengthening of the sales cycle, should investors look at Slide 5 a little differently in terms of the range of sales outcomes that you achieved over the last six to eight quarters relative to what the next six quarters or four quarters might look like? And then secondly, just given some of the comments that you provided on currency and on interest rates. If everything stays where it is currently, can you share a sense of what the potential headwinds could be on 2023 financial performance, thinking of revenue and core FFO per share? Thanks.\n\nAndy Power -- Chief Financial Officer\n\nSo, we'll do a reverse and I'll hit the currency and interest rates and then we can talk to pitch over to Corey about, call it, expectations on signings for, call it, the next several quarters. I mean, based on where we're seeing the currencies, I would say, especially precipitated by, I think, the activity in the sterling -- the British sterling pound over the last several, I still believe currencies will remain somewhat of a headwind in '23 relative to 2022. I don't think that's a permanent fixture. But based on the pace of, call it, governmental base rate increases and the currency differentials.\n\nSo, we haven't put that together nor the interest rate, call it, headwind. The interest rate one is -- excuse me, I should say, FX is going to be less of a headwind than my gut for 2023 than 2022. I mean, we're just absorbing, call it, 400 basis points. So, I would -- I don't have the exact number, but I don't see it being even half of that in the end of the day in the next year, unless you literally have the euro, and the pound literally dropped another 30% over the next 12 months.\n\nInterest rates, we have called 80-plus percent of our debt is fixed rate. We obviously saw last quarter looking to access capital across various markets and various currencies that align with our asset and revenue base to essentially buck some of the interest rate trend. But I mean, I think a good proxy is if you look at, call it, the quantity of our floating rate debt and you apply what the expected software increases over the next 12 months, that's probably going to be a ballpark in terms of headwinds on a year-over-year basis, Mike. In terms of -- I'll turn it back to Corey to how we're thinking about the range of outcomes on new signings.\n\nCorey Dyer -- Executive Vice President-Global Sales & Marketing\n\nYeah. So, thanks, Mike, for the question, and Andy for the -- let me go second. First off, I'll tell you that we don't forecast. I'm not going to try to play a game on what it's going to look like.\n\nBut what I would tell you from a demand and a pipeline perspective, our multi-quarter pipeline is really robust, may not robust. I'll say resilient and very healthy. And that comes off of our quarter that was our top quarter ever. The demand is healthy across all regions.\n\nThe one softness area would probably be in the small enterprises where they're having a little bit more -- I'd say they're more susceptible to the macro issues to the war in Europe. So, all those different items. And so, we saw those cycles lengthening, and that moderated some of our results in the somewhat megawatt. But broadly across the globe, we've got really strong hyperscale demand.\n\nWe've got strong demand and increasing demand from, I'll call it, our large $1 billion-plus multinationals. Our channel business is going really well. We're seeing new logos uptick from that cohort, as well as the possible demand from just new signings in that area. So, positive from a broad space, it's resilient and really healthy after our best quarter ever.\n\nAndy Power -- Chief Financial Officer\n\nThanks, Mike.\n\nOperator\n\nThe next question comes from Eric Luebchow of Wells Fargo. Please go ahead.\n\nEric Luebchow -- Wells Fargo Securities -- Analyst\n\nGreat. Thanks for taking the question. As we think about your -- the impact of inflation on your development costs next year and beyond, just I believe you have some VMI contracts renewing in early 2023 for your equipment spend. Maybe you could talk about what your expectations are there in terms of cost inflation on development as we enter the new year? And then second, as we think about the better pricing power and perhaps some constraints on new development in markets like Ashburn, are you in a position to perhaps have declining capital intensity in the next few years, which would kind of help reduce your needs for capital? Or how should we think about that dynamic as well? Thank you.\n\nAndy Power -- Chief Financial Officer\n\nSure. Thanks, Eric. So, the -- so we have numerous risk mitigations when it comes to our development and construction, which includes our vendor management inventory program, you mentioned other supplier contracts. At a more local level, bundling our projects with GCs and subcontractors.\n\nSo, when you put that all together in the current backdrop environment and we look at, call it, the next batch, which will be projects probably more back half of '23 into '24. On a fully -- including all baked into the whole basis of the project, we're still estimating that our costs are, call it, in the mid- to high single-digit-ish type of potential increase. Based on current outlook, and you touched a little bit on the supply demand dynamic, we believe that the rate of rate growth will outpace that or at least hold firm that our yields will hang in there and not be degradated by that inflationary impact. And that's something we're working day in and day out to keep focused on and working with our great vendors around the world on.\n\nWhen it comes to pricing power, when it comes to capital intensity, I would just echo really what Bill said at the outset of this call that in the last several months, the world has become more volatile. The capital markets have become more challenged. The talk of a looming recession, the war in Eastern Europe has continued, and we're raising the bar at Digital when it comes to focus on our strategic priorities. And we obviously have an incredible pipeline of projects.\n\nWe have probably one of the most distinguished land banks and runways for our customers. But I think there is a scenario very likely where we could spend a little bit less on speculative development. And because we're focused on projects that are delivering on those strategic priorities and delivering the highest risk-adjusted returns.\n\nEric Luebchow -- Wells Fargo Securities -- Analyst\n\nAll right. Thanks, Andy.\n\nOperator\n\nThe next question comes from Simon Flannery of Morgan Stanley. Please go ahead.\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nGreat. Thank you. Andy, I wonder if you could talk about the M&A market a little bit, both in terms of your ability to sell your assets, given the sort of the derating of the public company multiples. Have you seen any change in the market on the private side and how will that affect your fundraising? And you've obviously bought Teraco.\n\nHow are you thinking about acquisitions in terms of market expansions or expanding in existing markets over the next year or two?\n\nAndy Power -- Chief Financial Officer\n\nWe didn't share much on Teraco, and I'll start with that, and then we hand it to Greg to talk about both of your questions. Having spent some time down in region with the Teraco team, I think we're even more pleased with the incredible addition to our global platform, not only in terms of the most highly connected destinations across South Africa but we're a really fantastic team delivering on behalf of their customers, our customers and really growing that platform. I apologize. We did -- we obviously consolidated Teraco into our financials, but we did not roll them out into all the stats given we just closed and call it the middle of August.\n\nThat's coming in a quarter's time. So, please be patient with us on that. But I'll give it to Greg to maybe speak to your questions.\n\nGreg Wright -- Chief Investment Officer\n\nYeah. Thanks for the question, Simon. Look, I would say pricing on recent transactions in the private market have remained firm. We're fortunate to be in a sector that continues to experience growth and secular demand that really isn't common for other sectors, and we happen to have a product that's scarce in the market with growing demand.\n\nWhen you try to put some numbers to that, if you just look at the last two quarters in the second and third quarter, it's about $1.7 billion in transactions. And pricing has been very firm in terms of cap rate and per-KW basis. So, look, to date, look, the private capital, again, is looking to increase their exposure to the space where there's a limited amount of supply. So, to date, it's remained firm.\n\nOperator\n\nThe next question comes from Matt Niknam of Deutsche Bank. Please go ahead.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nGreat. Thank you for taking the questions. Just first on macro, and I think there may have been a question alluding to this before, but I just want to get a better sense whether you're seeing tightening financial conditions maybe starting to have an impact on your customers' propensity or willingness to invest further in Digital's transformation as they think about 2023, and whether it's varied across hyperscale enterprise or whether it's varied by geography? And then I have one housekeeping follow-up on Teraco, maybe, Andy, if you can talk about any incremental color you can give on expected contributions from Teraco perhaps in fourth quarter or maybe on a more annualized basis heading into next year? Thanks.\n\nAndy Power -- Chief Financial Officer\n\nSo, I'll handle the more mundane question on Teraco, and I'll pass it to Corey a little bit on buyer behavior in the current environment. So, Teraco, I believe, did for just about a month and a half, about $28 million of revenue, $16 million of EBITDA. It -- I would say it's signings. We're -- call it -- and again, do not include any of our numbers.\n\nWe call it just don't know the six megawatts plus a decent chunk of connectivity. It does have a very sizable backlog. Bit added, I think, a sizable amount to our construction called almost $0.5 billion of construction in progress. And based on what we're seeing, they're working on right now, feeling very good about the growth of that platform.\n\nCorey, do you want to handle on, call it, buyer behavior in the current part?\n\nCorey Dyer -- Executive Vice President-Global Sales & Marketing\n\nHey, Matt, thank you very much for the question. I would tell you that the financial situation changes, pricing rates that we've risen have all affected, as I mentioned earlier, kind of small enterprises the most in first. We haven't seen an effect our larger enterprises, the multinational $1 billion-plus companies, or our channel partners that are really our path toward the enterprise more broadly. So, I think on that, it's been moderated a little bit in the small enterprise.\n\nWhen you look at the hyperscale, we continue to see strong demand on the hyperscale across all regions. I think we mentioned Portland was our largest this past quarter. Paris, with significant in EMEA. Osaka was significant in AP.\n\nAnd so, we're seeing that across the board. We had large-scale deals, as mentioned earlier, with an enterprise customer in Texas and Virginia. And so, we're seeing larger scale deals. We're seeing it continue.\n\nJust a little bit of moderation, I think, in the small enterprises, but our pipeline is strong, resilient across all the different regions as well for you. So, I think that hits everything you asked, Matt.\n\nOperator\n\nThe next question comes from Aryeh Klein of BMO Capital Markets. Please go ahead.\n\nAryeh Klein -- BMO Capital Markets -- Analyst\n\nThanks. Bill, you mentioned sharpening the lens for new investments. Can you talk about, practically speaking, what changes there? And then, Andy, just on the minus 8.8% renewal spreads for larger deals. You mentioned that negotiations there began months ago.\n\nWhat would those rates kind of look like if they were done today?\n\nBill Stein -- Chief Executive Officer\n\nSo, sharpening the lens, I think practically, what you'll see is, over time, higher returns from the deals that we do and lower returning assets or investments dropping out of the mix. That's the practical implication. So, obviously, it's more complicated than that because we look at risk-adjusted returns. We look at what return should be in any given market, what type of -- whether it's a build-to-suit or a speculative development, how much preleasing there is, you know, whether there's any magnetic attributes to the customer.\n\nBut in general, I think you'll see over time, higher yields.\n\nAndy Power -- Chief Financial Officer\n\nAnd then, Aryeh, before I get to your question, I just want to apologize, I misspoke in answering Matt's question, we had two months, not a month and a half of the Teraco. Those numbers I quoted you in our financials. So, just want to clean that one up. So, as I mentioned before, the cash mark to markets have been moving in our favor for, call it, since we turned into 2022.\n\nAnd I would say, been strengthening along the way, and you saw that in our numbers, and you saw that in our guidance. That being said, as I've said before, we're not going to be universally at this minute without any negative market across any different product in any given quarter. I think the driver of the negative $8.8 million actually was a data center -- a one-off data center we acquired a couple of years back in Chicago. That customer's contract was in place.\n\nIt was above market at the time. The markets scribed not caught up to when it rolled. I think the more strategic and important story about that asset is that the -- we literally just greenlight the conversion of some of the shelf space into growing our colo footprint in the suburbs of Chicago, which has been a really great success more recently. To go on to your question on, call it, I think it's bigger deals, price action in just the past year, not our biggest deal that I mentioned, which is the called build-to-suit.\n\nBut I think our second biggest deal, which was a sizable plus megawatt deal. That transaction in North America signed and caught almost 18% net effective rates higher than a similar size transaction did, call it, a year prior. And the remaining space in that, actually, facility is probably being marketed up another 10%, 15%. Now, we have an in that remaining space.\n\nSo, you're seeing a quick reversal in some of these markets where, again, demand is -- continually is robust and diverse, and the supply is being whittled down.\n\nOperator\n\nThe next question comes from David Guarino of Green Street. Please go ahead.\n\nDavid Guarino -- Green Street Advisors -- Analyst\n\nThanks. On the inclusion of the CPI linked to rent escalators, is that a trend you're seeing from hyperscale tenants? Or is that more heavily skewed toward the zero to one megawatt bucket? And then the second question is, switching gears, just with the supply and power restrictions and a few of the top markets like Northern Virginia, do you think that's why you saw such strong demand in Dallas and Hillsboro this quarter? And are there any other spillover markets that you're seeing early signs of demand picking up that maybe they could have went to NOVA, if there was capacity there?\n\nAndy Power -- Chief Financial Officer\n\nThanks, David. So, first off, CPI was a predominant term, I would say, mostly in our European footprint, even before inflation was such a buzzword. Hence -- and that's the majority of, call it, just under 20% of our in-place contracts that have CPI escalations. We've been, call it, in the face of the current environment, making this a priority in our customer discussions.\n\nAnd it's not -- we're seeking that on larger contracts, as well as -- larger contracts, as well as smaller contracts. I would tell you, on a smaller contract, that already likely had a shorter duration, i.e., two years, three years, it's probably a little bit less a priority because you get another bite at the apple depending on the market rates. But we're trying to push it into those contracts. But if you look at our signings, we had a record quarter, 176, and 40% had CPI escalation.\n\nSome of them had capped or, call it, 2% or 3% on the floor and call it, 5% or 6% on the cap. But we were able to include in a significant percentage of our greater than one-megawatt signings this CPI escalation. And those look greater than one-megawatt science are typically the longest conference call it, 10 years. Hence, where it's the most needed because we won't get another opportunity to reset to the appropriate market rates for a fair bit of time.\n\nWhen it goes to NOVA spillover Dallas, Portland, I don't think -- our activity -- I would not describe our activity as spillover activity. The Dallas activity, a good portion of that was this build-to-suit customer demand. That customer picked -- they wanted multiple cities, so they're always going to pick not just NOVA. And then the Portland demand was very, call it, locational sensitive.\n\nI do think you -- and this is a -- I mean, you don't typically buy data centers like rushing to the grocery store and grab some of the shelf and run into the checkout. So, in the last 90 days, when this NOVA power issues come on the scene, I think the spillover effects are still playing out as we speak. I would say we see more of the early interest of spillover effects to, call it, Atlanta where we have, call it, almost 30-megawatt shell capacity, Northern New Jersey, potentially Chicago. Dallas could be in the mix as well.\n\nBut -- as well as -- I mean, nearby spillover tech in Manassas, we have 200 megawatts.\n\nOperator\n\nThe next question comes from Michael Elias of Cowen and Company. Please go ahead.\n\nMichael Elias -- Cowen and Company -- Analyst\n\nThanks for squeezing me in, guys, and congrats on the leasing. Just two questions for me. First is, as you think of Northern Virginia and the power delays, you mentioned how the conversations are evolving with Dominion. But how are the conversations going with the customers themselves who pre-leased capacity? Is there any risk to those leases maybe being canceled or anything like that? And then second, your leverage is now running around 6.7 times, or 6.4 if we adjust for forward.\n\nBased on the conversations you've had with the rating agencies, what's the highest level of leverage that you can hold before you run the risk of maybe being downgraded or losing that investment-grade status? Thank you.\n\nAndy Power -- Chief Financial Officer\n\nThanks, Michael. I think we saved the best for last. So, happy to take through both these. So, the -- I think the customers are obviously alarmed, right? Most of these customers probably never experienced anything like this.\n\nBut at the same time, I think they're incredibly grateful that they're in our hands and not some upstart competitor. And I know I'm biased in saying that, but I really mean it when. We're the largest in the market with a diverse set of campuses, of, call it, half a gig of IT load and a truly experienced team holding their hands through it. And I'll reiterate what I said before, while I cannot guarantee it right now, we are optimistic that the responsible parties in Loudon will work with Digital to deliver on behalf of all of these customers.\n\nAs it relates to your second question, we are -- obviously, the leverage has ticked up a little bit here. We are -- this is not a new normal. This is not where we desire to be. We've had a lot of moving parts in our capital stack with asset sales, joint ventures, acquisition closings with partial periods.\n\nWe still have, call it, $0.5 billion of equity forward, which we've not drawn down. And we see a path to return to target leverage through leasing up our vacant capacities. We had -- you saw the occupancy, which was a great stack, really moving the needle on a sequential basis. We are seeing a more friendly mark-to-market in our cash flows.\n\nAnd we're going to do what we've been doing for a long time, which is capital recycling and tapping into our private capital sources. We sold billions of dollars of noncore assets and joint ventures. And that's going to continue to be our playbook. And we think there's a great lineup of partners that want to work with us to call it, CR leverage to be a capital partner to Digital Realty.\n\nThat will bring that leverage back down toward target levels.\n\nOperator\n\nThat ends our question-and-answer portion of today's call. I'd now like to turn the call back over to CEO, Bill Stein, for his closing remarks. Bill, please go ahead.\n\nBill Stein -- Chief Executive Officer\n\nThank you, Andrea. I'd like to wrap up our call today by recapping our highlights for the third quarter, as outlined on the last page of our presentation. First, digital transformation remains an important secular driver of our business and drove record quarterly bookings. These additional commitments are reflected in our growing development pipeline and the high level of preleasing.\n\nSecond, we continue to enhance our global platform with the closing of Teraco, giving Digital Realty the leading position in South Africa and a critical complement to our existing capabilities elsewhere in EMEA. Third, we continue to execute with improving results in our core data center business, though these improvements are masked by foreign exchange headwinds. Finally, the capital markets are very -- were very volatile in the third quarter, and we've taken action by adding significant liquidity to our balance sheet and prioritizing our new investments. Before signing off, I'd like to thank our dedicated and exceptional team here at Digital Realty, who keep the digital world turning.\n\nI hope all of you will remain safe and healthy, and we look forward to seeing many of you at Nareit next month in San Francisco. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJordan Sadler -- Senior Vice President, Public and Private Investor Relations\n\nBill Stein -- Chief Executive Officer\n\nAndy Power -- Chief Financial Officer\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nFrank Louthan -- Raymond James -- Analyst\n\nChris Sharp -- Chief Technology Officer\n\nDave Barden -- Bank of America Merrill Lynch -- Analyst\n\nMichael Rollins -- Citi -- Analyst\n\nCorey Dyer -- Executive Vice President-Global Sales & Marketing\n\nEric Luebchow -- Wells Fargo Securities -- Analyst\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nGreg Wright -- Chief Investment Officer\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nAryeh Klein -- BMO Capital Markets -- Analyst\n\nDavid Guarino -- Green Street Advisors -- Analyst\n\nMichael Elias -- Cowen and Company -- Analyst\n\nMore DLR analysis\n\nAll earnings call transcripts"
}