{
  "companyName": "Roku",
  "companyTicker": "ROKU",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/roku-roku-q3-2022-earnings-call-transcript/",
  "content": "Roku (ROKU 0.34%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nHello. Thank you for standing by, and welcome to the third quarter 2022 Roku earnings conference call. [Operator instructions] Please be advised that today's conference may be recorded. I would now like to hand the conference over to your speaker today, Conrad Grodd, vice president of investor relations.\n\nPlease go ahead.\n\nConrad Grodd -- Vice President, Investor Relations\n\nThank you, operator. Good afternoon, and welcome to Roku's third quarter 2022 earnings call. I'm joined today by Anthony Wood, Roku's founder and CEO; and Steve Louden, our CFO. Full details of our results and additional management commentary are available in our shareholder letter, which can be found on our investor relations website at roku.com/investor.\n\nOur comments and responses to your questions on this call reflect management's views as of today only, and we disclaim any obligation to update this information. On this call, we'll be making forward-looking statements which are predictions, projections, or other statements about future events, financial outlook, our investments, our operating expenses, our business strategy, future market conditions, and macro environment headwinds, such as economic uncertainty and inflationary pressures. These statements are based on our current expectations, forecasts, and assumptions and involve risks and uncertainties. Please refer to our shareholder letter and our periodic SEC filings for information on factors that could cause our actual results to differ materially from these forward-looking statements.\n\nWe'll also discuss certain non-GAAP financial measures on today's call. Reconciliations to the most comparable GAAP financial measures are provided in our shareholder letter. Finally, unless otherwise stated, all comparisons on this call will be against our results of the comparable period of 2021. Now I'd like to hand the call over to Anthony.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nThanks, Conrad, and thank you, all, for joining us today. I'd like to provide some high-level thoughts on the macro environment, Roku's business model, and our ongoing conviction in the streaming platform opportunity. In Q3, advertisers pulled back on spending, consumers were further pressured by inflation and overall economic uncertainty remained high. We expect these conditions will continue and are likely to worsen in Q4.\n\nAlthough these factors are temporary and the ad market is expected to bounce back, we will continue to take steps to reduce our opex growth. In addition, we are sharpening our spending focus on the projects that will drive the most growth and enhance our leadership position. Our opportunity as a streaming TV platform is very large and remains intact despite the current ad pullback. We are not idly waiting for the ad market to improve.\n\nWe added 2.3 million active accounts in Q3, which was above net adds in both 2019 and 2021, and we grew streaming hours on the Roku Channel by more than 90% year over year. We're making good progress internationally, demonstrated by our results in Mexico. Last month, we launched the Roku Channel in Mexico, a milestone that is the result of meaningful scale and engagement that we have built there in the past three years. We continue to build our market-leading competitive assets and to attract top industry talent as demonstrated by the recent addition of Charlie Collier as president of media, and before that, Gidon Katz, our president of consumer experiences.\n\nAll of this positions us to return to stronger revenue growth when the ad market returns. We continue to innovate and execute. Last month, we launched new smart home products to build new service revenue streams. We believe every device in the home will be connected by software and services but it's still early days.\n\nFor example, only about 20% of U.S. households have IP cameras. Additionally, the existing smart home experience is fragmented and difficult to use. As the No.\n\n1 selling smart TV OS in the U.S., we have the technology and expertise in hardware, software, and services to deliver a smart home ecosystem that is simple, powerful, and delightful. We launched in this category with strong retail distribution at Walmart, America's No. 1 retailer. Roku is now the No.\n\n1 smartphone brand by shelf space in nearly 3,500 Walmart locations. As with our TV streaming business model, we will build scale with our devices and monetize through smart home services, which we expect to become a very large market. We have spent years building a business designed to benefit everyone in the TV streaming ecosystem. We are extending our ecosystem.\n\nAnd as we look ahead, we remain confident that our strategy and business model are the best way to maximize the opportunity to deliver both growth and profitability to our investors. Finally, we announced earlier today that after nearly eight years with Roku, Steve Louden will leave in 2023 after helping us recruit and transition his role to a successor. You may recall that Steve previously decided to leave Roku three years ago when he relocated to Seattle. With the onset of the pandemic, he decided to stay.\n\nI'm grateful for his leadership and for building a world-class team, which he will continue to lead until his departure, and we all wish him well. Thank you, Steve.\n\nSteve Louden -- Chief Financial Officer\n\nThanks, Anthony. I appreciate the kind words. Roku continues to grow, adding 2.3 million active accounts in Q3, which was above both 2019 and 2021 levels, ending the quarter with 65.4 million. This growth was driven primarily by TV sales in both the U.S.\n\nand international markets, along with improved active account retention. Meanwhile, Roku player unit sales remained above pre-COVID levels and the average selling price decreased 6% year over year as we continued to insulate consumers from higher cost to prioritize account acquisition. Roku users streamed 21.9 billion hours in the quarter, an increase of 21% year over year as we continued to outperform viewing hour growth of traditional TV. In Q3, total net revenue increased 12% year over year to $761 million.\n\nPlatform revenue was up 15% year over year to $670 million, representing 88% of total revenue. While platform revenue came in above our expectations and was a positive given the difficult macro environment, the advertising business continues to grow more slowly than our beginning of year forecast due to the current weakness in the overall TV ad market and the ad scatter market in particular. Player unit sales were down 2% year over year on a sell-in basis, while player revenue was down 7% due to a mix shift toward lower-priced units. Total gross margin was 47% in the quarter.\n\nQ3 platform gross margin of 56% was stable sequentially but down 9.2 points year over year. This reflects weakness in the ad scatter market and a greater mix of video advertising in Q3 2022 compared to a year-ago period. Q3 2021 was also a tough comp due to the launch of new streaming services which drove significant growth of higher-margin M&E and content distribution. In Q3 2022, we recognized a negative 606 adjustment due to lower SVOD industry expectations.\n\nAs a reminder, the 606 adjustment in Q2 was driven by our expectations for lower Roku TV and player unit sales due to the macro environment and both had a similar impact on our platform gross profit in their respective quarters. Q3 player margin was negative 19%, which was down roughly 4 points year over year as we continue to prioritize account acquisition and insulate consumers from higher cost caused by supply chain disruptions and inflationary pressures. The year-over-year compression in platform and player margins resulted in gross profit growth of negative 2% year over year versus the 12% year-over-year growth in total net revenue. Q3 adjusted EBITDA was negative $34 million and we ended the quarter with more than $2 billion of cash.\n\nLet me turn to our outlook for the fourth quarter. Total net revenue of $800 million, gross profit of $325 million with gross margin of 41%, and adjusted EBITDA of negative $135 million. The holiday season is typically the strongest period for most companies, including Roku, but we expect this season to be different. We believe that macro uncertainties and inflationary pressures will continue to negatively impact consumer discretionary spend and these pressures will further weigh on advertising budgets, particularly the ad scatter market.\n\nWe expect these conditions to be temporary, but it is difficult to predict when they will stabilize or rebound. For our player business, we anticipate lower sales year over year, and margins that will be significantly lower sequentially, primarily due to traditional holiday promotional pricing. For our platform business, we anticipate that these macro pressures will offset what would ordinarily be seasonal tailwinds. And as a result, our platform revenue will be slightly down on a sequential basis.\n\nIn addition, our player and platform revenue in Q4 is typically back-end loaded, which further reduces our visibility. As we indicated last quarter, we will continue to slow headcount and operating expense growth in response to the macro environment while continuing to make disciplined investments in our most strategic projects that will increase both the market penetration of our platform and long-term customer value. Despite near-term headwinds, we continue to make progress toward capitalizing on the opportunity created by consumers and advertisers moving to streaming. Roku will continue to invest in innovation and driving our leadership position forward, which we believe is the best way to deliver both growth and profitability to our investors over the long term.\n\nOn a personal note, it has been an incredible journey and a privilege to be part of Roku's success from pre-IPO to becoming a public company and a leading TV streaming platform. As Anthony noted, I will be here until my successor is in place sometime next year. In the meantime, I look forward to continuing to execute on our mission and working with our terrific team. With that, let's take questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator Instructions] Our first question comes from Justin Patterson with KeyBanc Capital Markets. You may proceed.\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thank you very much. Two, if I can. Anthony, I appreciate the comments you gave on smart home.\n\nHowever, it's a crowded space with some large competitors. Why focus on this category versus investing deeper into Roku's international expansion and strengthening the ad tech? What type of return do you see from this investment? And then for Steve, it's been a pleasure working with you. I wanted to double-click on some of your opex comments. I realize it's going to take time for that to flow through.\n\nBut how do we think -- how are you thinking about the right level of opex growth against, say, revenue growth and margin preservation as we head out of Q4 and into 2023? Thank you.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nHey, Justin. Thanks for the question. I will answer the question on smart home and then turn it over to Steve for opex. So I think -- the way I think about the smart home business is that it's a natural extension of Roku's ecosystem and a natural business for us to be in.\n\nI mean, -- and for a few different reasons. Let me just highlight some of them. So first of all, Roku has 65 million active accounts consisting of smart TVs, which is a great smart device to build on in terms of expanding around the home with other smart devices. So we have an early start.\n\nWe are probably one of, if not the most, popular smart home device in homes today. And then also, it's a big opportunity. I mean, it's still early days. For example, about 20% of U.S.\n\nhomes have a smart camera. But the whole smart home experience today is early and complicated. It's way too complicated. And it's got a lot more potential than the way the existing competitors are thinking about it.\n\nAnd so I just think it's an area. Making complicated things simple is something that Roku really excels at. And that's another big opportunity for us to be successful here, another way for us to be successful. It also -- if you think about all the assets we have, we have -- we're great at software services.\n\nWe're good at building very simple and usable devices and services. And all of those things directly apply to the smart home business. So we have our brand. I mean, we just -- it's a very natural extension and we've already built a lot of the pieces we need.\n\nAnd then finally, in terms of the opportunity, there's going to be -- it's going to be a big market for smart home services. And so it's -- kind of over the long term, it's the way for us to build out new high-margin service revenues. And then if you think about it tactically, our business -- at our business model level, our business model is to sell devices, smart devices that are low cost and great value for customers and then monetize those through service revenue streams. And so this is just, again, a natural extension.\n\nAlso, extending our ecosystem by allowing our customers to add other devices to their account should -- will also have the benefit of increasing the retention of our existing customers, as well as obviously building service revenue streams. So -- and it's not a particularly big investment for us because we're leveraging a lot of what we've already done. And so -- but yet, it's an option on something that could be very big and a very high return. And so that's why we're doing smart home.\n\nIt's a great opportunity. And then Steve, did you want to talk about the opex question?\n\nSteve Louden -- Chief Financial Officer\n\nSure. Yeah. Hey, Justin. I know you've been tracking us a while, but just -- I think taking a step back here on just the kind of trend over time.\n\nBefore the recent ad market downturn, we'd been performing well, consistent high revenue and gross profit growth and reinvesting that gross profit back into the business. As Anthony talked about, there's a significant opportunity out there ahead of us. And when the pandemic hit, what we did is we've greatly curtailed that opex growth given the uncertainty at that time, and effectively deferred some investments we would have otherwise made. When we thought that the business in the world was kind of moving out of the pandemic-related disruptions, we started to go ahead and invest again in a more substantial way, try to get through some of those deferred investments that we've pushed off during the pandemic.\n\nAnd so we ramped up headcount hiring, which is the primary way we invest in, in additional new innovation and work on our project road map. When we saw the ad market downturn in Q2, that was really kind of the confluence of high inflation, economic uncertainty, geopolitical issues around energy, and the war in Ukraine. So we pulled back significantly immediately on the opex growth. That manifested itself in relative, basically flat headcount levels in Q3.\n\nAnd we're continuing to look at ways to take steps to lower that opex growth. But notably, the opex year-over-year growth rate is still high but that's largely the result of that hiring increases late last year and early this year. So we're focused on driving the sequential opex growth rate down. And then we're making sure that we're focusing our remaining investment on the high-potential projects that are going to lead to further growth and further bolster our leadership position.\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nGot it.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nJustin, I'll just add that -- I mean, these are tough times, especially in the ad market, certainly impacting us, as well as others. But the transition to streaming and the creation of a small number of successful large-scale streaming platforms is a huge opportunity for us. And it's not changed by the current economic cycle. So that's why we're being very disciplined about where we spend our money but continuing to focus on strong account growth, strong engagement growth is positioning us well for when the market turns around.\n\nI think it would be a mistake -- although we're being very disciplined and we're definitely looking at opex very carefully. We don't want to pull back so much that we start impacting the key pillars that we're building out with our goal of becoming a very large and profitable company.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Aaron Kessler with Raymond James. You may proceed.\n\nAaron Kessler -- Raymond James -- Analyst\n\nGreat. Thank you. In terms of the Q3 kind of upside to ad revenues, can you just discuss kind of where the upside came from, maybe the linearity throughout the quarter as well? I mean, just any thoughts on revenue by ad verticals that you are seeing as well. Thank you.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nSteve, do you want to take the question on Q3 performance? I can talk about the ad market.\n\nSteve Louden -- Chief Financial Officer\n\nYeah, sure. Just in terms of Q3 ad performance, I mean, certainly, starting in Q2, kind of mid-Q2, we saw businesses react to the greater level of uncertainty by pulling back on opex in general and including the TV ad scatter market was impacted. That's something that, by its nature, is easy to turn off and then easy to turn back on when things get better or businesses get more comfortable. So we are happy with Q3 performance given the headwinds.\n\nBut that outlook was placed at a time where that trend was just materializing. So we feel like we've been performing well in terms of -- so we looked at some external data from SMI. It showed us outperforming the traditional TV ad market, as well as being at or slightly above the connected TV ad market. So I think we continued to perform well despite all these headwinds.\n\nAnd that's really where we've seen the results come in relative to a pretty uncertain outlook at the time we did last earnings call.\n\nAaron Kessler -- Raymond James -- Analyst\n\nGot it. I'd squeeze in that May, August, September were kind of better than when you initially gave guidance -- some things end of July?\n\nSteve Louden -- Chief Financial Officer\n\nYeah. We haven't really commented on the specific trends within the quarter. Certainly, there's a lot of uncertainty. And so there's been a lot of changes, I think, especially you mentioned some of the questions around the verticals.\n\nWe've seen kind of the strength or weakness of certain verticals. There's been a wide distribution of the impact. I mean, pretty much every vertical is down when you look at the ad spend but they're down very different levels. And so I think that it's been an ever-shifting landscape by verticals.\n\nAnd so it's really kind of hard to make a global statement about the overall trends.\n\nAaron Kessler -- Raymond James -- Analyst\n\nYeah. Got it. Great. Thank you.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nThis is Anthony. So we are seeing -- like Steve said, there's a lot of uncertainty. It's hard to say exactly what's going to happen in Q4, but we are seeing signs that Q4 is going to be worse in terms of the ad market than Q3 was. I mean, we're seeing lots of big categories pull back, telecom, insurance.\n\nWe're even seeing toy marketers planning on reducing their spend in Q4. I think traditionally, Q4 is a very -- the holiday season is typically the strongest period for a lot of companies, including Roku. But companies are pulling back their ad budgets because they're uncertain if there will be a recession or not. And so a lot of Q4 ad campaigns are being canceled.\n\nAnd so that's why -- so I think this holiday season, given the unique set of environments and characteristics, is probably going to be different than the typical holiday season.\n\nAaron Kessler -- Raymond James -- Analyst\n\nThanks so much.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Shweta Khajuria with Evercore. You may proceed.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nHello. Can you hear me?\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nYes. Go ahead.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nI'm sorry if my questions have been asked but let me try two, please. One is, Steve, could you talk about how much visibility you have and how that has changed over the course of the year? So as you sit today, how much visibility across your revenue segments do you have from player to video ads to M&E to content distribution? And then, Anthony, how are you thinking about prioritizing the different initiatives, whether it is the Roku Channel to the ad platform to the operating system and enhancing user experience and also international? Has your thought process changed with the change in the macro environment in terms of how you're prioritizing? Thanks a lot.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nSure. Steve, do you want to start?\n\nSteve Louden -- Chief Financial Officer\n\nYeah, sure. Thanks for the question, Shweta. The -- certainly, with the increased amount of uncertainty out there, both on the consumer side, as well as on the business and the advertising side, visibility has clearly diminished out there in the economy. Most pronounced is -- we talked about that briefly.\n\nThe ad scatter market is -- by its nature is uncommitted, tends to be in quarter spend. And so a good example on that is kind of before disruptions happened, before the ad pullback, we had a pretty good handle based on our experience over the years about what's the pipeline, what's the curve in terms of what percentage of bookings that we had at certain points before the quarter started and during the quarter. Those kind of historical pipeline curves are sort of largely thrown out the window these days where there's tremendous uncertainty. And as I mentioned on that prior question, there's a big shift in verticals, especially depending on the level of uncertainty, whether there's continued supply chain disruptions, all that.\n\nAnd so the ad scatter business, certainly, the visibility has been most impacted by that, although obviously, we've made changes to longer-term things like in our 606 modeling around the market size expectations out there in the industry have shifted and we had that change in Q2. And in Q3, we made some updates based on SVOD industry expectations as well. So you've got -- most pronounced, you've got short-term visibility issues and then some other kind of, let's call it, near-term to moderate-term one-time changes in expectations just given the way that the world is moving at this point.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nAnd then, Shweta, your question on how we think about priorities given the current macro environment. I mean, our priorities have not really -- have not changed. And so just to recap those, a big -- the kind of the first pillar of our business is built on scale of active accounts. And there's still lots of room to grow active accounts internationally, of course, but also domestically.\n\nAnd so that's the first area of continued investment for us. So that would be things like our Roku TV program, which has been super expensive. We're -- sorry, super effective, not expensive, super effective. We're the No.\n\n1 selling TV operating system in the United States built on the strength of our purpose-built TV operating system, purpose-built for TV computing platform. And again, just to recap for those who don't know our strategy here. If you think about when new computing platforms emerge, like happened with PCs, you get a lot of initial contenders or legacy businesses. And then they consolidate down to a handful of -- small handful of winners.\n\nAnd we saw that with Windows and Mac on PCs. And then on phones, it was iOS and Android. And on TVs, Roku is the No. 1 streaming TV OS platform.\n\nSo continuing to drive that both domestically and internationally by signing up more partners, entering new markets, creating more innovative products. So the Roku TV program is a big thing for us. And we made good progress in the quarter. Active accounts grew 2.3 million, both from TVs and players and internationally and domestically.\n\nSo growing active accounts for Roku TV program. And then another big area of investment for us is increasing the value of a customer. So we have lots of customers and we keep adding more customers. But we can also increase the value of those customers.\n\nAnd that's the mission of our consumer experience team, which we've been putting a finer focus on over the last year, led by Gidon Katz. And there -- what they're investing in is things that increases engagement in our UI, so engagement in the platform overall and engagement in the UI as well. And so making our -- making the user interface -- our platform user interface more effective in helping consumers find content to watch and more effective in terms of building out monetization options for us and just building the value of the customer by using all the levers available because we control the platform UI and there's a lot of ways to do that. And that's been going well, a lot of progress there.\n\nAnd then another area of -- sorry. And then on active accounts, international, of course, is a big -- continues to be a big area of focus for us and we're making good progress. I mean, we highlighted successes in Mexico in our shareholder letter. We're the No.\n\n2 platform in Mexico -- I'm sorry, we're the No. 2 selling TV OS in Mexico now. We continue to add more TV partners. We have a goal of passing Samsung.\n\nThey're currently No. 1, but I think we can pass them just like we did in the U.S. and other markets. And because we've been making the progress in building scale in Mexico, we launched the Roku Channel, which is kind of one of the steps in monetizing our platform in the market.\n\nSo continuing to focus on global expansion -- so active accounts, grow the value of a customer, increase engagement. And then finally, of course, there's monetization across the platform. And one of the key ways we do that is through the Roku Channel. So the Roku Channel continues to be a big success for us and an area that we continue to invest in.\n\nAnd then content is an area of focus for us. And we're getting -- we're obviously becoming a bigger player in the content industry in terms of licensing rev share, originals. But that spend has all done commensurate with the scale and size of the Roku Channel and appropriate to that business model. So I think -- so that's some of the areas that we're focused on.\n\nSo it's basically growing scale of the platform, increasing the value of a customer, and just innovation and competitiveness overall.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thank you, Anthony. Thanks, Steve.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Vasily Karasyov with Cannonball Research. You may proceed.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nThank you. Steve, can I ask you to unpack the platform revenue growth by component, please? Maybe tell us how much monetized with your ad impressions grew in the quarter. You used to give out that metric. And then did M&E grow and did distribution revenue grow and maybe rank order by growth rates, if possible?\n\nSteve Louden -- Chief Financial Officer\n\nVasily, happy to give you some more color. We obviously don't disaggregate that platform segment due to 606 disaggregation issue. But what we saw this quarter, obviously, we talked about the ad scatter market is challenged. And so that's been a significant driver of the slowing growth in platform overall.\n\nM&E, we had a tough comp compared to last year, where we had some services that had launched mid to late last year. But M&E continues to grow, and it's high margin. And from a content distribution standpoint, that is driven by the active account growth and streaming hour growth. So notwithstanding some of our expectations in the future based on SVOD industry changing expectations and some consumer behavior, that has held up as well.\n\nSo the main story here on the platform segment and its growth trend is largely driven by the ad scatter market. Again, a reminder that upfront commitments have been strong this year, over $1 billion with that. In general, each year, our exposure to the -- or our mix of the upfront to ad scatter has been moving toward upfronts. And so there's kind of a short-term, long-term disconnect here.\n\nThe short term, certainly, very challenged with the ad scatter market pullback -- pulling back significantly for the industry. But at the same time, good trend on the upfront commits, as well as things like M&E performing well.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nOK. Thank you very much.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nVasily, let me just add, M&E was brought up. M&E is -- which is media and entertainment and that -- for those that don't know that that's our business, helping drive subscriptions and engagement and viewership with content across our platform. And we're very good at it. It's an area that we've built a lot of expertise around.\n\nAnd as we built out our purpose-built platform for TV, it's an area that we've invested a lot in, in terms of building the right capabilities and tools into the platform. And of course, we understand very well the business of TV advertising and the tools needed to drive that. And so we built all that into our M&E business. And it's an area that I think has a lot of opportunity.\n\nI mean,, obviously, there's a lot of streaming services that are still trying to build accounts, trying to reduce churn and grow engagement. But we're also seeing big new services like Netflix and Disney get into the ad business -- are starting to add advertising to their -- some tiers of their services. And for those companies, as soon as they have ads, engagement becomes even more important for them because, obviously, the more people watch content, the more ads they can watch and the more money that can be made. And so using our M&E tools to drive engagement on our services, as well as third-party services, is something that we're very good at.\n\nAnd I think those companies know that we can help them a lot in that area. So -- so M&Es -- and also, I talked about Gidon working on our consumer experience. A big part of that is also related to driving our M&E business, which is around how can we become more relevant to our consumers, to our viewers and helping them decide what to watch. I mean, we're a trusted partner for our viewers when they use things like universal search or more ways to watch or feature-free in our user interface.\n\nBut as the owner of the platform UI, that's our core advantage is using that platform UI in ways to help our consumers find content is something that we can do exclusively. And then integrating that into our M&E business to drive engagement and viewerships and subscriptions is a big way that we can help our partners and generate profit for both our -- revenue for both us and our partners.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Jason Helfstein with Oppenheimer. You may proceed.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nThanks. Anthony, kind of big-picture question with a few parts. So from what I can tell, the majority of your shareholders think you're making a strategic mistake by refusing to let third-party DSPs bid on TRC and other inventories. So one, do you still think this is the right decision? Two, why do you think this is the right decision? And three, what's Charlie's view on this given his position in the business? And is it possible you change the position now that he is running advertising? Thanks.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nHey, Jason. Thanks for that question on DSPs. So well, I'll come to Charlie in a second, but let me just kind of touch on DSP. So first of all, we have our own DSP OneView, which is highly optimized for TV streaming and our Roku platform.\n\nIt's the best way to buy inventory across our platform, taking advantage of our data and technology we built into the platform. So that's obviously a big focus for us. In terms of diversifying our revenue streams, one of the ways we've been doing that is focusing on the upfronts. So we started out with no revenue coming from the upfronts.\n\nThis last year, we passed $1 billion in our upfront commitments, which -- and so every year, the mix of dollars that comes on the platform that comes through the upfronts has been growing. And that's becoming increasingly important for us. But in terms of actual DSPs, I mean, first of all, we do work with third-party DSPs. We work with dozens of buy- and sell-side platforms.\n\nWe've long worked with marketing and ad tech partners, including -- for example, the shopper program we do with Kroger or the Roku Measurement Partner program with 20-plus measurement companies. And are there other ways we could work with DSPs to generate incremental revenue? There might be. And that's -- we're definitely looking at ways to work with partners to increase our revenue stream. So that's something that we're looking at.\n\nIn terms of Charlie, I don't know what Charlie thinks about DSPs. But he's got a lot of experience working with advertisers, both traditionally through IOs and also through DSP platforms, which is something that -- TV does at Fox, where he was before Roku. So we'll see. But I think the big picture around Charlie is just that he's a very senior media executive with a lot of experience in advertising and in content, in programming, and the strategy of running a media company.\n\nAnd we built our media business to a big business, a very large business. But it's got so much more potential and it can be a lot bigger. And that's why we recruited Charlie to help take us to the next level. So I'm sure he'll bring some new insights and strategies and ways of thinking that we weren't thinking before and love to see what happens.\n\nBut I'm looking forward to working with him to grow the media business.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nAppreciate the color.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Ralph Schackart with William Blair. You may proceed.\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nGreat. Thanks for taking the question. Maybe can you give us some perspective on what you've seen quarter to date on the ad pullback? Anthony, I think you talked about big categories pullback like telecom. But any way to sort of quantify it or maybe talk to the -- I'm guessing more acceleration in the pullback? Just some perspective given sort of what we're seeing in the Q4 guide.\n\nAnd, Steve, I just wanted to clarify something. I think you said that -- I think you said platform revenue will be down sequentially in Q4. If you could confirm that's indeed correct.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nYeah. I mean, I can say a few words about what we're seeing in the ad business. But -- and then maybe Steve has something -- some comments on that as well on our guidance -- I mean, our outlook. So I think -- like I said before, this is not a normal holiday season.\n\nThere's a lot of uncertainty in the economy. And when there's uncertainty around it, there's going to be a recession or consumers are pulling back on spending. How much of that will continue, when will it turn around, when will the Fed stop raising interest rates, I mean, all these things creating a tremendous amount of uncertainty in -- so this is not a normal holiday season. And we are seeing -- and one of the first things companies do in the face of such uncertainty is they cancel their ad budgets.\n\nAnd so that's kind of the core driver of why the ad market is down. It's very hard to predict because a lot of our business comes in the second half of the quarter in Q4. So -- but the trends we're seeing are that big advertisers that we traditionally get spend from are not spending this quarter. They're not spending with anyone.\n\nIt's not just they're not spending with us. But the best information we have, we put in our outlook. And like I said before, it's definitely temporary. As soon as -- it doesn't -- the economy doesn't even have to turn around.\n\nWhat needs to happen is there has to be more certainty in people's minds about where the economy is heading. And that will cause people to come back in the market and start spending again. Steve, did you want to add anything?\n\nSteve Louden -- Chief Financial Officer\n\nYeah, sure. Ralph, so yeah, just on your specific question, so we did mention in the remarks that contemplated in the Q4 outlook is that the revenue will be down sequentially, as well as year over year, and specifically because of the significant pullback in the ad scatter market driving that platform revenue down sequentially, kind of effectively -- basically counteracting the traditional sequential pop that we would get because of the holiday season. We think that the forces that are sort of against that, weighing on the autonomy and consumers and advertisers is enough to make that a sequential decline.\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nOK. Thanks, Steve. Thanks, Anthony.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Jason Bazinet with Citi. You may proceed.\n\nJason Bazinet -- Citi -- Analyst\n\nI have a question about the next recession, actually. Do you think that the sort of dramatic sort of retrenchment that we've seen in your advertising revenue is simply a function of this upfront scatter mix? Or do you think it's that plus some sort of, I don't know, lack of sophistication or habit on the part of advertisers, where they still view connected TVs as experimental and therefore it's sort of the first thing that they cut when they're faced with a period of uncertainty? In other words, during the next recession, do you think you'll see the same sort of dynamics in terms of the pullback or it will look more like traditional TV? That's the basic question. Thanks.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nJason, that's an interesting question. I think that -- well, first of all, I think that there's nothing unique about Roku's situation. We believe that we're -- based on what we've seen that other connected TV companies are experiencing similar pullbacks to us. We think we're over-indexing slightly a little bit versus the connected TV market in terms of getting our fair share.\n\nSo we're doing a little bit better but roughly in line, we think, with other connected TV platforms. And it's certainly true that most ad dollars are still flowing to the traditional TV companies. And I believe that the environment we're in now will -- is causing people to look more seriously about how they spend their money. And traditionally, in similar situations in the past, you've seen situations like we're seeing now accelerate the transition.\n\nSo my expectation is this will accelerate the transition of dollars from traditional TV to connected TV. I think we're seeing that. And I think the next recession, hopefully, is a long way away. And when that happens, by that point, I think all advertising will be through connected TVs and streaming.\n\nJason Bazinet -- Citi -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Rich Greenfield with LightShed Partners.\n\nRich Greenfield -- LightShed Partners -- Analyst\n\nThanks for taking the question. Anthony, I guess if we sort of think sort of about the overall business and the profitability of your business, I'd love to sort of get how you're thinking about the shift. The -- one is when I think about the Meta challenges, it's because they're being forced to spend more on their business to sort of keep up with TikTok. And so the profitability from their AI investment is hurting the margin structure of the company.\n\nWhen you think about sort of Roku's current sort of smart TV landscape, is the content spend simply to drive an incremental revenue stream? Or do you see content spend increasingly as something you need to do to differentiate versus the other players out there? Meaning, is it sort of an increasingly important part of the business that you have to invest in, in order to drive player sales and sort of maintain player market share? That would be great just to kind of get your kind of high-level view on that. And then separately, we listened to Lachlan Murdoch earlier in the week talk about Tubi and talk about sort of 30% growth, accelerating to 40% growth in Q4. And I think the Street is having a lot of -- hard time kind of reconciling that -- those comments relative to what you and Steve just said, as well as what we've heard from most of the other companies who have been far more sort of pessimistic about Q4. And I'm just curious if there's any reason why not all players would sort of be seeing the same trend.\n\nThanks.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nRich, that was a complicated question. Let me see if I can parse it out. So the first part of it was around -- I think it was around our TV operating system strategy and -- that we see. Is there a parallel with Meta in terms of increased competition? I think it's completely different.\n\nI mean, I think that -- the way the operating system for television strategy -- or market is playing out is that we're not seeing new competitors. If you think like I do that all TVs are going to be sold with the licensed operating system and we're seeing that trend playing out over time. There's three licensed operating systems in the market that have any momentum. That's Roku, we're No.\n\n1 in the U.S. and Google TV or Android TV, whatever you want to call it, and Amazon Fire TV, which is the variation of Android. And the -- all three of those operating systems are gaining accounts. And they're gaining them at the expense of the incumbents -- the incumbent TV providers, which have proprietary operating systems.\n\nAnd those are all transitioning to licensed operating systems with various degrees of speed depending on the company, the OEM. So I think -- so to summarize, in the TV operating system business, Roku has the only proprietary-based TV operating system -- sorry, we have the only purpose-built operating system for TV. It's not an operating system that was designed for mobile phones imported. It gives us fundamental advantages.\n\nIt's the reason we're the No. 1 operating system in the U.S. and growing rapidly in the markets we enter. And we expect active accounts and adoption of that operating system to continue to grow.\n\nAnd we expect to maintain our leadership position. There's no new competitors coming into the market as the market is too far ahead. And it's not -- it's just different -- it's just a different market than social media platforms. I mean, it's a TV business.\n\nIt's hardware. It's -- it requires a lot of scale to be in the business at this point because there's so much R&D required. And it requires that you be successful in monetization to participate in the business successfully. So -- and to fund the R&D that goes along with it.\n\nSo I don't think there's really any analogy to Meta. And I think there's lots of reasons to think that the hardest part of our business in terms of active accounts is behind us. They're still very competitive, obviously. But we're doing well in terms of that.\n\nIn terms of content, our content strategy is not about differentiating our product, our platform. I mean, it might have some benefits there but that's not the primary reason. So I mean, if you look at -- versus, say, an SVOD service, a big SVOD service like Disney or Netflix or Hulu, they have to convince people to keep paying a subscription fee every month. And they do that by producing a lot of originals.\n\nAnd some of them become hits and some of them cause people to want to sign up or retain their subscription. Our business is different. Our business is we build active accounts by licensing our TV OS, selling streaming players. And then we focus on engagement across the entire platform and the customer has those.\n\nAnd because we control the user interface for the platform and we have our own free AVOD service called the Roku Channel, one of the things we do is we integrate the Roku Channel into the platform UI, which drives engagement at the Roku Channel. So it's not being driven -- of course, some of that engagement is where we promote content. And we promote originals, and originals' role actually is to drive engagement among other things. But it's all about -- it's all in service of creating a good business around the Roku Channel and getting customers to come into the Roku Channel and watch content.\n\nAnd so it's not about getting people to pick Roku as a retailer because we have \"Weird Al\" Yankovic. So anyway -- so for us, content or original is all part of a portfolio strategy design to have a portfolio of content for the Roku Channel that achieves our AVOD business model overall. So -- and then the third part of your question --\n\nRich Greenfield -- LightShed Partners -- Analyst\n\nAnd then just lastly on sort of the -- yeah.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nTubi, I don't know. They don't break out the specifics of Tubi. I feel confident that the Roku Channel is highly competitive. Pluto didn't have the numbers that Tubi had, allegedly.\n\nI can't really comment. I don't really know the specifics of the FOX TV situation. I do know that on our platform, the Roku Channel is doing extremely well. I mean, we grew engagement in the Roku Channel 90% year over year, which is a huge amount of growth.\n\nIt's a very successful product for us. It's the top five app, both in terms of reach and engagement. It's ranked No. 1 in AVOD SaaS services in the U.S.\n\nand Canada. We've got a broad portfolio of compelling content, everything from originals to direct license products, Spanish language products, exclusive content like the \"Weird Al\" Yankovic, which premieres exclusively on the Roku Channel, November 4. We just had the premier last night with Daniel Radcliffe and \"Weird Al.\" And a lot of buzz around that show. It's going to be a great show.\n\nBut it's not -- and it will be very successful for us. But it's not why people are buying Roku players. They're buying Roku players because it's got a great user experience for streaming. Other content that's exclusive to Roku Channel includes The Rich Eisen Show.\n\nWe're integrating more and more SVOD services into the Roku Channel, which has the benefit of driving a lot of incremental engagement for those SVOD services because the Roku Channel is integrated into our platform UI. So the Roku Channel has been great for us and it's a great asset for us.\n\nSteve Louden -- Chief Financial Officer\n\nRich, it's Steve. Just to add to what Anthony was talking about. I don't have any insight on Tubi, but one thing just to remind folks is, for a lot of media companies that have traditional sort of network cable and connected properties with the declining ratings in a lot of the traditional business. A lot of times, those ad sales are being fulfilled over on the connected TV properties.\n\nAnd so they're actually shifting kind of a broad-based sale disproportionately over to their connected TV properties. So again, I don't know what's driving Tubi's info. But that's one thing that is a general phenomenon in the industry.\n\nOperator\n\nThank you. And our last question. One moment, please. Our last question will be from Barton Crockett with Rosenblatt Securities.\n\nYou may proceed.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. Thanks for squeezing me in. I guess two things I wanted to just get some color on. One is when you talk about the upfront, which was $1 billion was a big increment.\n\nPresumably, that was kind of start to flow in the fourth quarter. So I'm just wondering if that, in fact, is happening or have -- we've had people exercise cancellation options or push their committed spend back to later in the year? And then the other question I was wondering about was in terms of the strong growth you've had in accounts, active accounts, hours this quarter, a bit of an uptick in the pace there. Was there anything kind of unusual that drove that? Or does that feel like just a manifestation of the broad trend and for that reason, maybe every reason to think it can continue in the near term?\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nThis is Anthony. I'll start with the active account question. And then in terms of the upfronts and how much of that is related to the Q4, maybe Steve can take that one. So active accounts, so active accounts were up 2.3 million net new adds.\n\nAnd it was driven by the normal thing. So we sell streaming players but TV sales, Roku TV program was a particularly big contributor for active accounts. And also international was a good contributor as well. So I would say, if you look at the kind of four parts of that grid, you've got streaming players, TVs and you got domestic and international.\n\nTVs did well and did maybe a little bit over-indexing there and international also did well. We also saw retention rates -- accounts come in and out depending on if a consumer is using them. It's not like a SVOD service where they cancel it or they don't cancel it. In the case of our accounts, if they use the account and stream, then that's an active account.\n\nAnd so -- and there's always accounts that haven't streamed in the last 30 days and so they drop out. And sometimes they come back. A lot of -- usually, they come back. So -- but anyway, all of that adds up to a retention rate that has been doing well for us for a little bit -- two quarters now.\n\nSo I don't think there's anything specific that was particularly unusual in the quarter, that was just going to be a one-time thing. I think those -- that was sort of our normal way where things are going for us in terms of accounts. And then, Steve, I don't know if you have anything to add about the upfronts.\n\nSteve Louden -- Chief Financial Officer\n\nYeah. In terms of the upfronts, you're right. The upfront commits start in Q4 and they go through the end of Q3 the following year. So the deals that we're talking about in the $1 billion-plus commits that we discussed on the last earnings call start as of October.\n\nWe haven't seen significant cancel rates. Just a reminder that unless the advertiser wants to specify in, say, Q4 that the upfront commitment level expand that 12-month period. And so they have flexibility to kind of think of what their plan is and change it around in general. But the main focus for the advertising pullback for us has been the ad scatter market.\n\nThat's where most of the advertisers are being conservative in the short term. And the upfront commits are still a positive indicator for the long term leaning into Roku and streaming.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nYeah. So maybe another way -- just to add on to that, basically, yes, upfronts have been coming -- are becoming a bigger and bigger percent of our ad plan and they're getting bigger. But when you see such a large dramatic reduction in the scatter market, it just -- it definitely impacts growth.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nAnd when you talk scatter market, you're not talking kind of the smaller digital players as much as you are the big traditional advertisers we see on TV. Is that what you're saying in terms of who's cutting back?\n\nSteve Louden -- Chief Financial Officer\n\nYeah. When we said scatter -- go ahead, Anthony.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nScatter -- when we say scatter, we mean anything that's not in the upfront. So it's big TV advertisers. Some of their budget is in the upfront, but not all of it.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. All right. Thank you.\n\nOperator\n\nThank you. I would now like to turn the call back over to Anthony Wood for any further remarks.\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nI just want to thank our employees, customers, and partners for their focus and commitment in a very difficult operating environment. We expect to emerge from the current advertising downturn stronger and in a better position than ever. So thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nConrad Grodd -- Vice President, Investor Relations\n\nAnthony Wood -- Founder and Chief Executive Officer\n\nSteve Louden -- Chief Financial Officer\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nAaron Kessler -- Raymond James -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nJason Bazinet -- Citi -- Analyst\n\nRich Greenfield -- LightShed Partners -- Analyst\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nMore ROKU analysis\n\nAll earnings call transcripts"
}