{
  "companyName": "Horizon Global",
  "companyTicker": "HZN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/horizon-global-hzn-q2-2022-earnings-call-transcrip/",
  "content": "Horizon Global (HZN -6.27%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, everyone, and welcome to Horizon Global's second quarter 2022 conference call. My name is Jamie, and I will be your operator for today's conference. All participants will be in a listen-only mode. After today's presentation, there will be an opportunity to ask questions.\n\nThis call is being recorded at the request of Horizon Global. If anyone has any objections, you may disconnect at this time. At this time, I'd like to introduce Mr. Jeff Tryka with Lambert IR, Horizon Global's investor relations firm.\n\nMr. Tryka, you may proceed.\n\nJeff Tryka -- Investor Relations\n\nThank you, operator. Good morning, and welcome to Horizon Global's second quarter 2022 conference call and webcast. On the call today are Terry Gohl, Horizon Global's chief executive officer; and James Zhou, Horizon Global's chief financial officer. Earlier this morning, we announced our second quarter 2022 results.\n\nThe release is available on many news sites as well as in the investor relations section of our website at horizonglobal.com. Turning to Slide 2. Today's presentation will include non-GAAP disclosures. These disclosures are reconciled to GAAP in the appendices to our quarterly press release and presentation, both of which are available on the investor relations section of our website at horizonglobal.com.\n\nTurning to Slide 3. I'd like to remind you that statements in today's presentation will include our views about Horizon Global's future performance, which constitute forward-looking statements. These statements are subject to risks and uncertainties that could cause our actual results to differ materially from the forward-looking statements. We've described these risks and uncertainties in our risk factors and other disclosures in the company's most recently filed annual report on Form 10-K, quarterly reports on Form 10-Q and other filings with the Securities and Exchange Commission.\n\nWith all that being said, I would like to turn the call over to Horizon Global's chief executive officer, Terry Gohl. Terry?\n\nTerry Gohl -- Chief Executive Officer\n\nThank you, Jeff, and good morning to all of you who are participating in today's review of our second quarter results. I would like to start off expressing our gratitude to our shareholders, employees, customers, and to our suppliers for your continued support as we collectively navigate through the many industry challenges faced during the quarter. Thank you all for your continued dedication to the company. Yesterday, the company issued a press release announcing that the board is reviewing strategic alternatives for the business.\n\nAs noted in the press release, we have received multiple inbounds, and the board's review reflects its commitment to maximizing shareholder value. Strategic alternatives could involve the sale of a portion or of the entirety of the business. While this review occurs, management remains focused on unlocking the deep value associated with our innovative products, iconic brands and long-standing customer relationships. Today, we will address our results for the second quarter and the actions we are taking to solidify our commercial position, improve our operations and mitigate controllable spend.\n\nThe second quarter was challenging with many external factors negatively impacting our business, including, notably, sales volumes, and volume mix. During the quarter, consumers experienced the impact of inflation on pricing across virtually all consumables. They faced uncertainty associated with the trajectory and duration of that inflation, continue to witness geopolitical conflicts and rising tensions around the world and continue to endure the impact of supply chain constraints on product availability. When you add in heightened inventory levels held at our non-OEM customers at the beginning of the quarter, it resulted in a significant impact to our top line and margin.\n\nOur assessment is that consumers represented in our marketplace pulled back on purchases during the quarter as they assess the impact of the changing economic factors I just described. During our last call in May, we emphasized our commitment to improving the company's performance. We remain committed, and despite a number of uncontrollable external factors, management is focused on the business and positioning it for success. Turning to Page 5 for an overview.\n\nJames will present the financials in detail, but maintaining consistency with prior releases, we are summarizing our quarter performance on this page. Some overall comments relative to the quarter. Sales were driven down primarily due to three factors: higher inventory levels held by our customers and our non-OEM channels, with a few exceptions, driving lower order volume during the period; OEM production was suppressed within the quarter due to supply chain issues; OEM volumes began to improve toward the end of the quarter, however, our production throughput was limited by component availability. Note that we never shorted any of our OEM customers during the period or throughout the semiconductor shortage events starting last year.\n\nNet sales were down $40.9 million as compared to quarter two, with the volume impact being approximately $57 million, partially offset with the impact of pricing recoveries. Note that incremental pricing actions continue to be negotiated throughout the quarter, with some not being finalized until after quarter end. We continue to see delayed recognition of a portion of our price increases we've previously secured due to the impact of lower volumes based on our customers' inventory levels. With the exception of our industrial channel, which posted an 11.9% growth, other channels were down as compared to Q2 2021.\n\nI will review this further in a couple of slides, but note that in our large global OEM and our Americas non-OEM channels, we have either retained or expanded our market share. This leaves the overall market softening, coupled with material availability, as the primary drivers to our volume delta to prior year. Note that we ended the quarter with a strong order book in North America at $50.8 million. While our inventory value reduced from quarter one, it remained elevated from Q2 2021.\n\nThis was tied to lower inbound orders, continued year-over-year increases of in-transit levels and the cost of inventories also being elevated by approximately $20 million against Q2 2021. As discussed in last quarter's call, we were prepared for a strong selling season in the Americas. That season has not materialized based on the aforementioned drivers. Inventory levels are expected to taper off in the back half of the year based on the purchase reduction actions we have initiated, coupled with the flow-through of current orders and new inbound orders out of existing inventory.\n\nWe stand ready to service our customers at any and all demand levels, but absent the expected season, we have focused on controlling overhead, operational cost and variable spending. We'll talk about these actions in a few minutes. Let's move to Page 6. Further detail to the metrics tied to the macroeconomic headwinds impacting our industry is shown on the left-hand side of this page.\n\nStarting with the industry indicators for the first half of the year 2022 versus 2021. New vehicle sales were down in North America 19%, while new vehicle registrations in Europe were also down there by 14%. While this represents a significant reduction, we saw our production demand from our OEM customers increased toward the end of the second quarter, and we exited June with the strong customer releases for this channel. A follow-on is that used car sales in North America were down 16%.\n\nThis is a critical driver for our non-OEM sales. Without the forward push of new vehicles into the marketplace, there was less volume of turnover in vehicles and lower resulting used cars for us to accessorize. New boat registrations in North America, driving trailer accessory demand, were down 17% through May, as this report lags a little bit in terms of volume and reporting. RV sales continued to be strong, with shipments being up 8% from prior year and reflecting the strength of the producers' order book and the continued consumer interest in the outdoor segment.\n\nThis remains good news. Moving to the economic indicators, again, listed on the left-hand side of the page. Consumer sentiment continued its downward trend as evidenced in the University of Michigan study scoring at 50 for the U.S. consumers, representing its lowest point in 60 years.\n\nEurope similarly had depressed sentiment scoring. Many issues hit the consumer in a short amount of time, so these results are really not surprising. Inflation rates for both regions ended at over 9% in June, and fuel prices continue to rise through the month of June. These are lofty headwinds to overcome, so what have we done? First and foremost, we delivered to our customers.\n\nThrough the combined efforts of our engineering, purchasing and logistics teams, we continuously assessed and validated alternatives to the constrained products which were limiting our production and we expedited them into production. We continued with the expansion of our supply base to address constraints, while also leveraging internal capacities to vertically integrate and in-source production.  During the first half and continuing through the second quarter, we continued to upgrade our portfolio and to secure new business. We did not pull back, but we accelerated our development activities, resulting in the most new product launches for the period in the history of the company. These launches are aligned with our profitable growth expectations.\n\nContinued with the investment in our Eastern European Romania footprint, and continued to be rewarded with new OEM business wins for the region. This was a direct response to both our product offering and our operational capabilities, as well as our Romania site initiative. Pricing recovery actions and negotiations continued throughout the period to address either further economic recoveries or to close out prior negotiations, which were left unsettled at the start of the quarter. As noted earlier, several actions were not closed or recognized until after the end of the second quarter.\n\nContinuous improvement actions are at full steam. Our Lean and Six Sigma initiatives continue to improve employee safety, production capacity and leading to cost improvements.  While multiple actions carried some degree of investment for implementation, the rewards of these actions will be seen going forward. We are aggressively flexing operational patterns and staffing at our manufacturing and distribution sites in North America to align with the change in demand. While there will be some levels of costs assigned to these actions as well, the positive results will be seen going forward.\n\nThese efforts will continue across all aspects of our business going forward. We continue to shift locations of production and, of particular note, we redeployed members of our workforce among plants in Europe to both optimize cost and to protect our customers with shifts in demand. This allows us, with the support of our unions, to level our workforce demands across the region. Our total enterprise focus on business and operational quality processes is also yielding significant results during the quarter and is aligned with our targeted improvement objectives.\n\nOur IATF and ISO auditing results are the best in the company's history. Product defect rates are the best in the company's history. OEM customer scorecards are fully compliant to quote new business across the board. ESG practices continue to improve across all categories, with notable improvements being the completion of our carbon disclosure project and reaching full compliance in our chemical reporting requirements.\n\nContinue with our ERP deployment, and we'll launch our SAP package in Q3 across the North American region. We initiated the same action in Europe, building off and leveraging the North American platform, starting with our Romania facility. We are expanding our direct import business as evidenced by a 25.4% year-over-year increase, which we expect to continue to positively impact our top line, our bottom line and our working capital position. To combat our high inventory levels, we throttled purchases with a year-over-year reduction of approximately $24 million or 17.3% in our Americas segment.\n\nWe also continue to optimize our distribution footprint, including the recent consolidation of one of our regional distribution centers in the Americas into our primary warehouse in Kansas City. As you can see with our actions, we are banking on and positioning Horizon Global for long-term sustainability and growth. Let's move to Page 7. On this page, you can see our net sales and adjusted EBITDA performance for Q2 2022, as well as the comparable periods going back through Q2 2019.\n\nA lot has happened during this period, including, of course, a global pandemic. So it is important to look at our historical performance. Net sales decreased from Q2 2019 by approximately $11.5 million, while the comparison to Q2 2021 reflected a sharper decline of $40.9 million. This decrease is due to significantly reduced volumes.\n\nIn addition to the volume reduction, our performance was negatively impacted by our sales mix that shifted away from higher-margin sales channels. Specifically, net sales in our aftermarket sales channel, traditionally our highest margin channel, dropped approximately $25.8 million from the same period in Q2 2021. This ties directly back to what we view as a lack of the traditional selling season, especially in the Americas. We were also unfavorably impacted by disrupted OEM production schedules driven by supply chain constraints.\n\nHowever, we saw a stabilization on the OEM side toward the end of the quarter. So overall, sales were negatively impacted by multiple factors, but our market share remained or improved. The volume/mix between OEM and non-OEM sales heavily impacted our performance. Performance was also impacted by delayed recognition of some pricing recovery due to slower flow-through of certain customers' inventories, resulting in lower inbounds at new pricing levels.\n\nTurning to Page 8. As mentioned on our last call, we expected to see steel costs soften in Q2 2022, from the second half peak in 2021. Though an overall softening has occurred, there was a slight uptick in both the CRU and MEPS indexes in Q2 2022. We expect, and the indexes project, further stabilization or improvements in the back half of the year.\n\nIn particular, with respect to the Americas, we are still well below the 2021 peak levels and expect this condition to remain. As a reminder, the impact on our operational performance relative to steel cost is generally recognized in a one- to two-quarter lag. We will continue to monitor these indexes to address our supply chain costs or to take pricing actions as necessary. Moving to Page 9.\n\nOver the last few quarters, we have talked about freight rates in North America, including rate spikes in the back half of 2021 and rate softening in the first half of 2022. Freight costs have continued to decrease, as you can see on this graph. Average container cost in Q2 2022 is substantially below the second half 2021 peak rates. We continue to execute and refine our port rebalancing strategy that occurred in early 2022.\n\nThis has led to reduced container cost and transit times as well as significant decrease in costly diversions. Further diversification actions are underway as well as efforts and actions in both regions to optimize and leverage reduced ground transportation rates throughout our supply and distribution network. Moving to Page 10. As previously mentioned, the number of our non-OEM customers in the Americas entered Q2 with elevated inventory levels.\n\nThis slowed inbound orders reduced our sales volumes and resulted in our own heightened inventory levels. Please note that the value of the inventory in terms of the impact of economics was impacted by approximately $20 million, which I mentioned earlier. As inventory at our customers is sold off, we expect an uptick of inbound orders and an increase of sales volumes which, coupled with reduced purchasing volumes, will reduce inventory throughout the back half of the year. This inventory reduction outlook was conveyed in our last call and remains the plan.\n\nWe have continued to adjust our purchases and our production plans to meet what we have seen in Q2 to meet these same objectives. On the right-hand side of the page, we can see net sales comparison by segment from quarter two 2021, through quarter two 2022. As previously mentioned, net sales for the quarter were lower than expected due to the lack of traditional selling season, driven by consumer reaction to multiple economic issues. This resulted in significantly lower sales volumes as well as the unfavorable mix shift away from higher-margin, non-OE sales.\n\nAs previously announced, we are pleased to have James Zhou in as our new CFO. James brings considerable experience and leadership to our team, and in a short time has displayed the leadership qualities we saw in him and is driving significant improvements throughout the company. James, take it away.\n\nJames Zhou -- Chief Financial Officer\n\nThank you, Terry. Good morning, everyone. I would like to thank Terry and the board for this opportunity. I am excited to join Horizon Global as the CFO and to be here with you today.\n\nPlease turn to Slide 11 for a review of the company's consolidated results for the second quarter of 2022. Consolidated net sales for the second quarter of 2022 were $181.2 million, a decrease of $40.9 million or 18.4% comparing to the second quarter of 2021. The net sales decrease was primarily attributable to lower sales volume in both the Americas and Europe-Africa operating segment. The decrease was partially offset by customer pricing initiatives implemented to recover the impact of increased input costs, including material and other inflationary costs.\n\nThis pricing recovery are generally recognized on a one- to two-quarter lag. Gross margins decreased to 11.4%, down from a gross margin of 21.3% for the second quarter of 2021. The decrease in gross margin was primarily driven by the lower sales volume, coupled with a significant mix shift to lower-margin sales channel, product and increased manufacturing input costs.  We reported an adjusted EBITDA of loss of $3.9 million, comparing to the adjusted EBITDA of $18 million during the second quarter of 2021. This was primarily due to the lower gross profit margin performance Terry has mentioned.\n\nNegative operating leverage from reduced production in this quarter significantly affected EBITDA. Now let's turn to Slide 12 to review the segment performance for the quarter. Net sales in the Americas were $110.9 million, $17.5 million or 13.6% lower than the second quarter of 2021. The decrease in net sales was driven by lower volume in the aftermarket and retail sales channel, partially offset by customer pricing recovery initiatives.\n\nAdjusted EBITDA for the segment decreased to $3.4 million, compared to adjusted EBITDA of $18.5 million for the second quarter of 2021. The decrease was driven by reduced production as a result of lower sales volumes, a significant mix shift to lower-margin sales channels and products, and increased manufacturing input costs, including elevated commodity and logistics costs. Transitioning to our Europe-Africa operating segment. Net sales was $70.3 million, a decrease of $23.4 million or 25% from the second quarter of 2021.\n\nThis decrease was primarily due to lower sales volume in the automotive OEM, automotive OES, and aftermarket sales channel, as well as unfavorable currency translation of $8.7 million. The decrease was partially offset by customer pricing recovery initiatives. Adjusted EBITDA loss for the segment was $1.5 million, comparing to adjusted EBITDA of $5.1 million for the second quarter of 2021. This decrease was driven by a lower net sales, coupled with a significant mix shift to lower margin sales channel and product, unfavorable manufacturing input costs, and operational inefficiencies due to automotive OEM customer disruptions.\n\nNow move on to our working capital, liquidity and free cash flow on Slide 13. Total trade working capital was $106.2 million in the second quarter of 2022, which represented a decrease of $2.6 million compared to the fourth quarter of 2021, an increase of $5.2 million comparing to the second quarter of 2021. Specifically, receivables increased $18.2 million to $98.9 million compared to the fourth quarter of 2021. Days sales outstanding was 50, an increase of five days over the fourth quarter of 2021.\n\nInventories increased $2.2 million to $165 million compared to the fourth quarter of 2021. Days of inventory on hand was 94 days, a decrease of seven days over the fourth quarter of 2021. Accounts payables increased $23.3 million to $125.5 million compared to the fourth quarter of 2021. Days payable outstanding was 71 days, an increase of eight days from the fourth quarter of 2021.  Cash and availability or liquidity totaled $46.5 million for the second quarter of 2022, which was comprised of $20.1 million of availability under our credit facilities and cash on hand of $26.4 million.\n\nThis reflects a $7.3 million increase, compared to the fourth quarter of 2021 and a decrease of $15.5 million compared to the second quarter of 2021. Free cash flow year-to-date 2022 was a use of $33.4 million comparing to a use of $37.6 million during the same period in 2021. The use was primarily related to company's financial performance in the first half of 2022, generally in line with the use of free cash flow during the same period in 2021. Turning to Slide 14 for a review of our current capital structure.\n\nDuring the quarter, we issued $41 million of redeemable preferred stock in exchange for settling $40 million of convertible notes. Total gross debt plus redeemable preferred stock increased in aggregate by approximately $139.9 million from $300.9 million at the end of the fourth quarter of 2021 to $440.8 million at the end of the second quarter of 2022.  Please note, this number reflects $85 million of convertible notes that were paid off on July 1, 2022, or in other words, the first day of the third quarter. Excluding convertible notes paid off on July 1, 2022, our gross debt increased approximately $14 million from the end of the fourth quarter of 2022, which was primarily due to increased ABL borrowings. With that, I will turn it back over to Terry for his closing remarks.\n\nTerry Gohl -- Chief Executive Officer\n\nIn closing, the second quarter of 2022 was a challenging quarter for us. Performance was driven by many factors, but for the most part, volume and mix of sales realized, we retained a strong order book as we closed the quarter at over $50 million in the Americas. We are advancing our commercial and competitive position with innovation, new product introductions, footprint positioning and further investments in our operations to support our long-term objectives. We are on the front line and deeply engaged with our customers as they look for innovative ways to optimize semiconductor usage and efficiency to address global constraints.\n\nOur operational improvement initiatives continue to result in increased capacities and lower cost to manufacture. We are leveraging this for further in-sourcing actions throughout the quarter, with more targeted actions planned for the remainder of the year.  We continue to optimize our logistics and supply chain with new supply partners being added and new carriers and routes being implemented to optimize the cost of transportation. We have achieved our best results in the company's history in our performance metrics on quality, and are advancing all measures of sustainability.  Our operations continue to build on its foundational strength, and we will leverage that through increased competitiveness and increased portfolio, and the recognition from our customers that we relentlessly work with them to protect their supply and to provide them the highest quality products in the market. We are Horizon Global, and we represent the industry leadership in the towing market.\n\nAgain, thank you to all who've joined and for your continued support. I'll now turn it back to the operator for questions. Operator?\n\nOperator\n\n[Operator instructions]. And ladies and gentlemen, at this time and showing no questions, I'd like to turn the floor back over to the management team for any closing remarks.\n\nTerry Gohl -- Chief Executive Officer\n\nAgain, as I said at the beginning, I want to express our appreciation as a company to all of you who continue to support the company and to have interest in joining the call today. We look forward to our Q3 earnings call later this year, and we'll talk to you then. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeff Tryka -- Investor Relations\n\nTerry Gohl -- Chief Executive Officer\n\nJames Zhou -- Chief Financial Officer\n\nMore HZN analysis\n\nAll earnings call transcripts"
}