{
  "companyName": "S&P; Global",
  "companyTicker": "SPGI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/sp-global-spgi-q3-2022-earnings-call-transcript/",
  "content": "S&P Global (SPGI -1.43%)\nQ3 2022 Earnings Call\nOct 27, 2022, 8:30 a.m. ET\n\nMark Grant\n\nGood morning and thank you for joining today's S&P Global third quarter 2022 earnings call. Presenting on today's call are Doug Peterson, president and chief executive officer, and Ewout Steenbergen, executive vice president and chief financial officer. We issued a press release with our results earlier today. If you need a copy of the release and financial schedules, they can be downloaded at investor.spglobal.com.\n\nThe matters discussed in today's conference call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including projections, estimates and descriptions of future events. Any such statements are based on current expectations and current economic conditions and are subject to risks and uncertainties that may cause actual results to differ materially from results anticipated in these forward-looking statements. A discussion of these risks and uncertainties can be found in our Forms 10-K, 10-Q and other periodic reports filed with the U.S. Securities and Exchange Commission.\n\nIn today's earnings release and during the conference call, we're providing non-GAAP adjusted financial information. This information is provided to enable investors to make meaningful comparisons of the company's operating performance between periods and to view the company's business from the same perspective as management. The earnings release contains exhibits that reconcile the difference between the non-GAAP measures and the comparable financial measures calculated in accordance with U.S. GAAP.\n\nI would also like to call your attention to a specific European regulation. Any investor who has or expects to obtain ownership of 5% or more of S&P Global should contact investor relations to better understand the potential impact of this legislation on the investor and the company. We are aware that we have some media representatives with us on the call. However, this call is intended for investors, and we would ask that questions from the media be directed to our Media Relations team, whose contact information can be found in the press release.\n\nAt this time, I would like to turn the call over to Doug Peterson. Doug?\n\nDoug Peterson -- President and Chief Executive Officer\n\nThank you, Mark. We're pleased to discuss our third quarter results and how we're growing, innovating and executing with discipline even in the face of a challenging macroeconomic backdrop. With each quarter that passes, we see further evidence of the strength of our combined company. While no one could have predicted what this year would have looked like, we have benefited from the diversification of our revenue and profit streams and that ballast has provided great resilience as we continue to navigate choppy waters.\n\nIt's been nearly two years since we announced the merger, and I'm proud of the progress we've made. We continue to put the customer at the core of everything we do and we continue to demonstrate a clear commitment to our people while maintaining a high standard of operational excellence. We have an incredibly bright future, and I'm excited to share more with you about our strategic vision at our investor day on December 1. As we look at our third quarter financial highlights, I want to remind you that the adjusted financial metrics we'll be discussing today refer to non-GAAP adjusted metrics in the current period and non-GAAP pro forma adjusted metrics in the year ago period.\n\nRevenue decreased 8% year over year or 6% ex-FX, with growth in four of our six divisions being offset by continued decreases in ratings, as well as a year-over-year decline in engineering solutions this quarter, due to the timing impact of a single product that Ewout will discuss later. Recurring revenue increased 2% year over year, representing 84% of revenue in the quarter. Adjusted expenses declined 5% year over year as cost synergies and disciplined expense management offset some of the inflationary impact we're seeing in labor and technology. Outside of the ratings business, we saw an average of approximately 250 basis points of adjusted operating margin expansion year over year.\n\nWe're updating our guidance ranges to reflect continued headwinds in ratings, as well as better-than-expected performance in indices. Guidance ranges for our other four divisions are unchanged from last quarter. I'd also like to share a few other highlights from the third quarter. As I mentioned, we're coming up on two years since the merger was announced and nearly eight months since the close.\n\nOur post-merger integration efforts are proceeding on track, but very importantly, we're outperforming on both cost and revenue synergies. Our customer conversations remain encouraging despite the economic environment. We continue to see significant growth in multiple business lines due to secular trends that will likely benefit us for years to come, like energy transition, as well as the near-term benefit we see from volatility and the need for insights and analytics in times of turbulence. We also remain committed to the capital allocation plan we laid out for you at the time the merger closed.\n\nWe're on track to deploy the full $12 billion in funds for accelerated share repurchases by year-end. Turning to the commercial success we're seeing in the business. The merger continues to generate encouraging conversations with our customers about the increased value we offer as a combined company. In market intelligence, we developed a strong commercial pipeline in September, and we believe we will see a reacceleration of the desktop business in the fourth quarter.\n\nBetween market intelligence and commodity insights, we've generated well over 3,000 cross-sell referrals since the merger closed, and the conversion rates are strong. Despite the issuance environment, our ratings teams remain highly engaged. We remain connected with investors and issuers to maintain relationships and ensure we have the appropriate understanding of their needs in advance of any recovery in the debt markets. Commodity insights and mobility are both seeing significantly improved retention rates relative to recent history, as well as strong competitive wins and new customer growth.\n\nWe saw a very important win in our indices business this quarter as a large Japanese asset manager launched the first cross-asset ETF in Japan based on both iBoxx Fixed Income and S&P Dow Jones Equity Indices. While it's still early in our efforts in cross-asset indices, this launch is powerful proof of the demand for such products among global asset managers. Now, to recap the financial results for the third quarter. Revenue decreased 8% to $2.86 billion or 6% constant currency.\n\nOur adjusted operating profit decreased 12% to $1.3 billion. Our adjusted pro forma operating profit margin decreased approximately 200 basis points to 46% as both profits and margin were negatively impacted by the decrease in ratings transaction revenue, partially offset by cost synergies realized in the quarter. Our non-ratings businesses in aggregate grew revenue 4% in the quarter compared to prior year. As you know, we measure and track adjusted segment operating profit margin on a trailing 12-month basis, which was 45.5% as of the third quarter.\n\nDespite the impact of the issuance environment, we benefited from the resiliency of our businesses, as well as disciplined cost management and cost synergies to significantly moderate the impact to our adjusted EPS, which declined only 4% year over year. Looking across the six divisions. I'm pleased to report positive growth across four of our divisions, with ratings continuing to work through a difficult issuance cycle and engineering solutions entering an off-cycle quarter without the sale of a core product that is released once every two years. Throughout the year, we've seen outsized growth in certain products as customers depend on our data and information to make informed decisions during uncertain times.\n\nWe saw double-digit revenue growth in multiple product lines as a result. Within our indices business, revenue from exchange-traded derivatives outperformed our internal expectations, growing nearly 40% year over year. Our CDS Indices, which include the CDX and iTraxx Index families increased 66%. Markets continue to recognize our leadership in areas like climate and financial data, and we provide a consolidated platform on which to access information.\n\nWhether it's tracking market movements, company performance or identifying physical risk from weather events, our customers continue to come to us for help navigating the uncertainty. This is evident in the growth we saw in key product offerings for market intelligence, including Trucost and Equities, data and analytics. I'm pleased to mark the first anniversary of the launch of Platts Dimensions Pro, a one-stop experience across Platts benchmark price assessments, news and analytics spanning 13 commodities, including energy transition. Over the last year, we've continuously increased functionality, introducing new features on a regular basis.\n\nThis unified platform is gaining clear recognition with active user growth nearly doubling in just the last six months. Moreover, some of our newer benchmarks continue to expand their market presence. Our low-sulfur marine fuel assessment is a great indicator of the trajectory of the successful new benchmark. Assessments like this often take multiple years to truly scale and become literal market benchmarks.\n\nIn the third quarter, approximately 1.3 billion barrels of fuel were traded based on our price assessment, representing a 15% increase compared to last year. Our iron ore assessment has been the primary physical market pricing reference for seaborne fine iron ore delivered to China for over 10 years, and it's still growing at an impressive rate. We understand the importance of reliable market benchmarks to the secular energy transition story, and we're positioning ourselves for long-term success. The chart on the right shows the cumulative number of new assessments we have launched and energy transition over the last two years.\n\nThese include a new suite of Australian hydrogen prices covering one of the key producers of this future fuel, as well as the methane performance certificate that we believe will be an integral component of low-carbon crude trading. Now, turning to issuance. During the third quarter, global-rated issuance decreased 40% year over year. In the U.S., rated issuance in aggregate decreased 47%.\n\nEuropean-rated issuance decreased 19%, and in Asia, rated issuance declined 47%. High yield was down by 80% year over year in both United States and Europe and was down nearly 100% in Asia. Structured finance in Europe was the only positive regional category in the quarter, increasing 7% year over year. We've included additional details on the subcomponents of issuance by region in the slide deck.\n\nWe continue to make significant progress in our sustainability products. ESG revenue increased nearly 40% year over year to nearly $50 million in the quarter. We saw continued innovation in our ESG indices and the market recognition of our strength. We launched the S&P Net Zero 2050 Carbon Budget Indices, and we ended the quarter with ESG ETF AUM of $35 billion, an increase of 7% year over year in a down market.\n\nWithin market intelligence, we launched enhanced physical risk exposure scores and financial impact data sets to support clients as they seek to understand and manage the physical and financial exposure to climate change. Our ratings division continues to see success here as well, completing 13 ESG evaluations and 23 sustainable financing opinions in the quarter. One of the most important competitive advantages in our ESG efforts is the Corporate Sustainability Assessment, which is an annual comprehensive assessment completed in partnership with participating companies. The S&P Global brand and everything it stands for continues to drive growth in the number of companies seeking to partner with us in this assessment process.\n\nYear-to-date, we've seen more than 2,300 companies opt in, a more than 25% increase from the same time last year. Now, turning to the outlook for the remainder of the year. Beginning with our issuance forecast. Our ratings Research team is expecting an approximately 19% decline in global market issuance, including both rated and unrated issuance for the full year.\n\nThis compares to the previous forecast of down 16%. Importantly, our financial results and guidance are more closely tied to billed issuance, which can differ materially from market issuance as we described last quarter. Year-to-date, market issuances declined approximately 14%, while build issuances declined approximately 42%. Based on the trends we saw in September and October, we now expect billed issuance to be down approximately 45% to 50% for the full year.\n\nWhen we look to the broader macroeconomic environment for the rest of 2022, we continue to see further deterioration from what we expected in August. In addition to the downward trend in issuance, our expectations for GDP growth, inflation and the commodities markets have all lowered. With only two months left in 2022, we wanted to provide what will likely be the final update on some of the macroeconomic indicators we're using to help inform our financial guidance for the year. We'll not be discussing our expectations for 2023 on this call, but we will be closely monitoring both the internal and external indicators of our business over the coming months.\n\nAnd we'll plan to provide our initial 2023 outlook at the customary time when we report our fourth quarter results early next year. Before I turn the call over to Ewout, I want to thank the incredible people we have at S&P Global. Our people have executed well in a challenging environment this year and have delivered great value for our customers and the organization while managing a complex integration. I'm confident that we're well-positioned to drive long-term growth and create long-term value for our shareholders.\n\nWith that, I'll turn the call over to Ewout to walk through financials and guidance. Ewout?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nThank you, Doug. Doug has already discussed the headline financial results, and I would like to cover a few other items. As Doug mentioned, the adjusted financial metrics we will be discussing today refer to non-GAAP adjusted metrics for the current period and non-GAAP pro forma adjusted metrics in the year ago period, unless explicitly called out as GAAP. Adjusted results also exclude the contribution from divested businesses in all periods.\n\nAdjusted corporate unallocated expenses improved from a year ago, driven by a combination of synergies and reduced incentive cost. Our net interest expense decreased 17% as we benefit from lower average rates due to refinancings following the merger. Adjusted effective tax rate was up modestly, but toward the low end of the guidance range we expect for the full year. As most are aware, we exclude the impact of certain items from our adjusted diluted EPS number.\n\nAmong those items in the third quarter were approximately $108 million in merger-related expenses. The details of which can be found in the appendix. We generated adjusted free cash flow, excluding certain items, of $965 million. We remain committed to returning the majority of this cash flow to shareholders through dividends and share repurchases.\n\nYear-to-date, we have deployed $11 billion toward share repurchases, and we expect the final $1 billion of our previously announced ASR program to be completed by year-end. We note that the U.S. dollar remained strong against many foreign currencies, and we've seen a corresponding impact on both our revenue and expenses. As a reminder, approximately three-quarters  our international revenue is invoiced in U.S.\n\ndollars, which provides some protection to revenue against FX volatility. In addition to the natural hedges that exist due to the global footprint of our people, we have a hedging program in place that further mitigates the ultimate impact on our earnings. For the third quarter, we saw a $0.03 favorable impact to EPS from foreign exchange and hedging programs. Turning to expenses.\n\nWe are committed to disciplined expense management in this current environment. And similar to last quarter, we highlight the levers we continue to pull to protect margins where we can while still preserving our investments to drive future growth. Actions taken include pull forward in synergies, a reduction in incentive accruals, adjustments to the timing of certain investments and pausing select hiring and limiting consulting spend in some areas. Through cost synergies and other management actions we have taken so far this year, we expect to generate more than $400 million in expense savings for 2022.\n\nNow, I would like to provide an update on our synergy progress. In the third quarter, we achieved $165 million in cumulative cost synergies and our current annualized run rate is $311 million. I'm pleased to report we continue to outperform our initial timeline on both revenue and cost synergies year-to-date. The cumulative integration and cost to achieve synergies through the end of the third quarter is $641 million.\n\nGiven the outperformance on the timing of our synergies, we now expect to achieve slightly more than the 35% to 40% of total cost synergies in 2022 that we were targeting previously. Now, let's turn to the division results and begin with market intelligence. Market intelligence revenue increased 4% with strong growth in data and analytics, offset by slower growth in desktop and flat growth in enterprise solutions. For this quarter, recurring revenue accounted for approximately 96% of market intelligence total revenue.\n\nExpenses were roughly flat this quarter with increases in compensation expense, cloud spend and outside services being offset by cost synergies and lower incentive compensation. Market intelligence remains the biggest driver of cost synergies from the merger and the synergy outperformance we have seen year-to-date. Segment operating profit increased 13%, and the segment operating profit margin increased 260 basis points to 33.9%. On a trailing 12-month basis, adjusted segment operating profit margin was 30.9%.\n\nThe OSTTRA joint venture that complements the operations of our market intelligence division contributed $19 million in adjusted operating profit to the company. As a reminder, because the JV is a 50% owned joint venture operating independent of the company, we recognized their results on an after-tax basis and do not include the financial results of OSTTRA in the market intelligence division. Looking across Market Intelligence, there was growth in most categories. And on a pro forma basis, desktop revenue grew 3%, data and advisory solutions revenue grew 7%, enterprise solutions revenue was flat and credit and risk solutions revenue grew 7%.\n\nFor desktop, we saw slower growth this quarter, driven in part by the timing of certain revenue recognition items, and we expect desktop to reaccelerate in the fourth quarter. For enterprise solutions, the business line continues to see headwinds in several of our volume-driven products that rely on equity and debt capital markets activity under variable subscription terms. Excluding the impact of FX and these volume-driven products, growth across market intelligence would have been approximately 7% year over year. While we remain confident in the long-term growth of all these product lines, we expect deceleration in categories outside of desktop to persist in the fourth quarter.\n\nNow, turning to ratings. Ratings continued to face difficult market conditions this quarter as issuance volumes remained muted with revenue decreasing 33% year over year. Transaction revenue decreased to 56% on the continued softness in issuance we highlighted earlier. Non-transaction revenue decreased 6% on a reported basis and 2% on a constant currency basis, primarily due to lower rating evaluation services and initial issuer credit ratings, partially offset by increases in CRISIL.\n\nICR and RES revenue are historically correlated with the relative strength of the issuance environment and M&A activity, respectively, and the declines we are seeing here are purely indicative of those market conditions. Expenses decreased 19%, primarily driven by disciplined expense management, including lower incentive expenses, partially offset by increased salary and fringe expenses. This resulted in a 41% decrease in segment operating profit and a 750 basis point decrease in segment operating profit margin to 55.9%. On a trailing 12-month basis, adjusted segment operating profit margin was 57.9%.\n\nNow, looking at ratings revenue by its end markets. The largest contributors to the decrease in ratings revenue were a 44% decrease in corporates and a 31% decrease in structured finance, driven predominantly by structured credit. In addition, financial services decreased 20%, Governments decreased 33%, and the CRISIL and other category increased 9%. And now turning to commodity insights.\n\nRevenue increased 5%, driven by strong performance of subscription products, including those within price assessments and energy and resources data and insights lines. However, that growth was impacted by the Russia-Ukraine conflict. As noted on the slide, revenue related to Russia contributed $12 million in the third quarter last year and made no contribution in the third quarter this year. Excluding this impact, commodity insights would have grown approximately 8% in the third quarter.\n\nThere's no change to the expected impact from this conflict. But as a reminder, on an annualized run rate basis, we expect commodity insights revenue and operating income to be lower by approximately $52 million and $51 million, respectively. For this quarter, recurring revenue contributed 91% of commodity insights revenues. Expenses increased 1%, primarily due to salary and fringe and an increase in T&E expense, partially offset by merger-related synergies, lower consulting spend and lower real estate costs.\n\nSegment operating profit increased 9%, and the segment operating profit margin increased 190 basis points to 45.8%. The trailing 12-month adjusted segment operating profit margin was 43.8%. Looking across the commodity insights business categories. Price Assessments grew 8% compared to the prior year, driven by continued commercial momentum and strong subscription growth for market data offerings.\n\nenergy and resources data and insights also grew 8% in the quarter, driven by strength in gas, power and renewables and in petrochemicals. advisory and transactional services decreased 1% in the third quarter. The upstream business was down 2% compared to prior year, mainly driven by higher comps for software and analytics products offerings, as well as the impact of Russia. Excluding that impact and the impact of FX, Upstream ACV growth would have been positive in the quarter.\n\nIn our mobility division, revenue increased 8% year over year, driven primarily by continued high retention rates and new business growth in CARFAX. For this quarter, recurring revenue contributed 78% of mobility's total revenue. Expenses grew 5% year over year as we have yet to lap planned increases in headcounts, and we saw continued cloud expense growth, which were partially offset by lower data cost and favorable FX. This resulted in a 14% growth in adjusted operating profit and 200 basis points of margin expansion year over year.\n\nOn a trailing 12-month basis, the adjusted segment operating profit margin was 40%. Dealer revenue increased 10% year over year, driven by strong demand for CARFAX as dealerships' profitability remain at elevated levels. Manufacturing grew 4% year over year, driven by strength in subscriptions and an uptick in the Recall business. Inventory shortfalls continue to temper growth as OEMs spend on marketing initiatives powered by mobility products remains muted.\n\nFinancials and Other increased 9%, primarily driven by continued strength in our insurance underwriting products and new business. S&P Dow Jones Indices revenue increased 3% year over year with strong margin expansion despite lower assets under management. For the third quarter, recurring revenue contributed 84% of the total for indices. During the quarter, expenses were roughly flat as strategic investments and higher information services costs were offset primarily by lower incentives and other expenses.\n\nSegment operating profit increased 5%, and the segment operating profit margin increased 100 basis points to 70.3%. On a trailing 12-month basis, the adjusted segment operating profit margin was 68.8%. Asset-linked fees were down 5%, primarily driven by lower AUM in ETFs. Exchange-rated derivative revenue increased 37% on increased trading volumes across key contracts, including a more than 60% increase in S&P 500 Index Options volume.\n\nData and custom subscriptions increased 10%, driven by new business activities. Over the past year, market depreciation totaled $472 billion. ETF AUM net inflows were $194 billion. This resulted in quarter-ending ETF AUM of $2.3 trillion, which is an 11% decrease compared to one year ago.\n\nOur ETF revenue is based on average AUM, which decreased 4% year over year. As a reminder, revenue tends to lag changes in asset prices. Given the declines across equity markets so far in the back half of this year, we continue to expect softness in asset-linked fees as we close out 2022. engineering solutions revenue declined 8% in the quarter, driven primarily by the negative impact of the timing of the Boiler Pressure Vessel Code, or BPVC, which was last released in August of 2021.\n\nThe BPVC contributed approximately $1 million in revenue this quarter compared to approximately $8 million in the year ago period. For this quarter, 94% of engineering solutions revenues were classified as recurring. Adjusted expenses decreased 7% due to favorable impact on BPVC royalties. On a trailing 12-month basis, the adjusted segment operating profit margin was 19.1%.\n\nNon-subscription revenue in engineering solutions decreased 63% year over year for the reasons I mentioned on the previous slide, while subscription revenue increased 3% over the same period. Now, moving to our guidance. This slide depicts our new GAAP guidance. And this slide depicts our updated 2022 adjusted pro forma guidance.\n\nDue to the continued softening of the issuance environment, we now expect revenue to decrease mid-single digits compared to our prior guidance. Some of that impact is offset by the outperformance in indices. The net impact of our lower ratings revenue expectations, combined with the cost measures and capital allocation measures we have outlined today result in our slightly lower margin outlook and a new adjusted EPS range of $11 to $11.15. This margin outlook reflects our continued expectation for approximately 180 basis points of margin expansion outside of our ratings business.\n\nInterest expense is expected in the range of $345 million to $355 million, slightly lower than our previous guidance due to higher interest on our cash deposits and positive impact from currency hedges. We're also reducing our outlook for capital expenditures to $115 million due to intentional delays in real estate investments. Adjusted free cash flow, excluding certain items, is now expected to be approximately $4 billion. The following slide illustrates our guidance by division.\n\nBased on this past quarter's performance, we're updating our expectations for adjusted revenue growth and adjusted operating profit margin for ratings and indices. The guidance ranges for our other divisions are unchanged. In closing, despite the geopolitical tensions and a challenging macroeconomic environment weighing on the market, our portfolio of strong businesses continue to prove resilient. Furthermore, I'm pleased with the progress our teams have made since the closing of the merger earlier this year.\n\nWe look forward to providing you with a deep dive into our businesses and the longer-term outlook of the company at our investor day on December 1. And with that, let me turn the call back over to Mark for your questions.\n\nMark Grant\n\nThank you, Ewout. [Operator instructions] Operator, we will now take our first question.\n\nOperator\n\nThank you. Our first question comes from Owen Lau from Oppenheimer. Owen, your line is open.\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nGood morning and thank you  taking my questions.  the MI credit and risk solutions and data and advisory solutions, could you please unpack a little bit on the products and services driving that growth in current backdrop? Are they new customers? Because based on my understanding, many of these products are subscription-based. I just want to get a better sense of how you can further monetize it and drive that growth. Thank you.\n\nDoug Peterson -- President and Chief Executive Officer\n\nHi, Owen. This is Doug, and thanks for joining us today. Let me start, first of all, by mentioning that within market intelligence, credit and risk solutions has always been a long-term outperformer. It's an area that we see very high demand from the markets for information about credit risk and other types of risk, especially in this market.\n\nAs you know, the core products in this area are the basic products that are providing information from the ratings business. So things like RatingsDirect, RatingsXpress. We also have a suite of products like Credit Analytics. And we do see a lot of growth now related to credit climate analytics.\n\nThis is an area where we're seeing increased interest and demand, especially from financial institutions, especially large global banks. In addition, we're seeing some other growth from areas like traded market risks. Some names of, I'll say, XVA, CCR. We have a VAR product, et cetera.\n\nAnd then, we have some additional buy-side risk opportunities for clients to look at for market risk and stress scenarios. So if you look at the entire suite of products, we're able to provide the market information at the time when they really want to understand risk.\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nGot it. That's very helpful. And then, my follow-up is somehow related to the ratings business. Could you please talk about your view on how private credit market might have impacted S&P Global Rating business? And how S&P can provide services in this area?\n\nDoug Peterson -- President and Chief Executive Officer\n\nYes. Thanks. On the private markets, as we saw earlier this year, there was a retreat of institutional investors and retail investors from credit funds. So there was really no liquidity at the beginning part of this year.\n\nIt was a combination of people that were risk averse and also looking at the shift between fixed and floating. There were a lot of moves in interest rates. So we saw a retreat from the traditional loan funds and high-risk investors that left the markets. That left an opportunity for the private credit funds that had traditionally been focusing on mid-market credit.\n\nSo SME credit was their expertise. Many of them also had started moving into the higher quality, higher level of risk and large-cap companies. So they were there to fill the gap. The gap was filled by private credit at the beginning of the year.\n\nAnd we know that they've also been able to take on loans with a faster, also with a higher risk level. And so, we've seen that increase during the year. Now, how do we think about that? First of all, we look at that as an opportunity for us going forward. We believe that the private credit funds will be looking over time to have some sort of risk, transformation, whether it's related to fixed floating or it has to do with securitization or syndication.\n\nWe think at that time, they're going to be wanting some Estimate services, potentially ratings services. In addition, we've identified private credit as one of our most important strategic growth drivers. We already have a base of private credit businesses that were part of IHS Markit. And related to that, we have a strong starting point with products like iLEVEL that provides information to portfolio managers.\n\nSo we've identified private credit as a growth area for us for ratings, as well as for market intelligence going forward. And we're watching the trend very carefully. We know at some point, investors will come back to the markets, and we'll see a broadening of the market again. But we've been watching this very closely and are actually interested in this as a growth area for us.\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nThat's very helpful. Thanks, Doug.\n\nDoug Peterson -- President and Chief Executive Officer\n\nThanks, Owen.\n\nOperator\n\nOur next question comes from Ashish Sabadra from RBC Capital Markets. Ashish, your line is open.\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nThanks for taking my question. I wanted to drill down further on the ratings and the issuance guidance. I believe my back of math -- envelope math suggests that you're assuming a similar growth in fourth quarter as third quarter for transaction revenues. I just wanted to see if I'm in the right ballpark, and I was just wondering if you could provide any color on what your expectations are for issuance for the rest of the year.\n\nAre you assuming any rebound? And how are the conversations with the issuers coming along?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nAshish, if you look at the outlook, as you know, we are not really providing quarterly guidance. So we're not really speaking about the quarterly outlook for either our financial results or some of the input variables like issuance. But of course, if you look at the numbers that we put out today, then if you would do a backwards calculation, you would assume that the most recent trends we're seeing in terms of issuance is what we expect to continue also in the fourth quarter. So definitely, the main reason why we took our guidance down.\n\nI would say that's the only reason because overall, the impact on our results from a top line perspective is about $200 million reduction in revenue outlook for the ratings business, so about $0.50 of EPS. And then, there were a couple of smaller things. But net-net, I think that's the main driver of why the EPS outlook is down for the full year.\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nThat's very helpful color. And maybe just switching gears on mobility, pretty strong momentum there, despite what we are seeing in the auto lending space or in the auto space. And so, I was just wondering as we start to see the demand for auto slow down, how should we think about the growth in the business? And is there some countercyclicality as well here in the business?\n\nDoug Peterson -- President and Chief Executive Officer\n\nYes, Ashish, thank you for your questions. When it comes to mobility, we see that there's a very interesting shift going on over the last couple of years. As you know, when the market started slowing down from the pandemic and the supply chain interruptions, we saw the used auto market really start expanding and we benefited from the CARFAX products and the CARFAX suite of products, especially at the dealer level. We know that there's some countercyclicality as you say, it is as the market returns to new autos coming into the market and inventories rise, that we will benefit from products and services to the OEMs and, as well as the dealers that are going to start having a different type of relationship again with the manufacturers and suppliers.\n\nSo we're watching right now very closely three big trends in the automotive market: what's happening with the used car market, where we have a strong position, what's happening with the OEMs and the supply chain for the new automobiles. They've been in historic lows over the last two years. So we expect that's going to start going up. And then, there's also transformation taking place in the industry as more and more vehicles start to become electric-based with the drivetrain as opposed to internal combustion.\n\nSo a lot of trends, which are all play to our advantage because we have data analytics and research products that we can serve all of the users in these markets.\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nThat's very helpful color. Thanks again.\n\nOperator\n\nOur next question comes from Alex Kramm from UBS. Alex, your line is open.\n\nAlex Kramm -- UBS -- Analyst\n\nYeah, hey, good morning. I understand that you don't really want to comment much on 2023 quite yet. I guess, we'll wait until December. Just on the issuance side, however, your own research group yesterday put out not only the 2022 update but also the 2023 initial look, which I think calls -- if I got this right, for 2% issuance growth and 10% growth, in particular, for the corporate side, which I think is the most important for you.\n\nSo since this is out there, I'm just wondering how we should be thinking about that forecast? And what's kind of items you would think about as you think about how that flows into billed issuance and revenues? I know it's early but given that your own company has an issue outlook out there already, figured it's relevant.\n\nDoug Peterson -- President and Chief Executive Officer\n\nYes. Thanks, Alex. As you say, we produce a report. And what we're looking at right now is understanding what are going to be the main factors driving us toward the end of the year.\n\nWe've given you those in that report as well. That showed that issuance was expected to be down by 19% for the full year, which compared to 16% from our last report. As you know, we will wait to provide guidance for 2023 until February when we provide our full issuance report, as well as our guidance for the year. What you saw from the report from our team, our credit research team, is product research and it's not necessarily geared directly to how we're going to find billed issuance.\n\nAs you recall, last quarter, we explained very clearly what is included in billed issuance. We take the -- what would be expectations for issuance overall. We add in leveraged loans. And then, we extract some debt areas like unrated categories such as MTNs, most of the domestic debt from China.\n\nAnd we also exclude the international public finance from those calculations to come up with our expectations. But maybe more importantly to your question, we're always in the market. As you saw, we talked about having had 3,000 interactions with the markets during the quarter. We are all over the market to understand what are the factors that are going on that are driving issuance and will drive issuance.\n\nSo we do provide our guidance going forward. But we're looking at the issuance forecast, GDP growth, macroeconomic factors like inflation, interest rates. We're looking at spreads, which have been quite high over the last few quarters. Maturity schedules, which are quite encouraging going forward into 2023, '24, '25, et cetera, M&A pipeline.\n\nSo as you know, at the time we come out with our guidance, we will have looked at all of these factors. But maybe the most important point is that we're not just standing around and waiting. We're very actively engaged with the markets.\n\nAlex Kramm -- UBS -- Analyst\n\nAll right. Fair enough. Then maybe just going to market intelligence. I think since the deal was announced or closed, I think we have had this expectation that more and more of the -- I guess, subscriptions on the IHS Markit side will be moving onto our S&P kind of enterprise umbrella.\n\nSo just wondering if that's still true. If there's a timeline for moving more and more that legacy Markit subscription under that S&P umbrella. And yes, how far we're along, if you're able to pick up any sort of incremental pricing as you do that? Or how should we think about that transition over time, if that is a plan?\n\nDoug Peterson -- President and Chief Executive Officer\n\nYes, Alex, it's very, very early for us to talk about it. But what I'll tell you is going back to the last comment I made that we're incredibly linked into the markets right now. We have all of our commercial teams are out speaking with our customers. What we're finding is that there's a lot of opportunities for us to start with cross-sell.\n\nSo our initial early wins have been with cross-sell, selling different products across -- within the divisions and sometimes across the divisions. But we are hearing opportunities for moving data into the desktop, finding some products for data and research and analytics fit together. So to your point, it's a vision that we have, but it's really early for us to give you any kind of detailed analytics about it.\n\nAlex Kramm -- UBS -- Analyst\n\nAll right. Thank you.\n\nMark Grant\n\nThanks, Alex.\n\nOperator\n\nOur next question comes from Toni Kaplan from Morgan Stanley. Toni, your line is open.\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nThank you. I wanted to ask about ratings margins. They were down sequentially, but they were still really resilient just given the environment and especially relative to one of your big competitors. Just wanted to ask you if you could talk about some drivers that enabled you to flex cost outside of incentive comp?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\n Toni, you're right. We are quite pleased with the overall expense discipline of the company in the third quarter. You've heard us announce last quarter that we're taking additional actions to deal with the macro environment and we're actually really pleased how that is playing out, and you may continue to see that kind of results from us going forward across the company. And of course, we take the benefit also from the cost synergies that we can implement and accelerate during this period.\n\nSo if you look specifically at the ratings business, it is a mix. On the one hand, we continue to make sure that we invest in future growth, making sure that we stay competitive from a compensation perspective. We want to preserve the capacity we have on the analytical side. But on the other hand, there are also discretionary costs that we are bringing down.\n\nThere are allocated costs that are benefiting from the synergies that we are realizing across the company, and then also incentive compensation is down year over year. So it's actually a balance of different elements that go into the mix. But definitely, as you have seen in the past, we're always focused in terms of trying to preserve margins in our businesses as much as possible, particularly in more challenging macro environments.\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nGreat. And this is a little bit of a broad question and you could take it where you want. But just -- could you talk about any changes in customer behavior over the last six months, and this could be elongation of the sales cycle in some places? Or maybe it's just different products that have been more in demand? Just wanted to get a sense of sort of changes in the businesses over the last recent history.\n\nDoug Peterson -- President and Chief Executive Officer\n\nYes. Toni, thanks for that question. And as you know, the markets are going through a lot of uncertainty and turmoil. We've never lived through a period where you have an end of a pandemic, a war, inflation, interest rates going up, all sorts of different impacts.\n\nI mentioned earlier on the mobility discussion what kind of impact that's had on the markets overall. We've seen this interest in talking about risk. It's a topic, which has increased dramatically. When we meet with customers, they want to talk about the external environment.\n\nThey want the expertise of S&P Global that comes from our entire company to understand what's happening with risk, with markets, with credit, as well as equities, commodities. So we start with very broad dialogues. And then, we dig deeper into some specific topics. One that comes up in almost every single conversation we have is energy transition, climate and sustainability.\n\nThat's a really common discussion. It's increasing in terms of how much time we spend on it. And another one is data and analytics. How are customers thinking about their own application of AI, data and analytics.\n\nThey want to learn from us how we're managing S&P Global, but they also want to learn how they can be deploying new types of products and services using more AI. But overall, we have not seen any kind of initial pushback on slowing down of sales cycle. Clearly, there are some markets, as I mentioned, the ratings market, there's not a lot of issuance right now, but we've stayed engaged with the market. But maybe net-net, the big topics we spent a lot of time on the macroeconomic environment, sustainability, as well as AI and data.\n\nThose are big conversations we have in almost every customer interaction.\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nTerrific. Thank you.\n\nMark Grant\n\nThanks, Toni.\n\nOperator\n\nOur next question comes from Jeff Silber from BMO Capital Markets. Jeff, your line is open.\n\nJeff Silber -- BMO Capital Markets -- Analyst\n\nThanks so very much. I wanted to start with a ratings-related question. I asked your competitor, your large competitor the same question. I'm just wondering about your thoughts.\n\nWhat are you looking for in terms of signs of an uptick in that market, green shoots, et cetera? What should we be focusing on?\n\nDoug Peterson -- President and Chief Executive Officer\n\nThere's a few things that I'm focusing on myself, and I know that if we had our ratings team specifically on the call, they might tell me that there's others that are looking at beyond that. But clearly, there's a set of factors, M&A activity is one for me, which is -- it's kind of an informal indicator. M&A activity has been quite weak recently. Typical M&A has a set of transactions come along with it, may be a bridge loan, which turns into a deal loan, which turns into a bond or rated loan, et cetera.\n\nM&A activity has been weak. IPO is another one. The reason I look at those myself is that those are just their activity, which denotes confidence in the markets that people are willing to invest. But then as you recall, we're having conversations with issuers.\n\nWe mentioned 3,000 that we had last quarter with issuers. And we see a lot of interest in investing people that have plans for investing in new markets for innovation, for investing in venture capital, ways that they can see new shoots in their own businesses. So we're watching when is it that people actually pull the trigger. And maybe the takeaway is it's not, if it's when.\n\nWe know that there's a lot of people out there that are ready to go. They have great ideas, but the question is when will those conditions of interest rates, of stability, of market confidence, when will those be back when people start going back to the market? Finally, we do look at the maturity schedules. And we know that there's a point starting toward the middle of next year that there will be maturity schedules are going to start kicking in and we're going to watch that carefully as well. We'll there be pull forward from that, but that's another factor we're going to be watching.\n\nJeff Silber -- BMO Capital Markets -- Analyst\n\nOK. That's really helpful. And I can shift over to the mobility line of business. Margins, at least, by our record, looks like it hit an all-time high, even I think compared to IHS' business, and I know it's a different segment right now.\n\nBut can you talk about what's going on there? And should we expect margins to continue to go higher from here?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nJeff, we are always aspiring to improve margins across all of our businesses. So mobility is not an exception to that. That is because of the fact that we're focused on operating leverage. We always like to see the top line growing faster than the expense line.\n\nAnd of course, aided then by strategic investments to aim for future growth as well. What we are seeing in the mobility business is really a positive overall environment that helps and is very supportive for the business, particularly with low inventory levels. We see margins high for the OEMs and for the dealers and that is driving high retention rates. The offset of that is that we see lower spend for sales and marketing products that we are having, and that's because of the same factor that the inventory levels are low.\n\nSo you could say there's a kind of an inherent hedge in that business. If the market starts to turn, if we see that the demand supply starts to shift in the car market, then we would also see those different revenue streams moving in opposite directions. But we think that with that, we're insulated from our overall financial impact, and therefore, we can continue to focus on margin expansion as well. And as Doug mentioned before, we also are taking a benefit from used car markets, and that has been proven to be quite resilient through the cycle.\n\nSo yes, overall, we are really happy with the growth of mobility, the margins, and we would see that continuing going forward.\n\nJeff Silber -- BMO Capital Markets -- Analyst\n\nOK. Appreciate all the color. Thank you.\n\nMark Grant\n\nThanks, Jeff.\n\nOperator\n\nOur next question comes from George Tong from Goldman Sachs. George, your line is open.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nHi. Thanks. Good morning, Billed issuance was down 40% in the third quarter. You're assuming full year billed issuance declines of 45% to 50% will be worse than the third quarter decline.\n\nWhat are you seeing that suggests 4Q could potentially be worse than 3Q, in terms of billed issuance? Any color there would be helpful.\n\nDoug Peterson -- President and Chief Executive Officer\n\nYes. First of all, let me just give a little bit more color on that. As you know, at the last forecast, we saw that issuance of the non-financials or corporates would be down about 30%. We now see it down about 35%.\n\nAnd then, we see that in financial services, they had expected to be down 10%, now down about $14 or so. When you look at the total billed issuance, and we mentioned that it was going to -- year-to-date was down 42% and we're expecting it to be down now 45%. This is going to be based on what we see in the pipeline. As I mentioned in the answer I gave a few minutes ago, we see that the market itself is quite hesitant.\n\nIt's not a question of if, it's a question of when. And we see that during the fourth quarter, what we've picked up from investment banks from issuers directly that right now, they're still waiting to see what the conditions are going to be around economic growth, interest rates and spreads. So it's just based on our forecast, not our issuance forecast. This is based on our market forecast based on people that are meeting with issuers and meeting with investors that the current conditions are still such that people are holding back before they go to market.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nVery helpful. And related to that, we're likely going to be in a higher interest rate environment for some time relative to pre-COVID. What are your thoughts on whether corporates may enter a phase of balance sheet delevering and implications for issuance performance?\n\nDoug Peterson -- President and Chief Executive Officer\n\nYes, that's a theoretical question, but let me go back and look at history. I know that many of us have been in the market for many years, remember when interest rates were 4%, 3%, 4%, 5% base rates and the markets were incredibly active. I think that we'll settle into a range once there's stability and we understand what the longer-term rates are going to be, what longer-term inflation and growth are going to be. Companies and financial institutions will go back to the markets because they want to invest and grow.\n\nWe know that organizations like to grow and to grow, you deploy capital. We also look at the trend around the globe where more and more markets are shifting from being banking markets to capital markets. Right now, in Europe, there's a couple of shifts going on in the support programs that the ECB was providing to the banks. This was very easy, very low-cost funding.\n\nThey're starting to wean the banks off of those, and they're going to the capital markets to raise more capital, as well as to deploy more capital into bonds instead of into loans. So we see this trend of capital marketization around the globe, and we think that's another trend in the long run that will drive a lot of positive tailwinds for the ratings business.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nVery helpful. Thank you.\n\nMark Grant\n\nThanks, George.\n\nOperator\n\nOur next question comes from Craig Huber from Huber Research Partners. Craig, your line is open.\n\nCraig Huber -- Huber Research Partners -- Analyst\n\nGreat. Thank you. My first question on pricing. Can you just update us on a like-for-like basis? What would you say the average price increase is this year? And how does it vary across the segments? Is it 3% to 4%? Or is a little bit higher?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nCraig, well, we are always very careful when we speak about pricing in isolation because, first and foremost, we start with customer value. What do we deliver for our customers. And the good news is that based on the very high value of our products and services, we should be able to pass on cost/price increases and to achieve more favorable contract terms and fees over time at renewal. Of course, it depends on facts and circumstances of each and every product, each and every customer situation and of the situation of each and every of our businesses.\n\nBut that is our overall philosophy. I can't give you specifically a number for across the company, how much price increases are up compared to previous periods. But there are definitely areas where we are looking at price increases or have already implemented price increases that have been higher than in the past. But again, that all has started with that there is a good balance with the overall customer value that we are delivering.\n\nCraig Huber -- Huber Research Partners -- Analyst\n\nMy second question, please, on market intelligence. Can you just talk a little further about the health of your clients, the sales pipeline there a little bit further. I mean your numbers speak for themselves. How do you feel about the outlook for market intelligence right now?\n\nDoug Peterson -- President and Chief Executive Officer\n\n Yes. We still feel very, very positive, and we're optimistic about the market intelligence pipeline. You read every once so about some of the financial institutions here and there that might be slowing down some of their growth, but we're not seeing that in terms of negotiations with clients. But very importantly, one of the propositions of the merger between IHS Markit and S&P Global was to cross-sell the excellent products from both groups to the client bases on the other.\n\nWe believe that we have a strong diversification of our client base. And as an example, in the IHS Markit businesses, their financial services business was mostly focused on financial services. We're finding that a lot of the opportunities and a lot of our initial cross-sell has been selling IHS Markit products to corporate clients. We think that there is a lot of upside and a lot of opportunity.\n\nWe are out in the market actively talking with our customers about ways we can bring value through new products, new services through data, et cetera. So right now, we're not seeing any pullback or any kind of major slowdown of our sales activities or pushback from clients.\n\nCraig Huber -- Huber Research Partners -- Analyst\n\nGreat. Thank you, guys.\n\nMark Grant\n\nThanks, Craig.\n\nOperator\n\nOur next question comes from Manav Patnaik from Barclays. Manav, your line is open.\n\nManav Patnaik -- Barclays -- Analyst\n\nThank you and good morning. Maybe just specific to market intelligence and the desktop side. Can you just help us understand the accounting issue, I guess, that will help reaccelerate the growth? And then just thinking out a little bit longer in there, how do you expect the trajectory of the growth there to play? Because, I mean, similar to yourselves, I imagine the sell side and other customers will be tightening budgets as well.\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nManav, we recognized that the third quarter revenue growth of the desktop was below our normal growth potential. But you have to look at it from a particular perspective that there is always some timing of revenue recognition of certain contracts. That was particularly impacting this quarter, but we expect the desktop growth to normalize again in the fourth quarter. Also for market intelligence, in general, if you take out the volume effect of the capital markets business, and also FX, then the overall growth for the full quarter was north of 7%, and we believe that's more indicative of the normal growth opportunity for market intelligence as well.\n\nManav Patnaik -- Barclays -- Analyst\n\nOK. Got it. And then, can I just ask on the non-transaction side of the ratings business? It's obviously down 2%, I think, you said, ex-FX. But how long will that keep, I guess, slowly declining? Like when do we lap the ratings evaluation services, tough comps or whatever it is that's driving that down?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nWell, Manav, that is directly correlated with the overall economic environment, capital markets activity, debt issuance, M&A environment. And we have, of course, seen that the beginning of this year was still relatively strong, and it started to deteriorate somewhere from March onwards. Non-transaction revenue is usually quite stable as a revenue stream. We have two particular areas that are mostly sensitive for the more general macro environment.\n\nThis is initial credit ratings. We don't see a lot of new issuers coming to the market. And then, rating evaluation services, this has a correlation with the M&A market. These are issuers that are thinking about IPOs, spin-offs and so on, want to have some kind of an insight in terms of implications for their ratings.\n\nSo obviously, those are revenue streams that will come back once the markets start to turn. The more stable elements in non-transaction are around surveillance, around frequent issuer programs. And then, most notably, I want to point out that CRISIL is doing very well and is supporting the non-transaction revenue in that category.\n\nManav Patnaik -- Barclays -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question comes from Jeff Meuler from Baird. Jeff, your line is open.\n\nJeff Meuler -- Robert W. Baird and Company -- Analyst\n\nYeah, thanks. I hear you that there's some inherent hedges in the mobility business, but I think the used car business is a decent amount larger than the new car market for you. So if the market, I guess, shifts back from a mix perspective and some of the profit pools for use target hit. I'm just wondering if there's a net benefit or a net detriment to you.\n\nAnd I recognize CARFAX has good structural growth, historically resilient. So could you just give us any more detail on what product lines the competitive wins and new customer growth was coming in or any more detail on CARFAX's innovation that's driving the growth, given that the core report is fairly well penetrated.\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nJeff, you're absolutely right that the used car market is a significant component of the overall revenue stream for the mobility business. And the good news there is that it has been a very resilient market through the cycles. So we're not overly concerned about if the cycle in the car market start to turn that that will have a material impact. And as I mentioned before, we have other revenue streams actually that we expect to pick up if the equilibrium in the car market start to change, particularly about our sales and marketing products where we have seen relatively lower growth in the more recent past.\n\nThe mobility business in general is a phenomenal business. There's a lot of innovation, a lot of new product developments, a lot of good support for our customers. CARFAX is really a gem from my perspective in terms of growth and in terms of innovation and new business activity, very close to the customers, a lot of new business launches and new product launches. So I think this business is in a very good position, and we would expect -- also if the car markets start to turn and go in a different direction, that we see continued good performance from this segment.\n\nJeff Meuler -- Robert W. Baird and Company -- Analyst\n\nOK. And then, Doug, you answered the deleveraging question. Can you also give us the historical view of like how much issuance was there in a falling rate environment of bonds being issued that was refinancing debt that wasn't coming due the next, say, three, four years but bonds that had significant duration remaining on them where there was issuance to get the interest expense savings from a falling rate environment. Just I guess on the theoretical that we might not have that type of activity for a while, if you could help me understand roughly if that was meaningful in the past or not.\n\nDoug Peterson -- President and Chief Executive Officer\n\nYes. Basically, this is a question about pull forward. And we saw in 2020 and 2021 during the pandemic, there was what we felt now was structural pull forward. It was a combination of low rates, but probably more importantly, if you are a CFO of any organization, you were not being criticized for having ample liquidity during what people didn't understand was the pandemic as we went into it.\n\nSo we did see a lot of structural pull forward during that period. But historically, I think the treasurers and CFOs of organizations are quite thoughtful and looking at their overall funding strategies. And so, the funding is not -- when people look at their balance sheets, it's not only just looking at what they have on what their costs are. But the opportunities that organizations have now are much more complex than they used to be.\n\nSecuritizations, looking at how they're going to use a maturity transformation, what they do in terms of derivatives. So yes, we do see the balance sheets. We do see that there was pull forward into '20 and 2021, but we know the maturities are coming now. And we think that the sort of tools that corporations have to -- and banks have to manage their risk and their liquidity have really changed a lot in the last 10 or 15 years.\n\nSo it's hard to go back and compare to history, but we do know what happened in the last few years, where we did see pull forward, but the upcoming maturity schedule, which starts in the second half of 2023 going forward. In a sense, it's kind of what was all the issuance that came after the financial crisis, in 2013, '14, '15. Just think about that huge boom of issuance that took place, that's going to start maturing next year. It was a seven-year, 10-year paper.\n\nWe see a lot of that will start maturing and that we know that that's going to be in the queue very soon.\n\nJeff Meuler -- Robert W. Baird and Company -- Analyst\n\nGot it. Thank you.\n\nMark Grant\n\nThanks, Jeff.\n\nOperator\n\nOur next question comes from Faiza Alwy from Deutsche Bank. Faiza, your line is open.\n\nFaiza Alwy -- Deutsche Bank -- Analyst\n\nGreat. Thank you and good morning. First, I just wanted to ask about the commodity business. You mentioned climate transition.\n\nSo it sounds like there are some underlying drivers that are sustainable. I'm curious if you could talk about the cyclical aspects of the business and maybe areas where you're running into tougher comps. And just how sustainable you think the overall growth rate is there?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nYes. Let me start with giving you an overall perspective on the commodity insights business and how it's doing in the current environment, and then I hand it over to Doug more for the energy transition and climate part. So if you look at the overall macro environment, it's very supportive for the commodity insight business at this moment. Definitely, where commodity prices are today is benefiting most of our customers.\n\nAnd therefore, we're seeing also, I would say, based on the very attractive proposition of the combined businesses that we have now brought together under the commodity insights segment. We're delivering a lot of new opportunities to our customers. And therefore, we have seen really one of the best sales momentums in this business. If I look at actual sales levels, this will probably one of the very best years for the last maybe a decade or so.\n\nSo very positive trends that we're seeing that is helping data and insights, that is helping price assessments. The Global Trading Services business was a little lower this quarter. The main reason there is that we're lapping more difficult comps. But generally, we also see elevated hedging activity on commodity prices, and we're also benefiting from that as well.\n\nAnd then, if you look at the upstream business, there, we have seen a turnaround. That was a business that for many years was in a more difficult period. But clearly, our customers are healthier there as well. We see larger capex budgets for those customers, and that is helping that business to grow.\n\nAnd we said in our prepared remarks that if you take out the effect of Russia, on a constant currency basis, actually the subscription book of business in the upstream business was growing during the quarter. So overall, very favorable macro environment for commodity insights, and that is clearly helping the business this quarter and also in the next couple of quarters.\n\nDoug Peterson -- President and Chief Executive Officer\n\nEwout, I just want to add two points. The first is that all of us know that energy transition is on everyone's mind, whether it's a corporation or government, regulator, financial institution. And as I mentioned earlier, almost every conversation we have talks about this. And where else do you want to go to find about -- learn about energy and energy transition? It's commodity insights of S&P Global.\n\nWe have the expertise. We have the experts that can talk about current markets, transition markets, and we're finding an incredible amount of engagement. We have conferences. It's one of the areas that commodity insights excels at.\n\nAnd we see very high demand for people to participate in those conferences and we're now back in person and the attendance is above the charts. But the second point I want to make is that we're launching new products all the time. Just in the last quarter, we launched some new products that were related to energy transition and new ways to find information about markets. As an example, there's -- in the tanker market, we talked earlier in my -- we had one of our points on our slide showed the low sulfur fuel oil market, which we -- I remember on an earnings call about three years ago talking about when we launched that and now it's become a benchmark in the market.\n\nBut in addition, there's things like the carbon accounted tanker rate price assessments, there's interest around the world for understanding freight emissions, and what would be under the EU emissions trading system. You're going to need to have much more information for every single tanker and what is its carbon output, and we will have a product for that. As an example, there's a whole information that's needed in Brazil and India and Turkey on energy certificates in emerging markets. And then, finally, we have some examples.\n\nRecently, as you know, in the United States, there was the new Climate Bill, which was issued by the United States by the Congress. And we've done very special research which is really industry-leading about the Clean Energy procurement and what that's going to mean for industry. So when it comes to energy and energy transition, where are the place you want to go.\n\nFaiza Alwy -- Deutsche Bank -- Analyst\n\nGreat. That's all very helpful. Just as a follow-up. Ewout, on market intelligence.\n\nI think you had -- the margin performance was really strong. And I'm curious if -- is that the area where you're maybe getting the most synergies? Or just give us a little bit more color on the margin performance, whether it's mix-related, and how we should think about that going forward.\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nFaiza, yes, we're seeing the largest benefit from cost synergies and revenue synergies in the market intelligence division. That's because it's the largest division. It's also the largest combination of different businesses that we're bringing together. And also based on the size of that division, it will also benefit, of course, from a large part of the synergies that we're realizing in the corporate center and the allocation of those costs down to the divisions.\n\nWhat you see is, in general, that we continue to invest in market intelligence for future growth. So you see new product launches continuing strategic investments in new areas and initiatives. That was already touching on private credit, private markets, ESG investments we're having there as well. We're having expansion still continuing in China, in the marketplace and many different areas that we are continuing to invest, as well as cloud expenses.\n\nWe're also continuing on our cloud journey and market intelligence is continuing to invest there as well. But then the opposite factors there are some of the expense reductions, the expense discipline and the synergies and the combination of all of that led to the significant margin expansion in market intelligence.\n\nFaiza Alwy -- Deutsche Bank -- Analyst\n\nUnderstood. Thank so very much.\n\nMark Grant\n\nThanks, Faiza.\n\nOperator\n\nOur next question comes from Stephanie Moore from Jefferies. Stephanie, your line is open.\n\nHans Hoffman -- Jefferies -- Analyst\n\nHi. This is Hans Hoffman filling in for Stephanie. Could you just comment a bit on what you're seeing across your European revenue base and how that region did relative to your expectations, either by segment or overall?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nYes, overall, not so much of a different trend we are seeing in Europe compared to other parts of the world. I understand the background of the question because definitely, the economic outlook in Europe is, of course, quite difficult. Given the inflation levels, given of course, the close proximity to the Russia-Ukraine conflict. But overall, from a customer dynamics perspective, overall in terms of commercial activity, we're not seeing a significant difference compared to North America or Asia.\n\nHans Hoffman -- Jefferies -- Analyst\n\nGot it. That's helpful. And then, just on the revenue synergy side, I guess where have you seen the most success so far and then sort of where do you kind of see the most opportunity?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nYes. Most success so far, we see in our largest divisions that we're bringing together, market intelligence, commodity insights and the index business. It's mostly cross-sell at this moment, which was as expected because cross-sell is the introduction of one product group to existing customers and making sure that we can sell new activities there. For example, in market intelligence, we had a nice sale of KYC, KY3P product to an existing customer that was for more a customer from the legacy as global site where we could sell a product from the legacy IHS Markit side.\n\nSo just as an example, so we see -- continue to see good cross-sell. At the same time, we're investing in new product development, in system development that will help them with that growth wave going forward. So it's still early, I have to say around revenue synergies, but we are clearly ahead compared to our original expectations.\n\nHans Hoffman -- Jefferies -- Analyst\n\nGot it. Thanks.\n\nMark Grant\n\nThanks, Hans.\n\nOperator\n\nOur next question comes from Russell Quelch from Redburn. Russell, your line is open.\n\nRussell Quelch -- Redburn Partners -- Analyst\n\nYeah. Hello, gents. I just wanted to talk about capital allocation priorities. You still got about $2 billion on cash on the balance sheet and you're on course to generate around $5 billion of free cash flow in '23, I believe, consensus.\n\nJust wondered where you look to do further M&A? Or do you have enough integrations on your hand such that you can look to return perhaps north of 100% of free cash flow again in '23?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nOverall, no change with respect to our capital philosophy, capital management targets. We think consistency and reliability there is the most important, particularly in this environment. You have seen us continuing with the $12 billion ASR, even despite that we have seen some impact of the current environment on the rating issuance levels we are able to execute on our plans this year. And you may expect the same from us over the next couple of years.\n\nSo at least, 85% of return of capital to our shareholders, a combination of dividends and share buybacks. Dividend payout ratio between 20% and 30%. And M&A, the focus is really on small tuck-in and bolt-on, where we see that we can add a nice capability to some of our core strategic focus areas. But nothing large because we first, of course, need to focus on the integration of the large merger and organically building out our businesses.\n\nSo no changes at all, and we think that is actually the right approach.\n\nRussell Quelch -- Redburn Partners -- Analyst\n\nOK. And then, just one housekeeping question, I guess. Given the earlier comment on being able to achieve the lower-than-average rates due to the refinancing of the IHS debt. What's the level of interest that was delivered in Q3, now the right quarterly rate to assume going forward?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nYes. This is the new run rate with respect to the interest expense on our debt. We were very fortunate with hindsight that we refinanced a large part of the debt at the beginning of March, when the 10-year U.S. Treasury was around 1.73 at that point in time.\n\nSo we are very happy that we locked ourselves in with long-term debt at very low levels. And actually, if you look at the average cost of debt for any player now in our industry, we're at one of the lowest levels. So yes, this is the normalized level. If you look, though, at the interest expense line, there's one point that I want to make.\n\nIt's a net number. So we're generating more interest income on our cash balances. So that is helping us a little bit and obviously, that might fluctuate over time.\n\nRussell Quelch -- Redburn Partners -- Analyst\n\nYeah. Got it. Good stuff. Thanks.\n\nMark Grant\n\nThanks, Russell.\n\nOperator\n\nOur next question comes from Shlomo Rosenbaum from Stifel. Shlomo, your line is open.\n\nShlomo Rosenbaum -- Stifel Financial Corp. -- Analyst\n\nHi. Good morning. Thank you for taking my questions. Hey, Ewout, I just wanted to ask you a little bit about your labor cost trends.\n\nObviously, it's a significant component of costs. Everyone in the industry has been dealing with the rising labor costs. Given what's going on in the market, what's your outlook for that? And do you see that kind of letting up in terms of just how we should think about the costs of the business on a go-forward basis, let's say, over the next six to 12 months?\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\n Shlomo, obviously, we are exposed as everyone else, to increases from an overall labor market perspective and comp expectations, and we need to stay competitive in order to attract and retain the best talent. So let me expand a little bit on that answer. So about 60% of our overall expense base is people cost. And obviously, we have people across the whole world in many different job groups and categories.\n\nIt's not a one-size-fits-all. We see more competitive situations in certain markets and jurisdictions. We see it more in certain job groups, and we are continuously making sure that we stay competitive from an overall comp perspective, and we will continue to do that. So we're definitely expecting to see also some of the changes over the next period flowing through our P&L.\n\nBut at the same time, we are also taking advantage of a lot of levers that we are having and maybe levers that are given to us through the merger. So we have, of course, the opportunity to realize cost synergies and reduction of headcount is an element to that. So that goes in an opposite direction, as well as synergies, cost synergies around real estate, around procurement. And then, as you see this year, given the performance of the company, also incentive compensation costs are down and we gave you the overall impact of around $120 million to $140 million.\n\nSo it is a bit of a mix. On the one hand, staying competitive from a labor market perspective, but on the other hand, using a lot of levers, in order to offset the overall impact on our expense line and on our margins.\n\nShlomo Rosenbaum -- Stifel Financial Corp. -- Analyst\n\nOK. And then, I just want to ask a little bit more about trying to figure out how far we are from the bottom, just in terms of the ratings revenue. Doug, you talked about refunding walls becoming more meaningful in the middle of next year. If you take the revenue that you would expect from those refunding walls together with your subscription revenue, that you're getting, say, this year.\n\nHow far away are you from, let's say, 2022 revenue that you're expecting? In other words, how much further downward you really have to go just to kind of hit that number?\n\nDoug Peterson -- President and Chief Executive Officer\n\nShlomo, we're not really trying to call a bottom or a top to the market. We are also not providing any guidance or outlook for 2023 at this time. As I mentioned, we've been very engaged with the markets with issuers and investors. We're also -- we have world-class economists and experts that are providing us with input.\n\nSo we're looking at all of that, what you just discussed, but we're -- there's no -- but we have no ability to actually call a bottom.\n\nShlomo Rosenbaum -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you.\n\nMark Grant\n\nThanks, Shlomo.\n\nOperator\n\nWe will now take our final question from Andrew Steinerman from J.P. Morgan. Andrew, your line is open.\n\nAndrew Steinerman -- JPMorgan Chase and Company -- Analyst\n\nHi. Referring to slide 38, I just wanted to talk about implied rating margins for the fourth quarter. To get to that mid-50s rating margin for the full year, my math says it's about 49% ratings margins for the fourth quarter. Ewout, if you could just please confirm that.\n\nAnd then, just help us appreciate the 49% because that's a notable step down from third quarter ratings margins. Please comment about seasonality or any other factors we would need to understand fourth quarter ratings margins on slide 38.\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nAndrew, as you understand, we're not giving quarterly guidance, so I can't give you numbers by quarter, by segment margins. But what we are, of course, trying to do is if we give you a full year picture, we give you a full year outlook. Then, of course, you can backwards calculate what is the expectation for the quarter itself. I do want to point out that the third quarter in general is the lowest quarter for us from an expense perspective.\n\nThat is due to seasonality. The fourth quarter is higher. But you have seen that in previous years as well. So from a trend perspective, there's nothing different than what you -- that you should have seen in the past.\n\nBut sequentially, you should expect expenses to roll out. Again, that is normal seasonality.\n\nDoug Peterson -- President and Chief Executive Officer\n\nWell, that was the last question. So I'd like to make a quick closing comment. So first of all, thank you, everyone, for joining the call today for your questions and your support. But I'm really pleased with the progress we've made since closing the merger.\n\nIt's only been eight months. And we've been able to unify our management team under a strong vision and set of purposes and values. We see strong commercial success. You heard about it on this call, our cross-sell and our product innovation, and we're ahead of schedule to achieve our cost synergies.\n\nAnd all of that in a challenging macroeconomic backdrop where we discuss some of those topics today. But we also have very important secular trends that are creating opportunities for S&P Global: the energy transition, the continued interest in climate and sustainability, the need for analytics and insights in very turbulent markets. So we're very pleased with our progress, and I'm excited that we'll be able to share more with you on our strategic vision and our multiyear targets at our investor day on December 1. But let me end by thanking again our people who are absolutely fantastic.\n\nThey're world-class. I want to thank all of you again for joining us on this call today. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Grant\n\nDoug Peterson -- President and Chief Executive Officer\n\nEwout Steenbergen -- Executive Vice President and Chief Financial Officer\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nAlex Kramm -- UBS -- Analyst\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nJeff Silber -- BMO Capital Markets -- Analyst\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nCraig Huber -- Huber Research Partners -- Analyst\n\nManav Patnaik -- Barclays -- Analyst\n\nJeff Meuler -- Robert W. Baird and Company -- Analyst\n\nFaiza Alwy -- Deutsche Bank -- Analyst\n\nHans Hoffman -- Jefferies -- Analyst\n\nRussell Quelch -- Redburn Partners -- Analyst\n\nShlomo Rosenbaum -- Stifel Financial Corp. -- Analyst\n\nAndrew Steinerman -- JPMorgan Chase and Company -- Analyst\n\nMore SPGI analysis\n\nAll earnings call transcripts"
}