{
  "companyName": "WD-40",
  "companyTicker": "WDFC",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/19/wd-40-wdfc-q4-2022-earnings-call-transcript/",
  "content": "WD-40 (WDFC -0.88%)\nQ4 2022 Earnings Call\nOct 19, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Good day, and welcome to the WD-40 Company fourth quarter and fiscal year 2022 earnings conference call. Today's call is being recorded. At this time, all participants are in a listen-only mode.\n\nAt the end of the prepared remarks, we will conduct a question-and-answer session. [Operator instructions] I would now like to turn the presentation over to the host for today's call, Ms. Wendy Kelley, vice president of stakeholder and investor engagement. Please proceed.\n\nWendy Kelley -- Vice President of Stakeholder and Investor Engagement\n\nGood afternoon, and thanks to everyone for joining us today. Joining us on our call today are WD-40 Company's chairman of the board, Garry Ridge; president and chief executive officer, Steve Brass; vice president and chief financial officer, Jay Rembolt; and vice president, global finance strategy and incoming chief financial officer, Sara Hyzer. In addition to the financial information presented on today's call, we encourage investors to review our earnings presentation, earnings press release, and Form 10-K for the period ending August 31, 2022. These documents are available on our Investor Relations website at investor.wd40company.com.\n\nA replay and transcript of today's call will also be made available at that location shortly after this call. On today's call, we will discuss certain non-GAAP measures. The descriptions and reconciliations of these non-GAAP measures are available in our SEC filings, as well as our earnings presentation. As a reminder, today's call includes forward-looking statements about our expectations for the company's future performance.\n\nOf course, actual results could differ materially. The company's expectations, beliefs, and projections are expressed in good faith, but there can be no assurance that they can be achieved or accomplished. Please refer to the risk factors detailed in our SEC filings for further discussion. Finally, for anyone listening to a webcast replay or reviewing a written transcript of this call, please note all information presented is current only as of today's date, October 19, 2022.\n\nThe company disclaims any duty or obligation to update any forward-looking information, whether as a result of new information, future events, or otherwise. With that, I'd now like to turn the call over to Garry.\n\nGarry Ridge -- Chairman of the Board\n\nThank you, Wendy. Good day, and thanks for joining us for today's conference call. Today is my 100th earnings call at WD-40 Company. It's also my last.\n\nAs we shared earlier this year, I formally handed the CEO rank to Steve on September 1 as part of our planned leadership transition. However, I wanted to join you all one last time to wrap up fiscal year 2022. Twenty-five years ago, we had a dream to take the blue and yellow can with a little red top to the world. Today, I'm extremely pleased to say you can find WD-40 Multi-Use Product in 176 countries and territories around the world.\n\nIndeed, the sun never sets on WD-40. As Marshall Goldsmith says, \"The best leaders understand that long-term results are created by the great people doing the work, not just the one person who has the privilege of being at the top.\" I've had the honor of working with many exceptional people during my tenure at WD-40 Company, many of whom remain on the global leadership team today and who will continue to work closely with Steve in the coming years. In addition to the leadership team, there are many talented people within the organization from all functions, trade blocs, countries, and time zones who are committed to ensuring that millions of new people will meet the blue and yellow can with little red top for the first time in the years to come. Now, let's take a bit of a closer look on fiscal year 2022.\n\nIn business, there are often headwinds and tailwinds, both are somewhat manageable because you know they are coming, and you can plan accordingly. We've had plenty of headwinds and tailwinds this fiscal year, but we've also had turbulence. Turbulence is more difficult to navigate. You don't see it coming.\n\nYou don't know how long it will last, and you can't properly plan for it. The turbulence we experienced this fiscal year was primarily in the form of inflation. Unfortunately, we continue to face a challenging inflationary environment and our fourth quarter gross margin came in at 47%, reflecting significant increases to our cost of products sold. In a few minutes, Jay will share an update with you on gross margin and what we have been doing and will continue to do to restore them.\n\nToday, I will walk you through the results of our six strategic initiatives for the last time. Our strategic initiatives support our 2025 revenue growth target, which is to drive net sales to between $650 million and $700 million by the end of fiscal year 2025. We strive to do that while following our 55/30/25 business model. Steve and Sara remain committed to the company's long-term revenue aspirations and to the 55/30/25 business model.\n\nHowever, a lot of excellent work has been completed over the last several months to better understand how we will continue to build a business for the future. Steve, Sara, and Wendy will be evolving the company's investor messaging over the next couple of quarters to better communicate how they intend to execute against the company's strategic initiatives. Strategic initiative No. 1 is to build the business for the future.\n\nOur goal under this initiative is to build an enduring business that we'll be proud to pass on to the next generation. The desired outcome for this strategic initiative is to fully integrate our ESG initiatives into the heart of our strategic planning process. Our ESG team made excellent progress in fiscal year 2022, and we'll be publishing our next ESG report on November 2, 2022. In this report, we will detail our ESG-related objectives, targets, and progress for the last two-year period, and we'll establish objectives and targets through fiscal year 2024.\n\nStrategic initiative No. 2 is to attract, develop, and engage outstanding tribe members. We believe that by building and nurturing an inclusive and diverse, purpose-driven, learning and teaching organization, our tribe members will succeed together while excelling as individuals. Maintaining this people-first mindset is an important strategic advantage for the company.\n\nIn fiscal year 2022, our biannual employee engagement survey revealed a slight increase in engagement from 93.1% in January 2020 to 93.5% in January 2022. Our nearly 600 tribe members truly create a culture that is a competitive advantage. Strategic initiative 3 is to strive for operational excellence. Our goal under this initiative is to foster a culture of continuous improvement in which operational excellence is the responsibility of every tribe member.\n\nOur commitment to operational excellence continues to be an enormous asset as we navigate a world of constant change. Using our 55/30/25 business model as a framework, we measure ourselves against this operational excellence initiative. Strategic initiative No. 4 is to grow WD-40 Multi-Use Product.\n\nOur goal under this initiative is to make the blue and yellow can with a little red top available in more places, to more people who find more uses more often. In fiscal year 2022, sales of WD-40 Multi-Use Product increased 8% globally to $399.4 million. Strategic initiative No. 5 is to grow the WD-40 Specialist product line.\n\nOur goal under this initiative is to leverage the WD-40 brand by developing new products and categories, which build and reinforce the core brand positioning and create growth through the continued geographic and digital expansion. In fiscal year 2022, sales of WD-40 Specialist increased 19% globally to $59.9 million. Strategic initiative No. 6 is to expand and support portfolio opportunities that help us grow.\n\nBrands under this initiative include 3-IN-ONE and GT85, as well as our home care and cleaning brands. In fiscal year 2022, sales of products included in this initiative declined 11% globally to $59.5 million. This decline is linked primarily to lower sales of our nonstrategic homecare and cleaning brands. Many of our brands in this category are harvest brands, which we expect to decline in sales over time but continue to contribute healthy returns to our business.\n\nThat ends my review of the strategic initiatives. I'd like to say thank you to our tribe members of WD-40 Company for allowing me the privilege of being your leader for the last 25 years. I was honored to stand on the shoulders of giants. Thank you for helping me build an enduring business that I'm proud to pass on to the next generation.\n\nBefore I pass the call to Steve for the last time, I'd like to share with you a quote from my friend, Ken Blanchard, \"To learn from the past is good, but to live there is a waste. To plan for the future is good, but to live there is a waste. Your happiest and most productive in life when you are living in the present.\" Steve, for one last time, over to you.\n\nSteve Brass -- President and Chief Executive Officer\n\nThank you, Garry, and good afternoon. Today is quite an emotional day for this earnings team as both Garry and Jay complete their final earnings call. I want to take a moment to thank Garry and Jay for their relentless commitment to our company and its stakeholders. Their fingerprints are all over this wonderful company, and I honestly don't think I could be inheriting a better situation.\n\nAs part of Garry's legacy, it's created a powerful global infrastructure over the last two and a half decades. The blue and yellow brand with a little red top is stronger than ever and is one of the most widely distributed and most consistently executed global brands out there. And then, of course, as our secret formula, not the one found inside the blue and yellow can with a little red top, but rather our wonderful global tribe mates. We believe in the will of the people.\n\nWill is not tangible, and you won't find it on our balance sheet. It encompasses morale, motivation, collaboration, and a desire to offer discretionary effort. Our special culture is absolutely a key source of competitive advantage and a critical multiplier of our strategic effectiveness, which will enable us to drive progress and sustain success. Now, let's take a closer look at our results.\n\nLast quarter, we shared with you that market conditions suggested that for the full fiscal year, sales were likely to be in a range of between $519 million to $532 million, reflecting year-over-year growth of between 6% and 9%. Today, we reported net sales of $518.8 million for fiscal year '22, up 6% over last fiscal year. Changes in foreign currency exchange rates had an unfavorable impact of $8.3 million on net sales for fiscal year 2022. On a constant-currency basis, net sales would have been up 8%.\n\nFiscal year 2022 was a challenging year, dominated by inflation, geopolitical tensions, currency headwinds, and continuing disruptions caused by the COVID pandemic. We learned to expect the unexpected in fiscal year 2022. We are a better prepared and more agile organization because of the challenges we've faced. We are pleased we were able to achieve top-line growth in this volatile environment.\n\nUnfortunately, gross margin was the Achilles' heel of fiscal year 2022. As inflation hit 40-year highs, we had to make exceptional efforts to adapt, which meant implementing our largest set of price increases. Jay will share the details of how those price increases impacted our gross margin with you in a moment. But first, let's dive into the fourth quarter.\n\nFor the fourth quarter, we reported net sales of $130.4 million, which reflects an increase of 13% over the fourth quarter of last year. Changes in foreign currency exchange rates had a larger-than-anticipated impact on sales in the fourth quarter, resulting in unfavorable impact of $6.7 million on net sales for the fourth quarter. On a constant-currency basis, net sales would have increased 19% over last year. So, now, let's take a closer look at fourth-quarter results in our trade blocs, starting with the Americas.\n\nSales in the Americas, which includes the United States, Latin America, and Canada, were up 25% in the fourth quarter to $68 million. Sales of maintenance products increased 30% in the Americas due to increased sales of maintenance products in the U.S., Canada, and Latin America, which all experienced double-digit growth. Maintenance product sales in the United States increased 21% or $8.1 million in the fourth quarter due to strong sales of both WD-40 Specialist and WD-40 Multi-Use Product. The strong sales were driven by the timing of promotional programs, the impact of price increases, as well as continued strength in the industrial channel.\n\nWD-40 Specialist sales were up 73% in the quarter due to increased production capacity and improved availability as our supply chain continues to strengthen. Maintenance product sales in Canada increased 41% or $1.3 million in the fourth quarter due to the timing of customer orders, the impact of price increases, and successful promotional programs. Our tribe in Canada is seeing phenomenal results with premiumization as they were the first country to launch Smart Straw Next Generation. Maintenance product sales in Latin America increased 80% or $5.4 million in the fourth quarter, resulting in the strongest sales quarter in the region's history.\n\nThe increase in sales in our Latin American distributor markets was partially due to many distributor customers purchasing products in advance of price increases that went into effect in the fourth quarter. In addition, we continue to experience positive momentum in our direct market in Mexico from the shift we made in 2020 from a distributor model to a direct market. In total, our Americas segment made up 52% of our global business in the fourth quarter. Over the long term, we anticipate sales in this segment will grow between 5% to 8% annually.\n\nAs a reminder, the compound annual growth rates associated with our segments reflect our long-term growth expectations for the segment and may not always align with shorter-term trends and results. Now, on to EMEA. Sales in EMEA, which includes Europe, the Middle East, Africa, and India, were down 3% in the fourth quarter to $43.6 million. Currency fluctuations significantly impacted our sales results for our EMEA trade bloc during the quarter.\n\nChanges in foreign currency exchange rates had an unfavorable impact of $5.9 million on net sales for the fourth quarter. On a constant-currency basis, sales would have increased 10% over the fourth quarter last year. In addition, lower sales of homecare and cleaning products negatively impacted EMEA sales in the fourth quarter. The COVID-19 pandemic resulted in particularly strong demand in homecare and cleaning products last year, which was not repeated this year.\n\nAs you know, we sell into EMEA through a combination of direct operations, as well as through marketing distributors. Sales in our EMEA direct markets, which accounted for 71% of the region's sales in the fourth quarter, declined by 7% during the quarter to $31 million. Changes in foreign currency exchange rates had an unfavorable impact on net sales for the fourth quarter. On a constant-currency basis, sales would have increased 6% over the fourth quarter last year.\n\nWhen foreign currency fluctuates from period to period, it can sometimes be informative to look at our results in the local currencies in which we conduct sales transactions in our direct markets. In our euro-based EMEA direct markets, in local transaction currencies, we experienced double-digit growth in nearly every market. We're seeing strong sales of both WD-40 Multi-Use Product and WD-40 Specialist in these direct markets. We do believe that a portion of this activity was due to some customers purchasing product in advance of the price increases that went into effect late in the fourth quarter or are going into effect early in the first quarter of fiscal year 2023.\n\nIn the United Kingdom, our pound sterling-based direct market total sales in transaction currency decreased by 24% in the fourth quarter. This decrease in sales is primarily attributable to reduced demand for our maintenance products compared to the prior-year period. In the comparable period of last fiscal year, we experienced increased demand due to isolation and renovation trends associated with the pandemic. Sales in our EMEA distributor markets, which accounted for 29% of the region's sales in the fourth quarter, increased by 7% during the quarter to $12.6 million.\n\nCurrency does not materially impact our EMEA distributor markets. Sales continue to be impacted by our values-guided decision to suspend sales of our products to our marketing distributor customers in Russia and Belarus. In total, our EMEA segment made up 34% of our global business in the fourth quarter. Over the long term, we anticipate sales in this segment will grow between 8% to 11% annually.\n\nNow, on to Asia-Pacific. Sales in Asia-Pacific, which includes Australia, China, and other countries in the Asia region were up 18% in the fourth quarter to $18.8 million. In our Asia-Pacific distributor markets, sales were $9.5 million in the fourth quarter, up 64% compared to last year. The product we sell in our Asia-Pacific distributor markets is sourced from a third-party manufacturer in Shanghai.\n\nYou will recall that there were severe lockdown measures in place last quarter in Shanghai, which were lifted on June 1. After the lockdown was lifted, we resumed shipping product to our customers in our Asia-Pacific distributor markets, resulting in strong fourth-quarter sales results. In Australia, sales were $5.5 million in the fourth quarter, up 3% compared to last year. Changes in foreign currency exchange rates had an unfavorable impact on sales for the fourth quarter.\n\nOn a constant-currency basis, sales would have increased by 11% compared to last year. These sales increases were driven by strong sales of WD-40 Multi-Use Product due to increased growth of our base business, increased promotional activities, and price increases that went into effect in February. In China, sales were $3.8 million in the fourth quarter, down 21% compared to last year, driven primarily by the timing of customer orders in the industrial channel and decreased sales through the e-commerce channel. Changes in foreign currency exchange rates had an unfavorable impact on net sales for the fourth quarter.\n\nOn a constant-currency basis, sales would have decreased by 18% compared to last year. We remain optimistic about the long-term opportunities in China. We expect volatility along the way due to the economic and health-related impacts of COVID-19, the timing of promotional programs, the building of distribution, shifting economic patterns, and varying industrial activities. In total, our Asia-Pacific segment made up 14% of our global business in the fourth quarter.\n\nOver the long term, we anticipate sales within this segment will grow between 10% to 13% annually. Now, a brief update on our Must-Win Battles. Our Must-Win Battles are the primary areas of action that will enable us to deliver against our revenue growth aspirations to drive sales to between $650 million to $700 million by the end of fiscal year 2025. These hyper-focused actions are the key drivers of revenue growth.\n\nOur largest growth opportunity in first Must-Win Battle is the geographic expansion of the blue and yellow can with a little red top. We continue to experience growth of our flagship brand with global sales of WD-40 Multi-Use Product up 8% in fiscal year 2022. We've experienced significant growth in priority markets like China, Mexico, and India, where sales increased by 13%, 31%, and 45%, respectively. Mexico is a shining example of how we can drive strong growth in emerging markets with appropriate resourcing.\n\nWe transitioned Mexico from an indirect to a direct market two years ago. And since that time, we have 2.5 times the sales in FY '22 compared to FY '20. We have identified 20 priority markets, which show the highest potential for growth, and we'll continue to prioritize investing in these priority markets to drive stronger growth into the future. Our second Must-Win Battle is the premiumization of WD-40 Multi-Use Product.\n\nPremiumization creates opportunities for revenue growth, gross margin expansion, and most importantly, it delights our end users. In fiscal year 2022, sales of WD-40 Smart Straw and EZ-REACH, when combined, grew 4% year over year, with growth across all three trade blocs, and currently represent 47% of global sales of WD-40 Multi-Use Product. It's worth noting that the percentage of premiumized sales has remained relatively constant compared to last fiscal year. That is because as we continue to drive premiumization in many markets, the growth of our classic WD-40 Multi-Use Product is growing at a faster pace in many emerging markets, particularly in some of our emerging markets where Smart Straw is not yet available.\n\nOver the long term, we continue to believe that there is significant opportunity to drive sales of premiumized products in both developed and emerging markets. As additional capacity for Smart Straw Next Generation comes online, we will move closer to our objective for this Must-Win Battle, which is to grow sales of premiumized products to greater than 60% of WD-40 Multi-Use Product sales by the end of 2025, which represents a growth opportunity of approximately $140 million. Our third Must-Win Battle is to grow WD-40 Specialist. In fiscal year 2022, sales of WD-40 Specialist were up 19% compared to last year.\n\nWe saw sales growth of WD-40 Specialist across all our segments, but the United States saw outstanding growth reporting an increase of 51% compared to last year. This was driven by several things. First, we've turned the corner on the capacity constraints we have been experiencing in our U.S. supply chain.\n\nIn addition, the new brand architecture is completely rolled out in the United States and improving the sell-through of our WD-40 Specialist brand products. As I've shared with you in the past, we fully rolled out the new brand architecture in Australia, and WD-40 Specialist continues to set a new benchmark there, with sales of WD-40 Specialist reaching over 35% of WD-40 Multi-Use Product sales in FY '22. Our final Must-Win Battle is digital commerce. Our vision for digital commerce is to engage with end users at scale, making it easier to access, learn about and purchase our brands.\n\nIn fiscal year 2022, global e-commerce sales were down 8% compared to last fiscal year, partially due to the continued rebalancing of sales toward brick-and-mortar locations. Despite our slow results this fiscal year, there is a significant opportunity ahead of us in the digital commerce space. In the Americas, digital commerce sales rolled back in the latter part of the year, which gives us great confidence that we're through the worst of the downturn. We expect sales in the e-commerce channel will return to strong growth in fiscal year 2023.\n\nMore importantly, we will continue to leverage our digital capabilities as an accelerator of our growth going forward. Now, I'll turn the call over to Jay, who will provide you with a financial update on the business.\n\nJay Rembolt -- Vice President and Chief Financial Officer\n\nThank you, Steve. It's hard for me to believe that today is my final earnings call at WD-40 Company. However, I will remain in my current role as CFO until the end of the month. As we shared with you earlier this year, Sara Hyzer will officially step into the role of CFO on November 1, and I'm thrilled to be handing the baton to such a capable leader.\n\nSara has worked alongside our global financial and accounting team as a financial strategist for a year now, and her financial expertise and growth mindset are an excellent fit for our company and its culture. I know you will enjoy working with Sara as much as I have. Now, let's start with a discussion about how we performed against our most recently issued fiscal year 2022 guidance. We expected net sales growth to be between 6% and 9%, with net sales of between $519 million and $532 million.\n\nToday, we reported fiscal year revenue of $518.8 million, up 6% compared to the prior fiscal year. As a reminder, our guidance excludes the impact of foreign currency exchange rates. Fluctuations in foreign currency had a significant negative impact on both the fourth quarter and full fiscal year sales results. We expected gross margin to be around 50%.\n\nToday, we reported gross margin of 49.1%, slightly below our guidance expectations. We expected our global advertising and promotion investment to be between 5% and 5.5% of net sales. Today, we reported an A&P investment of 5.3%. We expected net income to be between $69 million and $70.1 million, and a diluted EPS of between $5.02 and $5.10.\n\nToday, we reported net income of $67.3 million and earnings per diluted share of $4.90, slightly below our guidance expectations. To better understand what is driving these results, let's review our 55/30/25 business model, the long-term targets we use to guide our business. As you may recall, the 55 represents gross margin, which we target to be at or above 55% of net sales. The 30 represents our cost of doing business, which is our total operating expenses, excluding depreciation and amortization.\n\nOur goal is to drive our cost of doing business over time toward 30% of net sales. And finally, the 25 represents our target for EBITDA. First, the 55 or gross margin. In the fourth quarter, our gross margin was 47.4%, compared to 51.2% last year.\n\nThis represents a decline of 380 basis points due primarily to the challenging inflationary environment we continue to operate in. The good news is that we believe we have finally reached an inflection point. We put significant price increases into place in the third and fourth quarters, and we are seeing positive impacts to gross margin due to those price increases. I'll speak more about these impacts in a moment.\n\nChanges in major input costs, which includes specialty chemicals and aerosol cans, were the primary drivers of this decline. Rising specialty chemical costs negatively impacted our gross margin by 560 basis points period over period. As you know, crude oil is one of the primary feedstocks of our specialty chemicals, and costs associated with crude oil distillates continue to remain high even though crude oil has come down in price. This continues to put pressure on our cost of goods in all three trade blocs.\n\nIn addition, steel and tinplate continue to be at historic highs, and the increased cost of aerosol cans negatively impacted our gross margin by 520 basis points. In my 14 years as CFO, I've never seen inflationary impacts like the ones we are currently experiencing linked to specialty chemicals, steel, and tinplate. Also, negatively impacting our gross margin were higher filling fees, primarily in the Americas, which negatively impacted our gross margin by 140 basis points. To offset the impacts of inflation, we began tactical price increases across all our markets and geographies beginning in the first quarter of fiscal 2022.\n\nPrice increases take time to embed their way into our results, but I'm happy to share with you that gross margin was positively impacted in the fourth quarter by 810 basis points from sales price increases, which were implied during fiscal 2022. We have been implementing price increases across our business throughout 2022. However, we completed a significant round of price increases in our largest market, the U.S., in the third quarter. That resulted in a sequential improvement to the U.S.\n\ngross margin of 400 basis points in the fourth quarter compared to the third quarter of this fiscal year. We expect to experience similar positive margin increase trends as the full impact of price increases in other markets become embedded into our results. We implemented significant price increases in Europe beginning in July through September, and we began to see a recovery of EMEA's gross margin in the first month of fiscal 2023. We will continue to see further benefits from those and other price increases in future quarters.\n\nWe're confident that our action plans to rebuild margin, coupled with the advancement of our margin-accretive Must-Win Battles will enable us to deliver our long-term margin goals. The current inflationary environment has severely disrupted our ability to achieve our 55% gross margin goals over the near term. We recognize our recovery and progress toward our target of 55% will take time to achieve. While it may take some time, we will continue to take the necessary actions to restore our gross margins to 55% or higher over the long term.\n\nNow, I'll address the 30 or our cost of doing business. In the fourth quarter, our cost of doing business decreased to 31%, down from 39% last year. For the fourth quarter, 69% of our cost of doing business came from three areas: people costs or the investments we make in our tribe. People costs decreased by approximately $4.5 million in the fourth quarter compared to last year, primarily due to lower incentive compensation.\n\nThe investments we make in marketing, advertising, and promotion. As a percentage of sales, our advertising and promotion investment was 7.7% in the fourth quarter. Similar to the fourth quarter last year, we made a deliberate decision to increase our A&P investments to accelerate our efforts in building long-term brand awareness and market penetration. And finally, the freight costs to get our products to our customers.\n\nAnd that brings us to EBITDA, the last of our 55/30/25 measures. EBITDA was 16% of net sales for the fourth quarter, which is up compared to the fourth quarter of last year but lower than we would like to see. We would expect to move closer to historic EBITDA levels in the future. That completes the discussion on our business model.\n\nNow let's discuss some items that fall below the EBITDA line. The provision for income taxes was 19.1% in the fourth quarter, compared to 25.9% last year. The change in our income tax rate was primarily due to the favorable mix of income in jurisdictions taxed at lower tax rates, coupled with a one-time adjustment to state tax expense. Net income for the fourth quarter was $14.8 million, compared to $8.4 million last year.\n\nDiluted earnings per common share for the fourth quarter were $1.08, compared to $0.61 for the same period last year. Now, a word about our balance sheet and capital allocation strategy. The company's financial condition and liquidity remains strong. Our capital allocation strategy includes a comprehensive approach to balance investing in long-term growth while providing strong returns to our shareholders.\n\nWe continue to return capital to the shareholders through a combination of regular share repurchases and regular dividends. On October 11, our board of directors declared a quarterly cash dividend of $0.78 per share payable October 31 to stockholders of record at the close of business on October 21. During fiscal year 2022, we repurchased approximately 139,000 shares of our stock at a total cost of approximately $29 million. One other item I'd like to call your attention to is the increase in inventory on our balance sheet to $104 million.\n\nYou hear a lot of noise right now about how some consumer companies have heightened concerns about managing excess inventory and reducing inventory levels. I'd like to assure you that we do not have that concern. We have intentionally built up our raw materials, components, and finished goods, particularly in the U.S., to ensure supply and improve our ability to meet our market demands. We believe that this is a good use of our working capital.\n\nEventually, we would like to see inventory turnover go back to pre-pandemic ratios. But in the current supply chain environment, we have limited visibility as to when that may occur. In closing, I would like to take this opportunity to say thank you to the tribe and to all stakeholders for allowing me to serve as CFO of this wonderful company for the last 14 years. I've made so many positive lasting memories with you, and I am grateful for each one.\n\nI'm now going to turn the call over to Sara, who we will share a few thoughts with you on the future and provide a summary of the company's fiscal 2023 guidance. Now, it is my honor to pass the baton over to you, Sara.\n\nSara Hyzer -- Incoming Chief Financial Officer\n\nThanks, Jay, and thank you for that lovely introduction. I am very happy to be here and eager to get started in my new role on November 1. My primary objective will be to sustain the financial success that WD-40 Company has experienced throughout Garry and Jay's tenure. Several factors have contributed to the company's financial success, but there are two that I would like to focus on today.\n\nFirst is the 55/30/25 business model. For many years, we've run our business guided by these targets and have demonstrated that by aligning the organization behind these targets, we have continually improved the financial performance of our business. The model is being tested right now due to the inflationary environment we are operating in. However, we remain committed to our 55/30/25 business model and are focused on managing our business so that we can restore gross margin to our target of 55% in the future.\n\nSecond is the company's comprehensive capital allocation strategy, which I am committed to maintaining. The capital allocation strategy begins with targeted revenue and earnings growth in the mid- to high single digits. We have a cash flow accretive business that generates adequate liquidity to support our near- and long-term growth strategy. Historically, our business model has been asset-light, which has typically required low levels of capital investment, roughly between 1% and 2% of sales.\n\nIn fiscal year 2023, we expect to return to those historic levels and invest approximately $9 million in capital projects. We believe that we will continue to see our investments in capital projects return to historical levels in the future. Excess capital generated by the business is then allocated to the highest return alternatives. We don't anticipate any brand or product acquisitions.\n\nWe're in the business of acquiring new users and points of distribution every day, and that is where our focus will remain. Therefore, we returned the excess capital to our stockholders through dividends and share buybacks. Annual dividends will continue to be targeted at greater than 50% of earnings. Maximizing return on invested capital remains a priority, and we will continue to target a return on invested capital greater than 25%.\n\nNow, let's turn to fiscal year 2023 guidance. We expect net sales growth to be between 5% and 10%, with net sales between $545 million and $570 million. Gross margin for the full year is expected to be between 51% and 53%. Advertising and promotion investment is projected to be between 5% and 6% of net sales.\n\nThe provision for income tax is expected to be around 22%. Net income is projected to be between $69 million and $71 million. And diluted earnings per share is expected to be between $5.09 and $5.24 based on an estimated 13.6 million weighted average shares outstanding. Our projections for fiscal year 2023 reflects the recent strengthening of the U.S.\n\ndollar against the pound sterling, Chinese RMB, and Australian dollar. Without those currency headwinds, our sales growth projection would have been between 10% and 15% of net sales. In addition, we are managing through disruption in the market from our various price increases and expect much of our growth to be weighted toward the second half of fiscal year 2023. Our net income and EPS projections include planned investments for our ESG initiatives, new cloud-based IT systems, and strategic investments in our people to support our longer-term growth aspirations.\n\nWe want to remind everyone that there are dynamics outside our control that may impact our forecasted fiscal year 2023 results, including the impact of fluctuating foreign currency exchange rates, unanticipated inflationary headwinds, and other unforeseen events. This guidance does not include any future acquisitions or divestitures. That completes the outlook discussion. Now back to you, Steve.\n\nSteve Brass -- President and Chief Executive Officer\n\nThanks, Sara. Now, you have a summary of FY '22 and our financial expectations for FY '23. Let's spend a few minutes on the longer-term view. We have a simple strategy, a practical business model, and a significant and realistic opportunity to drive revenue growth well beyond the 2025 targets over the longer term.\n\nSara and I are absolutely committed to our 2025 revenue growth target, which is to drive net sales to between $650 million and $700 million by the end of fiscal year 2025. We will strive to do so while following our 55/30/25 aspirational business model. Looking beyond 2025, I believe there is a huge runway for long-term revenue growth for our company. As Garry alluded to earlier, we will be evolving our communications over the next couple of quarters to better share how we will achieve this growth in the future.\n\nFor now, I'd like to share with you my three strategic priorities for my tenure as CEO. They are: Firstly, to pivot the company toward a sustainable future. I consider the environment to be a key stakeholder in making decisions that create and protect long-term value must take that key stakeholder into consideration. Secondly, to further leverage our capability as a global learning and teaching organization.\n\nI believe if we learn faster, we can grow faster. And thirdly, to realize a huge growth potential present in emerging markets. I believe the long-term global market growth opportunity for WD-40 Multi-Use Product is over $1 billion and that the fastest growth will be achieved in our emerging markets. I look forward to sharing more with you on these and other developing areas in the coming quarters.\n\nIn summary, what did you hear from us on this call? You heard that this will be Garry and Jay's last earnings call. You heard that Sara and I are committed to the 2025 revenue growth targets and the 55/30/25 business model. You heard that sales of WD-40 Multi-Use Product were up 8% in fiscal 2022. You heard that sales of WD-40 Specialist were up 19% in fiscal year 2022.\n\nYou heard that with the exception of digital commerce, all the Must-Win Battles are performing well and supporting our revenue growth objectives and that we expect digital commerce to return to solid growth next fiscal year. You heard that although we've been experiencing pressure on gross margins from the challenging inflationary environment, in the fourth quarter, we saw a strong margin recovery in the United States, and we've begun to see a recovery in EMEA's gross margin in the first month of fiscal year 2023. And you heard that I'm very focused on my strategic priorities as CEO and will be sharing more with investors in coming quarters. In closing, today, I'd like to share with you a quote from Jim Collins, \"In a world of constant change, the fundamentals are more important than ever.\" Thank you for joining our call today.\n\nWe'd now be pleased to take your questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Linda Bolton-Weiser with Davidson. Your line is now open.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nYes. Hello. Thank you. Well, farewell, Jay and Garry.\n\nWe'll miss you. And welcome to the new management team. We look forward to working with you. So, could I just ask you -- my first question is about your expectations around gross margin in the quarter.\n\nI think that you have been saying that you expected gross margin to be up sequentially and yet it was down a little bit. So, what were the things that came out different in the quarter versus what you had been expecting to point to gross margin in the quarter being down?\n\nJay Rembolt -- Vice President and Chief Financial Officer\n\nHi, Linda. This is Jay. Yes. You know, if you recall, we had price increases going in, in the third quarter in the U.S., in the Americas.\n\nWe also had them going in, in the fourth quarter in EMEA. What we found is those price increases took -- while they didn't generate a significant amount of resistance, we were able to -- it took us longer than we had anticipated. So, the delay of price increases -- the delay of the implementation of price increases was the primary driver. We've also had some disconnection with respect to our petroleum distillates, the various components we use, and their index is not necessarily tied to the -- directly to oil.\n\nAnd in the past, it's tracked fairly closely to that. But what we did see is a significant variation from that and maintained itself at a fairly high level and continues to this day.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. So, I guess when you look at the maintenance product sales in the U.S., I think you said it was up 21%. So, that's really close to the 25% price increase, but not quite. So, was -- did you experience volume declines as you were taking these price increases, some volume softness?\n\nSteve Brass -- President and Chief Executive Officer\n\nHi, Linda. This is Steve. Overall, the volumes for the year, I mean, it's a slightly different story for, obviously, Asia Pacific where we continued strong volume growth. But yes, in the United States and -- sorry, the Americas totally and then in EMEA as well, our volumes were kind of flattish for the year.\n\nObviously, in EMEA, we had the loss of half of year worth of Russian business. So, that was a hit in EMEA. But overall, in terms of MPMP, so multi-purpose maintenance products, our volumes were flat for the year. So, there was some decline.\n\nAll of our kind of volume -- all of our price -- all of our growth was price driven for the year when you look at it globally.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nWell, but I guess I'm not so much interested in the fiscal year. I'm interested in the period during which you started to take these significant price increases. So, did the volume declines get more significant as you were taking these price increases of 20%, 25%?\n\nSteve Brass -- President and Chief Executive Officer\n\nYeah. So, what happens? When you implement price increases of that kind of magnitude, you get quite a lot of disruption in the market. So, there's been lots of promotions and a lot of our volume is driven by lots of displays in home centers, in major retailers. And so, losing some of that momentum is what causes some of that volume loss.\n\nSo, yes, in Q4, to answer your question specifically, there was some volume loss as we went through some of this disruption, and we expect that to continue for the first part of FY '23.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nSo, what is -- for your local constant-currency sales estimate for FY '23 of up 10% to 15%, how does that very roughly break down between volume and price?\n\nSteve Brass -- President and Chief Executive Officer\n\nSo, going -- looking forward, overall, we'd see volumes overall being flat to slightly negative for the year. And so, all of the price increases are basically globally. That's all being driven by price and absorbing those price increases. So, it's slightly different again by trading blocs.\n\nSo, we haven't had the same inflationary impact we've seen elsewhere in Asia Pacific. But for Europe and for the Americas, and don't forget in Europe, we've still got to absorb a half year of the Russia loss. So, that's out there as well in terms of the volume loss. So, volume expectations for FY '23 are flat to slightly negative, recovering as we work our way through this disruption by the second half year.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. Thank you. That's very helpful. And then at the Analyst Meeting, I think you were kind of talking about getting back to a 55% gross margin by the end of fiscal '23.\n\nI mean, is that still kind of what you're expecting, but yet, it's kind of sequentially going up slower than we thought? Or just what is the cadence that you're now thinking versus when you were talking in July?\n\nSara Hyzer -- Incoming Chief Financial Officer\n\nHi, Linda. This is Sara. So, yes, I think we had hoped that we were going to be there by the end of fiscal '23. But as Jay mentioned, the timing of these price increases coming in was a little bit later than we expected when we started to see them actually flow through the results.\n\nAnd so, we will see a slower uptick and we're anticipating a slower uptick for the upcoming year. So, at this point, we don't think we'll be able to get to the 55% by the end of this year. But I think there are still opportunities both with premiumization and other margin accretion activities that we're working on that we believe that we can get there at some point in FY '24.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. And then just one final one for me on -- I mean, you talked about inventory. And you're right, a lot of companies are carrying higher inventory and slower than expected at working it down, it seems like. Is this a permanent situation because of components availability and all that? In which case, you did sort of technically borrow to pay your dividend, your free cash flow is lower than your dividend.\n\nSo, that's not a great situation. So, going forward, I mean, I guess if inventory just doesn't increase anymore, your cash flow will improve. But what's the outlook for cash flow relative to your cash dividends in FY '23?\n\nJay Rembolt -- Vice President and Chief Financial Officer\n\nSorry, Linda, I was on mute. We certainly expected to cover it as we go into the -- in the next year. This was a year of outsized investment in inventory and one that we are -- we might see some incremental movement, but it certainly is not going to be of the similar magnitude as we go forward. So, our view is that the inventory at some point will normalize back to the turns that we've historically had.\n\nIt's just that right now, we can't see when that will be because of things like lead time, availability of certain components, etc., etc.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. Well, that's fair enough. Thank you so much for answering my questions. Best of luck.\n\nJay Rembolt -- Vice President and Chief Financial Officer\n\nThank you, Linda.\n\nOperator\n\nYour next question comes from the line of Daniel Rizzo with Jefferies. Your line is open.\n\nDaniel Rizzo -- Jefferies -- Analyst\n\nHi, everyone. Thanks for taking my questions. Just for clarification, there is -- I think you said there was sales -- there was FX headwinds expected in sales, I think it was, I think, 500 basis points. Did you -- have you clarified what you expect FX to mean to EBITDA or EPS?\n\nSara Hyzer -- Incoming Chief Financial Officer\n\nNo, we have not quantified that, but we have built in those expectations into our guidance.\n\nDaniel Rizzo -- Jefferies -- Analyst\n\nYou have. OK. And then I think North America was fairly strong. I don't know if I missed this, but did you indicate that there was some prebuying in North America because of -- in anticipation of the price hikes in the Q4?\n\nSteve Brass -- President and Chief Executive Officer\n\nDaniel, this is Steve. So, in Latin America, there was some limited prebuying. So, it's not overly material, but in Latin America with our distributor markets, we did have some prebuy on [Inaudible].\n\nDaniel Rizzo -- Jefferies -- Analyst\n\nBut not North America?\n\nSteve Brass -- President and Chief Executive Officer\n\nNorth American increases were in Q3.\n\nOperator\n\nLadies and gentlemen, that does conclude our allotted time for questions. [Operator signoff]\n\nDuration: 0 minutes\n\nWendy Kelley -- Vice President of Stakeholder and Investor Engagement\n\nGarry Ridge -- Chairman of the Board\n\nSteve Brass -- President and Chief Executive Officer\n\nJay Rembolt -- Vice President and Chief Financial Officer\n\nSara Hyzer -- Incoming Chief Financial Officer\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nDaniel Rizzo -- Jefferies -- Analyst\n\nMore WDFC analysis\n\nAll earnings call transcripts"
}