{
  "companyName": "Bumble Inc.",
  "companyTicker": "BMBL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/bumble-inc-bmbl-q3-2022-earnings-call-transcript/",
  "content": "Bumble Inc. (BMBL 1.35%)\nQ3 2022 Earnings Call\nNov 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Bumble's third quarter 2022 conference call. At this time, all participants are in a listen-only mode. After speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Cherryl Valenzuela, vice president of investor relations. Please go ahead.\n\nCherryl Valenzuela -- Vice President, Investor Relations\n\nThank you, operator, and thank you all for joining us to discuss Bumble's third-quarter financial results. With me today are Whitney Wolfe Herd, founder and CEO; Tariq Shaukat, president; and Anu Subramanian, CFO of Bumble. Before we begin, I'd like to remind everyone that certain statements made on this call today are forward-looking statements. These forward-looking statements are subject to various risks and uncertainties and reflect our current expectations based on our beliefs, assumptions, and information currently available to us.\n\nAlthough we believe these expectations are reasonable, we undertake no obligation to revise any statements to reflect changes that occur after this call. Descriptions of these factors and other risks that could cause actual results to differ materially from these forward-looking statements are discussed in more detail in our earnings press release and filings with the SEC, including our annual report on Form 10-K for the year ended December 31, 2021, and our subsequent periodic filings. During the call, we also refer to certain non-GAAP financial measures. These non-GAAP measures should be considered in addition to and not as a substitute for or in isolation from our GAAP results.\n\nReconciliations to the most comparable GAAP measures are available in today's earnings press release, which is available on the Investor Relations section of our website at ir.bumble.com. And with that, I'll turn it over to Whitney.\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nThank you, Cherryl, and thank you all for joining us today. Our Q3 results demonstrate the strength and resilience of our brands and our business amid a challenging global operating environment. I want to lead by restating that love is a universal and fundamental human need. How we deliver for this global need evolves, but we are well-positioned to deliver for our members at scale.\n\nIn the third quarter, we delivered solid top-line growth of 17% year over year, driven by 28% growth for Bumble App. Adjusted for both FX and the Ukraine complex, Bumble Inc. revenue growth would have been 10 points higher and Bumble App revenue growth would have been five points higher. We maintained a strong focus on cash flow and profitability, delivering record adjusted EBITDA of $62 million in the third quarter, surpassing our outlook.\n\nBumble App continued its momentum in Q3, gaining download share in both core and international expansion markets while exceeding our expectations for both new user growth and reengaged users. Monetization was also strong as paying users accelerated for the fourth consecutive quarter to a record 164,000 sequential net adds. International expansion continued to propel bundle apps growth with strong increases in users and payers across Western Europe, Asia Pacific, and Latin America. Our strategy and new management structure for Badoo are starting to deliver, and we have made progress in stabilizing to do.\n\nSequential net adds increased for the first time since Q4 2021, and we achieved positive revenue growth after adjusting for the impact of FX and the conflict in Ukraine. We achieved these results against the backdrop of a very uncertain geopolitical and macroeconomic environment. While these results are strong, our third-quarter revenue adjusted for FX headwinds came in just shy of our previous expectations. There are two factors that drove this, which will also impact Q4.\n\nNow let me provide more context for each. First, in Q3, we encountered some design and user engagement issues related to new product launches on our core profile page. As a result, we made the decision to delay these launches, including monetized complements. That's our message before Match feature.\n\nWe have addressed the issues, and these features have started rolling out eight to 10 weeks behind plan. Notably, fully monetized complement is now live in Australia, Germany, Canada, and parts of the U.S., including New York and New England. We anticipate completing the U.S. rollout and progressing to our remaining markets throughout Q4 and into early 2023.\n\nOur results were also impacted by the increasingly challenging macroeconomic environment in late Q3 and Q4. User engagement and new user growth are strong in both our core markets and our international expansion markets. Importantly, we have seen no impact on new subscriptions. However, some of our user segments are facing greater pressure on disposable income, and these segments are renewing their subscriptions at a modestly lower rate.\n\nWe are actively adjusting our marketing approach to ensure that we highlight the comparative value of our offerings to other dating alternatives and modifying our merchandising and payer retention strategies. Notwithstanding these items, our business remains strong. Bumble App revenue grew to $181 million in Q3, up 28% year over year. Paying user growth remained strong in Q3, with sequential net adds accelerating to $164,000.\n\nWe continue to grow download share in both core and international expansion markets with share gains across all of our major regions and strong year-over-year performance in the U.S., Canada, U.K., and Australia. Notably, we are continuing to see strength in our Gen Z user growth in both our core and our international growth markets. According to the research group warning consoles, Bumble has the highest net brand favorability and Net Promoter Scores with the 18 to 29 and 30- to 44-year-old segment is the major dating brands that they track in the U.S. This speaks to the unique strength of our brand, which is the foundation for the strong performance that we have delivered all year.\n\nInternational expansion continues to be a critical growth driver for bundle app. In Western Europe, we saw robust user growth and even faster revenue growth. We remained the No. 2 dating app in Germany, closing the gap significantly with the No.\n\n1 player, and we gained a download share in Austria. Fran, Switzerland, Belgium, and the Netherlands. Spain is our most recent launch in the region, and we have seen significant growth in registrations, MAU, and revenue since early July. Our Latin America and Asia expansion are performing well.\n\nIndia remains a notable highlight and revenue in India more than doubled year over year, again, demonstrating the broad global appeal of our brand and product. Between now and the end of 2023, we will build on our proven playbook to continue to actively expand internationally. We expect to complete our major launches in Europe and critically to continue to deepen our presence in each of our recently launched markets. In addition, we expect to continue our rollout in Asia and Latin America.\n\nOutside of the products already noted, Q3 was a very active product launch period for us, that are serving the wide range of audiences on Bumble has been a key focus. We launched improved experiences for users who want to celebrate their cultural heritage, and we improved the experience for our LGBTQIA+ audience. We launched Astrology Tuesday offerings, which drove strong engagement with 1eight- to 30-year-old women, in particular. We expect to continue building on this platform.\n\nWe've also been focusing on developing an improved experience for our college and recent graduate communities, and we are rolling out student-only experiences for verified college students. Our first college monetization offering launched in late August, and we are pleased with the initial results. In Q3, we also introduced our speed dating feature in select cities around the world, who utilize the product functionality to launch our partnership with Emmy award-winning comedy Ted Lasso, with Banter Live by Bumble, we are bringing the fictitious dating app feature on the show to life, creating an innovative and fun way to grow and further engage bumble users in our core English-speaking markets. Banter Live takes place on Thursdays each week through the remainder of the year.\n\nWe are pleased with the initial participation results that we've seen, and we're excited by the new engagement model that this product represents. Now, looking forward to 2023, we expect to continue our rapid pace of product development. Our product focus will include enhancing the college and recent crowd experience continuing to build on the complements and speed dating platforms that we've launched, leaning into social features, such as our recently launched recommender friend feature, and building out new monetization platforms at both the low end and high end. Now, turning to Badoo and other products, including Fruitz.\n\nBadoo and other revenue totaled $52 million in Q3, down 10% year on year on a reported basis. That includes 21 points of combined negative impact from FX and the conflict in Ukraine. We have made progress toward stabilizing Badoo's performance. The sequential increase in paying users was driven by product improvement, including an enhanced talk-to-someone experience and a new one-day consumable aimed at driving payer conversion for the more economically sensitive Badoo user.\n\nOver the next several quarters, we will build on these successes with additional product releases and a continued disciplined marketing approach. Let me turn next to Fruitz. Adoption continues to grow quickly in France, Belgium, the Netherlands, and parts of Canada, and we are actively working on its broader international expansion strategy for 2023. Since acquiring the company in January, we have integrated a significant amount of our safety capability and throughout Q3, we've been bringing our monetization expertise to that team.\n\nAt the same time, we are leveraging Fruitz as a learning platform to better serve Gen Z. Finally, I would like to spotlight a couple of safety initiatives that serve as powerful reflections of our mission and our commitment to creating kind connections. First, California signed a cyber flashing bill in September that makes the sending of unwanted lude images illegal, building upon similar legislation that we also championed in Texas, Virginia, and the U.K. More recently, we open-sourced our private detector machine learning model to bring improved user trust and safety to the social media industry at large.\n\nI am so proud of how our team's work is shaping our global industry for the better, and I'm looking forward to more. I will now turn it over to Anu for a discussion of our financials and outlook. Thank you so much.\n\nAnu Subramanian -- Chief Financial Officer\n\nThank you, Whitney, and good afternoon, everyone. I'll begin with a discussion of our third-quarter trends and results before turning to our outlook for Q4 and the full year. Unless stated otherwise, the comparisons I will make refer to the third quarter of 2022 versus the third quarter of 2021. Total Bumble Inc.\n\nrevenue in Q3 was $233 million, up 17%, driven by growth in Bumble App. FX was a $14 million headwind to top line, $2 million worse than we had expected at the time of our guidance. In aggregate, FX headwinds and the Ukraine conflict impacted our Q3 growth rate negatively by 10 percentage points. At a group level, revenue growth was driven primarily by growth in paying users which increased 15% to $3.3 million, while our people increased by 1%.\n\nRevenue from Bumble App grew 28% to $181 million. FX was a $7 million year-over-year headwind, which negatively impacted growth by five percentage points. FX headwind was $1 million more than we had previously expected. Bumble App revenue growth was driven by a strong 36% increase in paying users to $2.1 million.\n\nOn a sequential basis, we added 164,000 paying users marking the fourth consecutive quarter we've increased net adds. The strong growth in paying users was driven by a number of factors, including active user growth from high reengagement rates, successful international expansion, and product enhancements that drove paid conversions. Bumble App's ARPPU was $28.84, down 6% year over year and 1% sequentially primarily due to country mix and FX impacts, partially offset by pricing optimization initiatives. Now, moving on to Badoo App and other.\n\nBadoo app and other revenue declined 10% in Q3 to $52 million. FX and the Ukraine conflict represented a $12 million headwind year over year which negatively impacted growth rates by 21 percentage points. FX headwind was $1 million worse than we had expected. Absent these headwinds, Badoo and other revenue grew double digits year over year.\n\nBadoo App and other paying users declined 10% year over year to $1.2 million but grew sequentially by $106,000. Badoo App and other ARPPU declined 7% year over year to $12.75 due to FX and country mix, partially offset by pricing optimization work. As a reminder, we currently include Fruitz revenue within Badoo App and other revenue but exclude Fruitz paying users from Badoo App and other paying users. Turning now to expenses.\n\nWe continue to remain very focused on managing our business profitably, especially in light of the current geopolitical and macroeconomic environment. Total GAAP operating costs and expenses were $204 million for the quarter, down 1% year over year. On a non-GAAP basis, excluding stock-based comp and other noncash or one-time items, I'd note the following: our total non-GAAP operating expenses were $171 million, up 18%. Cost of revenue was $64 million and grew 17% year over year.\n\nThe increase was primarily driven by higher app store fees as revenues have grown. As a percentage of revenue, cost of revenue was 27%, flat versus the year-ago period. Sales and marketing expenses grew 16% year over year to $61 million. This represents 26% of revenue, flat versus the year-ago period.\n\nG&A expenses were $30 million or 13% of revenue, compared to $24 million or 12% of revenue last year. Product development expenses were $16 million or 7% of revenue, flat versus the year-ago period. Q3 GAAP net earnings were $26 million, compared to a net loss of $10 million in the year-ago period. And Q3 adjusted EBITDA was $62 million, up 13% year over year, and represented a 27% margin.\n\nWe generated $34 million of free cash flow this quarter. We have a strong cash position and ended Q3 with total cash of $365 million. We continue to maintain strong financial discipline with regards to potential uses of cash. Now, moving on to our outlook.\n\nWe expect the following for Q4. Total revenue between $232 million and $237 million, representing a growth rate of 12% to 14% year over year. Our outlook assumes $16 million of year-over-year FX headwinds, $6 million more than we had previously estimated. Our outlook also assumes approximately $5 million of year-over-year headwinds related to the conflict in Ukraine, primarily in Badoo.\n\nExcluding the impact of FX and the Ukraine conflict, our total revenue growth outlook would have been 22% to 25% year over year. We expect Bumble App revenue to be between $184 million and $187 million, representing a growth rate of 23% to 25% year over year. The revenue outlook assumes a negative impact from FX of approximately $9 million, $4 million more than we had anticipated originally. Excluding FX headwinds, our guidance for Bumble revenue growth would be 29% to 31% year over year.\n\nWe estimate adjusted EBITDA will be between $57 million and $59 million, representing 25% at the midpoint of the range. Our Q4 expectations are based on three considerations. First, we expect FX to continue to be a headwind across all our apps. Second, while Bumble App is continuing to demonstrate strong user engagement, product delay and macro issues will weigh on Q4 results.\n\nAnd lastly, on Badoo and other, we expect continued macro pressure along with lower demand for advertising this holiday season. On a full-year 2022 basis, we expect total revenue growth rate of 17% to 18% year over year. This assumes $44 million of year-over-year FX headwinds and excluding the impact of FX and the Ukraine conflict, our guidance for total revenue growth would have been 26% year over year. We expect Bumble App revenue growth rate to be 30% to 31% year over year.\n\nThe revenue outlook assumes a negative impact from FX of $23 million. Excluding FX headwinds, our guidance for bumble revenue growth would be 34% to 35% year over year. We estimate adjusted EBITDA will be between $223 million and $225 million, representing 25% margin at the midpoint of the range. We are currently in the middle of our annual planning cycle.\n\nAnd while we typically provide full-year guidance on our Q4 earnings call, given macro uncertainty, we wanted to share some preliminary expectations for full-year 2023 today. While the operating environment continues to evolve, based on our current visibility on our product road map and market expansion efforts, we expect that Bumble Inc. revenue will grow between mid- to high teens next year. This has used 300 basis points of FX headwinds at current rates.\n\nAdjusted for that, we expect our total company revenue growth will be high teens to low 20s on a year-over-year basis next year. We are also committed to expanding adjusted EBITDA margins in 2023 by at least 100 basis points on a full-year basis. This will be achieved by ensuring that we remain laser-focused on spend while continuing to invest in our growth priorities. In closing, we remain as focused as ever on balanced execution.\n\nWe will continue delivering best-in-class experiences for our users and we will do this without sacrificing on our goals of sustainable and profitable growth for our shareholders. And with that, operator, we can open it up for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Please stand by while we compile the Q&A roster. Our first question comes from Andrew Marok with Raymond James. Your line is now open.\n\nAndrew Marok -- Raymond James -- Analyst\n\nHi. Thanks for taking my question. I wanted to talk a little bit about the preliminary outlook for '23. I guess what assumptions for macro are based in -- are baked into that? A consistent outlook or any worsening involved? And is there any contribution baked into that from nondating properties?\n\nAnu Subramanian -- Chief Financial Officer\n\nYeah, sure. Hi. I can take that. So, again, like I said in my prepared remarks, I wanted to mention that we are still very much in our planning stages for next year.\n\nAnd so, the teams are actively working on what 2023 will look like. But again, like I said, given the larger macro uncertainties, we wanted to just provide everyone a preliminary estimate based again on our best guess around 2023. So, like I said, our range currently is in the high teens to low 20s adjusted for about three points of FX headwinds. We are assuming here that Bumble App will continue to be primarily the growth driver for our business next year.\n\nAnd the growth levers are -- will largely be similar to what we saw in 2022 in terms of we still expect paying users to drive growth across both our core and international markets. No, we've obviously made some reasonable assumptions around what the growth vectors look like across the different geographies based on the data that we have from historical market expansion. And we've also made some high-level assumptions about product contribution. But again, these road maps are still being built, and so we'll have more detail to share when we come back in Q4.\n\nFrom a macro perspective, again, we've assumed that the current state continues into 2023. We've not assumed any material degradation in terms of what we are seeing. But obviously, this is something that we will be looking at very closely between now and Q1 when we come back to provide guidance. Again, our goal was to provide a high-level numbers, but we will provide specific drivers of revenue when we come back.\n\nAndrew Marok -- Raymond James -- Analyst\n\nGreat. Thank you. And one more if I could. In this type of environment, I know you talked a little bit about your marketing philosophy in your prepared remarks.\n\nBut in this type of environment, can you pull back on marketing spend? Or will you need to spend through it to defend your position? I guess is there any differences in your outlook on marketing like channel shifts toward campus, influencer or lower-cost channels, anything like that?\n\nTariq Shaukat -- President\n\nSure. I'll take that. This is Tariq. So, we've always had a very disciplined approach on marketing, and it's always been very ROI-centric, even our brand marketing spend, not just our performance in paid marketing spend.\n\nA lot of the success we see on the marketing side is built off of the brand base and some of the stats that Whitney said about the love for our brand and the favorability that we have for our brands. So, at the moment as conditions got tougher in Q3 and in the first several weeks of Q4, we haven't seen a need to change our marketing approach per se from a channel standpoint or anything like that. What we are doing is adjusting the messaging and the merchandising to make sure that we're able to really speak to our users in the context of the current environment. A lot of our messaging is working one of our big platforms that you'll recall is it started on Bumble, which is really about celebrating the success that our users have on the platform.\n\nwe are dialing up some of the comparative value messaging that Whitney mentioned about Bumble, we believe, being one of the best ways to have a first state to find the first state compared to cost of drinks and bars could cost of other things that you might do. So, you'll see more messaging around that as well. And yes, and I don't think we're going to be seeing any substantial change in spend.\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nAll right. Great. Thank you. Yeah.\n\nAnd I just wanted to clarify. I think I missed answering your question about nondating businesses. Our 2023 revenue assumptions don't include any major contributions from our nondating business. Our goal is to test monetization strategies for our nondating business next year.\n\nBut right now, we are not baking in any big revenue contributions from that.\n\nAndrew Marok -- Raymond James -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Mark Kelley with Stifel. Your line is now open.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you very much. I was wondering if there's a way for you to maybe quantify a bit more that eight- to 10-week delay that you highlighted at the outset of the prepared remarks. Maybe just how it impacted Q3 and then how you think that impacts Q4 maybe into next year? And then would love your thoughts on just expectations for app store fees next year and beyond, given the margin outlook you gave, you're not taking any improvement into your estimates at this point.\n\nBut any just high-level thoughts there would be great. Thank you.\n\nAnu Subramanian -- Chief Financial Officer\n\nYeah, sure. Why don't I start with the margin question? And then I'll hand it over. You're right, on the app store fees, we haven't assumed any relief coming in, in 2023. So, we've resumed largely current state of affairs.\n\nObviously, we'll have to see what next year will bring in terms of changes in this front. But right now, our EBITDA 100 basis points expansion doesn't assume any additional benefit coming out of that.\n\nTariq Shaukat -- President\n\nAnd in terms of the product delays, as we mentioned, it was some of our products. We had a very robust product launch flow, if you will, in Q3. There was a handful of our products that did get delayed that had monetization implications. Most notable is complements and the paid version of complements.\n\nThat is now live. So, it really is that eight- to 10-week delay on a number of those features. We're not providing specific breakdown between them, but macro and the product delays are, give or take, roughly even in the Q4 calculus.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nThank you. One moment for our next question, please. Our next question comes from Cory Carpenter with J.P. Morgan.\n\nYour line is now open.\n\nCory Carpenter -- JPMorgan Chase and Company -- Analyst\n\nThanks for the question. Maybe one more on the product delays. Just Tara, hoping you could expand a bit on what exactly the issues were that led to the delay. And then also what you did see in testing with complements in the college bundles and what your expectations are on the monetization side? And then for new, just hoping you to expand on the 4Q bundle out guide.\n\nAny color you could provide on what your expectations are in terms of payer growth versus ARPU would be helpful. Thank you.\n\nTariq Shaukat -- President\n\nGreat. So, I'm going to try and answer the question, Cory, without going into too much of the details of the product. But the -- so essentially, there's a number of products that we were launching this quarter like complements that have to be integrated into the core profile experience. And that profile experience.\n\nIt's like the homepage on the web. It is required to solve -- to serve everybody who uses our apps, right? We do personalization, but it's largely a single experience and a single home page, if you will, for the app a number of features built on top of that. As we rolled into testing, we started to see that there were some impacts from a design and user experience standpoint, primarily on the power user segment that interact most frequently with that app, and it was causing some kind of unexpected behavior in that segment, such an important segment for us in such a sensitive area. We decided to hit pause, make sure we really understood it, and tweak some of the design elements and some of the mechanics underneath the hood.\n\nSo, for complement as an example, exactly how -- where it sits on the page exactly how you interact with it. There are elements like that that were good broadly speaking, but not good for specific segments like that power user segment that we were talking about. And we wanted to get it right. We have both a high bar to run the risk of alienating any of our users.\n\nThat said, it has been live now in Germany and Australia. And those were our test markets, we rolled it in late October into Canada and then more recently in November into New England, New York, New Jersey, a couple of other places in the U.S. We're seeing strong adoption. People are sending compliments.\n\nIt's a different experience, as we've said. It's not something that we've done before. So, there's a little bit of a learning curve associated with it, but we do have people sending. We have people opening.\n\nWe see that it is leading to better matches. And really, critically, we are seeing that people are willing to pay for the experience, the monetized version we have rolled out is really leaning into at the moment, a consumables experience where you pay to send beyond your free quota that you get for a day. And so, that is all working well, we see excitement because it is a new interaction model in the app, right? And so, we're very pleased with that. We're going to continue rolling it out, as we said.\n\nCollege bundles was a big topic in August. And we have mentioned that from a go-to-market standpoint, we were delaying -- it did go live on our revised schedule in August and September, as students came back on the campus. And just as a reminder of the strategy on college, it really is all about finding these segment-specific opportunities that we can target and dive into, largely areas that we've kind of missed from our overall broad-based monetization strategy, so college students being an under-monetized segment that we have. We rolled out a number of different college monetization offerings.\n\nOne of them was labeled the student bundle. There are some others. These are all available on a targeted basis. We saw in the segments we targeted a meaningful uplift in ARPU.\n\nWe are now working on how do we expand the distribution of those and the evolution of the -- as we had talked previously about adding virtual goods, for example, later in this year and early next year, that is still our plan, and we think we'll drive further uplift. We're also rolling out this college verification program, which will enable us to expand verified distribution. So, we don't accidentally offer these packages to somebody who is not -- who shouldn't be getting it.\n\nAnu Subramanian -- Chief Financial Officer\n\nYeah. And, Cory, just to answer your question about specifics on Q4 outlook. So, just to contextualize this, we -- compared to our previous guidance, we've taken down our overall guidance by about $20 million. $6 million of that relates to incremental FX headwinds.\n\nSo, you're really talking about a $14 million difference, about $9 million of that is on Bumble and $5 million of that is on Badoo. The $9 million for Bumble is largely because of the two factors we've already talked about in terms of the product delay and macro. In terms of how I expect Bumble App KPIs to come out in Q4, our goal for the year in terms of getting to 500,000 net adds still has not changed. So, we are still hoping to get to that number by the end of the year.\n\nObviously, given FX and given the fact that complements, which would have been an RPP driver are delayed and are not going to contribute as much in Q4. We will see year-over-year declines in our people in Q4 for Bumble App. So, that's the composition of how I expect Bumble asked to come out in Q4. And for Badoo, the $5 million is largely -- right now, we are taking again a cautious approach on what macro looks like.\n\nObviously, as we've said before, the Badoo consumer is more sensitive to some of the macro conditions. So, we are just taking a cautious approach to where we think Q4 will end. That $5 million also includes weakness that we are seeing in advertising, again, similar to a lot of other companies. So, we are expecting to be about $1 million lower than last year in terms of that as well.\n\nSo, those are the high-level components of how the Q4 outlook breaks out.\n\nCory Carpenter -- JPMorgan Chase and Company -- Analyst\n\nVery well. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Shweta Khajuria with Evercore ISI. Your line is open.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thank you for taking my questions. A, could you please provide more detail on what has to happen? I understand it's a very high level, and you'll do your planning. But what has -- as of now, assuming that macro is steady, what has to happen to get to low -- I guess high teens next year and low 20% growth rate? So, what is the assumption baked in that range as of now? And I guess the second question is, could you talk about sensitivity of low disposable income consumers? My understanding was that at a high level, you've got your skewed toward the demographic that's more resilient, but could you touch on that and where you're seeing that sensitivity? Thank you.\n\nTariq Shaukat -- President\n\nHey, Seth, I'll start with that second one maybe and then turn it over to Anu on the outlook question. So, it is true that historically, Bumble has had a more resilient user base. And we think we are still seeing that resilience in the majority of our user base as we've grown both globally and just in our core markets, we have, for example, been rapidly adding Gen Z users. Gen Z users make up a large amount of the growth that you're seeing in downloads.\n\nAnd Bumble is really becoming as the No. 2 most downloaded dating app in the world. And particularly in these core markets that we're talking about, a broad-based product. And so, we are seeing a little bit of that price sensitivity creep in.\n\nIt is primarily the Gen Z, the younger demographics. At the moment, there's a couple of other pockets of price-sensitive users. I think I'll hit on a point that with said earlier that what we're seeing is really this thinking twice about a purchase type of dynamic. The initial subscription rates, including in these price-sensitive segments, we're not seeing any decline in that.\n\nSo, this is really -- to put it bluntly, at what point do you run out of money and start thinking about wanting to do -- should you keep going or not. And that is impacting these renewal rates. It's a very isolated phenomenon in certain pockets of the user base, not anything that is broad-based.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thanks, Tariq.\n\nCherryl Valenzuela -- Vice President, Investor Relations\n\nYeah. In terms of expect, like you said, I think, again, you know, we are very much in preliminary stages of providing outlook. But at the high level, if you think about it, like Tariq was saying, we are seeing in some pockets of our business, macro start to rear its head. We assume that that continues.\n\nI mean, if you -- even if you compare between September to October and November, while we saw a lot of that impact in September, we haven't seen the trends worsen in October and November, yes. So, we've sort of assumed a steady state in terms of that for next year. Now obviously, if things got worse from a macro perspective, you would see us flight to the lower end of that guidance. And on the higher end of the guidance, again, we made our best guess estimate in terms of which international markets we want to get into where some of the products we think we really want to focus on next year will land and the timing of all of those are still being worked out.\n\nBut again, depending on how many of those and what the probability of each of those products ends up being. That is what would push us to the high end of our guidance. And obviously, we are also -- next year, as we think about it, we are excited about products like Fruitz, which obviously, this year has been very much a focus on integration. But next year, we are excited about groups starting to monetize.\n\nSo, there are assumptions baked into what that looks like, as well as we are excited about stabilizing Bed. Obviously, we saw that in Q3, but we also know that macro is potentially going to come in the way of that. So, again, lots of plans being made in terms of all the products that we have. So, we are right now, very confident about this range.\n\nAgain, we'll put a finer point on this when we come back in a few months.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thanks. And if I may --\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nThank you. \n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nHello? Can you hear me now?\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nGo ahead.\n\nTariq Shaukat -- President\n\nActually lost you there for a second.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nYeah, sorry about that. Just to follow up, you said October- and November-to-date was stable. So, your guidance, does that assume any deterioration from now to the end of the year going forward? Or Q4 guidance assumes what you see now to stay the same? Thank you.\n\nAnu Subramanian -- Chief Financial Officer\n\nYeah. So, Q4 guidance assumes what we are seeing now, which is, again, remember, lower than what we had seen back in July and August. So, we've assumed that that stays, but we'll obviously, you know, keep a pretty close eye on it. But right now, we feel pretty good based on the numbers that we are seeing for October and November in terms of where we are with respect to guidance.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thanks a lot.\n\nAnu Subramanian -- Chief Financial Officer\n\nThanks.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nThanks, Tariq.\n\nTariq Shaukat -- President\n\nThanks.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Alexandra Steiger with Goldman Sachs. Your line is now open.\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nThank you so much for taking my question. So, Whitney, maybe one for you. In your prepared remarks, you mentioned that you're addressing some of these macro headwinds that you're seeing by changing some of the product marketing. Can you just elaborate on these product changes a little more? And how fast do you think changes could offset some of the impact you're seeing? And then second, maybe just on like the Badoo segment, what is the new management team most focused on from like a product perspective? And, you know, what gives you confidence that we can see revenue reacceleration into '23 from that segment? Thank you.\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nYeah. Great. Thank you so much for your question. I think I would love to start with both pieces of my remarks around changing product but also marketing tactics around this.\n\nSo, if you think about the relative cost of our product comparatively to alternative dating options. For example, what I was saying is it's very strong. So, for example, our weekly boost subscription cost less than a beer at a New York City bar, and the expense of going on multiple days in a week really adds up quickly. So, we're leaning into this both from a product and marketing perspective.\n\nSo, from a product marketing hybrid, we are going to be really showing our customers the relative value of using a subscription on our product versus going out and dating in the real world. This resonates very well. We are also going to be really adjusting the way that we offer these experiences to our customers to be more in line with their needs as they evolve. So, maybe instead of a longer-term subscription maybe shorter opportunities, shorter consumables.\n\nSo, really just being nuanced to the demand of these segments. Now I want to reinforce this is not a blanket approach. There is still a segment that really wants high-end offering. There's a segment that wants more curated experiences and more premium offerings.\n\nAnd so, we can do this on a very targeted basis. with these new capabilities that we've built. You saw these capabilities land with college bundle. I think this is an important point.\n\nCollege bundle is not just about the college audience. It's about how we can actually bundle our monetization offerings and our product offerings to enhance the experience for our core demographics. So, if you see a demographic that might have less disposable income, how can we give them consumables and subscription offerings that meets their needs versus someone on the other end of the barbell, that might be looking for a more premium experience? So, this is really something we would say is a hybrid product marketing effort that we would not extrapolate from one another and really leaning into that relative value. And I think it's just very important to end on this point with our deep conviction for the confidence and the demand for love and for dating.\n\nOur top-line numbers have shown in our registration numbers have shown there is not disintegration in demand for this product. And so, I just wanted to reinforce that. And I believe the second question was about the do. So, we're really excited about the new focus around the leadership team.\n\nEssentially, we've assigned a single-threaded owner, Badoo, which has been remarkable for the efficiencies, and so really understanding the customer and delivering for their needs, delivering for who that customer really is -- and so, while we're very encouraged by Badoo's improving performance in Q3, as we've laid out, we know that we still have work to do in terms of that reacceleration. But we also anticipate that the does more economically sensitive user base will remain affected by these uncertain macroeconomic challenges. So, for the year ahead, we're really just focused on driving monetization and adding new product features that serve that audience. And then this includes a new Discover feature that will be providing daily compatible suggestions.\n\nthat we really plan to introduce before the end of this year. So, all of this being said, it's really ultimately the design of a tight and focused team and led by that really excellent new general manager. So, overall, we're pleased with the progress, and we are maintaining our product focus to continue the positive momentum.\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Laura Champine with Loop Capital. Your line is open.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nThanks for taking my question. On the guide for -- or the initial outlook for next year's revenues to grow in sort of a teens range, how does that compare to your thoughts on the long-term opportunity for Bumble Inc. total company revenue growth?\n\nTariq Shaukat -- President\n\nMaybe I'll start with that, and the others can chime in. I think we do think -- we've talked in the past about the TAM in both online dating, but really in the kind of social connection space as we're defining it as we think about BFF bids, other areas like that. I think that if you look at the bundle app growth rate, we do think that there is a lot of reason to believe that both international expansion and the continued expansion of the market opportunities we'll continue to keep bundle app growing in the future. And then you layer on top of that, both the opportunity we have with some of our other apps like do Fruitz, others that we may incubate over time.\n\nAnd of course, BFF, we do think there's a tremendous amount of runway in online dating and in the connection space. We are not really focusing on what could 2026 look like or at least we're not going to speculate on that, but we do think there's tremendous headroom, both on a secular basis and given the performance that we've had in terms of gaining market share. Whitney?\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nI just want to -- on more Bumble App faces. I think what's really exciting and remarkable -- and you're seeing very early indicators of this complement. You look at the historic nature of how the product works given this powerful brand functionality and core user proposition of a woman making the first move. This is the foundation of our business, and this is so strong and core to our future, but we've never had any really interesting forms of engagement pre-match.\n\nAnd so, when you think about the product unlock in the year ahead and the years ahead, there's exciting opportunities there as well.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nGot it. Thank you.\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. One moment for our next question. And our next question comes from Benjamin Black with Deutsche Bank. Your line is now open.\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nGreat. Thank you for the questions. It'd be great to hear your perspective on how Bumble App KPIs have trended in some of your newer international markets. And how should we be thinking about the timing of new international launches from here? And secondly, Whitney, you spoke a bit about the product road map for Bumble App next year.\n\nCould you just dig a little bit deeper into what we should expect in 2023? And how should sort of the newer product suite sort of impact the model should be drivers of conversion? Or should we have a bigger impact on RP2? Thank you.\n\nTariq Shaukat -- President\n\nSure. I'll start with the international growth piece and then turn it to it for the product piece. I'll focus on Western Europe, happy to talk about some of our other markets, but just to make it specific what we're really seeing as we go into these markets is that we are able to establish the brand. The brand favorability, as Whitney was talking about really lays the foundation for strong organic growth in all of our international markets.\n\nWe actually see that there is really a core of organic growth that we build on top of as opposed to just coming in and laying tons of marketing into a market. We really try and lay that organic foundation. And then the market with our marketing on top of it tends to build into this healthy virtuous cycle. So, if you look at what that means in a market like Germany, as an example, you would see -- you know, to start with a strong and growing brand preference, you would see that leading to strong organic growth.\n\nAnd then you would really see that the ecosystem is continuing to grow. We talk a lot about new registrations, new registrations continue to be very high. You can see this in the third-party data around download share where we are continuing even in the face of a lot of competitive spend to gain download share in that market and, as Whitney said, closing in on the No. 1 position in that market.\n\nYou see it in terms of reengagement rates where if people find a relationship, they go off the app for a little while they come back, they're doing that at a very high rate as well. So, you build that preference, we're seeing it in retention rates. And then monetization and the payer dynamics builds over time because you need that critical mass to make the payment option is worthwhile. So, that's a well-worn path that we have.\n\nYou see this in that DAC region, you see it in France, you see it, as Whit mentioned, emerging in Spain where we just launched in July. And we think that that playbook is one that we can use pretty quickly around different markets. We have a lot of organic -- if you looked at markets that we haven't launched in you would actually see in most of these markets a healthy level of organic demand that's there. That is something we nurture through the localization of the product and through the brand kind of the global brand work that we do.\n\nand it makes it relatively straightforward us to go into a market like Spain and really amplify what's already there. And so, we do have, as we mentioned, plans to complete our Western European launches next year, we've been moving very quickly through our Latin American -- the major markets in Latin America and Southeast Asia. And there's a couple of others that we're taking a very close look at, and we'll come back as we get into, you know, Q1 with more definitive plans on that.\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nSo, now turning to Badoo product strategy. So, we've had an exciting year to date with product launches and innovation. And looking ahead, we feel great about our road map. So, in 2022 to recap, we spent a lot of time advancing our offerings, specifically as it relates to leveraging technologies such as machine learning and AI to deliver product experiences that drive safety and trust and relevance.\n\nSo, as we look to the year ahead, we're really taking a two-pronged approach to product development. I want to underpin that by saying we do not carve out safety and women-first initiatives as a lane or as a car of our strategy, it is the underpinning of everything we do. So, as I talk you through this two-pronged approach, please note that women first safety and time connections is baked into this entire strategy. So, that said, we are going to be focusing on, one, driving engagement and two, increasing monetization.\n\nBoth of these things will just increase the overall health of the ecosystem. So, on engagement, 2023 is all about building products that cater to our user demographics specific wants and needs. Dating is not one size fits all. And we have active and rapid growing user bases in so many different cohorts and segments.\n\nSo, we are prioritizing experiences that are particularly focused on delivering these unique and engaging experiences that really resonate with these cohorts and specificity. So, Gen Z users, for example, socialize and they engage much differently than millennials do. That doesn't mean they don't use our product and don't want to, but there is nuance in how they do it and what the intentions are behind it. Therefore, we're going to be giving them product that really resonates and virality within their group.\n\nWe will continue to innovate for our millennial users as well, of course. There is so huge demand and upside for that segment, and they want things like curated offerings, and we see this opportunity to really continue to engage with that group around those offerings and to further expand those. So, now turning to monetization. We are taking a barbell approach.\n\nSo, when we look at higher tier and longer-duration products for more affluent customers, we can still think about this shorter-duration and lower-care offering and consumables for users. But limited or more limited spending power than that first group. So, for example, compliments is live in New York and New England as we speak. We'll be continuing to roll these out to the rest of the U.S., but with nuances, and of course, the world.\n\nBut with Nuance, for these different groups, college bundles are also live and those have been resonating well. So, those are two examples of how we can kind of target these different groups. So, with engagement and monetization at the front and center of this product road map, we will really just continue to lean into great experiences, premier experiences. We believe that this approach will position us to advance our lead with Gen Z users, which is so important while driving monetization in the year ahead with both categories.\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from Lauren Schenk, your line with Morgan Stanley. Your line is now open.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nOK. Great. Thank you. Maybe just following up on a couple of the earlier questions.\n\nIn the initial '23 outlook, what's sort of the underlying assumption in terms of Bumble App revenue growth for '23? And then just coming back to marketing, as you think about some of your largest competitors sort of increasing their spend and being more present in the marketing backdrop next year? How are you thinking about sort of your marketing spend on a year-over-year basis? Thanks so much.\n\nAnu Subramanian -- Chief Financial Officer\n\nYeah. So, we are not right now going to sort of break out specific numbers for Bumble App. We'll obviously give that when we provide formal guidance. Like I've said, Lauren, I think Bumble App will still be the major driver for growth next year.\n\nSo, that is expected. And again, paying users within Bumble App will be a large function of where the growth comes from. With respect to our spend philosophy, like I said, we do want to -- and we've committed this since we've been public. We are committed to expanding our long-term margins, and you've seen us do that this year.\n\nAnd next year, we want to expand our margins at least by 100 basis points. When as you think about our areas of spend, our philosophy next year, especially given the larger macro environment is going to be around leaning into areas that are critical for the growth of our business. Think about investing areas of product and technology that we really need to beef up on such as whether it's AI, machine learning, data engineering, things like that. So, you will see us continue to invest in specific pockets of the business where we want to lean in.\n\nOn the marketing side, obviously, international growth, like Tariq was just saying, is still a huge pillar and a big driver of revenue for us. So, you will see us spend money there, but we are also taking a very hard look at every area of spend within marketing to make sure that each dollar that we spend is meeting the high thresholds we have for ROI returns, roads, etc., etc. So, this is definitely a line item that we want to see leverage on next year, but it's also a line item where you will see us spend money on, especially in areas that we want to grow and invest in. And largely -- and then finally, we've built up, obviously, our infrastructure since we've gone public.\n\nSo, we feel pretty good about being largely built out. We still have a few pockets where we need to invest in. But as you think about G&A, that's also another area where we are looking to create leverage next year. And the final thing I will say is, obviously, given what's happening in the world, the bar for growing headcount next year and still funding anything within the company is going to be very, very high.\n\nAnd we expect that our growth in headcount will be much lower than what we've seen in the past. I mean, we are still very much focused on investing in the right areas. But again, the bar that we are applying to the company and to ourselves is going to be very, very high. So, again, I look forward to providing more specific information in a few months.\n\nTariq Shaukat -- President\n\nAnd then maybe on the marketing side real quick. I think the -- we have been -- we have a very unique marketing approach that is not something that you see in the industry, typically, a lot of focus on the micro and the brand elements of this, we've seen even in Q3 and Q2, a fairly considerable amount of competitive spend, and we have continued to gain share without just by relying on our historical differentiated marketing product. So, we feel pretty confident we can continue to do that.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCherryl Valenzuela -- Vice President, Investor Relations\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nAnu Subramanian -- Chief Financial Officer\n\nAndrew Marok -- Raymond James -- Analyst\n\nTariq Shaukat -- President\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nCory Carpenter -- JPMorgan Chase and Company -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nMore BMBL analysis\n\nAll earnings call transcripts"
}