{
  "companyName": "MaxCyte, Inc.",
  "companyTicker": "MXCT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/maxcyte-inc-mxct-q2-2022-earnings-call-transcript/",
  "content": "MaxCyte, Inc. (MXCT 1.49%)\nQ2 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by, and welcome to MaxCyte second quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Sean Menarguez, director of investor relations. Please go ahead.\n\nSean Menarguez -- Director of Investor Relations\n\nThank you, Norma, and good afternoon, everyone. My name is Sean Menarguez, and I'm the director of investor relations here at MaxCyte. Thank you all for participating in today's conference call. On the call from MaxCyte, we have Doug Doerfler, president and chief executive officer; and Ron Holtz, interim chief financial officer.\n\nEarlier today, MaxCyte released financial results for the second quarter ended June 30, 2022. A copy of the press release is available on the company's website. Before we begin, I need to read the following statements. Statements or comments made during this call may be forward-looking statements within the meaning of federal securities laws.\n\nAny statements contained in this call that relate to expectations or predictions of future events, results or performance are forward-looking statements. Actual results may differ materially from those expressed or implied in any forward-looking statements due to a variety of factors, which are discussed in detail in our SEC filings. The company undertakes no obligation to publicly update any forward-looking statements, whether because of new information, future events or otherwise. And with that, I will turn the call over to Doug.\n\nDoug Doerfler -- President and Chief Executive Officer\n\nWell, thank you, Sean, and good afternoon, everyone, and thank you for joining MaxCyte's second quarter earnings call. I will begin with a discussion of our business and operational highlights during the quarter, followed by a detailed financial review from Ron, along with an update on our revenue outlook for the year. We will then open the call for questions. I am very pleased with our start to 2022, as our team continues to deliver on the financial and strategic objectives in our plan.\n\nMaxCyte's ExPERT platform and team continue to be the premier cell engineering technology and partner, enabling the development of a growing set of advanced cell-based therapeutics. With additional resources at hand, we continue to invest in our people and capabilities at a measured but healthy rate as we seek to take advantage of the growing markets and support our customers' and partners' growth. Ron will provide more details later in the call but I'd note that we generated very strong second quarter 2022 results, as outlined in the press release this morning. We continue to build traction and saw steady growth in our core business, which was up 45% year over year, led by revenue from cell therapy customers, which increased 61% year over year, while revenue from drug discovery customers increased 4%.\n\nCell therapy revenue growth was driven by significant increases in both instrument and PA sales. We are seeing expansion of our global customer base across all stages of development and are encouraged by our traction with the cell therapy customers in early development stages, which continues to strengthen our robust pre-SPL partnership pipeline. Our partnership pipeline is the strongest it's ever been and spans across a wide array of cell types, approaches and indications. We did not recognize any SPL program-related revenue during the second quarter and we remain excited about the progress our partners have been making as they progress their clinical programs, including into pivotal studies.\n\nWe are also hopeful regarding the potential for some of our partners' therapeutics to reach commercialization over the next 12 to 24 months with others reaching that space thereafter, which we believe will generate meaningful and growing revenue to us. In addition, we continue to sign new strategic platform partners. I do want to note that due to the confidentiality of our partnership agreement, we will not be able to answer any specific questions related to SPL Partners, their clinical progress, or their respective development programs. A few weeks ago, we signed an SPA with LG Chem, Korea's largest chemical company and a globally diversified petrochemical advanced materials and biotechnology company.\n\nWe are excited to partner and support their CAR-T programs for solid tumors. This represents our first SPL with a South Korean company and broadens our reach in Asia. With this most recent agreement, we now have 17 SPL partnerships, covering more than 95 development programs in the aggregate, that's based on the calculations we talked about in January 2022, of which more than 15% have entered the clinic. We remain optimistic regarding the potential to add additional SPL partnerships this year and the comparable economics to prior partnerships.\n\nWe maintain strong relationships with our partners and customers and believe the combination of MaxCyte's ExPERT platform and the support of our team is a core aspect of their therapeutic development strategy. Our partners are well funded and leaders in the cell therapy industry, developing a wide-ranging set of innovative gene editing approaches. Our platform continues to lead the industry in transfection efficiency, cell viability and scalability, which are critical capabilities through the development of cell-based therapeutics. And combined with our unparalleled scientific support is the core of what brings customers to our platform.\n\nA key element of our work this year is the ongoing investment we are making to support our future revenue growth. These investments include expanding our commercial teams, expanding in-house manufacturing, enhancing our applications and process development capabilities and ongoing product development, as well as reinforcing our business infrastructure. All these investments are central to supporting our customers and partner success in driving continued revenue growth. This summer, we are completing our move to new headquarters in a facility nearby in Maryland.\n\nA key part of our headquarters project is the expansion of our instrument and disposables manufacturing capacity from research and clinical scale to now commercial therapeutic scale. Building out in-house manufacturing is expected to increase our manufacturing capacity, build redundant disposable manufacturing capability and enhance our control over supply chain. These developments are critical to supporting our SPL partners as their programs advance. In addition, we continue to see exciting growth in our end markets, particularly in novel cell types and gene editing applications.\n\nOur ongoing investments in our applications and process development labs will keep us at the forefront of these changes, where we play a central role enabling innovation in cell therapy as the field advances. Additionally, the PD lab is building out the platform and processes needed to support the use of the VLx platform in large-scale bioprocessing, including the production of monoclonal antibodies. We also are investing in our sales, marketing and field science applications team to further our ability to capitalize on growing markets. Finally, we are making the necessary investments in our business infrastructure, information systems, quality systems, regulatory, legal, finance and accounting to support the growth of the company.\n\nThese investments will advance our ability to support expanding markets, engage successfully with emerging therapeutic development programs in companies and support our partners as they move toward commercial launch of therapeutic products. We remain confident in the value of these investments to our partners and that they will continue to deliver strong growth. As we make these investments, important to note that we remain well funded with modest cash burn and a strong balance sheet as we move toward profitability. In summary, we had an excellent second quarter, 2022.\n\nWe remain excited about our opportunity going forward, especially in the cell therapy market as we continue to execute on our financial and strategic goals and make the right investments to drive growth across our business. I will now turn the call over to Ron to discuss our financial results. Ron?\n\nRon Holtz -- Interim Chief Financial Officer\n\nThank you, Doug. Hello, everyone. As Doug mentioned, we reported total revenue of $9.6 million in the second quarter, compared to $7.1 million in the prior year's quarter, driven by strong performance in our core business. Core business revenue was $9.6 million in the second quarter of 2022, compared to $6.6 million in 2021.\n\nThis includes revenue from cell therapy customers of $7.7 million, which grew 61% year over year, while revenue from drug discovery customers was $1.9 million, up 4% year over year. The increases were primarily driven by strong instrument and disposable sales growth in cell therapy. We did not recognize any material SPL program-related revenue in the second quarter of 2022, as compared to $0.5 million of program-related revenue in the second quarter of 2021. Moving down the P&L.\n\nGross margin was 88% in the quarter versus 89% in the second quarter of the year prior. Total operating expenses for the second quarter of 2022 were $17.2 million, compared to $10.7 million in the second quarter of 2021. The overall increase in operating expenses was primarily driven by increased staff and field sales science, manufacturing, lab teams that support customers' and partners' growth. The increase also included growth in public company-related stock-based compensation and marketing expenses compared with the same period a year ago.\n\nFurthermore, we have a very healthy balance sheet with combined total cash, cash equivalents and short-term investments of $240.9 million as of the end of the second quarter and no debt. As communicated last quarter, total investments this year in our new headquarters is expected to be approximately $12 million in 2022. Based on the growth year to date and a robust pipeline, we are raising our revenue outlook for 2022. We remain cautiously optimistic about the balance of 2022 and now expect revenue from our core business which includes sales and leases of instruments and sales of disposables to both cell therapy and drug discovery customers to grow approximately 30% compared to 2021 core business revenue.\n\nTurning to our SPL Program economics. As we've discussed previously, the timing of SPL revenues is predicated in our customers' clinical and regulatory progress and, therefore, is fundamentally more difficult to predict than core revenues, which we manage directly. Based on that more limited visibility, we continue to expect 2022 SPL milestone revenue of approximately $4 million. Lastly, we believe that our modest cash burn and debt-free balance sheet will support our future plans for profitable growth.\n\nWe expect to end this year with approximately $220 million in cash, cash equivalents and short-term investments. Now I'll turn it back over to Doug.\n\nDoug Doerfler -- President and Chief Executive Officer\n\nWell, thank you, Ron. So in summary, we remain optimistic about the opportunity to lead the industry forward as the premier cell engineering platform technology, supporting the development of advanced cell-based therapeutics for patients who may not otherwise have treatment options. We are very pleased to report strong second quarter results and raise our full year revenue outlook. We're excited about the opportunities ahead.\n\nAnd as always, we want to take this opportunity to thank our team, the board, suppliers, investors, partners and the amazing industry that we have the honor of serving. Thank you and I'm open for any questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Max Masucci with Cowen. Your line is open.\n\nMax Masucci -- Cowen and Company -- Analyst\n\nHi. Thanks for taking the questions. First one related to the core cell therapy business, another strong beat in the segment. It would be great to understand how much of that strong growth in the core cell therapy business, both on the instrument placements and processing assembly side of things, how much of that growth is being driven by SPL partners versus customers that you haven't signed SPL agreements with?\n\nDoug Doerfler -- President and Chief Executive Officer\n\nRon, do you want to take that one? Thanks, Max.\n\nRon Holtz -- Interim Chief Financial Officer\n\nYeah, sure. So the SPL customers on the cell therapy side tend to be the larger customers. And so more of the growth comes from them than from smaller customers and new customers where they're typically buying one instrument or have a single instrument on lease. So it's -- I don't have the proportion in my head but it's certainly the larger proportion is coming from SPL customers.\n\nMax Masucci -- Cowen and Company -- Analyst\n\nOK. Great. And then second one, could you -- is there a way for us to better understand maybe even qualitatively, just how licensing fees have evolved as a contributor to revenues and growth, maybe compared to the time of the NASDAQ IPO or in recent quarters?\n\nRon Holtz -- Interim Chief Financial Officer\n\nYeah. So I don't think that there's been a lot of movement in the proportion. So the mix is kind of recurring revenue, so you have instruments that are licensed and those are -- those grow. And because they're recurring, as long as the instruments are in place, that gives us a strong base for growth.\n\nProcess and assemblies tend to be repeating and also a consistent proportion of revenues. And I don't -- I was looking at it today. I don't think there's been much in the way of the shift in the past, even few years, really.\n\nMax Masucci -- Cowen and Company -- Analyst\n\nOK. Got it. Maybe final one. Several MaxCyte engineered therapies in various phases of clinical development, all with aspirations of regulatory approval and launch.\n\nI think for us, at biomanufacturing conferences, there seems to be an emphasis on companies preparing for commercialization, logistics and scale up a bit earlier than, say, a few years ago. So just a broad question. Is that what you're seeing on your end? And if so, is there anything that you need to do at MaxCyte to sort of prepare yourself operationally for that next wave that will be coming over the next, call it, three to four years?\n\nDoug Doerfler -- President and Chief Executive Officer\n\nHey, Ron, let me take that. It's a great question. Precisely what we've been investing in the last year or so. We talked about moving into our new facility that basis for that move is to substantially expand our manufacturing operation and to become more basic in the manufacturing of processing assemblies.\n\nSo we want to build up a lot of capability. We also -- you also will see some increase in inventory and that's a result of us, again, becoming more basic building in our supply chain so that we can support our customers as they move from late stage clinical development into that launch phase. And as you can imagine, there's a lot of speculation on what those numbers could look like but we want to make sure that we're in a position that we can support our commercial customers at any level that they need. And so we're spending a lot of time thinking about that.\n\nWe're also investing in regulatory field support because these companies are typically thinking about global launches or at least EU, U.K. and U.S. launches and also building out our operating group as it relates to quality group and making sure we have all the processes built redundant to support audits by our customers. So there's a lot of work going on.\n\nI think it's fair to say at MaxCyte, that's our No. 1 priority right now is preparing for our partners' launches.\n\nMax Masucci -- Cowen and Company -- Analyst\n\nGreat. Well, appreciate all the detail, and congrats on another great quarter.\n\nDoug Doerfler -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. And our next question comes from Julie Simmonds with Panmure. Your line is open.\n\nJulie Simmonds -- Panmure Gordon -- Analyst\n\nThank you. Hi. Excellent quarter, guys. Well done.\n\nJust looking at the split between cell therapy and the drug discovery side of things, cell therapy obviously going amazingly well. Drug discovery is slightly lower in terms of the growth. Is there anything particular behind that? Is just that due to sort of an internal refocusing or where the sales team are focused because I know they do both now? Or is there something else going on underlying in the market we should be thinking about?\n\nDoug Doerfler -- President and Chief Executive Officer\n\nWell, hi, Julie. And thanks for staying up late in London. I know it's late there. This -- the drug discovery market for us is smaller in revenue compared to the cell therapy market.\n\nSo naturally, you're going to see some lumpiness in the growth rates from quarter to quarter. That being said, we posted double-digit growth.\n\nRon Holtz -- Interim Chief Financial Officer\n\nDid we lose Doug?\n\nOperator\n\nLadies and gentlemen, please stand by. Again, ladies and gentlemen, we're experiencing technical difficulties. Please stand by. And thank you, Doug.\n\nYou may resume.\n\nDoug Doerfler -- President and Chief Executive Officer\n\nHi. Sorry. I'm not sure where I cut off here, but my Internet completely went down. I'm sorry, Julie.\n\nI'm trying to -- OK. Sorry about that. So the drug discovery business is a smaller business than cell therapy just from a revenue perspective. And so I think you're going to see some -- we're experiencing some lumpiness from quarter to quarter.\n\nThat said, if you look at the first half of 2022, I think the growth rate was around 13% or maybe 15% which is a bit higher than it until that point. I think our growth rate is in the mid-single digits. So I think you're seeing an increase in the -- we released the VLx in the drug discovery area. So we're pretty -- we're quite excited about that launch, which will happen from --\n\nJulie Simmonds -- Panmure Gordon -- Analyst\n\nYou just disappeared again. And when was the VLx launch, the full launch expected? Because that was going to be my next question.\n\nRon Holtz -- Interim Chief Financial Officer\n\nJulie, formal launch of the VLx will be sometime this year. So it's placed into the market at the beginning of this year and we're going to put it out formally at the appropriate conference and that's something that's in our planning. We just haven't announced the date.\n\nDoug Doerfler -- President and Chief Executive Officer\n\nYeah. I'm sorry. I'm just trying to move between two different computers. I'm sorry about this.\n\nJulie Simmonds -- Panmure Gordon -- Analyst\n\nAnd I suppose just one final question. Just as far as cost is concerned. Clearly, they're continuing to ramp, which is what we'd expect given what we're doing at the moment. Are you expecting by the fourth quarter of this year, you'll sort of reach a more sort of, I suppose, stable and gently growing run rate than the step-up we're seeing at the minutes? I mean, do you think by that point, you will be at the sort of closer to the level of sort of ongoing costs at that point?\n\nRon Holtz -- Interim Chief Financial Officer\n\nJulie, I missed a piece of that. Were you asking about the operating growth step up in the second quarter?\n\nJulie Simmonds -- Panmure Gordon -- Analyst\n\nYeah.\n\nRon Holtz -- Interim Chief Financial Officer\n\nYeah. OK. So that makes sense. So it's actually sort of an ordinary pattern for us to have a bigger step-up quarter on quarter in operating expenses when we get to the second quarter as people are starting the hiring process early in the year, which takes a little while to get going and then putting the people in place, which is most of the expense growth, as they go into the second quarter.\n\nAnd those expense growth rates tend to moderate in the second half of the year. So we won't see the kind of step-up we saw from Q1 to Q2. And will be -- I'm not completely flat but quite a bit flatter than what we saw in the first half of the year. And this has been a big investment year for us, as Doug talked about in the initial comments.\n\nAnd we would expect that as we go through future years that that expense growth year over year would moderate from the big step-up that we took here as we did a lot of important investments as Doug talked about, in-house manufacturing and the new facility and expanding the team on a broader basis.\n\nJulie Simmonds -- Panmure Gordon -- Analyst\n\nBrilliant. Thank you very much.\n\nDoug Doerfler -- President and Chief Executive Officer\n\nThanks, Julie.\n\nOperator\n\nThank you. And our next question comes from Dan Arias with Stifel. Your line is now open.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nAfternoon, guys. Thanks for the question. Doug or Ron, maybe to Ron's point on the growth skew toward the SPL programs. When we were talking last year, you noted that the average number of platforms per strategic partner was, I believe, three or four.\n\nSo assuming that there are one or two in the mix and that would also mean that there maybe are some like five or six. So the question is, one, is that sort of the installed base range within the SPL subset? And then I'm just curious if there is a pull-through difference per instrument within that subset that kind of speaks to sort of the consumables runway per unit that you might expect as these partners progress? Or does the pull-through per unit basically stay the same, they just have more unit?\n\nDoug Doerfler -- President and Chief Executive Officer\n\nYeah. Let me take a crack at that. Ron, you can follow up. Thanks for the question.\n\nIt's something we're trying to think through with our partners right now. I don't think there's enough end to actually have a meaningful expectation of how many placements these customers are going to need, these partners. A lot has to do with the indication they're pursuing, their manufacturing strategy, their launch strategy in which countries, their regulatory strategy. So all that has to be built in, each of these as an individual almost snowflake.\n\nSo I really can't -- we don't know where we are with some of these customers in terms of -- are we just beginning to see a surge in placements? Or is this kind of steady state? So we're watching that very closely. That said, we're prepared for a surge, if that's the case. So -- and what we're also seeing is pull through and I think it's -- we had suspected that some of the pull-through would go down as partners move further into the clinic. But I think what we're seeing is that a number of these partners are actually doing quite a bit of nonclinical work in parallel to the clinical work.\n\nSo we're really not seeing a reduction in pull-through when they move late-stage clinical, they're actually increasing that because they're doing additional research work to substantiate their CMC and their controls. Hopefully, that's helpful.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nYeah, it is. But Doug, can I just -- just for clarification, is that total pull-through as they accumulate more instruments or pull-through per instrument, such that as we think about these customers moving forward, their utilization of one instrument is higher and so therefore, maybe more revenue generating.\n\nDoug Doerfler -- President and Chief Executive Officer\n\nYeah. Dan, I understand the question. I don't think we have enough data yet to suggest -- that's the point -- yeah.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nI gotcha. OK. Maybe just a follow --\n\nDoug Doerfler -- President and Chief Executive Officer\n\nRon, did you want to comment?\n\nRon Holtz -- Interim Chief Financial Officer\n\nDan, yeah, I just wanted to add one other thing, Dan, that one of the things that also drives the number of instruments per SPL partner is the number of programs that run through the clinic. I mean I think their revenues pull forward, as Doug talked about, is hard to summarize. But you tend to see a balance between the revenues of -- coming from the instruments and the revenues coming from miles -- from processing assemblies; they tend to grow together. But if you're thinking about the number of instruments, it varies a lot for program but the number of programs drives that, how many instruments you might see per customer.\n\nSo a customer within program is a small number of instruments and a customer that has two programs or three or then four, then five in the clinic that in the clinical stage, is really driving their instrument counts.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nYup. Definitely makes sense. And maybe relatedly, just as a follow-up, Doug, obviously, a lot going on in biopharma and cell therapy specifically. One of the assumptions that has underpinned your long-term model is that you would average three new SPLs per year.\n\nIs that an assumption that you're more or less still comfortable with when you look out, say, at the next like three to five years?\n\nDoug Doerfler -- President and Chief Executive Officer\n\nYeah, we are very comfortable. I mean, I think we've done two already this year. So we're very comfortable with that expectation. And we're building an organization around that.\n\nOK. Super. Thank you, guys.\n\nThanks, Dan.\n\nOperator\n\nThank you. And our next question comes from Matt Larew with William Blair. Your line is now open.\n\nMatt Larew -- William Blair -- Analyst\n\nHi. This is Matt on for Matt. Thanks for taking our questions. I just wanted to start off with a high-level question around funding.\n\nObviously, there's been a lot of attention paid to the slowdown we've seen year to date in biotech funding. Just wanted to get your thoughts and see if you've seen any sort of impact from the slowdown in biotech funding observed year to date. Doug, I think maybe in the past, you mentioned a little bit of pipeline rationalization, expected at some point in the future. But I'm just wondering how things have trended so far since the end of the quarter and whether or not you're seeing a slowdown in activity so far here in the back half of the year?\n\nDoug Doerfler -- President and Chief Executive Officer\n\nYeah. It's obviously something we're paying a lot of attention to and thinking through and communicating not only with our partners but with other capital sources to make sure that we see this on a longer-term basis. That said, we're really not seeing a pullback in the cell therapy side of the business, evidenced by our second quarter and first half gross numbers. And I think we mentioned before that in [Inaudible] on their leader No.\n\n2 asset and that's -- they're going to tighten their belt. They're not going to do it in later stages of element. They're going to probably do it in the front end and the research side. So we're really not seeing that as an impact to us.\n\nBut we're watching it. We're also seeing quite a bit of kind of new capital formation, new companies that are being launched with more complex cellular therapies as their base asset, which really portends well for MaxCyte that's what we -- that's in our wheelhouse in terms of doing these more complex cell therapies.\n\nMatt Larew -- William Blair -- Analyst\n\nGot it. That's very helpful. Thanks, Doug. For my second one, I wanted to follow up on Julie's first question around the outlook for the different segments.\n\nSo you're guiding to 30% growth now for the base business for the year. Just wondering if you can provide any detail around how to think about growth in the back half of the year for each segment. Apologies if I missed this earlier when you're cutting out a little bit. But -- and then moving forward, in terms of 2023, I mean, you pointed to 25% growth in the base business long term.\n\nJust trying to get your initial thoughts on whether or not you think that's a reasonable bar for next year and your thoughts on how to think about the growth rates for each segment beyond 2022?\n\nDoug Doerfler -- President and Chief Executive Officer\n\nRon, do you want to take that first and I'll jump in?\n\nRon Holtz -- Interim Chief Financial Officer\n\nYeah. So as Doug said, if we dial back a little bit from a single quarter, drug discovery, we think is growing nicely. It's been growing double digits in the first half of this year. That's an increase from where we were in COVID, which hit pretty drug discovery pretty hard.\n\nAnd I think that kind of expectation below the consistent grower capable of doing double digits, that's reasonable. And -- we don't see much change in the trajectory on cell therapy, either, maybe quarter -- in a particular quarter, it will be lumpy in some way but consistent with what you've seen in the past to deliver the kind of growth that we've been doing in the past generally 18 months.\n\nMatt Larew -- William Blair -- Analyst\n\nOK. Got it. On VLx, just a quick one. So you talked about rapid production monoclonal antibodies being a broad, TAM expansion opportunity for you.\n\nBut how realistic should we think of this being -- given it would require the FDA to waive its requirement for MaxCyte to be produced from the master cell line. Are there any other applications that you're thinking about in the near term that can lead to some VLx revenue here, either in the back half of the year or in 2022?\n\nDoug Doerfler -- President and Chief Executive Officer\n\nYeah. So the uptake -- the eventual large opportunity in monoclonal production would be when FDA clears the use of transit materials, right? And I think that's the big opportunity. But there's also a significant opportunity before that and that is larger volumes of monoclonal antibodies to do later-stage preclinical work. Many of that work is being done with stable cell line produced material, which can take anywhere from months to years to produce.\n\nSo we're going to see some uptake. Can't really talk too much about the use case that will happen when we launch the product and we mentioned we'll launch it in the second half of this year. So the other applications are behind it would be the production of allogeneic cell lines, which I think is going to be a large opportunity but that's going to come much more -- a bit longer, longer term. Near term would be the production of viral vectors in suspension cells versus the current process of manufacturing them on adherent cells.\n\nSo that would be -- the next major area will be putting applications, information into the marketplace to produce those products.\n\nMatt Larew -- William Blair -- Analyst\n\nAll right. Got it. Thank you.\n\nDoug Doerfler -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. And our next question comes from Jacob Johnson with Stephens. Your line is now open.\n\nUnknown speaker\n\nHey, it's Hanna on for Jacob. Good afternoon. A couple of questions. You just signed your first SPL in APAC with LG and it seems like you've had traction in this area.\n\nAre there any updated thoughts on traction internationally, especially as it relates to APAC?\n\nDoug Doerfler -- President and Chief Executive Officer\n\nYeah. So that announcement was just right after we closed the second quarter. LG Chem is a pretty large biotech group. They go a little over $0.5 billion invested in biotech now.\n\nWe've had a standing group of relationships in Korea as we do in Japan and in China. The challenge for us is really around the licensing model and does that work in those environments. We've been cautious about entering in a big way the China market for a lot of different reasons. But we are beginning to make more investments to secure licensed deals in that market.\n\nSo it's part of our strategy for the next couple of years. Again, there's a huge opportunity, we think, in that marketplace but I think we have to be really thoughtful about how we enter it, how we protect our franchise and how to ensure we work with the right partners that can provide us kind of the long-term value that we're seeing with our existing 17 partners.\n\nUnknown speaker\n\nThanks. And one follow-up. As we think about the cell and gene therapy pipeline. At a high level, it seems like interest in gene editing and allogeneic therapies continues to grow.\n\nAs you think about your customer conversations now versus a year or two ago, are you seeing more opportunities at the macro level?\n\nDoug Doerfler -- President and Chief Executive Officer\n\nYeah, absolutely. We started talking about this when we went public about a year ago, about the burgeoning, if you will, increase in allogeneic cell therapies. And that's really -- that really has come to fruition. And now companies are moving away from autologous when they can because the opportunities we think are larger and allogeneic.\n\nWhen you move into allogeneic, nonviral becomes a very important part of that engineering strategy and also multiple edits, which really falls into MaxCyte sweet spot. So one of our key -- one of our key themes when we went public about a year ago was the increase in the attention in allogeneic cell therapies. And I think we're extraordinarily well-positioned in that space and that's turning out to be an area of increasing interest by companies and increasing interest by investors. So we're quite excited about some of the new programs we're seeing coming out of that -- in that area.\n\nUnknown speaker\n\nThanks. I'll leave it there.\n\nDoug Doerfler -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] And at this time, I'm currently showing no further questions. I would now like to hand the conference back over to Mr. Doerfler for any closing remarks.\n\nDoug Doerfler -- President and Chief Executive Officer\n\nWell, thank you very much and thank you all for your participation today and your engagement and certainly these questions. And we look forward to speaking to many of you in the near term. And again, thank you for your support and look forward to again updating the market in the third quarter but we will also be taking individual meetings in the next couple of weeks with investors and analysts. So thank you very much.\n\nAppreciate it.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSean Menarguez -- Director of Investor Relations\n\nDoug Doerfler -- President and Chief Executive Officer\n\nRon Holtz -- Interim Chief Financial Officer\n\nMax Masucci -- Cowen and Company -- Analyst\n\nJulie Simmonds -- Panmure Gordon -- Analyst\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nMatt Larew -- William Blair -- Analyst\n\nUnknown speaker\n\nMore MXCT analysis\n\nAll earnings call transcripts"
}