{
  "companyName": "GoodRx Holdings, Inc.",
  "companyTicker": "GDRX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/goodrx-holdings-inc-gdrx-q3-2022-earnings-call-tra/",
  "content": "GoodRx Holdings, Inc. (GDRX -1.48%)\nQ3 2022 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, and thank you for standing by. Welcome to the GoodRx third quarter 2022 earnings call. As a reminder, today's conference call is being recorded.I will now like to introduce your host for today's call, Whitney Notaro, vice president of investor relations. Please go ahead.\n\nWhitney Notaro -- Vice President, Investor Relations\n\nThank you, operator. Good afternoon, everyone, and welcome to GoodRx's earnings conference call for the third quarter of 2022. Joining me today are Doug Hirsch and Trevor Bezdek, our co-founders and co-chief executive officers; and Karsten Voermann, our chief financial officer. Before we begin, I'd like to remind everyone that this call will contain forward-looking statements.\n\nAll statements made on this call that do not relate to matters of historical fact should be considered forward-looking statements, including statements regarding management's plans, strategies, goals, and objectives, our market opportunity, our anticipated financial performance, the impact of the grocer issue on our business and the impact of macroeconomic conditions on our future results of operation. These statements are neither promises nor guarantees but involve known and unknown risks, uncertainties, and other important factors. These factors may cause our actual results, performance, or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Factors discussed in the Risk Factors section of our annual report on Form 10-K for the year ended December 31, 2021, as updated by our quarterly report on Form 10-Q for the quarter ended June 30, 2022, and our other filings with the Securities and Exchange Commission could cause actual results to differ materially from those indicated by the forward-looking statements made on this call. Any such forward-looking statements represent management's estimates as of the date of this call, and we disclaim any obligation to update these statements, even if subsequent events cause our views to change.\n\nIn addition, we may also reference certain non-GAAP metrics, which are reconciled to the nearest GAAP metric in the company's earnings press release and accompanying slides, which can be found on the overview page of our Investor Relations website at investors.goodrx.com. I'd also like to remind everyone that a replay of this call will become available there shortly as well.With that, I'll turn it over to Doug.\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nThank you, Whitney. Good afternoon, everyone, and thank you for joining us. Today, we will be sharing our perspective on our recent performance, but I want to start off by discussing two of our most important priorities, which go hand in hand to help Americans get the healthcare they need at a price they can afford, and as we deliver on that mission to create value for our shareholders. During the last quarter, we made significant progress on both of these priorities.\n\nWe furthered our mission by engaging even more deeply with all of our constituents and in particular with consumers and providers. We continue to stabilize and further grow our retail network, worked with retailers and pharmacy benefit managers on finding more ways to offer even better consumer prices, expanded our content offerings, and enhanced our provider-focused offerings to make it even easier for providers to be great advocates for GoodRx. Providers have brought millions of consumers to the GoodRx platform over the last decade, and we look forward to their future contributions in connection with the continued build-out of our provider-focused offerings. I will talk more about this shortly, but I wanted to first touch on the progress we've made toward driving value for shareholders.\n\nDuring the quarter, we significantly exceeded our own 3Q margin expectations with approximately 28% adjusted EBITDA margin. We drove better-than-expected growth, reaching $187.3 million in revenue in the quarter, and continued our high cash conversion with $33.7 million in cash flow provided by operating activities. Most importantly, we enhanced the stability of and expanded our ecosystem of PBMs, retailers, healthcare providers, and pharma manufacturers, all of which helped us deliver our third-quarter results. Trevor will talk more about driving shareholder value shortly. Going forward, we are focused on driving adjusted EBITDA and cash conversion, which we have significant control over, while also delivering continued efficient growth and will continue to take action and drive shareholder value, strong margins, and our mission.\n\nI'll now dive into some of the actions we've taken recently that align with our culture as a mission-driven organization. We further our mission by helping consumers in strengthening our business. One example is GoodRx Health, which we launched in September 2021. During the third quarter, GoodRx Health experienced strong year-over-year traffic growth at approximately 25%.\n\nAdditionally, as we discussed in our second-quarter earnings call, we are in the early stages of increasing our consumer engagement efforts, which we will continue to focus on in Q4 and into 2023. We anticipate seeing meaningful benefits as a result of deeper relationships with our consumers and these ongoing efforts will allow us to help consumers better navigate their healthcare journey with an even more compelling GoodRx value proposition and user experience. Allowing consumers to provide us with more information through registration increases, the LTV of each user in prescription transactions and other areas of the business over time as we leverage data to create new tools and products in quarters and years to come. Examples of LTV enhancing consumer outreach include communications around price improvements for chronic prescriptions and reminders to engage with their provider for prescription refills.\n\nOur consumer engagement efforts are looking promising with significant differentials in LTV and repeat claim usage for engaged consumers versus baseline consumers. We serve 7.3 million consumers across our prescription transactions and subscriptions offerings in the third quarter. Given each subscription plan has, on average, approximately 1.5 members. We see our engagement efforts opening the door to providing an array of services, extending from subscribers to incremental services for engaged consumers, and finally, our more transactional savings offerings.\n\nImportantly, higher engagement enhances our ability to influence consumer behavior, giving us more leverage and opportunities across our ecosystem of retailers, PBMs, and manufacturers. An example of just one of the expected benefits is our increasing ability to direct users to the retailer that best fits their needs, especially as their needs and prescription pricing change over time. In addition to these new ways to help consumers, we are also furthering our mission by helping healthcare providers through our recent launch of provider mode last month. Over the last decade, GoodRx has been embraced by healthcare providers who see firsthand the consequences their patients face when they choose not to fill prescriptions or to get care because it simply costs too much.\n\nIn the last 16 months, over 865,000 prescribers have used GoodRx to look up medication prices, prescription discounts, and trusted health information on behalf of patients, mindful of the pivotal role these healthcare providers play in helping patients overcome access and affordability challenges. We wanted to develop a product that would arm providers with the tools they need to better help their patients at the point of prescribing. Provider mode offers a redesigned prescription savings flow and a faster, more customized experience to help providers find the information they need in the moment so they can spend more time focusing on patient care. At launch, we expanded access to all HCPs, including nurses, medical assistants, and front office staff as examples.\n\nThis allows us to penetrate more of the approximately $30 billion pharma manufacturer solutions TAM since data shows that of $30 billion, $20 billion is spent targeting HCPs and $10 billion to target consumers, it complements our growth strategy by addressing brand name prescriptions through awareness, access, and adherence but more medication in the hands of consumers more affordably. In addition, the broader GoodRx providers offering has seen almost 90% often rate since it started rolling out last December, putting it on the path to becoming one of the largest provider platforms in the U.S. This recent launch is a remarkable achievement by our team, and I can't thank them enough for their hard work and the progress we have seen in the short time since provider mode went live. Early feedback we've received from our partners has also been extremely positive.\n\nProvider mode gives us a unique opportunity to develop strategic integrations with pharma manufacturers that designed specifically for providers. For example, we recently announced a collaboration with Biogen to make it easier for HCPs who have decided to start patients on Vumerity to enroll patients with relapsing forms of multiple sclerosis in the specialty hub. We anticipate that in the coming months, we will plan to make provider mode accessible to users of a top EHR and adding more clinical drug information onto the price pages. We're very excited about where this new platform is heading, and we look forward to providing you with updates on how it is furthering our mission and driving revenue in the quarters to come.\n\nThe actions we're taking reinforce our ongoing commitment to a world-class mission-aligned team that helps millions of Americans improve their health outcomes, and as a result, also increases the LTV of our consumer and provider relationships going forward. I will now turn the call over to Trevor for more details on how we're driving shareholder value.\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you, Doug, and good afternoon, everyone. Before getting into our third quarter results, I'm going to talk about the increasing strength of our retail, PBM, and pharma manufacturer relationships, as well as the health of our broader ecosystem. One of the main areas of investor interest on our second-quarter earnings call was our retail network, so I'll begin there. Importantly, as we discussed during that earnings call in August, we've addressed the grocer issue and GoodRx discounts have since been welcomed at the grocer pharmacy's point of sale.\n\nWith the exception of this particular grocer, volume across other pharmacies increased approximately 8% year over year and approximately 5% quarter over quarter. We continue to deepen our relationships with existing retailers and bring on new retailers. Historically, PBMs have contractual agreements with pharmacies and our business model has been tied to contractual agreements with PBMs and their relationships with pharmacies. Today, our approach involves selective direct contracting with pharmacies to complement the continued existing contractual agreements with our PBM customers.\n\nWe believe our hybrid approach ensures stronger lines of communication and stronger relationships with our retailers. The elements of our business model and growth strategy are all interdependent. We strongly believe that our success of acquiring new consumers even more efficiently and knowing our consumers better. Through the initiatives Doug discussed will strengthen and provide us more control over our retail relationships.\n\nThese more direct relationships have provided key insights into the unique challenges presented by the current macro environment and enable us to proactively collaborate on solutions to drive our mutual success and profitability. We're helping retailers drive their strategic initiatives and improve their unit economics while maintaining the strength of our own economics. With regard to strengthening our network, I'm happy to share the extension of our Gold retail network with the addition of Giant Eagle. You may recall a 2021 survey we conducted of over 4,000 GoodRx and GoodRx Gold users that found that 85% of consumers surveyed agreed that their positive experience with GoodRx at their preferred pharmacy makes them want to return to that pharmacy more often.\n\nThe survey also found that almost 80% of consumers reported that they purchase nonprescription items such as general merchandiser groceries when picking up a prescription, spending an additional $40 or more on average at the pharmacy counter. These are just some examples of how GoodRx adds value to pharmacies across our retail network. In addition to our strong retail relationships, we continue to have robust and strong partnerships with our network of PBMs and we never have had a PBM terminate its relationship with GoodRx. This is the result of the volume and value we efficiently drive for our PBM partners. Additionally, we are leveraging our PBM relationships to drive prescription transactions revenue and efficient user acquisition in new ways.\n\nAn example, we are especially excited about is a new collaboration with Express Scripts to support them in their mission to make prescription medicines more affordable for their members. Under this innovative program, eligible Express group members will automatically access GoodRx prices as part of their pharmacy benefit. This means an eligible Express Scripts member will have seamless access to GoodRx prices for eligible generic medication in instances where that price is lower than their benefit price. Importantly, this keeps visibility of the eligible members GoodRx claims within the pharmacy benefit, and it enables out-of-pocket claims account order members deductible.\n\nWe were delighted to be selected as Express Scripts' exclusive partner for this important new program. We believe this innovative collaboration is a strong validation of our leadership in the prescription discount space, the strength of our brand, and the deep trust consumers have in our technology powered by last year's acquisition of RxNXT. Next, this collaboration creates a new distribution channel that we believe expands our market opportunity and represents a way to efficiently gain many incremental users. This new offering is anticipated to become available to Express Scripts' commercial clients in early 2023.\n\nToday, we have the most expansive network of PBM relationships in our space, accepted that most pharmacies in the U.S. and prescription prices on the top 30 drugs in the U.S. that beat other cash discount offerings more than 87% of the time based on our analysis. We continue to work with more pharma manufacturers, offer more solutions and deliver superior ROIs to those with which we work.\n\nOur compelling suite of solutions creates a highly effective way for pharma manufacturers to reach patients and providers, leveraging our millions of monthly visitors made up of both consumers and healthcare providers, as well as the approximately 20% of searches on our platform that are four brand drugs. In fact, our analysis shows that among the top 100 branded medications, the traffic, the drug savings page to these brands on GoodRx is a multiple of the traffic to the same brands own drug saving pages because of our users are so high intent and often at the bottom of the funnel with a prescription in hand. The TAM in this market is huge, $30 billion with increasing spend shifting to digital and we have not even penetrated 1% yet giving us massive runway. It is important to remember that branded medications present consumers and HCPs with a unique set of challenges when compared to generic medication, as they tend to be more expensive and insurance coverage is often complicated and restrictive.\n\nPharma manufacturers want to provide affordable options, but even with the approximately $30 billion they spend annually to reach consumers directly or through providers, they struggled to gain awareness and improve access and adherence. With our pharma manufacturer solutions offerings, we are able to partner and innovate with drug manufacturers to help address these challenges and encourage use of their life-saving products and services, increasing LTV and attractive ROI in part through our ability to target so effectively by driving awareness, access, and adherence, we also help healthcare providers who use GoodRx and their patients to achieve better outcomes. That said, the industry has started to face some moderation in spending, which may impact our near-term results for this offering. While we continue to experience solid growth with our customers, we'll continue to monitor the landscape and be proactive with our growth strategy.\n\nOther strategic initiatives continue to perform well. On the acquisition front, the integration of vitaCare's innovative pharmacy service platform is going well. vitaCare gives us valuable capabilities to facilitate the brand medication prescription process from start to finish and yet another innovative product and enhances our pharma-focused capabilities. We believe vitaCare increases our strength and differentiation, particularly as it relates to the access and adherence elements of this patient journey, which continue to be a key focus for manufacturers to drive medication volume and revenue.\n\nWe work with pharma manufacturers to help patients and providers through the most complex part of their journey to therapy. An example is our recent announcement of an exciting collaboration with Biogen, which aims to improve the patient HCP experience when initiating a new specialty therapy. HCPs who have decided to start patients on Vumerity can now utilize provider mode to send enrollment information directly to the specialty hub, which helps patients and providers navigate patient access to therapy. On our second-quarter earnings call, Doug, Karsten, and I talked about our focus on adjusted EBITDA, which we can control, and I also talked about taking a hard look at all of our costs and expenses and reprioritizing where and how much we spend across the business and all of our offerings.\n\nThat is exactly what we have done. Following a careful review of our business structure, we implemented an organizational realignment to operate more effectively and efficiently. The resulting reduction in force we announced in August was part of our initiatives to rebalance our investments and cost structure into prioritize areas that we believe will drive efficient growth and margin expansion. We are focused on optimizing current cash flow generation from our established business platforms, while efficiently planting seeds for growth in new areas to expand faster into our addressable markets by strengthening our customer value proposition.\n\nOur third quarter results begin to reflect the benefits of these actions. Total revenue for this quarter was $187.3 million, which exceeded our expectation of approximately $185 million. Adjusted EBITDA was $52 million and adjusted EBITDA margin was approximately 28%, which was approximately $15 million more than the implied adjusted EBITDA dollars on our expected 20% margin. We also continue to serve millions of consumers across our prescription transactions and subscriptions offerings, which totaled $7.3 million at the end of the third quarter. The outperformance in adjusted EBITDA was driven in part by the one-time reduction in force we completed last quarter and partly by focusing on marketing efficiency ahead of the marketing investments we plan to make around year-end when many consumers change health plans and begin new plan years with fresh deductibles.\n\nThe advertising proportion of sales and marketing dropped by five percentage points from 64% to 59% between the second and third quarter of 2022, even as our math count remained relatively consistent at $5.8 million and despite the continued impact of the grocer issue. Relative to the second quarter of 2022, advertising fell by a full 16% to $50.9 million while prescription transactions revenue decreased from $134.4 million to $131.2 million. The amount of prescription transactions revenue associated with the grocer decreased from $12.4 million to $4.3 million during this period and is still well under the $33.7 million from third quarter 2021, as well as the $37.7 million we earned in connection with the grocer in the first quarter of 2022. Our cash flow provided by operating activities was $33.7 million, representing approximately 18% of revenue and we have been consistently strong on this metric.\n\nOur team is highly focused on consistently and efficiently growing adjusted EBITDA quarter over quarter going forward by reprioritizing investments only where they're needed to drive highly profitable growth while delivering to consumers what they have come to expect from GoodRx.With that, I'll turn it over to Karsten to discuss our financial results and guidance.\n\nKarsten Voermann -- Chief Financial Officer\n\nThank you, Trevor. Total revenue for the quarter decreased 4% year over year to $187.3 million, which exceeded our quarterly guidance of $185 million. Prescription transactions revenue decreased 16% year over year, which also came in above our expectations as ongoing business reviews with retailers have been positive and the dialogue continues and how we can further drive revenue. Importantly, with the exception of the particular grocer volume across other pharmacies increased 8% year over year and 5% quarter over quarter.\n\nMAC declined 9% year over year to $5.8 million, while PTR per MAC decreased approximately 70% year over year and 2% quarter over quarter. The PTR decrease was driven by the decrease in MAC and an ongoing shift in volume of prescription transactions to other retailers that impacted pricing as a result of the grocer impact and consumer engagement efforts that we previously discussed.We also experienced positive week-over-week growth at the grocer in the quarter, which was the first time since the end of the first quarter we saw positive week-over-week growth. We continue to be focused on user growth, pricing, and consumer engagement. On the engagement front, the impact in the third quarter on conversion was less than we expected.\n\nAs Doug and Trevor touched on, we'll continue to roll out our engagement efforts in the fourth quarter and beyond. Turning to subscriptions. Subscription revenue remains strong, increasing 63% year over year, slightly exceeding our expectations. We ended the quarter with 1.1 million subscription plans, which was down 6% year over year primarily due to the expected churn resulting from our fee increase in the first half of 2022 and an expected sequential decline in our subscription plans for Kroger Savings as a result of reduced marketing spend.\n\nWhen taking family subscriptions into account, 1.5 million total members benefited from our subscriptions offering during the quarter. The benefit from our Gold subscription fee increase is offsetting the decline in memberships and we saw a meaningful improvement in September churn, but we do anticipate some continued churn and decreases in subscriber count in the fourth quarter. As Trevor said, we're proud to have served 7.3 million consumers in the third quarter across our prescription transactions and subscriptions offerings. Our Pharma Manufacturer Solutions revenue increased 32% year over year, less than we anticipated the industry started to see a degree of expense control in the quarter, which we expect to be temporary in nature.\n\nWe continue working with more pharma manufacturers offering more solutions and are delivering superior ROIs to those of which we work. This is the second quarter of contribution related to vitaCare, which contributed approximately $2 million of revenue, and we are pleased with how the integration is progressing. We're also pleased that in the first nine months of 2022, Pharma Manufacturer Solutions revenue increased 81% relative to the first nine months of 2021. Other revenue increased 10% to $5.2 million slightly ahead of our expectations.\n\nCost of revenue was $17.4 million or 9% of revenue, compared to $11.3 million and 6% of revenue in 3Q 2021, which was primarily driven by an increase in personnel related to consumer support and allocated overhead resulting from the acquisition of vitaCare. Product development and technology expenses remained relatively flat at $35.9 million or 19% of revenue, compared to $35.1 million or 18% of revenue in the comparable period last year, primarily driven by higher headcount and costs related to our in-period reduction in force, resulting from the realignment of our organization in support of our strategic goals substantially offset by higher capitalization of costs related to software development due to greater investment in our products and reprioritization of the development efforts that better align with our strategic goals in future scale. Excluding stock-based compensation expense and other items, adjusted product development technology expense was 13% of revenue, compared to 12% of revenue in 3Q 2021. The increase was due to investments in the team and product.\n\nAdjusted product development and technology expenses were also relatively flat quarter over quarter. Sales and marketing expenses were $86.2 million or 46% of revenue, compared to $95.7 million or 49% of revenue in 3Q 2021. As we look to balance investments in our team and build the GoodRx brand more efficiently. Excluding stock-based compensation expense and other items, adjusted sales and marketing expense was down 12% year over year and down 9% quarter over quarter, driven by a focus on marketing efficiency.\n\nDespite the spend reductions and the larger impact of the grocer issue in the third quarter relative to the second quarter, we're pleased that our MAC counts have remained consistent. General and administrative expenses were $49.5 million or 26% of revenue, compared to $35.9 million or 18% of revenue in 3Q 2021. The increase is primarily due to a $16.6 million change in fair value of contingent consideration related to the vitaCare acquisition and an increase in payroll and related expenses due to higher headcount, partially offset by a decrease in stock-based compensation expense. Excluding these and other adjustments, adjusted G&A expense as a percentage of revenue is 8%, compared to 5% in 3Q 2021.\n\nThe grocer issue contributed to the increase in adjusted general and administrative expense as a percentage of revenue. Net loss was $41.7 million, compared to a net loss of $18.1 million in 3Q 2021. Net loss has impacted by the grocer issue and an increase in general and administrative expense related to a change in the fair value of contingent consideration related to the vitaCare acquisition described earlier, partially offset by a decrease in stock-based compensation expense and sales and marketing expenses. Adjusted net income decreased 25% year over year to $29.9 million.\n\nAdjusted EBITDA decreased 16% year over year to $52 million, largely driven by the grocer issue, which materially impacted revenue growth, as well as adjusted costs and operating expenses as a percentage of revenue. We also continue to invest in growing our new offerings such as vitaCare, which as we stated at the time of acquisition has historically generated net losses in negative adjusted EBITDA, which we expect will continue in the near term. Adjusted EBITDA margin of approximately 28% declined 390 basis points year over year, but improved quarter over quarter and exceeded the 3Q guidance we provided in August given the one-time reduction-in-force we completed during the quarter and our focus on marketing efficiency. We generated net cash provided by operating activities of $33.7 million for the quarter, and we'll continue to focus on strong cash flow and adjusted EBITDA generation in the quarters to come.\n\nDuring Q3, we repurchased $18 million of Class A common stock, or approximately 2.8 million shares. At the end of Q3, we had $148.3 million remaining from our $250 million share purchase authorization approved by our board during the first quarter. Given the ongoing uncertainty around the economy, I also wanted to talk about our balance sheet and our capital allocation priorities. GoodRx maintains a strong balance sheet with a net cash position.\n\nWe had $728.8 million in cash and cash equivalents on the balance sheet and $668.8 million in outstanding debt as of the end of the third quarter. Our capital allocation priorities are reinvesting in the business, maintaining a strong balance sheet, returning capital to shareholders via share purchases, and evaluating acquisition opportunities that support the company's strategy. These support GoodRx's long-term growth strategy while also providing flexibility to navigate near-term challenges and are directly linked to our two most important priorities, furthering our mission, and creating shareholder value. Moving on to guidance. For the fourth quarter, we expect prescription transactions revenue of approximately $125 million to $126 million, which assumes a combined $45 million to $50 million estimated impact related to the grocer issue and our consumer engagement efforts.\n\nWe expect to continue seeing the year-over-year impact of the grocer issue until 3Q 2023 when we left 3Q 2022, which was the first quarter with full impact of the disruption. Our expectation is for a PTR per MAC to continue to modestly decrease quarter over quarter until that time primarily due to an ongoing shift in retailer volume. We expect subscription revenue of approximately $22 million to $23 million down quarter over quarter. As we anticipated, we're entering the fourth quarter with a smaller Gold subscriber base due to the expected churn related to increased prices we rolled out to new and existing subscribers during the first half of the year.\n\nAs we mentioned on our second-quarter earnings call, the strategic repositioning of this offering focuses on the narrower audience, which negatively impacts growth rates, but is anticipated to reduce churn in the longer term. As a reminder, the price increases took place during the first half of the year and are not providing incremental benefit to the fourth quarter. However, their churn effects on subscriber counts lag from the time user's pricing changed, which does impact the fourth quarter. We expect Pharma Manufacturer Solutions to grow quarter over quarter by approximately 10%.\n\nAs a CFO, Pharma Manufacturer Solutions continues to be my favorite GoodRx offering. However, as we've discussed previously, this offering comprises relatively large, often multimillion-dollar deals that can create quarterly volatility. The macro tail end driving more digital outreach to healthcare providers and their staff shifts on the consumer side to video content consumption, such as the assets we acquired in our HealthiNation deal and the fundamentally huge $30 billion TAM we barely penetrated, making highly optimistic about our multi-year trajectory. Finally, we expect other revenue to be approximately $4 million or $5 million in the fourth quarter consistent with the third quarter.\n\nIn aggregate, we expect total revenue of approximately $175 million to $180 million. We expect adjusted EBITDA margin to fall into the low to mid 20% range. The modest margin decline is primarily a function of the anticipated revenue decline in our Prescription Transactions business relative to the third quarter, which relates to our user engagement efforts and is consistent with the expectations we provided on our second-quarter earnings call. And as I mentioned, year-end can be an opportune time to invest in marketing, so we're maintaining the flexibility to do so.\n\nFinally, as we've articulated since the time of vitaCare's acquisition, we continue to expect vitaCare to have a drag on our adjusted EBITDA margins, as will likely be the case for a few more quarters. Our focus continues to be on growing adjusted EBITDA and continuing to deliver strong margin performance and cash conversion. We believe we have the right strategy in place to return to consistent high-margin growth and are focusing on efficient organic investments that will drive growth and strengthen our platforms for the long term. I look forward to updating you on this progress in the quarters ahead.\n\nWith that, I'll turn it over to Trevor for closing remarks.\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nWe are excited about our future and the opportunities ahead, while also recognizing the near-term challenges we face. Our leadership team is committed to navigating these challenges. We'll continue to focus on improving our profitability as measured by adjusted EBITDA, which we view as our number one goal. We are also focused on reaccelerating revenue growth in an efficient manner by leveraging our platform to expand margins following the cost reduction initiatives we began in the third quarter.We expect to see meaningful benefits over the long term from our engagement efforts, along with our focus on investing in our fast-growing Pharma Manufacturer Solutions platform.\n\nWe are confident in our ability to achieve our goals of returning to high growth while remaining highly profitable as we continue to deliver on our mission to help Americans get the healthcare they need at a price they can afford. Thank you again for joining us today. I'll now turn it over to the operator for Q&A.\n\nOperator\n\nThank you. [Operator instructions] One moment for our first question. And it comes from the line of George Hill with DB. Please go ahead, Mr.\n\nHill, your line is open. One moment for our next question, please. Our next question comes from the line of Jailendra Singh with Truist. Please proceed.\n\nJailendra Singh -- Truist Securities -- Analyst\n\nThanks, and thanks for taking my questions. I know you guys are not providing 2023 guidance at this point, but are you willing to share some puts and takes you see for next year at this point? And how much visibly do you have on those factors at this point? Of course, grocer issue is one headwind on a year-over-year basis. But maybe share some additional puts and takes we should keep in mind for next year.\n\nKarsten Voermann -- Chief Financial Officer\n\nAll right. Thanks for the question, Jailendra. This is Karsten speaking. Great to hear from you, again.\n\nYes, I think as we look into 2023, we do have some visibility, of course. I think the biggest areas of confidence come from the reality that we still feel like we're barely penetrated into a prescription transactions TAM, number one. Our Manufacturer Solutions market and TAM is also very large, where we're also lightly penetrated. And so, those two tailwinds in particular are ones that we are highly focused on.\n\nI think in the interim period though, particularly with respect to Manufacturer Solutions, given what we're seeing going on in the marketplace and how with pharma manufacturers taking longer to make decisions around marketing spend and being somewhat more focused on spend period in the fourth quarter, which could extend into 2023 as well. We will continue to monitor the situation between now and when we do our upcoming earning call at the beginning of 2023 to continue to refine our reviews on how that year will evolve.\n\nOperator\n\nOne moment for our next question, please. It comes from the line of Michael Cherny with Bank of America. Your question, please.\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nGood evening. Thanks for taking the question. Congratulations on a nice result this quarter. I'd love to dive in a little bit on the Express Scripts announcement.\n\nObviously, a very important brand name PBM to work with to expand with. And I noticed the term you talked about relative to exclusive. Can you maybe just give us a sense on -- again, not trying to get ahead on guidance, but how to think through how the progression of this relationship first came to fruition and then b, how we should see it start to filter through both in terms of the potential for revenue, potential for incremental costs into 2023 and beyond as it really ramps up.\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nThank you, Michael, for the question. We're really pleased about this new collaboration with Express Scripts. It helps us support their mission to make prescription medicines more affordable for their members. Under this new program eligible Express Script members get access to GoodRx prices as part of their pharmacy benefit.\n\nSo, an eligible Express Script member gets seamless access to GoodRx prices for the eligible generic medication when the price is lower than their benefit price. This keeps visibility of the eligible member GoodRx claim within the pharmacy benefit. It enables out-of-pocket claims to count toward a member's deductible, gives full visibility of the claim to the payer, and as you just brought up, we're delighted that we were selected as Express Scripts exclusive partner for this program. We believe it's really good recognition of our leadership in the prescription discount space of the strength of the GoodRx brand and of the trust consumers have in our technology.\n\nAnd this technology is powered by last year's acquisition of RxNXT. The collaboration creates a new distribution channel for us. We believe that expands the market opportunity. It represents a way to efficiently gain many new incremental users.\n\nAnd this offering is anticipated to be available to Express Scripts commercial clients later this year and in early 2023.\n\nOperator\n\nThank you. One moment for our next question. It comes from Eric Sheridan with Goldman Sachs. Please go ahead.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the question. I want to hone in a little bit on some of the drivers of other revenue. In terms of like what you see coming out of this year and going into next year. We've talked a lot about marketing solutions and working more closely with the industry on the healthcare side to drive good outcomes for you as a platform and for them as companies.\n\nHow could some of those budget conversations and dynamic continued to evolve as you move out of 2022 and into 2023 and supportive evidence of continuing to drive high ROI outcomes for marketers on the platform? Thanks so much.\n\nKarsten Voermann -- Chief Financial Officer\n\nThanks for the great question. This is Karsten speaking here. Yes, I think we are very excited about the other revenues you characterized it, our Manufacturer Solutions line in particular as the biggest component of I think what you're considering in there, the business in which we serve pharma manufacturers. And in that context, I think there are few points that are really critical here.\n\nThe first point is that the TAM is huge. It's about $30 billion TAM, split $20 million to healthcare providers and $10 million to consumers. And we hit both of those parts of the TAM very effectively for our manufacturers, so from that perspective that business continues to be very attractive to us. In the last 16 months alone, 865,000 prescribers have used GoodRx to look at medication prices, prescription discounts, etc., on behalf of their patients.\n\nSo, from that perspective, we remain highly bullish. I think, in addition, the relationships we have both on the consumer and the provider front create a lot of value for us. The 90 NPS with providers and with consumers mean both sets of constituencies are hardly receptive to being approached and being served by us with respect to pharma manufacturers. We also have, as Trevor mentioned in the prepared remarks, significant volume.\n\nWhen you think of all of the monthly visitors that come to GoodRx's platforms, which number in the tens of millions, those visitors are all visitors for whom pharma manufacturers benefit in particular because again, as Trevor said, we tend to be very deep in the funnel folks who are actually looking for a particular medication or a savings opportunity on it. We've also layered in provider mode, which is a tool that allows providers to, for example very rapidly share GoodRx discounts directly with their patients without sharing their personal email address or phone number. So, these kinds of tools that build new infrastructure that providers use on a recurring basis in their interactions with patients are very, very sticky indeed. So, I think all of those elements together continue to allow us to over sort of the medium meaning couple quarters to longer term, incredibly bullish on our pharma manufacturer solutions business.\n\nI think in the interim period right now, as we alluded to in the scripted remarks as well, pharma manufacturers are taking more time to make decisions around spend, and given that at year-end, in particular, the deals can be quite significant in size, amounting to millions or sometimes even $10 millions -- tens and millions of dollars in one deal, that catalyzes potential fluctuation around year-end. And that's one of the things that causes us to have some challenges around predicting the specific level that a business like that will come into in a specific quarter. That said, looked at over any longer-term period of time, like for example, the first nine months of this year compared to the first nine months of last year, when the business grew at 81%, when looked at any -- over any longer period of time, I think we've been very pleased with the growth rates that our pharma manufacturer solutions business has sustained.\n\nOperator\n\nThank you. One moment for our next question, please. And it comes from the line of Doug Anmuth with J.P. Morgan.\n\nPlease proceed.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nThanks for taking the question. With discounts welcomed again in large grocer, can you just help us understand kind of how that's playing out on the ground, the issue now loss revenue more functioning, less foot traffic, having to start over data prices were less compelling now. And have you had [Inaudible]? Thanks.\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nThank you, Doug. It was a little hard to hear you, so I'll do my best to touch on each part of that question. But to the grocer issue was addressed in August, as we've discussed, GoodRx discounts have since been welcomed at Kroger Pharmacy's point of sale. During third quarter, we are pleased to see, with the exception of the particular grocer, that volumes did increase 5% quarter over quarter.\n\nWe are also happy that we are now seeing week-over-week increases in volume at Kroger, as well as increases in subscribers for Kroger Savings Club. We did have a step down in volume because of the disruption, and that's why we really brought up these in the prepared remarks this -- these topics of how we are strengthening the retail network. And we think we've made really good headway on that front in this period that we have made more direct relationships with retailers. We have continued to maintain our really strong PBM marketplace.\n\nBut in addition, we are selectively direct contracting with pharmacies and including many of the largest chains. That hybrid model really lets us ensure network stability, the -- we want to make sure we don't have -- and we anticipate -- we don't anticipate having any similar issue. Because partly, because these direct relationships enable us to collaborate on solutions to drive success. We also think this allows us to be -- have deeper -- these direct relationships allow deeper and stickier relationships, marketing partnerships, and just there are a variety of incremental opportunities there.\n\nOperator\n\nThank you. One moment for our next question, please. It comes from Stephanie Davis with SVB Securities. Please go ahead.\n\nStephanie Davis -- SVB Securities -- Analyst\n\nHey, guys, thank you for taking my question. I want to ask a little bit about the new profitability focus, just in light of both the press release and prepared remarks really point to a greater focus on cash conversion. So, could you walk us through your early thoughts on areas that could merit step back in investments and business lines that conversely could merit a bit of a step-up just in light of that focus?\n\nKarsten Voermann -- Chief Financial Officer\n\nSure. I can take that to start, Stephanie. This is Karsten speaking, and I think others may jump in because they see it. There are really two parts here.\n\nOne's the focus on flow through of EBITDA and cash, and the other is the focus on opportunities for growth going forward. So, focusing on the first part of the question initially, yes, you heard us quite correctly. I think the risk we undertook at the end of August in particular and the refocusing and prioritization that allowed us to do also is a manifestation of the focus you mentioned. We took a really careful review of our business and its structure involved key leaders across the entire organization and realigned the organization to operate really more efficiently and effectively as well.\n\nAnd that was consistent we felt like with our comments during our second-quarter earnings call already where we said that we'd focus on earnings and cash conversion, as well as on revenue growth at that point too. These elements, particularly EBITDA and cash conversion are largely in our control. And I think our reality is that even by focusing on greater efficiency, we don't trade off a significant amount of forward-looking growth. You see us still creating new offerings like provider mode, which I'm sure we'll talk about further and then Q&A that's highly impactful.\n\nAnd you've seen when we look at things like MAC counts, for example, those MAC counts despite the grocer issue remain stable even as we're able to successfully cut back marketing as a percent of revenue and also an absolute dollar terms when you look at the sales and marketing line as well. I think the reality is that the strength of the brand we've built and the fact that we're the scale player in certainly many of the faces we operate, such as our prescription transactions and subscriptions, combined savings offerings mean that we can leverage what we've already built to still be able to grow quite effectively, but also more efficiently than we used to. In terms of growth areas going forward, I'll start, but I'm sure others on the team will jump in as well. And as we've talked about in the past, we remain incredibly bullish on pharma manufacturers' solutions, particularly over a multi-quarter sort of evolution.\n\nI think in any given quarter, there can be some fluctuation, but over multiple quarters, it continues to be an incredibly attractive business. The shift of that business toward digital, which of course benefits us plus the sheer size of the TAM, which were relatively low penetration into today. And the recent reports that have come out from the sell side where interviews of pharma manufacturers indicate that spend will only go up into next year and the shift to digital will only continue into next year for example, also encourage us to be very, very bullish across the broader pharma manufacturer solutions offering, in particular.\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nAnd this is Doug. I'll jump in and talk a little bit about some of the things we're excited about with regard to engaging with our, both our consumers, as well as physicians, more and more tightly. As we deepen our relationship, we're seeing much higher LTV and repeat claim usage for engaged consumers versus our baseline. When we know our consumers better, it allows us to anticipate and respond to more of their healthcare needs and play a more active role in all aspects of our care, not just at the pharmacy counter.\n\nAnd when we know GoodRx user better, we can guide users to the retailer that best fits their needs. We can communicate price improvements for their client prescriptions. We can set reminders to engage with their provider or their pharmacy for prescription refills. Really, it allows us to leverage our data to create new products and tools.\n\nFor example, the medicine cabinet, which we've recently rolled out and I'm very, very excited about. As a result -- and really the punch line of this is that we anticipate increasing the value to each of our users and therefore the ARPU associated with all the offerings, both our prescription-related core, as well as our subscription businesses, and also from pharma manufacturer solutions, like Karsten mentioned.\n\nOperator\n\nThank you. One moment for our next question, please. It comes from the line of Craig Hettenbach with Morgan Stanley. Please proceed.\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nYes. Thanks. Just following back on the pharma manufacturing solutions particularly related to the TAM, are there any anecdotes you can share or update us on, whether it's your penetration with top 20 pharma? Or just any statistics in terms of just kind of where that business stands today? And then also had a quick question on just the prescription business, what you were seeing for core utilization trends kind of through the end of October?\n\nKarsten Voermann -- Chief Financial Officer\n\nSure. So, I think a couple questions sort of embedded there. First of all, this is Karsten speaking again; I'll tackle the manufacturer solutions part. So, on our business, as we've said before, while we're deeply penetrated into the top pharma manufacturers, in fact, we're in top 19 of the top 20 today, we see significant opportunity to continue to grow those relationships, as well as to grow beyond that top 20 by quite a bit.\n\nSo, first of all, in the context of the top 20, while we are in top 19 of the top lens, the number of solutions we're offering to manufacturers and the number of medications at each manufacturer that we're able to help drive volume on those opportunities continue to grow over time. And we've been excited about the progress we've made in deepening those relationships and taking advantage of those opportunities to expand the number of brands we serve and expand the number of different solutions they're using from GoodRx. In fact, that also ties into the acquisition we did earlier in the year on vitaCare because vitaCare is really an offering that allows us to be involved in almost the entirety of the prescription cycle. From the moment the healthcare provider writes the prescription through to the period when the consumers actually benefiting from receiving it at the pharmacy, including managing a lot of the complexity that exists, particularly for insured patients around things like step therapies and preauthorization and the like.\n\nSo, our ability to become more deeply involved with these manufacturers in the top 20, very high. Then secondly, we're penetrated into approximately call it 10% or 15% of U.S. manufacturers period. So, there's still an amazing amount of runway ahead of us to penetrate into more manufacturers as well.\n\nSo, we're excited about that growth vector. We're excited about the incremental solutions vector. And we're also excited about the opportunity to penetrate into more medications. With respect to the prescription transactions business, on that dimension, I think one of the factors that we follow very closely in a, call it, week-to-week, month-to-month basis, particularly at this time of year that we've talked about in the past, is the evolution of the flu season in particular.\n\nWhile it's tough on all of us as individuals more aggressive flu seasons tend to correlate with tailwinds for GoodRx as well. So, we're monitoring that situation closely, as well as healthcare utilization broadly, closely. And on the healthcare utilization broadly front, as we talked about in the last earnings call, we've seen that largely return to normal, which is great on the flu front, I think it's a little too early to predict, but the reason both of those dimensions matter so much is that consumer interactions with the healthcare community are a key driver for us of our own growth. And one of the big reasons for that is healthcare providers are potentially the first evangelists that GoodRx had on us behalf and one of the largest set of groups who are able to help promote GoodRx to their patients.\n\nWe have over 400,000 doctors' offices that solicit GoodRx-related collaterals from us so that they can promote GoodRx to their patients and result in better patients outcomes. We also created things like the provider mode tools to do exactly the same thing so that healthcare providers can leverage GoodRx even more efficiently. And having returned back from sort of the COVID era underutilization around middle of this year to more normal utilization, we expect those dynamics to be bigger and bigger tailwinds as the quarters evolve going forward into 2023.\n\nOperator\n\nThank you. One moment for our next question. And it comes from the line of Jonathan Yong with Credit Suisse. Please proceed.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nHey, thanks for taking my question. Just on the grocer impact, for 3Q, you're estimating that the impact was a $40 million headwind, but then you're also mentioning that you're seeing week-on-week improvement from that particular grocer. But if I look at your 4Q guide, you're essentially guiding for little improvement on a sequential basis. So, can you help me reconcile the guide and your commentary on the improvement, and is this a function of conservatism on your end? And alongside that, should we think that this $40 million gap closes as we move into 2023 and deeper into 2023? Thanks.\n\nKarsten Voermann -- Chief Financial Officer\n\nSure. Yes. Let me, first of all, start by the -- with beginning of your question and bridging the commentary. So, while we talked about a roughly $40 million impact in the last quarter for the grocer and we're anticipating similar size impact going forward that's a function of a couple different things.\n\nI think the first is that, well we are seeing some week-on-week growth associated with the grocer. The week-on-week growth is often extraordinarily small base relative to what it used to be. So, when you look at the grocer as having historically represented approximately 20% of volume, just shy of 25% of revenue to where they are today that much lower percentage today in the very low single-digits, even if it's growing slightly, doesn't really impact the aggregate number -- dollar number associated with the amount of revenue that we've forgotten with the grocer. So, again, it's a relatively small scale today, even though growing doesn't have a significant impact on the gap that's left in association with the grocers historical levels of contribution to our revenue at, like I said, just shy of 25%.\n\nI think to the other part of your question, which goes to how that could evolve going forward and whether the gap will close. I think there are a couple of dynamics to articulate. The first is that while we're excited about the momentum that we have with the grocer and we're excited about the ubiquity of availability of GoodRx, we think it's important that you can use GoodRx at any of the large pharmacies across the country. At the same time, the reality is that I don't think we expect to see volume levels for the grocer anywhere close to historical ones.\n\nMeaning that we don't see a return to 20%-ish of volume and nearly 25% of revenue. And that's a function of a few factors, including the reality that pricing at the grocer used to be highly advantaged relative to other retailers. And because of that, given that we're a marketplace, many of our users went to the lowest price, which was that particular grocer. Now, that they're often not the lowest price anymore, the return of the volume to that particular pharmacy, I think we see is unlikely at anywhere close to historical levels that pharmacy represents low single-digits of total volume in the market as a whole from a market share perspective.\n\nAnd it wouldn't expect them to over-index going forward. Therefore, I don't think we see the share getting anywhere close to as big as it was historically. I hope that's helpful.\n\nOperator\n\nOne moment for our next question, please. And it comes from the line of Yong Lee with Evercore ISI. Please proceed.\n\nUnidentified speaker -- Evercore ISI -- Analyst\n\nGreat, thank you. I have a couple questions. One, just to clarify on the pharma solution comment of deal timing push-out. Just to clarify, is it just like, do you expect that to be kind of a push-out in timing? Or do you see an overall pullback in the marketing spend from front of pharmaceuticals? And also, the second on the $45 million to $50 million in Q4, how much of that is from the customer engagement and initiatives? Because I think that's mentioned in the letter as well.\n\nAnd when do you expect that to become a tailwind rather than a headwind? Thank you.\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nSure. Thanks for the great questions, Yong. So, first of all, to the questions around pharma manufacturer solutions and the timing and quantum of market revenue is probably the best way of putting it. To take it at the general level before getting specific to GoodRx, I think our view is that the market as a whole continues to be one that's growing rapidly and in an attractive direction for us.\n\nAnd what I mean by that is the latest studies that I've read that came out of the sell side over the last couple weeks indicate based on interviews that the pharma spend market on medication advertising, broadly speaking and awareness access and adherence solutions more broadly is expected to grow in the mid-single-digits next year. That's, I think in itself very attractive to us that mid-single-digit growth. I think what makes it even more attractive is the continued shift to digital that pharma manufacturers are indicating they're continuing to be committed to make, because that shift to digital in years, particularly to GoodRx's benefit, given our relatively unique ability to be able to both target healthcare providers and consumers and to target healthcare providers and consumers in a very specific way. So, for example, healthcare providers buy specialty, which is one of the benefits that we've been able to reap from our provider mode offering, as well as the investments we're making in healthcare provider-related solutions.\n\nSo, in those two dimensions, I think we see the reality is one in which timing may be more questionable than it was in the past, but the overall attractiveness of the market for GoodRx's as high as it ever was, potentially even higher with the continued shift to digital now being confirmed, I think through the recent surveys we're seeing. So, again, I think we remained very positive and very bullish on this business over a multi-quarter view. I think with respect to the second part of your question, I think that part of your question related more specifically to consumer engagement and the impacts of consumer engagement in the fourth quarter. So, the consumer engagement efforts launched around mid-quarter of the third quarter.\n\nSo, we only saw about half the impact we'd expect to see in the fourth quarter. And last quarter we said we expected to see or somewhere around $5 million of impact. I think the reality was a little better than that. We're pleased that the attenuation or the narrowing of the funnel cause with the engagement efforts reduced a little bit, but again, where the impact only manifested for a partial quarter this quarter, they're going to impact for about double as long, so for the full quarter in the coming quarter, consistent with the commentary, I think, we made on the prior call.\n\nAnd we also intend to continue these engagement efforts beyond this year, of course. So, I think we'll expect that we'll continue to focus heavily on knowing our consumers better, being able to get more information from them that allows them us to help them more and create products that are even more innovative and even more supportive of their health outcomes. So, this is not just a 2022 thing, this will continue into 2023 as well on the engagement side.\n\nOperator\n\nThank you. One moment for our next question. It comes from the line of Sandy Draper with Guggenheim Partners. Please proceed.\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nThank you very much. A lot of the questions have been asked and appreciate all the answers. Maybe just one last drill down on the pharma manufacturer solution side. Just trying to think through, there were some comments you made at a recent, or back in September, I believe it was about still expecting that business to maybe even double this year.\n\nAnd so, while you're still growing nicely, it's obviously slowed down fairly quickly. So, I'm just trying to think if you can give some commentary around like average tenure of the programs you're working, how long it is. What, just trying to think about visibility and how much of this is coming out of more of the consumer-facing versus physician side. Just trying to understand, I understand the long-term view of the market and think that is positive, but just trying to turn the visibility, how it switches off that quickly, unless it's really customer concentration, or maybe just much shorter duration contracts than I may have expected.\n\nThanks.\n\nKarsten Voermann -- Chief Financial Officer\n\nHey, Sandy, great to speak with you, and thanks for the question as well. This is Karsten again. I think the best way to articulate it is when we look at sort of pharma's man sol's performance for the first nine months of the year, it's up about 81%. So, just shy of or somewhat shy of doubling.\n\nI think earlier this year we said we expected it to close to double for the year. That held largely true through the first nine months. I think for the fourth quarter. We're really seeing a macro environment that's shifted a little bit versus where it was.\n\nAnd again, I think we see that as something that delays revenue more than anything else. I think the other aspect of that is that, if deals are delayed, then the delivery on them also gets pushed out. And of course, the deliveries where and when you can recognize the revenue on them. In terms of deal duration and in terms of concentration on our pharma manufacturer solutions business it's not a business where anyone customer accounts for even a large minority of revenue let alone a majority.\n\nThe customer dispersion is very, very high with very few of them trying to think if any of them in the double digits, but very few of them in double-digit percentage of revenue. But what we do see is that certain kinds of offerings made by manufacturers and made by others who leverage or manufacture solutions offerings are more episodic or they can be tied to a particular time of year. For example, we have historically worked with entities that are seeking to support Medicare open enrollment, Medicare open enrollment spend happens predominantly in the third quarter versus say the fourth quarter or the second quarter. And so, you do see in those areas, revenue that can come in one quarter, but not come in from the same entities in a subsequent quarter.\n\nI think the other piece of it is that while individual deals can be quite large, and those, therefore, swing revenue growth, Q-o-Q in particular, when you look at a given quarter that as the business continues to expand over time, portfolio theory will apply and that Q-o-Q volatility will decrease as we continue to scale the business. But in the interim period, again, I think we see this as more like Jon ask a few minutes ago. We see this more as a timing issue than anything else given the nature of the market and the huge TAM and growth rate associated with it and our unique ability to go hit it. I think one of the folks that people haven't heard clearly from us in the past, and we're certainly stressing on this call too, is just the sheer number of healthcare providers who we work with as well, which are, of course, an incredibly attractive audience, given that in most cases, we can identify them by specialty and by the prescriptions they write.\n\nSo, having that 865,000 healthcare providers using GoodRx that we talked about earlier, I think is something that is of huge benefit to pharma manufacturers, especially given that we can also support them on the consumer side in a coordinated fashion.\n\nOperator\n\nThank you. One moment for our next question, please. It comes from the line of Steve Valiquette with Barclays. Please proceed.\n\nSteve Valiquette -- Barclays -- Analyst\n\nGreat. Hi. Good afternoon. Thanks, everyone, for taking the question.\n\nSo, just wanted to walk through a scenario or two for a moment. I think as you alluded to on this call, you reiterated the communication from August that the grocery dispute was resolved and your direct relationships with retailers such as grocers as a key positive development. However, I think some in the investment community became a little bit confused when, Kroger announced back on September 30th that their dispute between themselves and the Express Scripts was still not resolved and without a resolution by December 31, their commercial contract would be terminated. So, I guess really the scenario question now is, what would be the expected impact that GoodRx in 2023, if that Kroger Express Scripts PBM contract is terminated on 12/31/22, if any? And then does either your direct contracts with brochures either mitigate that or shield that, or does your new collaboration with Express Scripts shield you or mitigate you from that scenario I just mentioned? Just trying to get clarity around that September 30 press release from Kroger/Express Scripts.\n\nThanks.\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nYes, thank you very much for the question. I'm not -- you know, the fix that -- anything between Kroger and Express Scripts, we don't anticipate would affect our business. As we mentioned GoodRx is accepted at almost all pharmas in the U.S. We addressed the grocer issue and GoodRx discounts are welcome at Kroger.\n\nWe've been pleased with that growth we've been seeing. What I guess I'd like to highlight again, how we've been going forth strengthening our retail relationships because we view that as incredibly important. We're selectively as a direct contracting with a growing number of pharmacies, including many of the largest chains that hybrid model lets us ensure network stability and these direct relationships let us collaborate on various solutions.All of this has led to continued strengthening of those relationships, have led us work on strategic initiatives together. We're driving traffics to retailer locations.\n\nWe're driving additional merchandise spend for, there's for customers who are in places, in stores not using their pharmacy, we're getting them to use their pharmacies, we're driving additional adherence. So, we're driving all these additional benefits. We're also -- have been making good headways to this hybrid effort to improve unit economics for retailers while also balancing that against the strength of our own economics, which continue to be strong as you know as partially evidenced by our strong margins.And these direct relationships as I mentioned, open up these opportunities for just stickier partnerships that we think will be incremental. So, we're really pleased that we think we have may strengthen this further.\n\nWe're also seeing new additions to the retail network, such as the addition of Giant Eagle to the Gold retail network, which adds additional geographical coverage. And I hope that answers the question.\n\nOperator\n\nThank you. One moment for our next question. It comes from the line of Stan Berenshteyn with Wells Fargo. Please go ahead.\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nHi. Thanks for so much for taking my questions. So, as we're thinking about next year, can you maybe remind us when the Kroger Savings Club contract is up for renewal? And can you maybe walk us through the revenue visibility you have in the event that the contract is sunset? Thanks so much.\n\nKarsten Voermann -- Chief Financial Officer\n\nSure. Stan, great to speak with you. Karsten here. I think that couple points to make, a couple earnings calls ago, we talked about the scale of the Kroger Savings Club that we support as a proportion of our subscription to revenue.\n\nAnd the reality is that the Kroger Savings Club is very small, both as a proportion of our subscriptions revenue and our proportion of our total revenue. So, from that perspective really wanted to shed light on the fact that the massive majority of our subscription revenue comes from our own Gold program. That said the current agreement with Kroger run through July of 2023. And we're enrolling new members right now on annual plans.\n\nOf course, we're past July of 2022 at this point. So, I think that's a good indicator of the nature of the relationship with Kroger that we're continuing to add annual members and plan servicing them through at least mid-2024 at this point. But again, KSC doesn't really swing the needle or move the needle on our business overall, relative to our own business, though, that's given all that, I think the bottom line for us is we're extremely pleased that Kroger is still working with us on KSC. Number one, we're extremely pleased that GoodRx discounts are welcomed at Kroger.\n\nNumber two, again, as I said earlier in response to another question, ubiquity of availability of GoodRx is key. And especially now to the question, that I think that got asked by Steve a few minutes ago too. Having GoodRx available at Kroger is critical, especially if, ESI and other offerings aren't as available as they used to be.\n\nOperator\n\nThank you. One moment for our next question, please. And it comes from the line of Scott Schoenhaus with KeyBanc.\n\nScott Schoenhaus -- KeyBanc Capital Markets -- Analyst\n\nHi, team. I wanted to follow up on the provider mode that launched last month combined with the EHR. You said you're partnering with. How do you see this growing into 2023 and what does this translate into the pharma manufacturing growth? Is this price differently for your pharma manufacturing clients versus your legacy revenue stream? Thanks.\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nSure. When we look at -- maybe I'll -- I'm going to speak a bit generally about what we're doing with provider mode and why we think it's valuable and how we're monetizing it. So, GoodRx provider mode is part of this GoodRx providers we've been talking about, so GoodRx providers is all of these offerings we have for healthcare providers, including provider mode flipMD from GoodRx and our general work with more than 400,000 HCPs and HCP offices actively distribute GoodRx materials. So, provider mode is this technology platform that we launched last month and it has a number of advantages and provides a number of advantages to HCP and related parties to help consumers, help patients get through the healthcare journey, get access to medication, be adherence medication.\n\nSo, one of the advantages with provider mode is we've expanded access from prescribers to all HCPs, including nurses, medical assistants, and front office staff, all of these participants are really important in helping get patients to the right solutions. And provider mode also includes this redesigned prescription savings flow that gives a faster, more customized experience to get users to help the providers get their patients medication. This is super synergistic both across our prescription discount business and the pharma manufacturer solutions business because we're trying to help patients get all their medications, generic brands, specialty and get access to them. This gets monetized through increased use of prescription discounts, and it gets monetized through the pharma manufacturer solutions.\n\nSome of our pharma manufacturer solutions deals, I believe this is part of your question are for both our consumer and HCP offerings. And then we have other deals that are specifically an HCP deal, for example.\n\nOperator\n\nThank you. One moment for our next question, please. It comes from the line of Robert Simmons with D.A. Davidson.\n\nPlease go ahead.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nHey guys, thanks for taking the question. So, it's understandable and expected that they're going down now, but when do you think the number of subscription plans will trough and start to go up again on a quarter-over-quarter basis?\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nYes, thank you for the question. So, subscription revenue grew 63% year over year to $26.5 million for the quarter. As we've discussed, we've sort of made the decision to tighten the focus of it to the patients, to chronic care -- chronic patient take with chronic conditions more, more tightly. And that has been the focus and that price increase has worked.\n\nI believe, as we expected, with the the amount of people decreasing sort of within or better than our expectations there, but we continue to work on that program and are optimizing it. And so, you'll see some continued improvements there as we try to make that program applicable a broader and broader set of users and start increasing subscriber numbers again.\n\nOperator\n\nThank you. One moment for our next question, please. It comes from the line of Kevin Caliendo with UBS. Please proceed.\n\nKevin Caliendo -- UBS -- Analyst\n\nThank you. Thanks for getting me in. I noticed the capitalized software number jumped in 3Q and the run rate, this year is a lot higher than last year. I'm just wondering if this is the run rate we should be working off of going forward, or is it going to continue to accelerate as you make investments in software? Just thinking about how to model that and the driver of it.\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nSure. So, thanks for the great question. First of all, Kevin in terms of cap soft we're, we spent a lot of time over the prior year's continuing to focus on managing and maintaining our base code, building new infrastructure to allow us to develop faster, and taking on other initiatives of the, like I think what you're seeing, particularly since Mark Hall joined us to Head product, you're seeing a shift in which we're now focused very, very hard on delivering direct value to healthcare providers through things like the provider mode that Trevor talked about and new offerings for consumers too. And as we do that, as we continue to drive these new offerings and focus very heavily on creating new products and new features, the capitalization rate has crept up just a little bit.\n\nAnd that's really a function of the great work that's being done to serve consumers, consumers better.\n\nKarsten Voermann -- Chief Financial Officer\n\nAnd yes, what I want to highlight there though is we are just laser-focused on driving efficient growth and driving margin expansion. And the series of actions we've been taking is what enabled us to exceed expectations this quarter, in particular on adjusted EBITDA. So, two things I want to highlight. We did complete the organizational realignment, the reduction in fourth in August to rely on ourselves.\n\nWhile that had some, hard trade-offs, it's we believe that was executed very well and that we are now operating even more effectively in getting products out the door quickly. We also have made really good headway on marketing efficiency. We've reduced advertising spend and heading into Q4 while maintaining relatively stable max. So, the strength of our brand and just the really solid work being done there has showed us that we can be more efficient there and we continue to see opportunities there.\n\nAnd then my final comment is this is a macro environment where GoodRx really shines. The need for affordability is really only increasing as employers cut back some spending. And as consumers need affordability solutions, this is what we made GoodRx for. We are here in these slightly harder times to help consumers to get them the medications they really need to keep people adherent to their medications to produce better health outcomes.\n\nSo, we're happy we can provide that. Thank you.\n\nOperator\n\nThank you. And with that, ladies and gentlemen, we conclude the Q&A and program for today. [Operator signoff]\n\nDuration: 0 minutes\n\nWhitney Notaro -- Vice President, Investor Relations\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nKarsten Voermann -- Chief Financial Officer\n\nJailendra Singh -- Truist Securities -- Analyst\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nStephanie Davis -- SVB Securities -- Analyst\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nUnidentified speaker -- Evercore ISI -- Analyst\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nSteve Valiquette -- Barclays -- Analyst\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nScott Schoenhaus -- KeyBanc Capital Markets -- Analyst\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nKevin Caliendo -- UBS -- Analyst\n\nMore GDRX analysis\n\nAll earnings call transcripts"
}