{
  "companyName": "Eastern Bankshares, Inc.",
  "companyTicker": "EBC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/eastern-bankshares-inc-ebc-q3-2022-earnings-call-t/",
  "content": "Eastern Bankshares, Inc. (EBC -0.35%)\nQ3 2022 Earnings Call\nOct 28, 2022, 9:00 a.m. ET\n\nOperator\n\nHello, and welcome to the Eastern Bankshares, Inc. third quarter 2022 earnings conference call. Today's call will include forward-looking statements, including statements about Eastern's future financial and operating results, outlook, business strategies and plans, as well as other opportunities and potential risks that management foresees. Such forward-looking statements reflect management's current estimates or beliefs and are subject to known and unknown risks and uncertainties that may cause actual results or the timing of events to differ materially from those expressed or implied in such forward-looking statements which are referred to the disclosures set forth under the caption Forward-Looking Statements in the earnings press release, as well as the risk factors and other disclosures contained in the company's recent filings with the Securities and Exchange Commission for more information about such risks and uncertainties.\n\nAny forward-looking statements made during this call represent management's views and estimates only as of today. While the company may elect to update forward-looking statements at some point the future, the company specifically disclaims any obligation to do so, even if management's views or estimates change, and you should not rely on such statements as representing management's views as of any date subsequent to today. During the call, the company will also discuss certain non-GAAP financial measures. For a reconciliation of such non-GAAP financial measures to the comparable GAAP figures, please refer to the company's earnings press release, which can be found at the investor.easternbank.com.\n\nPlease note this event is being recorded. [Operator instructions] I would now like to turn the call over to Bob Rivers, chair and CEO.\n\nBob Rivers -- Chairman and Chief Executive Officer\n\nThank you, Michelle. Good morning, everyone, and thank you for joining our third quarter earnings call. Joining me today is Jim Fitzgerald, our chief administrative officer and chief financial officer. Our performance continued to be strong, demonstrated continued improvement in a number of key measures.\n\nOperating net income in the third quarter was 49% higher than the comparable prior year quarter, a new record, driven by our highest ever quarterly revenue, which increased 34% year over year. As a result, Eastern's return on assets continued to improve as did the efficiency ratio, which declined eight percentage points from a year ago. Underlying this progress, our deposit costs continue to be well managed, rising only four basis points from the prior quarter despite another 150-basis-point increase in the Fed funds rate over the past three months and an increase of three percentage points since the beginning of the year. Growth in loan outstandings continued to accelerate during the quarter, rising 16% overall on an annualized basis, driven by record commercial and home equity loan production with net charge-offs of just one basis point.\n\nAs a result, the net interest margin increased 24 basis points during the quarter. In addition, Eastern Insurance Group acquired its second Agency of the Year in August and its 36th since 2002, and Eastern Bank was recognized by the Boston Business Journal as one of the most charitable companies in our region, our 10th time in the Top 10. We think it is increasingly clear that investments we have been making in the growth of our company are paying off. In addition to significant financial leverage, the acquisition of Century Bank, which closed last November, helped increase our deposit market share to the fourth largest in the Greater Boston market.\n\nOur record commercial loan originations reflect just the beginning of the benefits we expect to achieve through the expansion of our commercial lending teams. Our continued significant investments in technology have elevated our digital capabilities, better serving our customers and improving process workflows that we believe will ultimately reduce expenses. As always, these results reflect the hard work and tremendous commitment of my 2,100 Eastern colleagues with whom I am privileged to work and whom I thank for all that they do every day to serve our customers, communities and each other. Once again, thank you for joining us today and for your interest in Eastern.\n\nAnd now I'll turn things over to Jim for an in-depth review of our third quarter financial performance and outlook for the remainder of 2022 and for 2023.\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nThanks, Bob, and good morning, everyone. As Bob mentioned, we're very pleased with our third quarter results and think they demonstrate continued momentum from the first and second quarters of this year. We were pleased with the growth in our net interest income and margin due to higher rates and very strong loan growth. Net income was $54.8 million for the quarter or $0.33 per diluted share.\n\nOperating net income was $55.7 million or $0.34 per diluted share. Operating net income for the second quarter -- operating net income was 49% higher than the same quarter of 2021. Net interest income was very strong in the quarter, rising 10% from the prior quarter as net interest margin increased 24 basis points from Q2. Our asset yields increased by 29 basis points in the quarter, and our cost of funds was up eight basis points.\n\nWe also had a strong quarter of loan growth in all of our major portfolios, with commercial loans up 16% quarter-to-quarter. Organic residential mortgage growth was 10% and consumer loans were up 6%. All these percentages are on an annualized basis. Our board approved a dividend of $0.10 per share payable on December 15 to shareholders of record on December 2, 2022.\n\nWe repurchased 1.5 million shares under our share repurchase program in the third quarter at an average price of $19.52. First, I'll make some comments on the balance sheet. Assets were down $300 million from Q2 and ended the quarter at $22 billion. Deposits were down $430 million in the quarter and were offset by an increase in borrowings of $380 million.\n\nLoans were up $505 million, while cash was down $210 million. The securities portfolio is down $700 million due primarily to reductions in market value. All major loan categories were up for the quarter. Commercial loans were up $357 million or 16% annualized.\n\nOrganic residential loans were up $52 million or 10% annualized, and consumer loans driven by home equity loans were up $19 million or 6% annualized, and we added $78 million of mortgage loans to the embrace relationship we described last quarter. As mentioned above, deposits were down $430 million in the quarter, although there was little change in average deposits from the second quarter. We talked on the last call about the tightening market for deposits and that we expected price increases in a challenging market going forward. That did materialize, and we expect it to continue.\n\nWe have begun to adjust our deposit pricing to remain competitive and have used some of our borrowing capacity to fund loan growth in the quarter. Shareholder equity decreased $303 million in the quarter due to the impact of lower AOCI and share repurchases, partially offset by an increase in retained earnings. As I mentioned, GAAP net income was $54.8 million or $0.33 per diluted share and operating earnings were $55.7 million or $0.34 per diluted share. We feel our results reflect very strong progress in many key areas.\n\nNet interest income of $152.2 million was $14.4 million or 10% higher than Q2 and benefited from higher rates and strong loan growth. Asset yields were up 29 basis points quarter over quarter, and funding costs were up eight basis points. This combination allowed our net interest margin to expand by 24 basis points from 2.63% to 2.87% in the quarter. The provision for loan losses was $6.5 million in the quarter compared to a $1.1 million provision in Q2.\n\nLoan growth was the driver of the increase. $4.7 million of the $6.5 million provision was due to the increase in loans and $1.8 million was primarily due to a modest increase in our ACL factors. Noninterest income on an operating basis was $45.3 million in Q3 and Insurance revenues were $23.8 million in the quarter, up 8% from the same quarter of 2021 and down $900,000 from Q2. We started to see a reduction in deposit service charges due to the changes in our overdraft practices we mentioned earlier in the year.\n\nOther operating line items were generally in line with either the prior quarter or the prior year. The value of Rabbi Trust assets was down $2.2 million due primarily to declines in the stock market, and we incurred some small losses on security sales, both are excluded from the calculation of operating earnings. Noninterest expense was $116.8 million in the third quarter compared to $111 million in Q2. On an operating basis, noninterest expense was $117.4 million compared to $114.4 million in Q2 due to an increase in salaries and benefits.\n\nThis increase was due primarily to higher incentive compensation. As is outlined in the non-GAAP tables of the press release and the presentation, there was a $2.4 million increase in benefit expense during the quarter due to lower rabbi trust losses in the quarter. All other expenses in total were either in line with Q2 or prior years. I'll include some comments on our outlook for expenses later in the presentation.\n\nTax rate in the quarter was 24%, and we provide guidance for the full year tax rate on the outlook slide. Our marginal tax rate is higher than the average tax rate, and as projected earnings increase, the average will increase. The average tax rate will increase. Asset quality continues to be sound.\n\nThrough the end of the third quarter, net charge-offs were very close to zero. NPLs are at very low levels, and our reserve coverage to NPLs is over 380%, the loan we moved to nonperforming loan status in Q2 paid off in full in Q3, and there was a corresponding reduction in nonperforming loans at 9/30. We continue to carefully monitor all of our portfolios through our internal portfolio management processes and don't see any significant adverse trends in our risk ratings in the commercial portfolios or early delinquencies in the consumer portfolios at this time. We continue to monitor all credit quality trends carefully.\n\nAs I mentioned, the provision in the quarter was $6.5 million due primarily to loan growth and was sufficient to maintain allowance of about 1% of total loans. I wanted to review our outlook pages and make some additional comments. Although the environment is challenging, we expect the continuing increases in rates to improve our net interest income for Q4 and into 2023. We expect to see net interest income for 2022 in the range of $570 million to $580 million, and we expect to see our net interest margin move into the low 3% range in early 2023, if not late 2022.\n\nWe would expect full year 2023 net interest income to have a percentage growth rate over full year 2022 in the low teens. We expect commercial loan growth to produce another strong quarter in Q4. Q3 was a record for commercial loan originations and and generated 16% growth on an annualized basis. We would expect those levels to come down but expect Q4 to be above our long-term target growth rate of the mid- to high single digits.\n\nHigher rates in a slowing economy are expected to have an impact as we transition into 2023, and we would expect slower loan growth than in 2022. We will update our views on that next quarter. Given the change in the liquidity outlook generally, we have decided to discontinue our flow arrangement for residential mortgages with embrace home loans that we described on the last call. Although the program was working well, the challenging outlook for deposits and liquidity has reduced our appetite.\n\nWe will close out the existing pipeline over the next 90 days. We would expect our organic mortgage loan growth to decline due to the general slowdown in the mortgage market. We completed the hedging program we described on the last call. We completed the hedging program we described on the last call in Q3 and feel very good about the long-term benefits of reducing our asset sensitivity.\n\nThere's no change in our guidance on noninterest income from last quarter as we still expect $180 million to $190 million for 2022. We do not expect growth in noninterest income in 2023 due to the reduction in deposit service charges mentioned previously related to overdraft revenue and pressures on wealth, mortgage and interest rate swap fees due to market conditions. We are adjusting our operating noninterest expense guidance for 2022 and -- we expect expenses to be between $455 million and $465 million for 2022, up slightly from the prior guidance. We continue to invest in our commercial teams and technology and are confident these investments are critical to our success and will be a long-term competitive advantage.\n\nIn addition to the outside hires for our commercial team we mentioned earlier in the year, we've added the support and infrastructure needed to grow at the faster pace we've experienced in 2022. The 10% and 16% annualized commercial loan growth rates we experienced in Q2 and Q3 were an early dividend on that investment. We also have some investments in digital account opening and workflow technology that will be coming on stream in late 2022 and early '23 that we are excited about for both our customers and also our colleagues. The combination of these investments along with salary adjustments we have made for colleagues at the lower end of the wage scale to help offset some of the inflation challenges, as well as general wage pressures will drive our salary and benefit costs higher in 2023 than the increases in prior years.\n\nWe would expect growth in salaries and benefits of 6% to 7.5% in 2023. This is well above our long-term experience, and we would expect that to return to more normal levels as inflation declines. Included in this increase are included in this increase is our healthcare costs, which are expected to be up 7% in 2023. We expect the other major expense line items, occupancy, professional services, marketing and other expenses to have increases in the low single digits for the year.\n\nWe commenced our second share repurchase authorization in Q3 and for the quarter, purchased a total of 1.5 million shares. As we mentioned on the outlook slide, future purchases will be determined by market conditions, as well as capital and liquidity considerations. As we pointed out in the outlook, we will recognize a noncash charge in Q4 related to the required use of defined benefit pension settlement accounting for 2022 for our pension plan that I will explain in a moment. Our preliminary estimate, which is based on data at the end of August that is very preliminary, is that the incremental pension expense will likely be in the range of $10 million to $15 million.\n\nAs background, GAAP requires Eastern to use settlement accounting if during a calendar year the total amount of lump sum distributions from our pension plan taken by retirees and other former employees exceeds the settlement accounting threshold, which is the total amount of service and interest cost of the pension plan for that year. Our pension plan administrators test for the settlement accounting threshold throughout the year. We learned this quarter that the total amount of lump sum payouts for 2022 will exceed the accounting threshold for the year, and therefore, we will be required to apply pension settlement accounting retrospectively for all of 2022. The actuarial work to calculate the incremental pension expense resulting from the required use of settlement accounting is complex, and therefore, our estimated incremental expense of $10 million to $15 million is preliminary.\n\nWe intend to publicly disclose the actual settlement accounting charge for Q4 promptly after it's finalized, which we anticipate will be in early December. In closing, we continue to see a great opportunity to further penetrate our market in Eastern Massachusetts and Southern New Hampshire. We experienced an improvement in our deposit market share due to the Century acquisition last year, and our growth rate for commercial loans in 2022 stands out in our market. Although we expect the environment to be challenging in 2023, we're confident that we are well positioned in an excellent market for long-term growth.\n\nThank you very much, and we are ready for questions. Michelle?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Mark Fitzgibbon, Piper Sandler, Please go ahead.\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nHey, guys. Good morning. I wonder if you could start by sharing with us -- and I apologize if you said this in the very beginning, I missed a couple of minutes, but the loan pipeline, the mix and maybe average rate?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nSure. So Mark, we don't disclose the loan pipeline. It's calculated a little bit differently for different products. But on the commercial side, which is where we focus most of our strategic attention, the pipeline is about the same size as it was at the end -- coming into Q3.\n\nWe do expect a good quarter for closings in Q4 and expect that to come down. And as I articulated, we would expect slower growth as conditions -- as 2023 looks like it will be a more difficult year than 2022. But the pipeline going into the fourth quarter is at about the same level as it was the prior quarter. In terms of yields, new business on the commercial side, sort of in the high, low to mid to high five percent range, those would be for fixed rates.\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nOK. Great. And then, secondly, Jim, on page 11, you detail the total securities portfolio yield, and it came down a bit from the second quarter to the third quarter. I was just curious why that was.\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nSure. premium amortization, we had one or two selected situations where there were -- we had to accelerate premium amortization primarily due to payoffs of the securities.\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nOK. And as you kind of think about the size of the securities portfolio, and I know you're using cash flow to fund loan growth, how quickly can you shrink down that securities portfolio? Or do you have a target in mind for it?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nSure. That's a very good question, Mark. And in many ways, the answer is going to be very similar to what we said last quarter. The cash flow from this portfolio today is about $70 million a month, call it, $800 million a year, $800 million to $850 million a year.\n\nAt this point in the rate cycle, that's what -- those are the changes we expect. We expect to see it come down in those amounts. Obviously, if rates change and there's opportunities to do other things, we'd address it at that point. But at this time, that's what we see.\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nOK. And lastly, what would you say your spot deposit rate is today?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nYes, that's a hard one because there's a wide variety of different products in different sectors. So it's hard for me to give you an answer. We do expect to see a pretty -- we do expect to see an increase in our deposit costs in Q4.\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question comes from Damon DelMonte, KBW. Please go ahead.\n\nDamon DelMonte -- Keefe, Bruyette and Woods -- Analyst\n\nHey, good morning everyone. I Hope everybody is doing well today. Jim, I was just wondering if you could revisit the commentary on the decision to terminate the relationship with OnCourse. I didn't quite get everything that you said there, but it's impressive.\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nYes. It's I'm laughing OnCourse. I mean, Boston is sort of a local joke, but it's embraced home loans. And as we outlined at the quarter last time earlier in the year, when the liquidity picture was very different, we were looking to, in essence, direct security cash flows away from the securities market and developed -- had a pre-existing relations -- very strong pre-existing relationship with Embrace.\n\nSo what this program was to buy loans originated by Embrace based on our underwriting criteria and take them in the portfolio on a flow basis. What we articulated at the last call at the end of Q2 was we had targeted an amount of $400 million for that. And it was a little bit of an experiment to see how it would work. Change in liquidity and the outlook for liquidity really reduces our appetite for that, Damon.\n\nSo we have notified embrace, we're going to discontinue that. There are loans in the pipeline that will close out in the normal course. And as I said in my comments, we're very happy with the way it was working, but it's really just the liquidity outlook that changed our appetite.\n\nDamon DelMonte -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. And then, you had said to the last question that the securities portfolio is putting off about $800 million a year in cash flow.\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nYes.\n\nDamon DelMonte -- Keefe, Bruyette and Woods -- Analyst\n\nAnd so do you expect all of that to be used to fund loan growth? Or do you think you're going to have to reinvest some of that back in the securities portfolio?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nNo, we would anticipate as those cash flows are received to bring the securities portfolio down and fund loan growth with those, yes.\n\nDamon DelMonte -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. OK. Great. And then, I guess with respect to the margin commentary points to a higher margin going through year-end and into 2023.\n\nDo you think that you're going to end up peaking somewhere halfway through the year? Or do you think that there's still enough flexibility on the balance sheet, particularly on the funding side to keep that margin moving higher?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nIt's a difficult question, Damon, because the -- it's just a difficult question at this time, given all the uncertainty with rates what we articulated and what we can see is the rate increases that have happened and will and are expected to happen over the next couple of months will definitely improve the margin, and we can see that as you get out further, there's just the rate of the volatility and the questions around liquidity make it hard to get further out than that.\n\nDamon DelMonte -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. Fair enough. I know that wasn't an easy question. So I appreciate the response.\n\nAnd I guess just lastly, credit trends remain strong, and you kind of look at the reserve level here. Do you try to kind of hold it in this 101, 102,103 type range as you look out over the next few quarters?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nYou're asking all these very good questions that are very hard to answer, Damon. I think what we saw this quarter was that -- based on our forecast, which the forecast does not have a severe recession in it, and it does have a slowing growth and then modest recession that we didn't see a big change in ACL factors, as I said, most of the provision was due to loan growth. And that's what we saw this quarter. That's really all we know at this point.\n\nDamon DelMonte -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Sounds good. That's all that I have for now. Thanks a lot.\n\nAppreciate it.\n\nOperator\n\nThank you. The next question comes from Laurie Hunsicker, Compass Point. Please go ahead.\n\nLaurie Hunsicker -- Compass Point Research and Trading -- Analyst\n\nYes. Hi Bob, Jim. Good morning. I'm hoping you can go back to the expense guide slides or commentary.\n\nJust wanted to think about that if I'm doing the math off the operating guide that you have provided, just simply going from right in the middle, the $460 million to $500 million operating expense for full year '23 compared to '22. That's almost 9% growth and completely get your comments around the compensation growth expense of 6% to 7.5%. Just can you help us think a little bit about where that delta is going higher?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nSure. So it's primarily in -- as I tried to say, it's primarily in salaries and benefits, Laurie. There is growth in the other categories, although that's at a more modest level. But the primary increase there is in salaries and benefits.\n\nLaurie Hunsicker -- Compass Point Research and Trading -- Analyst\n\nRight. But I mean just I'm just looking off your guide, the salaries and benefits was the highest end of what you gave, which certainly makes sense given where we are with inflation. And then, everything else you said low single digits, yes, your full year expense growth guide is up almost 9%. -- you know what, maybe I can talk to you offline.\n\nI feel like I'm missing something here. I'm not quite...\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nSure. Sure. No, happy to.\n\nLaurie Hunsicker -- Compass Point Research and Trading -- Analyst\n\nYou know what, yeah, I'll follow up with you off-line. Can you talk very high level the buyback? Obviously, great to see you buying back this quarter, but it slowed pretty significantly from last quarter. Can you help us think about how you look at that going forward?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nSure. Just one reminder from the historical side, we did conclude the first repurchase and needed to get regulatory approval for the second. So there was a time period in there where we were pending regulatory approval. So there was -- just as a reminder there, there was a gap in time where we were waiting for that approval.\n\nI think going forward, it's similar to what we would have said previously, but just added the liquidity constraints. Obviously, market conditions are very important as we evaluate it, but also our capital liquidity position. And as those change, that becomes a factor in the overall decision, and we'll make those decisions as we go forward.\n\nLaurie Hunsicker -- Compass Point Research and Trading -- Analyst\n\nOK. OK. And any comments around the price, how you think about it up here?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nYes. We do kind of I would think of a standard earn back, not standard necessarily, but typical earn-back calculations. And when we've done that in the past, we've been very satisfied with that period, and that's why we've been what I would consider to be a pretty aggressive buyer of our shares. So that framework is still in place.\n\nIt's just the additional market conditions, as well as liquidity and capital.\n\nLaurie Hunsicker -- Compass Point Research and Trading -- Analyst\n\nOK. Great. And then, just jumping back over to margin, net interest income. Was there any non-accruing loan income recovery that was booked this quarter associated with your drop in nonperformers?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nThere was a modest amount, a very small amount. Laurie.\n\nLaurie Hunsicker -- Compass Point Research and Trading -- Analyst\n\nOK. OK. And then, the increase in borrowings in the quarter, can you talk a little bit about that just because your core deposits are so nice and low in cost and obviously, the borrowings aren't just how you're thinking about that or how we should think about that going forward?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nSure. So your points are well taken. And I would just say it this way. Obviously, the history of the company has been -- one of our pride points has been we've been pretty much a deposit-funded organization.\n\nSo our first goal is to continue to experience that have deposits be the vast majority of our funding. Liquidity changed pretty quickly here in the second and third quarter and really in the third quarter and late in the third quarter. As we went through our pricing strategies, we started out -- we didn't change our strategies, but the strategies that we implemented really starting in the fourth quarter was much more aggressively retained deposits. We had small outflows and that's why we need -- that's what caused the borrowings.\n\nLaurie Hunsicker -- Compass Point Research and Trading -- Analyst\n\nOK. And so, I guess more importantly, how do you think about using borrowings and going forward?\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nIt's hard to give you a short answer on that, Laurie, because across the spectrum, we've got the pricing -- deposit pricing strategies. The goals of those strategies are to retain certainly in this environment, retain and ultimately grow deposits. But there are definitely a variety of factors that go into that. We have a lot of borrowing capacity and $380 million for a balance sheet of our size, it's not a large amount at the end of the quarter.\n\nSo the balancing act there is figuring out deposit prices that can retain our existing deposits and ultimately grow them and balance that off with the borrowing capability that we have. We would hope that over time, we would continue to be as deposit funded as possible, but it's a difficult market to do that.\n\nLaurie Hunsicker -- Compass Point Research and Trading -- Analyst\n\nOK, great. Thanks for taking my question. Thank you\n\nOperator\n\nThere are no further questions at this time. I will turn the call back over to Bob Rivers for closing remarks.\n\nBob Rivers -- Chairman and Chief Executive Officer\n\nGreat. Well, thanks again, Michelle. And thanks to all of you for joining the call. Thanks very much for your questions, and we look forward to talking with you again on our next quarterly earnings call.\n\nThanks again, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBob Rivers -- Chairman and Chief Executive Officer\n\nJim Fitzgerald -- Chief Administrative Officer and Chief Financial Officer\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nDamon DelMonte -- Keefe, Bruyette and Woods -- Analyst\n\nLaurie Hunsicker -- Compass Point Research and Trading -- Analyst\n\nMore EBC analysis\n\nAll earnings call transcripts"
}