{
  "companyName": "Crescent Capital BDC, Inc.",
  "companyTicker": "CCAP",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/crescent-capital-bdc-inc-ccap-q2-2022-earnings-cal/",
  "content": "Crescent Capital BDC, Inc. (CCAP 0.08%)\nQ2 2022 Earnings Call\nAug 11, 2022, 12:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to Crescent Capital BDC, Inc.'s second quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference may be recorded. I would now like to turn the conference over to your speaker host today, Dan McMahon, head of investor relations. Please go ahead.\n\nDan McMahon -- Vice President and Head of Investor Relations\n\nGood morning, and welcome to Crescent Capital BDC, Inc.'s second quarter ended June 30, 2022, earnings conference call. Please note that Crescent Capital BDC, Inc. may be referred to as CCAP, Crescent BDC or the company throughout the call. Before we begin, I'll start with some important reminders.\n\nComments made over the course of this conference call and webcast may contain forward-looking statements and are subject to risks and uncertainties. The company's actual results could differ materially from those expressed in such forward-looking statements for any reason, including those listed in its SEC filings. The company assumes no obligation to update any such forward-looking statements. Please also note that past performance or market information is not a guarantee of future results.\n\nDuring this conference call, we may discuss certain non-GAAP measures as defined by SEC Regulation G, such as adjusted net investment income, or NII, per share. The company believes that adjusted NII per share provides useful information to investors regarding financial performance because it's one method the company uses to measure its financial condition and results of operations. A reconciliation of adjusted net investment income per share to net investment income per share, the most directly comparable GAAP financial measure can be found in the accompanying slide presentation for this call. In addition, a reconciliation of this measure may also be found in our earnings release.\n\nYesterday, after the market closed, the company issued its earnings press release for the second quarter ended June 30, 2022, and posted a presentation to the investor relations section of its website at www.crescentbdc.com. The presentation should be reviewed in conjunction with the company's Form 10-Q filed yesterday with the SEC. As a reminder, this call is being recorded for replay purposes. Speaking on today's call will be Jason Breaux, chief executive officer of CCAP; and Gerhard Lombard, chief financial officer of CCAP.\n\nWith that, I'd now like to turn it over to Jason.\n\nJason Breaux -- Chief Executive Officer\n\nThank you, Dan. Good morning, everyone. Thank you for joining our earnings call today. We appreciate your continued interest in CCAP.\n\nToday, I'll highlight our second quarter results, review our investing activity and current portfolio and then provide some thoughts on the current market backdrop. Gerhard will then review our financial results in more detail. So let's begin. Please turn to Slide 6, where you'll see a summary of our results.\n\nWe reported adjusted net investment income for the second quarter of $0.41 per share. On a GAAP basis, our second quarter net investment income was $0.50 per share. The difference relates to a $0.09 per share noncash reversal of our capital gains-based incentive fees on net unrealized capital appreciation. Our net asset value per share ended the quarter at $20.69, down just over 2% as compared to the record $21.18 per share, which we reported in the prior quarter.\n\nGerhard will touch on this in more detail, but the lion's share of the decline relates to unrealized losses we took to reflect wider credit spreads in the market as volatility within the leveraged finance and equity markets continued during the second quarter. This volatility has created an increasingly complex operating environment that many companies face in today's economy. However, our continued focus on market-leading companies with strong margins and high free cash flow generation in resilient industries has positioned our portfolio to avoid segments of the economy that are in our view, more negatively impacted by recent inflation and supply chain issues. And while certain of our companies are experiencing some margin pressure from increases in labor and input costs, our portfolio companies have largely been able to maintain solid margins.\n\nOur investment philosophy for the past 30-plus years at Crescent has been disciplined credit selection with a focus on capital preservation. It's at the core of Crescent's DNA and has led to investors entrusting us with their capital to successfully originate and manage the low investment-grade debt investments across multiple strategies and over numerous cycles. We believe this approach has resulted in an attractive, highly diversified CCAP portfolio, as highlighted on Slides 13 and 14 of the presentation. We ended the quarter with our second largest portfolio since inception, with nearly $1.3 billion of investments at fair value across 137 portfolio companies with an average investment size of less than 1% of the total portfolio.\n\nOur portfolio continues to consist primarily of senior secured first lien and unitranche first lien loans, collectively representing 88% of the portfolio at fair value, up from 86% in the prior quarter. And we remain well diversified across 18 industries and continue to lend almost exclusively to private equity-backed companies, with 98% of our debt portfolio in sponsor-backed companies as of quarter end. For the second quarter, 136 out of our 137 debt investment portfolio companies, representing over 99% of total debt investments at fair value, made full scheduled principal and interest payments. 91% of our debt investment portfolio today is marked above $0.95 on the dollar with an average mark of approximately 97.\n\nTwo more positive credit trends are outlined on Slide 17. Continued strong performance ratings and nonaccrual levels. Our weighted average portfolio grade of 2.1, was unchanged as compared to the prior quarter. And the percentage of risk rated 1 and 2 investments, the highest ratings our portfolio companies can receive, remains healthy at 89% of the portfolio at fair value.\n\nAs of quarter end, we had investments in three portfolio companies on nonaccrual status, representing 1.3% and 1.1% of our total debt investments at cost and fair value, respectively, as compared to 1.4% and 1.2% in the prior quarter. Moving to our investment activity. Please turn back to Slide 15. Gross deployment in the second quarter was $112.4 million, as you can see on the left-hand side of the page, 96% of which was in senior secured first lien and unitranche investments.\n\nAll told, we closed on 11 new and 12 follow-on investments totaling $8 million and $9 million, respectively, with the remaining $23 million coming from revolver and delayed draw term loan activity. All 11 of the new investments were first lien or unitranche private equity-backed loans with silver floors of 75 to 100 basis points, OIDs of 1% and 2% and a weighted average spread of approximately 590 basis points. In addition, loan-to-value levels remain attractive, averaging 41% for these transactions. The $112 million in gross deployment compares to approximately $97 million in aggregate exits sales and repayments in the quarter.\n\nIt's also worth highlighting that CCAP's total commitment for the aforementioned new deals represented about 10% of the over $1.1 billion total check size committed across Crescent's private credit accounts, highlighting the breadth of the platform. Moving to the right-hand side of the page, you'll see that over the past several quarters, our net investment activity has led to unitranche first lien becoming a more prominent percentage of our total portfolio. This increase from 46% a year ago to 62% today is by design as it allows us to offer even greater surety of execution to the sponsor community and enables us to enhance our yield opportunity while remaining at the top of the capital stack. We expect this trend will continue, particularly given the wind down of CBDC Senior Loan Fund, our joint venture that I've touched on in prior quarters.\n\nTo date, we sold roughly 94% of the approximately $300 million pool of first lien broadly syndicated loans within the joint venture and plan to monetize the remaining 6% and formally wind down the entity in the coming months. We made our first liquidating distribution during the second quarter and expect to distribute the remaining proceeds, which were marked at approximately $19 million as of quarter end by the end of this year. A few more items before I turn it over to Gerhard. First, I'd like to highlight the impact of Federal Reserve's rapid interest rate hikes have had and will most likely continue to have on us.\n\nAs of June 30, 98.7% of our debt investments at fair value were floating rate with a weighted average floor of 83 basis points, which compares to our 72% floating rate liability structure with no floors. This situates us well to benefit from increases in market interest rates above our average floors as was the case this quarter with growth in our interest income line item despite relatively modest net investment activity. If the full impact of the market rate moves this quarter had flowed through the entire quarter, we calculate that our second quarter adjusted net investment income per share would have been $0.07 higher. Additionally, as of quarter end, holding all else equal and after considering the impact of income-based incentive fees, we calculate that a 100 basis point increase in short-term rates could increase our annual earnings by approximately $0.20 per share, which would represent an 11 and a half percent lift to our LTM adjusted net investment income per share.\n\nIn terms of the impact of rising rates on our debt investments, we continue to believe we've constructed a highly diversified and defensive portfolio. And sitting here today, do not observe any meaningful credit deterioration. Our debt investments ended the quarter with a weighted average interest coverage ratio of 2.7 times. Holding all else equal, including leverage at the borrower level, short-term base rates will need to rise by over 2% before aggregate interest coverage would dip below two times.\n\nWe feel good about the ability of our portfolio companies to navigate a higher rate environment and have developed a toolkit over Crescent's 30-year operating history to effectively navigate through periods of heightened volatility. Finally, for the third quarter of 2022, our board declared a $0.41 per share quarterly cash dividend, which will be paid on October 17 to stockholders of record as of September 30. Additionally, the fourth and final previously declared $0.05 per share special cash dividend will be paid on September 15 to stockholders of record as of September 2. So with that, I'll turn the call over to Gerhard to cover some more details on the second quarter.\n\nGerhard?\n\nGerhard Lombard -- Chief Financial Officer\n\nThanks, Jason, and good morning, everyone. Our adjusted net investment income per share of $0.41 for the second quarter of 2022 compares to $0.42 per share for the prior quarter. Total investment income of $26.8 million for the second quarter compares to $26.4 million for the prior quarter, which includes approximately $2 million of nonrecurring income related to our exit from an investment during Q1. Importantly, interest income, excluding onetime accelerated amortization which represents the recurring component of our total revenues, grew from $21.7 million in Q1 to $22.8 million for the second quarter and was a key driver of quarter over quarter total investment income growth.\n\nWe expect our recurring interest income to continue to increase into the second half of 2022 on the heels of the rate hikes we've seen and may continue to see in the near future. We have yet to see the full quarter benefit from higher market rates that have already occurred in the second quarter as most of our portfolio base rates repriced either monthly or quarterly. The increase in base rates through these resets generally occurred in the latter part of the quarter, which is why our second quarter earnings did not fully benefit from the increase in market rates reflected in our yields at quarter end. Dividend income came in at $2.1 million for the second quarter of 2022 as compared to $2.3 million in the prior quarter, and other income was up modestly quarter over quarter from $0.1 million to $0.2 million.\n\nOur GAAP earnings per share or net decrease in net assets resulting from operations for the second quarter of 2022 was minus $0.03 per share as compared to $0.52 per share increase from the prior quarter. Our GAAP earnings included net realized and unrealized losses on investments of $0.53 per share. At June 30, our stockholders' equity was $639 million, resulting in net asset value per share of $20.69 as compared to $654 million or $21.18 per share last quarter and $591 million or $20.98 per share at June 30, 2021. We net deployed $33 million into private credit investments before approximately $18 million of continued wind down from our joint venture, which predominantly invested in broadly syndicated bank loans.\n\nOur total investment portfolio at fair value of $1.3 billion as of June 30, 2022, was down approximately $3 million quarter over quarter given unrealized mark-to-market losses on our investments. I want to underscore the importance of our valuation process, which seeks to accurately mark each investment in our portfolio each quarter. Our net decline this quarter is not, in our view, a reflection of deteriorating credit quality in our portfolio, but rather the widening credit spread environment, which impacted marks. This dynamic is evidenced by our internal portfolio ratings at the end of the second quarter, consistent with prior quarters, was roughly 90% of the portfolio rated 1 or 2, our highest rating categories.\n\nWe believe this is an important distinction to highlight for shareholders in a volatile market environment. Turning to Slide 16. This graph summarizes the weighted average yield on income-producing securities and spread over LIBOR of our floating rate debt investments. As of June 30, 2022, the weighted average yield on our income-producing securities at amortized cost was 8.3%, up from 7.5% in the prior quarter.\n\nAs we've discussed, we remain well positioned to benefit from a rising rate environment, and we remain comfortably passed the interest rate floors for all our investments. Now, let's shift to our capitalization and liquidity. I'm on Slide 19. As of June 30, our debt-to-equity ratio was 1.03 times, up modestly from 0.97 times at March 31, but still well below our longer-term target range.\n\nThe weighted average stated interest rate on our total borrowings was 4.2% as of quarter end. We expect that near-term all deployment activity will be financed by our attractively priced secured facilities. As you can see on the right-hand side of the slide, we have a low level of debt maturities over the next two years with no maturities this year and $150 million maturity related to our 5.95% unsecured notes in July 2023, which can be redeemed at par plus accrued interest on January 30, 2023, without penalty. After that, there are no remaining term maturities until 2026.\n\nFrom a liquidity perspective, as of quarter end, we had $228 million of undrawn capacity subject to leverage, borrowing base and other restrictions and $19 million of cash and cash equivalents. Expected proceeds from the wind down of our joint venture, as Jason discussed, will provide for incremental liquidity. On August 5, our board of directors declared a third quarter cash dividend of $0.41 per share, which is consistent with the regular quarterly cash dividend paid in the prior quarter augmented by the fourth and final special cash dividend. And with that, I'd like to turn it back to Jason for closing remarks.\n\nJason Breaux -- Chief Executive Officer\n\nThanks, Gerhard. We continue to believe that CCAP remains well positioned to navigate the economic and market uncertainty ahead. While we do anticipate further market volatility and the potential for spread widening as the cycle progresses, we feel good about our current portfolio and our ability to lean into attractive opportunities created during periods of dislocation, while, of course, maintaining the same rigorous underwriting standards we've always implemented. I wanted to close by highlighting that based on where CCAP is currently trading and based on our stated regular dividends, CCAP stock is currently yielding nearly 10% on a portfolio of well-performing, primarily first lien and unitranche term loans, which we believe is a compelling relative value in the current environment.\n\nWe would like to thank all of you for your confidence and continued support. And with that, operator, please open the line for questions.\n\nOperator\n\n[Operator instructions] Our first question coming from the line of Robert Dodd from Raymond James. Your line is open.\n\nRobert Dodd -- Raymond James -- Analyst\n\nHi, guys, and congrats on the quarter. First, the two topics I want to touch on. And Jason, your wind up remarks kind of touch on spreads. Spreads on your originations in Q2 were basically stable with where they've been in Q4, Q1.\n\nIs that a function of just the lag, right, the traditional private credit lag? And are you seeing in the market today, spread widening, changes in terms, etc., etc.? I guess tied in with that is given the lag, do you expect new originations that have the highest spreads in Q3 or is that more going to be a Q4 thing, etc.?\n\nJason Breaux -- Chief Executive Officer\n\nHey, Robert. Thanks for the question. It's a great question. I think it's largely attributable to the lag, which we've talked about before in terms of the private markets catching up to perhaps what we're seeing more on the liquid side of things.\n\nAnd I would say, over the past months, maybe month and change, spreads in the private markets have widened out in terms of the opportunity set that we're looking at. What was maybe 550, 575 deal is looking more like a 625, 650 deal. In addition to that, and this is largely because I think the syndicated loan market is shut down, given the volatility in the markets and the time of the year, frankly. We are, I would say, getting potentially better protection and terms than we would have otherwise gotten.\n\nI think we're able to tighten up documents a bit. There's more focus on the lender side in current and projected cash flow coverage, certainly. And I think as a result of that focus and the shutdown in the BSL market, we've been able to get better terms with respect to incurrence tests and baskets and EBITDA definitions. So I think that's all moving in a favorable direction from a lender standpoint in real time.\n\nRobert Dodd -- Raymond James -- Analyst\n\nI appreciate that color. On the next one, I got to ask about credit quality. I mean, you mentioned at the very beginning, certain companies are experiencing margin pressure. And then later on, you said do not observe a, and key word meaningful credit deterioration.\n\nSo the implication you are seeing some in terms of maybe some at some companies or some more broadly sort of inflation? It's meaningful. It's obviously a significant word. Can you give us any more color on any thematic things you are seeing? I mean there's obviously supply chain and labor, but is that it? And to that point, have you started to see the advantage of private credit, you can pick up the phone and call the companies which are BSL and they can't necessarily do. Have you heard anything incrementally more recently about directions in those trends?\n\nJason Breaux -- Chief Executive Officer\n\nYeah, Robert, I would say nothing to call out specifically by industry or by portfolio company size. I would say, portfolio largely is performing well on the top line across the board, where maybe we saw higher growth rates year over year last year on the top line than maybe we're seeing this year, which may not be totally surprising, but I would say top lines are still pretty healthy. On the cost side of things, that is where we do see some pressure in certain segments, certain companies. The wage inflation is real.\n\nAnd I think retention is also a challenge in some instances. That said, the retention challenges are largely at the more entry-level positions within our portfolio companies as opposed to the highly skilled end of things. So yes, there are challenges. Yes, we are facing some wage pressure in some of our portfolio companies.\n\nBut I think it's -- fortunately, it's -- when it comes to the retention side, it's not -- those aren't extremely difficult positions to refill when the turnover comes.\n\nRobert Dodd -- Raymond James -- Analyst\n\nGot it, got it. I appreciate that color. I mean -- and then just on kind of your thoughts, I mean, M&A activity is lower this year. I mean it was obviously very high last year.\n\nIt is down a little bit because syndicated markets have been closer, private lending has been gaining share. But I mean looking forward and not Q3, like the next 12 to 18 months, I mean, do you expect kind of a steady recovery there? Or is it just -- it's just too hard to say given the amount of volatility in the market right now? It's really a question about sponsor activity rather than lending activity per se.\n\nJason Breaux -- Chief Executive Officer\n\nYeah, there's certainly a lot of uncertainty with respect to deal flow for the balance of the year. I think much of it is going to depend on the economy and the macroeconomic environments with what the Fed continues to do or stop doing where inflation goes, the Russia conflict, consumer spending, midterm elections. I think if these factors caused the economy to worsen significantly, I think it's likely that deal flow will slow materially as it's going to be hard for buyers and sellers to come together on purchase price. And frankly, financing providers are going to be increasingly conservative when giving leverage REITs.\n\nIf, however, we are headed down to more soft landing path where the downturn is maybe perhaps moderate, I think we could see private market activity continue to be good from a deal flow standpoint just because of the amount of private equity capital that's still on the sidelines to be deployed. One more thing that I would just say, Robert, is that when it comes to the syndicated market, we do believe, and we're hearing that there's $50-plus billion of transactions that are coming post Labor Day from the banks, which I think could put some continued pressures on that market and pricing in that market as it's going to take some time to absorb that supply that we're hearing is going to come.\n\nRobert Dodd -- Raymond James -- Analyst\n\nThank you for all that detail. I appreciate it. Thanks a lot.\n\nJason Breaux -- Chief Executive Officer\n\nSure. Thank you.\n\nOperator\n\n[Operator instructions] Our next question coming from the line of Jordan Wedson from Wells Fargo. Your line is open.\n\nUnknown speaker\n\nHi. Good morning. Just a question on market dynamics. The syndicated markets are closed, I guess, for now, and direct lenders are filling that gap.\n\nSo I'm just curious what that's done for kind of your core middle market? Has all that activity up market from direct lenders kind of created a vacuum in the core middle market? Or are you seeing just so much competition there has always been there?\n\nJason Breaux -- Chief Executive Officer\n\nHey, Jordan. It's Jason. Thanks for the question. I think there's a few factors going on to maybe provide some color on to help answer your question.\n\nOne is the inflows have slowed into not just the syndicated market certainly but also the private markets as well. So there are platforms that have relied heavily on retail for capital raising. And I think that slowed materially. And in addition to that, the institutional accounts, I think, are slowing their pace down in terms of committing less, folks are dealing with the denominator effect as well in that regard.\n\nSo I think the -- from a competitive standpoint, that's a dynamic that I think is playing out. In terms of the overall opportunities that we're seeing, typically, in periods of volatility, particularly when the syndicated markets shut down, that's a good time from an opportunity set standpoint for private credit because those that need to finance are steered toward private credit, even if they could otherwise have the syndicated markets in a healthy environment. So I would say the quality of the deal flow can oftentimes improve in this type of environment for private credit lenders. Now that doesn't mean that everybody is moving upmarket because the other sort of contributing factor to inflows coming down as that whole levels are coming down in the private market, too.\n\nSo folks that were speaking for several hundred million dollars on the high end are perhaps downsizing their check size, which means larger unitranches are getting filled with more lenders than they used to be in a more robust environment. So kind of a long-winded way of saying that I think that we're going to continue to see opportunities across the middle market. I think perhaps the quality of the opportunities that we'll see might be a little bit higher in a more volatile period. And for us, I think it's incumbent on us to just be super selective in this environment and pick our spots in terms of where we can generate really attractive risk/return investments.\n\nUnknown speaker\n\nOK. Thank you. It's really helpful. And that's all for me.\n\nOperator\n\n[Operator instructions] I am showing no further questions at this time. I would now like to turn the call back over to Mr. Jason Breaux for any closing remarks.\n\nJason Breaux -- Chief Executive Officer\n\nOK. Thank you very much, operator, and thank you all for joining the call. We appreciate your continued interest and support in CCAP, and we look forward to speaking with you soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDan McMahon -- Vice President and Head of Investor Relations\n\nJason Breaux -- Chief Executive Officer\n\nGerhard Lombard -- Chief Financial Officer\n\nRobert Dodd -- Raymond James -- Analyst\n\nUnknown speaker\n\nMore CCAP analysis\n\nAll earnings call transcripts"
}