{
  "companyName": "NextEra Energy Partners",
  "companyTicker": "NEP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/nextera-energy-partners-nep-q3-2022-earnings-call/",
  "content": "NextEra Energy Partners (NEP -1.03%)\nQ3 2022 Earnings Call\nOct 28, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the NextEra Energy and NextEra Energy Partners third quarter 2022 earnings conference call. [Operator instructions] Please note that this event is being recorded. I would now like to turn the conference over to Jessica Geoffroy, director of investor relations. Please go ahead.\n\nJessica Geoffroy -- Head of Investor Relations\n\nThank you, Matt. Good morning, everyone, and thank you for joining our third quarter 2022 combined earnings conference call for NextEra Energy and NextEra Energy Partners. With me this morning are John Ketchum, chairman, president and chief executive officer of NextEra Energy; Kirk Crews, executive vice president and chief financial officer of NextEra Energy; Rebecca Kujawa, president and chief executive officer of NextEra Energy Resources; and Mark Hickson, executive vice president of NextEra Energy, all of whom are also officers of NextEra Energy Partners; as well as Eric Silagy, chairman, president and chief executive officer of Florida Power & Light Company. Kirk will provide an overview of our results, and our executive team will then be available to answer your questions.\n\nWe will be making forward-looking statements during this call based on current expectations and assumptions, which are subject to risks and uncertainties. Actual results could differ materially from our forward-looking statements if any of our key assumptions are incorrect or because of other factors discussed in today's earnings news release and the comments made during this conference call in the Risk Factors section of the accompanying presentation or in our latest reports and filings with the Securities and Exchange Commission, each of which can be found on our websites, nexteraenergy.com and nexteraenergypartners.com. We do not undertake any duty to update any forward-looking statements. Today's presentation also includes references to non-GAAP financial measures.\n\nYou should refer to the information contained in the slides accompanying today's presentation for definitional information and reconciliations of historical non-GAAP measures to the closest GAAP financial measure. As a reminder, Florida Power & Light completed the regulatory integration of Gulf Power under its 2021 base rate settlement agreement and began serving customers under unified rates on January 1, 2022. As a result, Gulf Power is no longer a separate reporting segment within Florida Power & Light and NextEra Energy. For 2022 and beyond, FPL has one reporting segment.\n\nAnd therefore, 2021 financial results and other operational metrics have been restated for comparative purposes. With that, I will turn the call over to Kirk.\n\nKirk Crews -- Executive Vice President and Chief Financial Officer, NextEra Energy\n\nThank you, Jessica, and good morning, everyone. Before I begin today's discussion of our third quarter results, I would like to extend our deepest sympathies to all those who have been affected by the widespread destruction caused by hurricanes Fiona and Ian over the last month. Hurricane Ian was the fifth strongest hurricane to ever make landfall in the Continental U.S. The powerful and destructive storm hit Southwest Florida as a high-end Category 4 hurricane with sustained winds of approximately 150 miles per hour, devastating storm surges and numerous tornadoes, tragically resulting in the loss of lives and causing more than 2.1 million FPL customers to lose power.\n\nIn preparation for the hurricane, FPL assembled a restoration workforce of approximately 20,000 workers. This preparation and coordinated response, combined with FPL's valuable hardening and smart grid investments, enabled the company to restore service to roughly two-thirds of affected customers after the first full day of restoration following Hurricane Ian's landfall. This represents the fastest restoration rate in our history for a major hurricane. Our dedicated and resourceful workforce was able to restore essentially all FPL customers who are able to safely accept power within eight days.\n\nI would like to thank all of our employees who made personal sacrifices leaving their own homes to serve our customers, our communities and our state. It was because of their training, their preparation their dedication and their commitment that we were able to restore power to our customers so quickly. I would also like to thank other members of the restoration team, including the contractors, vendors and first responders that supported our efforts, for their dedicated assistance during this critical time. Finally, we are deeply grateful for the assistance provided by our industry partners who came from 30 different states to help support our customers.\n\nMutual aid in times of disaster is one of the hallmarks of our industry, and this storm was no exception. For nearly two decades, FPL has invested significantly in building a stronger, smarter and more storm-resilient grid. While no energy grid is hurricane-proof, the performance of our system demonstrates that FPL's hardening and undergrounding investments are providing significant benefits to our customers. Despite sustained winds of approximately 150 miles per hour, FPL did not lose a single transmission pole or tower during Hurricane Ian.\n\nAdditionally, initial performance data show that FPL's undergrounding distribution power lines performed five times better in terms of outage rates than existing overhead distribution power lines in Southwest Florida. On a related note, we were pleased that the Florida Public Service Commission substantially approved our 2023 storm protection plan earlier this month, which we expect will lead to an even stronger and more resilient grid for the benefit of our customers. Finally, we are proud to report that our generation fleet, including our solar sites, sustained almost no structural damage. Despite 38 of FPL's 50 existing solar sites or approximately 12 million panels being exposed to storm conditions, less than 0.3% of our solar panels were affected, and those impacted were mostly at our older fixed racking sites.\n\nOur battery storage sites, including one of the world's largest solar power batteries at our Manatee Solar Energy Center, remained available throughout the storm. We believe these investments, together with our preparation and coordinated response, have improved FPL's overall reliability and resiliency, providing significant value to our customers. Although FPL has not completed the final accounting, our preliminary estimate of Hurricane Ian restoration costs that we plan to recover from customers through a surcharge is approximately $1.1 billion, of which approximately $220 million will be utilized to replenish the storm reserve, subject to a review and prudence determination of our final storm cost by the Florida Public Service Commission. Under its current settlement agreement, FPL is allowed to collect an equivalent of $4 for every 1,000 kilowatt hours of usage on residential bills but can request an increase to the $4 equivalent surcharge given the cost exceeded $800 million.\n\nWe anticipate discussing the surcharge amount and timing with the Florida Public Service Commission in the coming months. Let me briefly comment on the Inflation Reduction Act, or IRA, and what it means for our customers, for our company and for our industry. At our investor conference in June, we announced our vision to lead the decarbonization of the U.S. economy, and we announced our industry-leading goal to deliver real zero emissions by no later than 2045.\n\nWe discussed our strategy to get there and how every part of our strategy is focused on saving customers' money on their energy bills. We also said in June that achieving our goals would require constructive governmental policies and incentives. The IRA gives us those policies and incentives at the federal level. It also gives us visibility into what those policies and incentives will look like for what we believe will be more than two decades.\n\nWe believe that the IRA will not only help reduce carbon emissions, strengthen energy independent and security, and create jobs in our industry and in our domestic supply chain, but also and most importantly will reduce the cost of energy for everyone. We can already see some of the positive impacts of the IRA on customer bills at FPL. Last month, we filed with the Florida Public Service Commission our estimate that the solar production tax credits in the IRA are expected to save customers nearly $400 million over the course of our current rate agreement. Those savings start with a onetime $25 million refund through the capacity cost recovery clause in January 2023 to reflect the solar PTCs on our completed 2022 rate-based solar projects, subject to a review by the commission, which we expect later this year.\n\nLooking forward for our FPL customers, we believe that the IRA makes every solar project, every battery storage project, every renewable gas project and every green hydrogen project more cost-effective. And these solar battery storage, renewable gas and green hydrogen projects are designed to reduce the impact that fuel volatility can have on customer bills. We believe the IRA will help make Florida an even better place to raise a family or build a business as we work toward our goal of delivering 100% carbon emissions free energy affordable and reliably. We believe the IRA will also make clean energy cheaper for our customers at Energy Resources.\n\nWe have never been more excited about our opportunity to partner with customers to decarbonize the power sector as well as broader parts of the U.S. economy. The IRA provides decades of visibility to low-cost renewables, and that visibility has already encouraged our power sector customers and customers outside the power sector to think big about how they can realize the value of renewables to reduce cost and emissions. As a world leader in renewables with deep energy market expertise, we were having conversations with customers about large-scale opportunities unlike anything we have seen in the past.\n\nAnd while some will take time to develop, we cannot be more excited about the future. Turning now to our financial performance. NextEra Energy delivered strong third quarter results, with adjusted earnings per share increasing by approximately 13% year over year. FPL increased earnings per share by $0.07 year over year, growing regulatory capital employed by approximately 11% over the prior-year period.\n\nWe have highlighted in the past our smart capital investments in fuel efficiency, combined with our best-in-class O&M performance and productivity initiatives, provide significant benefits to customers and have allowed us to continue to deliver residential bills well below the national average and the lowest among all of the Florida investor-owned utilities. At Energy Resources, adjusted earnings per share increased by $0.06 year over year. We continue to capitalize on a terrific environment for renewables development, originating approximately 2,345 megawatts of new renewables and storage since the last call. With economics as a significant driver, Energy Resources continues to capitalize on strong renewables demand from both power and non-power sector customers, particularly in light of high power prices and high natural gas prices.\n\nOverall, we are well positioned to achieve our long-term financial expectations, subject to our usual caveats. For the third quarter of 2022, FPL reported net income of nearly $1.1 billion or $0.54 per share, which is an increase of $147 million and $0.07 per share, respectively, year over year. Regulatory capital employed increased by approximately 11% over the same quarter last year and was the principal driver of FPL's earnings-per-share growth of approximately 15%. FPL's capital expenditures were approximately $2 billion in the third quarter, and we continue to expect our full year capital investments to total roughly $8.5 billion.\n\nFPL's reported ROE for regulatory purposes is expected to be approximately 11.8% for the 12 months ended September 2022. Largely as a result of warm weather, we have fully restored our surplus depreciation reserve, leaving FPL with a balance of approximately $1.5 billion to use over the term of the current settlement agreement. As a reminder, our 2021 settlement agreement provided a mechanism whereby a sustained increase in 30-year Treasury Bond yields would trigger an increase in FPL's authorized ROE range. Accordingly, the Florida Public Service Commission approved an increase in FPL's authorized midpoint ROE from 10.6% to 10.8% with an allowed range of 9.8% to 11.8%, which became effective on September 1, 2022.\n\nImportantly, FPL will not increase base rates as a result of triggering the increased authorized ROE. For the full year 2022, FPL continues to target an 11.6% ROE but is allowed to earn at the high end of the revised range, which may occur based on, among other things, warmer-than-expected weather. The Florida economy continues to be healthy. Florida's unemployment rate of approximately 2.7% remains below the national average and at its lowest level in more than 15 years.\n\nFlorida's labor force participation rate remains strong. In spite of significant inflationary pressures across many parts of the U.S., customer sentiment and Florida ticked up slightly in the third quarter. However, the August reading of the three-month average of new building permits in Florida declined year over year, which is not a surprise given the significant growth we have observed since the pandemic and the recent increase in mortgage rates. We continue to believe that Florida offers a unique value proposition and will continue to show strong population growth over the coming decades.\n\nFPL's average number of customers increased by nearly 83,000 or 1.5% versus the comparable prior-year quarter driven by continued strong underlying population growth. FPL's third quarter retail sales increased 3.8% from the prior-year comparable period. For the third quarter, we estimate that warmer weather had a positive year-over-year impact on usage per customer of approximately 2.9% and that Hurricane Ian had a negative impact of approximately 0.4%. After taking these factors into account, third quarter retail sales increased 1.3% on a weather-normalized basis, with a strong continued customer growth contributing favorably.\n\nEnergy Resources reported third quarter 2022 GAAP earnings of $655 million or $0.33 per share. Adjusted earnings for the third quarter were adjusted earnings per share of more than 19% year over year. Contributions from new investments increased $0.02 per share versus the prior year, primarily reflecting continued growth in our renewable portfolio. Our existing generation and storage assets decreased results by $0.02 per share, primarily due to unfavorable wind resource during the third quarter, which was the third lowest wind resource quarter on record over the past 30 years.\n\nOur customer supply and trading business contributed $0.06 year over year primarily due to higher margins in our customer-facing businesses. All other net impacts were roughly flat year over year. Additional details of our third quarter results are shown on the accompanying slide. As I mentioned earlier, Energy Resources had another terrific quarter of origination, signing approximately 2,345 gigawatts of new renewables and storage projects since our last earnings call.\n\nSpecifically, we originated approximately 1,215 megawatts of wind, 965 megawatts of solar and 165 megawatts of battery storage projects. Included in these solar additions is approximately 270 megawatts of post-2025 delivery. With these new additions, net of approximately 1.3 gigawatts of projects placed in service and roughly 680 megawatts of projects removed from our backlog, our renewables and storage backlog now stands at roughly 20,000 megawatts and provides strong visibility into the significant growth that is expected at Energy Resources over the next few years. Our development expectations through 2025 are unchanged from what we disclosed at our investor conference in June and reflect a planned renewables and storage build that is, at the midpoint, more than 20% larger than the entire renewables operating portfolio at Energy Resources today.\n\nThe accompanying slide provides additional details on where our development program at Energy Resources now stands. As previously discussed, we believe Energy Resources is better positioned than anyone in our sector to benefit from the provisions of the IRA, particularly after 2025 when incentives were previously expected to expire or step down. With what we believe is over two decades of visibility for wind, solar and storage credits, the long-term growth opportunity set is expansive and exciting. Energy Resources is uniquely positioned to capitalize on battery storage colocation opportunities with wind and now has repowering opportunities across this existing renewables footprint.\n\nNew markets and new investment opportunities are being created for renewables and renewable fuels that require wind and solar as their source. Transmission will be needed to support this significant renewables buildout. And all these opportunities support our vision of leading decarbonization of the U.S. economy.\n\nA key component of our vision is helping commercial and industrial customers meet their sustainability goals by providing them with comprehensive clean energy solutions, including providing renewable fuel alternatives such as hydrogen and renewable natural gas. To that end, today, we are excited to announce we reached an agreement to acquire a large portfolio of operating landfill gas to electric facilities, which will become a core part of our renewable fuels and potentially hydrogen strategies. This transaction represents an attractive opportunity for Energy Resources to expand its portfolio of renewable natural gas assets and grow its in-house capabilities in this rapidly expanding market. Energy Resources intends to purchase the portfolio for a total consideration of approximately $1.1 billion, subject to closing adjustments, plus the assumption of approximately $37 million in existing project finance debt estimated at the time of closing.\n\nSubject to regulatory approvals, the acquisition is expected to close in early 2023. In the coming years, we expect to invest roughly $400 million net of the investment tax credit benefit of additional capital into the portfolio of projects, primarily to enable production of renewable natural gas. In our base case, we expect that the acquired portfolio delivered more than $220 million of adjusted EBITDA at Energy Resources by 2025, which is included in our financial expectations. Moreover, the acquisition is expected to deliver double-digit returns.\n\nWe are particularly excited about additional upside opportunities the portfolio may enable that are not included in our base case and look forward to potentially deploying additional capital and new ventures that may qualify for new federal incentives. Turning now to the consolidated results for NextEra Energy. For the third quarter of 2022, GAAP net income attributable to NextEra Energy was roughly $1.7 billion or $0.86 per share. NextEra Energy's 2022 third quarter adjusted earnings and adjusted EPS were approximately $1.683 billion and $0.85 per share, respectively.\n\nAdjusted results for the Corporate and Other segment decreased by $0.03 year over year. A hallmark of our business is our financial discipline and forward planning as we grow the business, including the consideration of a range of scenarios to manage interest rate risk. In recent years, we've proactively engaged in liability management initiatives, which we expect to yield significant interest cost savings through 2025. Additionally, we have $15 billion of interest rate swaps to manage interest rate exposure on future debt issuances.\n\nWith the swaps in place, we're in good shape to manage 2023 and 2024 maturities and new debt issuances despite the current interest rate environment. Finally, the recent increase in interest rates is taken into account in our financial expectations. Our long-term financial expectations through 2025 remain unchanged. For 2022, NextEra Energy expects adjusted earnings per share to be in a range of $2.80 to $2.90.\n\nFor 2023 and 2024, NextEra Energy expects adjusted earnings per share to be in the ranges of $2.98 to $3.13 and $3.23 to $3.43, respectively. For 2025, we expect to grow 6% to 8% off the 2024 adjusted earnings per share range, which translates to a range of $3.45 to $3.70. We will be disappointed if we are not able to deliver financial results at or near the top end of our adjusted earnings per share expectation ranges for 2022 through 2025, while at the same time, maintaining our strong balance sheet and credit ratings. Inclusive of the increases in our expectations in both January and June of this year, NextEra Energy's adjusted earnings per share expectations reflect a roughly 10% compound annual growth rate from 2021 to the high end of our range for 2025.\n\nIn addition, for 2021 to 2025, we continue to expect our average annual growth and operating cash flow will be at or above our adjusted EPS compound annual growth rate range. We also continue to expect to grow our dividends per share at a roughly 10% rate per year through at least 2024 off a 2022 base. As always, our expectations assume normal weather and operating conditions. Now, let's turn to NextEra Energy Partners, which delivered strong financial performance for the quarter.\n\nThird quarter adjusted EBITDA and cash available for distribution were up approximately 13% and 17%, respectively, against the prior-year comparable quarter. Last week, the NextEra Energy Partners board declared a quarterly distribution of 78.75 cents per common unit or $3.15 per common unit on an annualized basis, up approximately 15% from a year earlier. Inclusive of this increase, NextEra Energy Partners has now grown its distribution per unit by approximately 320% since the IPO. NextEra Energy Partners continued to execute against its growth initiatives during the quarter.\n\nSince the last earnings call, NextEra Energy Partners completed its previously announced acquisition of an approximately 67% interest in a 230-megawatt 4-hour battery storage facility in California from Energy Resources. This acquisition further diversifies NextEra Energy Partners portfolio into battery storage. During the quarter, NextEra Energy Partners issued approximately $145 million in new equity through its at-the-market program and used these proceeds, along with cash on hand, to fund this acquisition. Consistent with our long-term growth prospects, today, we are also introducing year-end 2023 run rate expectations, which are built upon NextEra Energy Partners' strong existing portfolio and cash flow generation potential and continued ability to access low-cost capital to acquire accretive renewable energy projects.\n\nAt the midpoints, NextEra Energy Partners' new year-end 2023 run rate expectation ranges reflect estimated growth in adjusted EBITDA and cash available for distribution of roughly 23% and 12%, respectively, from the comparable year-end 2022 run rate expectations. Overall, we are pleased with the year-to-date execution at NextEra Energy Partners and believe we are well positioned to continue delivering LP unitholder value going forward. Turning to the detailed results. NextEra Energy Partners' third quarter adjusted EBITDA was $377 million, and cash available for distribution was $185 million.\n\nNew projects, which primarily reflect contributions from approximately 2,400 net megawatts of new long-term contracted renewable projects acquired in 2021, contributed approximately $66 million of adjusted EBITDA and $23 million of cash available for distribution. The third quarter adjusted EBITDA contribution from existing projects declined by approximately $18 million year over year driven primarily by unfavorable renewable resource. Wind resource for the third quarter of 2022 was approximately 95% of the long-term average versus 101% in the third quarter of 2021. Third quarter cash available for distribution benefited from higher year-over-year PayGo payments from both new and existing projects after a relatively strong wind resource period in the first half of this year.\n\nAdditional details of our third quarter results are shown on the accompanying slides. From a base of our fourth quarter 2021 distribution per common unit at an annualized rate of $2.83, we continue to see 12% to 15% growth per year in LP distributions per unit as being a reasonable range of expectations through at least 2025. We expect the annualized rate of the fourth quarter 2022 distribution that is payable in February of 2023 to be in the range of $3.17 to $3.25 per common unit. Additional details of our long-term distribution per unit expectations are shown on the accompanying slide.\n\nNextEra Energy Partners continues to expect year-end 2022 run rate adjusted EBITDA and cash available for distribution in the ranges of $1.785 billion to $1.985 billion and $685 million to $775 million, respectively, reflecting calendar year 2023 contributions from the forecasted portfolio at the end of 2022. At year-end 2023, we expect the run rate for adjusted EBITDA to be in the range of $2.22 billion to $2.42 billion and run rate for cash available for distribution to be in the range of $770 million to $860 million. These expectations highlight our continued confidence in NextEra Energy Partners' ability to deliver on its long-term distribution per common unit growth expectations. As a reminder, all of our expectations are subject to our normal caveats and include the impact of anticipated IDR fees as we treat these as an operating expense.\n\nNextEra Energy Partners is well positioned to manage financing costs in the current interest rate environment. Approximately 98% of NextEra Energy Partners long-term debt, including current maturities, is not exposed to fluctuations in interest rate as it is either fixed rate debt or financially hedged. Moreover, NextEra Energy Partners has $6 billion of forward starting interest rate swaps, which will help mitigate the impact of higher interest rates on future debt issuances, whether for growth or maturities. NextEra Energy Partners also has no significant debt maturities in '23, and debt maturities over the next five years are manageable in -- with the forward starting swaps.\n\nFinally, I'd like to close with a few words about how we expect the IRA may benefit NextEra Energy Partners and its LP unitholders. In response to the extension and expansion of clean energy tax credits, we anticipate an acceleration of renewables and storage deployment in the U.S. over the next few decades. In turn, we expect that NextEra Energy Partners will continue to have ample opportunities to acquire assets from both Energy Resources and from third parties.\n\nAdditionally, we believe that the long-term organic growth potential for NextEra Energy Partners has increased, with potential new opportunities to repower its roughly 8 gigawatt existing wind and solar assets and to pair battery storage with this nearly 7 gigawatt existing wind portfolio. Considering the potential impacts of the IRA, our expectation regarding the overall tax position for NextEra Energy Partners remains largely unchanged, including that it is not expected to pay any meaningful taxes for at least the next 15 years. Combined with its current yield and the expectation of 12% to 15% annual distributions per unit growth through at least 2025, NextEra Energy Partners has the potential to deliver a total after-tax return of approximately 20% annually through this time frame. With the ongoing strength of the renewables development environment and all of the market tailwinds provided by the IR, we believe that NextEra Energy Partners remains well positioned to continue delivering on its unitholder value proposition.\n\nIn summary, we continue to believe that both NextEra Energy and NextEra Energy Partners have some of the best execution track records in the industry, and we are extremely excited about the long-term growth prospects for both businesses and the value we can continue to create for both customers and shareholders. That concludes our prepared remarks. And with that, we will open the line for question.\n\nOperator\n\n[Operator instructions] And our first question will come from Steve Fleishman with Wolfe Research. Please go ahead.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nYeah. Hi, good morning. Thanks. So just first on the -- last quarter, you had mentioned the two gigawatts of potential backlog that could be at risk due to circumvention and the like.\n\nAnd I don't see any updated footnotes on that. So I don't know if that's resolved or -- could you give us an update on those two gigawatts?\n\nRebecca Kujawa -- President and Chief Executive Officer, NextEra Energy Resources\n\nGood moring, Steve. It's Rebecca. And I'd be happy to start with that answer. First, let me start with the most important part, which is everything that we're seeing at this point in terms of origination at Energy Resources is just terrific.\n\nWe're seeing strong demand across all the technologies, strong demand across the different customer groups and strong demand across the country. And I feel terrific about meeting the long-term expectations that we've laid out, including reiterating today of the 27.7 to 36.9 gigawatts of new projects put into service between '22 and '25. And I think the origination for this quarter of the over 2,300 megawatts is a great sign to that, and the momentum remains very strong. As you know and appreciate being involved in the development process, there's always some things that can go wrong as you move forward with developing a project where it could be unforeseen permitting or interconnection issues or something else that gets in the way.\n\nAnd so occasionally, we do remove projects from backlog like we did today. We didn't include the reference to the two gigawatts mostly because it's going to be harder and harder as time goes by to identify what's related to issues from circumvention and supply chain versus normal development issues. So I think I'd lean more on the side of giving you context for what's going on against our expectations, what's the current momentum. And both of those are just terrific.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nOK. That's good. And I guess just specific to supply chain, any updated things that you're seeing related to UFLPA impacts?\n\nRebecca Kujawa -- President and Chief Executive Officer, NextEra Energy Resources\n\nYes, Steve. It continues to be an opportunity for our team to work through challenges that we're experiencing along with the rest of the industry. We've continued to work with the various agencies, most importantly, Customs and Border Control, with our suppliers to bring clarity to these implementing regulations. And while we continue to see progress, it also continues to be slower than we would like.\n\nEverything that we've laid out today in terms of our expectations reflect our latest views on when panels will be delivered to us, and we'll be able to bring projects into service for our customers. One of the biggest things that our team has been working on over the last year is how do we mitigate the risks related to these broader geopolitical issues, whether you focus specifically on a circumvention issue or UFLPA or whatever else it might entail. And our suppliers have made tremendous progress on de-risking that. And we've gotten a lot of increased confidence longer term.\n\nIt will be able to mitigate the issues even if we see some disruption in the short term.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nOK, great. Thanks. One last question, just, I guess, on the internal investigation related to the Florida political noise. Is there any update on timing or -- and/or outcome of that?\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nSteve, this is John. I'll go ahead and take that. Let me just start from beginning. As you know, media articles have been published that allege, among other things, campaign finance violations by FPL, and we have a core who's been conducting a very thorough review of those allegations with the national law firm, Paul, Weiss.\n\nLate yesterday afternoon, a complaint was filed by a non-profit corporation with the Federal Election Commission that appears to center around some of the same allegations as those that have appeared in a lot of the media articles. So all those allegations that have been made are within the scope of our review. We have a core who's been taking the matter very seriously, and we will continue to do so as we work toward completing our thorough review of these matters as quickly as possible. And that's really the only update I have at this point.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nOK. All right. Thank you.\n\nOperator\n\nOur next question will come from Julien Dumoulin-Smith with Bank of America. Please go ahead.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning, team. Thank you for the time. Appreciate it.\n\nListen, I just want to jump at the heart of the matter here. How do you think about IRA in terms of increasing your EPS through the 2025 forecast? Or is this about extending the duration of the existing growth and/or both, right? The pivot to the solar PTC from ITC for a host of products already in flight should be immediately accretive, you would think. But clearly, there could be some offsets as well. And then related, the added opportunities in the repowering and storage colocation as you guys quantify just now, in theory, should also afford an accelerated opportunity.\n\nBut I just want to come back on how you guys want to tackle that from an earnings recognition perspective.\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nYeah. Let me go ahead and take that, Julien. This is John. As you said, look, IRA provides a tremendous opportunity set for us across the board.\n\nObviously, we've had some contracts that were already in place that assumed ITC on solar and obviously benefit from the production tax credit. So there's benefits certainly in the existing portfolio. I think we're also going to see some improvement going forward. As I said, I think recently at a conference in our 70-30 in the way things are treated on the unregulated business mix standpoint because, remember, those new PTCs that we get actually helped to buy down the contribution from the unregulated side of the business.\n\nSo that's a big benefit for us as well going forward. We have transferability options now built into IRA that should help the cash flow from operations as well as we go -- as we think about the future of the business. I mean, obviously, it creates a lot of immediately in the money opportunities for us going forward, both on wind, on solar and on battery storage. Nobody has the existing footprint that we have.\n\nAnd so having not only a 20-gigawatt backlog, but you combine that with 25 gigawatts of operating renewables, and you just think about the potential opportunity of 45 gigawatts around repowerings and with regard to colocated storage because, as we all know, under the old regime, the only way you could really introduce storage into the puzzle was by combining it with solar. Nobody has the wind footprint that we do. And so now we have the opportunity to put -- colocate storage in all of our wind sites, not only that we own today, but that we might build going forward. The same goes with solar.\n\nAnd then obviously, there's an opportunity now to go ahead and build storage stand-alone. And so that is terrific, not only for Energy Resources, but obviously provides a great opportunity set for NEP going forward as well. In terms of timing, which I think was the other part of your question, I think we've been very open that we plan to provide a further update on the next call in January on the Q4 call.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And just to get ahead of that fourth quarter a little bit, you would have a more holistic update on just the extent that the repowering opportunities and colocated opportunities through, call it, the '25 period by fourth quarter. Again, I get that it takes some time to actually execute to decide what...\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nYeah, Julien, we'll do the best we can. Remember, too, that there are some regulations we're working on with the Treasury Department as well. So some of that update around repower and colocated storage might be tied to finalization of those, but we'll certainly try to give a view.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nGot it. All right. Thank you. Hey, best of luck.\n\nWe'll speak then.\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nYeah. Thank you.\n\nOperator\n\nOur next question will come from Shar Pourreza with Guggenheim Partners. Please go ahead.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nHey, guys. Good morning.\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nGood morning, Shar.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nJust a real quick follow-up on Julien's question. Just -- maybe just fine-tuning it a little bit, as we're kind of looking at just the near-term earnings guidance that you guys have out there, how do we sort of think about the IRA impact as we're thinking about the existing PPAs, right, which predominantly don't have any reopeners, and then you couple that with sort of some of the counteracting items like higher interest rate environment, do these two sort of items, are they offsetting? Are they accretive? I guess how do we think about those two items in the context of what you guys have just reiterated this morning?\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nYeah. I think, Shar, you've got to balance all those things together. First of all, it's really project by project. I mean some projects benefit more than others, and that really depends on which projects have been impacted by some of the supply chain issues that we have had.\n\nThat's really the first piece. From an interest rate standpoint, though, I think for -- Kirk dealt with that. I mean, obviously, the current interest rate move is taken into account in our expectations. And I think we've been very prudent and careful about managing that interest rate exposure.\n\nI mean we have $15 billion of interest rate swap protection in the book. So I'd really think about it more of -- more as a -- an ITC to PTC versus supply chain trade-offs. Some projects benefit more than others. So you kind of have to go down the list and look at it on a deal-by-deal basis.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nGot it. OK. That's helpful. And then just on -- FPL, obviously, you had a 10-year site plan adjusted for inclusion of tax legislation.\n\nI think IRA came out even better than prior proposals. So does that prompt an update for a preferred solution at FP&L, maybe going from 10 to 20 gigs? What would be the cadence for an update or to pivot resource strategy there?\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nSo we'll be filing -- updating our 10-year site plan as we do every year. We're in the process now of updating that. That gets filed on April 1. Obviously, as I talked before, there's opportunities going forward.\n\nWe're always looking at ways to make it even more economic to be able to deploy the assets, including the solar that we're currently doing. But we're currently five years ahead of plan on our 10,000 megawatts of solar to be installed, and that's on file with the commission, and then we'll update our 10-year site plan and file that on April 1.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nGot it. Terrific. And then just one last quick one. Just curious on the move in the RNG side.\n\nYour '25 EBITDA guidance for the acquisition is based on existing operating assets or does that include a backlog of RNG development that would require additional funding? Thanks.\n\nRebecca Kujawa -- President and Chief Executive Officer, NextEra Energy Resources\n\nThanks, Shar. Appreciate the question. We're really excited about the acquisition. It is about just over 30 projects that do landfill, gas, electricity or renewable natural gas today.\n\nAnd that number in '25 reflects our base case. And in our base case, we are converting a number of those facilities from landfill gas to electricity to renewable natural gas. So it does include the investment that we referenced in the prepared remarks of about $400 million in order to convert them to produce renewable natural gas. One of the reasons why we're really excited about the transaction, though, is there's a lot of optionality in it, and some of which was afforded in the Inflation Reduction Act.\n\nOne is these projects now qualify for an investment tax credit, which obviously enhances the economics of the conversions. There's also the opportunity to support the further decarbonization or the improving of carbon intensity for blue hydrogen, which really opens up a whole new market for renewable natural gas that we think is going to be very attractive to blue hydrogen producers to enable the full value of the PTC where they otherwise wouldn't have been entitled to the full value of the PTC. And in doing that, we think that creates a real long-term contracted market because a blue hydrogen producer will be very motivated to lock in the value that the renewable natural gas lending will bring to their economics. There's also the opportunity, if it isn't a blue hydrogen contribution, actually to keep some of these assets producing electricity and utilizing what we expect are new regulations coming out of the EPA to enable a pathway for the RINs, the predominant renewable fuel credit that renewable natural gas benefits from today, that there'll be a pathway enabled for electric vehicles.\n\nSo that might enable us to not invest that $400 million in some or all of those assets to convert them to renewable natural gas. So I think the bottom line is we are very excited about it. We think this is a great platform from which to grow our renewable fuel business, our renewable energy solutions in order to help our customers across the broad set of sectors, both in the power sector and beyond to enable their full decarbonization.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nTerrific, guys. Thanks very much. See you in a couple of weeks. Appreciate it.\n\nRebecca Kujawa -- President and Chief Executive Officer, NextEra Energy Resources\n\nThanks, Shar.\n\nOperator\n\nOur next question will come from David Arcaro with Morgan Stanley. Please go ahead.\n\nDavid Arcaro -- Morgan Stanley -- Analyst\n\nHi. Good morning. Thanks so much for taking my question.\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nGood morning, David.\n\nDavid Arcaro -- Morgan Stanley -- Analyst\n\nGood moring. Maybe continuing on that, just wondering more broadly your thoughts on the M&A landscape, are there priorities or attractive opportunities out there in the market right now that you might be considering?\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nI will go ahead and take that. David, this is John. We have so many terrific organic opportunities, growth opportunities in front of us. M&A is not an area of focus.\n\nDavid Arcaro -- Morgan Stanley -- Analyst\n\nAnd then, maybe on the renewable side of things, wondering if you could comment on the ICC and FEMA proposal to rate the structural risk ranking of solar and wind? What could that do for your projects, your pipeline and the costs for developing renewables?\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nI will go ahead and take as well. So FEMA did come forward with some recent proposals. Those have not been put to a final vote yet. I think the best example as to why none of those changes are required is what we just saw with Hurricane Ian.\n\nAnd so when you -- Kirk had some of those remarks in the script, but I think it's worth noting, and obviously, we put this information back in front of FEMA that none of this is necessary. Because if you evaluate what happened in Hurricane Ian, which was the fifth worst most catastrophic storm to ever hit the Continental United States, it passed over 38 to 50 of our solar sites with maximum sustained winds of 150 miles per hour. We had essentially no impact to our solar generating facilities. About 0.3% of the panels were impacted.\n\nAnd you got to remember, that slight number of impacts that even occurred were on the older sites that have the fixed tracker technology. Now if the new tracker technology, we can move it east to west, we can pivot it to the 35 degrees. The wind cuts right through it. We saw essentially no damage at those sites.\n\nThe solar held up extremely well. And in some cases, I think probably better than even a gas plant, which are really rated up to only 100 miles an hour. So really happy with the way it all performed. We think the FEMA changes are completely unnecessary, and we are working through that with them with terrific evidence from how our own fleet just performed a couple of weeks ago as a no better case in point.\n\nEric Silagy -- Chairman, President, and Chief Executive Officer of Florida Power and Light\n\nSo this is Eric Silagy. I guess I'll just add a little bit. So when John talks about the panels that were -- the 0.3% of panels that were affected, many of those panels weren't even damage at the point we simply put them back on and reuse them. So to put it in perspective, panels that actually had to be replaced out of 12 million panels is 0.03% or 3,000 panels out of 12 million.\n\nAnd so to John's point, it is immaterial. And we were up and running the next morning with output at our plants.\n\nDavid Arcaro -- Morgan Stanley -- Analyst\n\nGreat. I Appreciate that color. Thanks so much.\n\nOperator\n\nOur next question will come from Michael Lapides with Goldman Sachs. Please go ahead.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nHey, guys. Thank you for taking my question, and congrats on a good quarter. One for Eric. Talk about $8.5 billion of capital deployment this year at FP&L.\n\nHow should we think about what that level looks like, call it, in 2023 and 2024? And maybe what are the puts and takes that could move it in either direction for those years?\n\nEric Silagy -- Chairman, President, and Chief Executive Officer of Florida Power and Light\n\nHey, Michael. It's Eric. So look, we have a robust capital plan that continues. We've talked about it before from a standpoint of our storm hardening that program.\n\nObviously, you could see the impacts with Ian and how beautifully it really made a difference. We're going to continue with our storm hardening program, our undergrounding program, our solar build-out. We have great visibility into our capital deployed right through the rate case settlement period and what we have filed through our 10-year site plan.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nGot it. So I'm just trying to think about this just, is capital spend above or below 2022 levels for the next couple of years?\n\nEric Silagy -- Chairman, President, and Chief Executive Officer of Florida Power and Light\n\nIt's basically where it is at the '22 levels. It varies a little bit but is exactly what we put forward for the plan here for the last two years that we've had going forward.\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nYeah. Michael, I would just add, there's no real deviation from what we shared at the investor conference. So it's in line with the plans that we laid out in terms of roughly $8.2 billion to $8.5 billion a year over the settlement terms.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nYeah, the only reason I ask -- and thank you for that. It's given the fact you've got the full surplus amortization back on board right now, you could actually invest more to improve reliability, and obviously, green the system even more without necessarily having to, a, hurt earnings; and b, increase customer rates for the next couple of years.\n\nEric Silagy -- Chairman, President, and Chief Executive Officer of Florida Power and Light\n\nYeah. But Michael, again, we're right now sticking with our plan. We've got a good visibility. A lot of this, remember, it's a lot of execution.\n\nAnd so we have a -- we've been managing the supply chain. We've been managing all the issues that have been a challenge for folks across the country and being able to hit that capex plan is right now what we see is the best path forward to be able to maintain what the commission expects and financially, what we expect.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nGot it. And then one for Rebecca. Just curious, what are you seeing in terms of just -- just given what's happening inflation-wise around the world, especially commodity and labor, what the cost to install new wind and solar has -- kind of how much that has changed before we kind of bake in the higher tax credit levels?\n\nRebecca Kujawa -- President and Chief Executive Officer, NextEra Energy Resources\n\nYeah, Michael. I think we obviously had a number of comments around this at the investor conference. We certainly have seen increases in costs, both in the -- or the -- actually equipment prices as well as balance the system and the labor to build the projects. I don't know that it's materially changed from what we shared with you a couple of months ago.\n\nI think we were at the peak in a lot of commodity prices and even some of the key ones that ultimately affect the inherent costs of our building a project have come down since then. As we think about it long term, we obviously have views on what it's going to look like going forward and that we build those expectations into our Power Purchase Agreement prices with our customers. I think one of the key things to keep in mind, particularly as you think about the overall demand for renewables and other clean energy solutions long term, is that they have such a competitive advantage against the alternatives. So even where we've seen increases in costs, even in some areas, maybe at parity with what we've seen in terms of the strict value that the IRA incentives may have brought in terms of the difference versus prior incentives, what we've seen is that the alternatives have increased even more.\n\nAnd that goes from new build as well as the overall market prices. So from our customer standpoint, which is what -- who we're focused on the most, they are as compelling as they've ever been to incorporate into their solutions, whether that be a power customer to bring down electricity prices for their customers, which is clearly very top of mind for our customers today, but also our non-power sector customers who are finding ways to not only provide a lower carbon intensity product to their customers, but they want to do it at lower cost. And we've got great solutions for them.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nGot it. Thank you, Rebecca. Thanks, Eric and team.\n\nOperator\n\nOur next question will come from Jeremy Tonet with J.P. Morgan. Please go ahead.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nThanks for squeezing me in. Just wanted to hit on RNG real quick and maybe round out the conversation a little bit more, big acquisition here, but how do you think about the total addressable market here? And is the focus really just on landfills in certain locations or other parts of RNG could be interesting as well? And then lastly, I guess, further expansion, it seems like you have quite a platform to work off here, but future RNG would be just organic or could there be more purchases as well?\n\nRebecca Kujawa -- President and Chief Executive Officer, NextEra Energy Resources\n\nHi, Jeremy. And thanks for the question. We're very excited about the potential for RNG, in particular, as part of the broad set of solutions we want to offer our customers. So I would say this is just a large step forward in something we've already been working on with smaller investments and some other co-investments with other folks.\n\nAnd we're excited about not only adding these portfolio of projects and the value that this creates for our shareholders, but also using it as a platform for future growth. As part of this acquisition, building a services company along with it. That's part of what the existing portfolio provides, and we're excited about incorporating those capabilities into our team. And we are excited about both landfill gas and alternative forms of renewable natural gas, including very long term.\n\nSo we'll do it both through organic as well as through acquisitions. So -- and all of the above. We're excited about the size of the acquisition space. But before I get too excited, we also need to keep in mind that as the $85 billion to $95 billion of capital we want to invest over the period we laid out at the investor conference, this is approximately $1 billion and change.\n\nSo a great addition to our portfolio, but still in context, a measured step in the overall portfolio.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. Very helpful. And just rounding out the conversation on hydrogen, I think you touched on it a bit, but any other updated thoughts you want to share with us post-IRA here?\n\nRebecca Kujawa -- President and Chief Executive Officer, NextEra Energy Resources\n\nI'm thrilled with the prospects of hydrogen going forward and not just literally hydrogen itself, but the renewable fuels that, that creates is potential solutions for our customers, whether that's synthetic natural gas as a potential solutions for customers who are looking for 7/24 fully decarbonized power, but also through synthetic jet fuels, synthetic ammonia products, other things that will help bring out of people's supply chain, manufacturing processes, etc, their carbon-intensive fuels that they use today. Some of those are not going to be economic literally today, but there's a clear pathway to them being economic in a couple of years, but some of them with the benefit of the IRA incentives are economic today. And at the heart of them, what the opportunity is for us is to deploy a substantial amount of renewable energy in the form of wind, solar, battery storage, the core things that we have been very successful doing for years now, if not decades, and we're continuing to invest heavily to maintain those competitive advantages going forward.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nVery helpful. I'll leave it there. Thank you.\n\nRebecca Kujawa -- President and Chief Executive Officer, NextEra Energy Resources\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJessica Geoffroy -- Head of Investor Relations\n\nKirk Crews -- Executive Vice President and Chief Financial Officer, NextEra Energy\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nRebecca Kujawa -- President and Chief Executive Officer, NextEra Energy Resources\n\nJohn Ketchum -- Chairman and Chief Executive Officer, NextEra Energy Partners\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nDavid Arcaro -- Morgan Stanley -- Analyst\n\nEric Silagy -- Chairman, President, and Chief Executive Officer of Florida Power and Light\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nMore NEP analysis\n\nAll earnings call transcripts"
}