{
  "companyName": "Village Farms International Inc",
  "companyTicker": "VFF",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/village-farms-international-inc-vff-q2-2022-earnin/",
  "content": "Village Farms International Inc (VFF 2.29%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen and welcome to Village Farms International's second quarter 2022 financial results conference call. This morning, Village Farms issued a news release reporting its financial results for the second quarter ended June 30, 2022. That news release, along with the company's 10-Q filing, are available on the company's website at villagefarms.com under the investors heading as well as EDGAR. Please note that today's call is being broadcast live over the internet and will be archived for replay, both via telephone and via the internet, beginning approximately one hour following completion.\n\nDetails of how to access the replays are available in today's news release. Before we begin, let me remind you that forward-looking statements may be made today during or after the formal part of this conference call. Certain material assumptions were applied in providing these statements, many of which are beyond our control. These statements are subject to a number of risks and uncertainties that could cause actual results to differ materially from those expressed or implied in forward-looking statements.\n\nA summary of these underlying assumptions, risks, and uncertainties is contained in the company's various securities filings with the SEC and Canadian regulators, including its Form 10-K MD&A for the year ended December 31, 2021 and Form 10-Q MD&A for the quarter ended June 30, 2022. These forward-looking statements are made as of today's date and except as required by applicable security laws, we undertake no obligation to publicly update or revise any such statements. I would now like to turn the call over to Michael DeGiglio, chief executive officer of Village Farms International. Please go ahead, Mr.\n\nDeGiglio.\n\nMike DeGiglio -- Chief Executive Officer\n\nThanks, Debbie. Good morning. With me for today's second quarter call is Village Farms' chief financial officer, Steve Ruffini; Village Farms' head of Canadian cannabis, Mandesh Dosanjh; and Village Farms' executive vice president of corporate affairs, Ann Gillin Lefever. Steve and I will provide our customary remarks and operating highlights and financial results, and then we will be available for questions.\n\nSo, let me start by sharing my views on the quarter. First, year-over-year revenue growth of 18% was quite strong with contributions from each business lines. As with Q1, we saw strong relative execution and performance from our cannabis businesses, which continued to be offset by the macro challenges facing Village Farms Fresh, our produce business. As I did last quarter, I will start with our Village Farms Fresh, our produce business.\n\nOn our Q1 call, we listed a number of significant pressure points for the produce business, notably significant input costs inflation, lack of ability to pass pricing on to the customer, and an oversupply of product. And all this was in addition to the ongoing challenges of the brown rugose tomato virus that is impacting tomato growers, nearly all of them, globally. We also noted that as long as these conditions continued, we would see their impact on our produce results, and it was likely to get worse before it got better. So, as expected, that was the case in Q2, as we, along with our peers, most of whom are private companies, some of whom are also public, continue to see cost balloons.\n\nTo provide some perspective, freight alone increased 2.2 million higher in Q2. And we saw significant increases in fertilizer and other inputs, as well as packaging and labor. Fresh produce is a difficult business. It's our heritage and a business we take great pride in.\n\nWe also believe it is a tremendous foundation for our expansion into U.S. cannabis. And we have already proven that same synergy and strategy in Canada. We believe with full comprehensive legislation of cannabis, when that happens, there'll be a significant change in how cultivation is done.\n\nLarge scale, low cost will matter. With that in mind, during the quarter, we initiated an intensive operational review of the fresh produce business in light of these additional industrywide headwinds, which have made a business within margins even more challenging. To review, which will include third-party experts who will scrutinize our processes to ensure that we are optimizing profitability, we have been here before a number of times, especially during the last 15 years, that we have lowered our cost to manage through secular price compression caused by importation. It all comes down to resourcefulness and determination.\n\nWe separate what is in our control and not in our control so that we can prioritize our attack, and we take definitive action. Right now, it's all hands on deck for this perfect storm in Fresh produce. However, as I have spoken too often, a critical part of produce strategy is optionality for our expansion into U.S. cannabis.\n\nWe are not losing sight of what these assets will be worked in a different macro environment or, more importantly, in a different regulatory environment for cannabis. We believe they would be multiples of their current value. We had been optimistic that following the last election, some sort of meaningful progress in U.S. cannabis regulation would have occurred by now.\n\nThis is obviously a source of significant frustration for us and we know for our shareholders as well. So now turning to our Canadian cannabis business, we have all read and heard about how difficult and challenged the Canadian cannabis industry is. Oversupply, price compression, a retreating, but still lingering illicit supply, this is not shocking to us. You have heard me say many times that we have built our Canadian cannabis business for just this environment.\n\nAnd last year, we saw the capital market start to dry up for the sector. We prepared ourselves for just what we have seen, irrational behavior by many in the marketplace in an attempt to solve operational or market share issues. The back half of 2021, as a team, we hunkered down and refined our long-term strategy for success in 2022. So, how did our Canadian cannabis business perform in the first half of 2022? Net sales grew a very healthy 25% year over year and 38% sequentially, a new record with healthy growth in both our branded and nonbranded segments.\n\nThe segment printed its 15th straight quarter of positive adjusted EBITDA, which remains a standout achievement among publicly traded licensed producers in Canada. Our namesake Pure Sunfarms brand, held its position as the No. 1 cannabis flower brand in Q2. Now, five quarters in a row, supported by the lunch of 12 new SKUs, including one new strain, we did not sacrifice profitability to buy market share.\n\nMany new brands and new products continue to enter the market. To grow our share, we must be even more innovative and strong on our commercial efforts. And I'll talk about what we are doing in both those areas in a moment. In Quebec, ROSE expanded its market share with its portfolio, moving into the No.\n\n3 licensed producer spot with an 8.5% share of the market. As importantly, during the quarter, we were laser-focused in executing on multiple growth initiatives that will drive what we have said and continue to believe will generate even more traction in the back half of 2022. These are the launch of Pure Sunfarms second brand, the Original Fraser Valley Weed Company, accelerating our innovation strategy to launch more new products more often with a particular focus on new strains, supporting our brands and products with the right commercial effort, and building a solid footprint in international markets modeled on the success of Canadian cannabis business. Let me start with Fraser Valley Weed Company.\n\nWe entered the Canadian cannabis market with a single brand, Pure Sunfarms, whose everyday premium positioning targeted the largest segment of the consumers, what we've referred to as our core segment. We watched as consumer preferences evolved, and the market began to segment. Today in certain markets such as Alberta and British Columbia, the value segment accounts for well over a third of the market. The Fraser Valley brand is targeted directly at this significant market opportunity.\n\nIt is differentiated from the Pure Sunfarms brand in that it targets a frequent and price-conscious consumer with dependable and potent large-format flower with selected popular strains, starting with consumer favorites, Donny Burger and MAC. While the team naturally expects some cannibalization of our Pure Sunfarms brand, we also anticipate profitable market share gains as Fraser Valley targets a real need articulated by both the provincial boards, retailers, and consumers. The Fraser Valley brand will follow a gradual rollout. We have prioritized British Columbia, where the value segment has been growing significantly; followed by Alberta, which is highly competitive in the value segment.\n\nAlthough it is still early days, we are very encouraged by the consumer response to date. Our first shipment to British Columbia sold out in just three days and immediately became the No. 2 flower brand right behind Pure Sunfarms, which continues to hold the top spot in that province, as it continues to do so in Ontario and Alberta. Early data from Alberta is also very strong.\n\nIn terms of innovation, to date, we have launched more than 100 SKUs across the Canadian cannabis business. This includes new strains such as Bubble Mints, Berry Cream Puff, and, most recently, Sugar Cookies. Innovation followed by investment is critical, especially when the growth of this segment attracting so many brand launches. Jet Fuel Gelato is a great example.\n\nJet Fuel is now the fastest growing strain in Ontario through the quarter end of June, 2022. In July, Jet Fuel moved into the No. 2 position in top strains in Ontario with our Pink Kush remaining to the No. 1 overall spot, where it has consistently been since the launch one year ago.\n\nThis is quite impressive, and kudos to the Pure Sunfarms team. Innovation has been an integral part of ROSE's market share. During Q2, they launched nine new SKUs into the Quebec market and their first SKU in other provinces. A meaningful contributor to the strong performance of the ROSE portfolio was a promenade brand, which benefits from the collaboration with Pure Sunfarms, including use of Pure Sunfarms biomass.\n\nAnother successful innovation at ROSE is that the leased brand, which brings together the products of Quebec-based craft produces under ROSE's brand strength and distribution capabilities. Based on success in Quebec, ROSE is now expanding that model to other provinces under the homage brand. This is a great first example of the synergistic opportunities between ROSE and Pure Sunfarms with our Canadian cannabis operators. And I look forward to discuss many more in the future.\n\nWe are innovating in other ways as well. During the quarter, we were proud to partner with NOYA to launch Cookies sun-grown flower in Ontario, Cookies being one of the most well-known and successful cannabis brands globally. It is a testament to our cultivation capabilities that we were chosen for Cookies to enter the Canadian market with high-quality, large-format, sun-grown strains at a differentiated price. On a final note on innovation, we are also investing in our core capabilities to ensure that we are relevant in the moment of consumer purchase.\n\nIn that regard, I'm pleased to report 100% of Pure Sunfarms product is now hang dried. Following significant investment, we now have the capacity to hang dry all of our Delta 3 and Delta 2 production. And as expected, we are already hearing very positive customer feedback as a result. Just as the case with the Canadian market, there was a lot of noise around international markets.\n\nWhat will they look like? What will the regulations be? Where are the real opportunities, and who will be the winners and losers? And once again, we are ignoring the noise and focusing on our strategy, which can be very simply stated as follows. We will participate in those markets where we believe the regulatory construct and consumer demand gives us the right to win and be profitable. Our first foray was into Australia where we have now completed our sixth shipment for the medical market there since beginning shipments 10 months ago. Growth in the Australian market is accelerating, and we are capturing that growth.\n\nFollowing receipts of our EU GMP Certification earlier this year, the team is also engaged with partners in both Israel and Germany, where we believe we have a winning strategy for these promising markets, the same strategy that has underpinned our success in Canada; high-quality products at an attractive price. I'm encouraged by our progress, especially after the two-year protraction of the certification process due to pandemic travel restrictions. Even with the significant time it takes to ensure compliance with every country's unique regulations, including new requirements as the market opens, we are targeting to begin shipments at these markets in the coming months. And then finally, on the international front today, I'm very pleased to announce that Leli Holland has just granted the 10th and final license to cultivate and distribute cannabis in the Dutch Supply Chain Experiment, which is expected to be the first major legal recreational market for cannabis in Europe.\n\nLast year, we purchased an option on majority ownership of Leli and subsequent to Leli's receipt of their license we exercised that option, such that we now own 85% of Leli. As Village Farms Europe cannabis, we can now look forward to executing on our plan. Under which, if the program proceeds on schedule, we will see us generating revenues later next year. In our U.S.\n\ncannabis business, Balanced Health Botanicals continues to perform well and remained profitable in what is an increasingly challenging market. However, our Balanced Health Botanicals business has experienced a slowdown in consumer purchasing consistent with data that is emerging from other consumer-facing businesses, which is being exasperated by the lack of clarity on the CBD category's ability to access traditional retail selling channels. Average order sizes are decreasing, and we are detecting a lengthening of order times from our recent -- or rather, repeat customers. The BHB team has continued to develop products with unique benefits [Inaudible], like Synergy+.\n\nLast month, they released a study that report a significant reduction of mild or temporary anxiety when using CBDistillery's daytime synergy, CBG and CBD tincture. I might suggest that we could all use some of that product these days. None of these interim challenges changes our mind around the strategic importance of our acquisition of BHB. It remains a well-established, profitable business with top brand awareness and an established e-commerce platform and retail channels that provide an additional pathway to participate in the high THC cannabis market in the U.S.\n\nwhen we are able, which we believe will be very different from today. With that I'll turn the call over to Steve. Steve?\n\nSteve Ruffini -- Chief Financial Officer\n\nThanks, Mike. First a reminder on the timing of our Balanced Health and ROSE LifeScience acquisitions last year and their impact on our second quarter 2022 results as we acquired Balanced Health Botanicals in Q3 2021 and in 70% LifeScience in 2021, results of each are consolidated in our financial results for the second quarter and first half of 2022. However, neither contributed to the comparative periods of 2021. Turning to the results, consolidated sales of all of Village Farms that includes our Canadian and U.S.\n\ncannabis operations, our VF Fresh produce operations for the second quarter increased 18% year over year to 82.9 million from 70.4 million in the second quarter of 2021. The increase was driven by higher sales from both the Canadian cannabis business and fresh produce, as well as the incremental contributions from the acquisition of Balanced Health under our U.S. cannabis operations. This quarter is a mixed quarter, which includes a large one-off goodwill write-down.\n\nConsolidated net loss for the quarter was 36.6 million or negative $0.41 per share compared with a net loss of 4.5 million or a negative $0.06 per share for the same period last year. This quarter's net loss includes a gross impairment of $29.8 million or $22.8 million after tax relating to the acquisition of Balanced Health Botanicals in our U.S. cannabis segment and a write down of our investment in VF Hemp, which was our remaining 2019 hemp inventory. The net write-downs resulted in a negative impact on earnings per share of approximately $0.27 cents per share.\n\nThe remainder was driven almost entirely by the impact of cost inflation and ongoing virus pressure on our fresh produce business. Consolidated adjusted EBITDA for the second quarter of 2022 was negative 10.3 million compared to a positive adjusted EBITDA of 1.5 million for the same period last year. The EBITDA loss in Q2 this year was driven entirely by our fresh produce division. Corporate costs were 2.1 million compared to 1.7 million with the increase due primarily to incremental costs related to various business expansion initiatives, including those associated with the Netherlands cannabis opportunity that Mike just described.\n\nLooking at our individual business segments, starting with cannabis, net sales from our combined Canadian and U.S. cannabis operations grew 44% year over year to 35.6 million from 24.8 million with the increase roughly split between the growth in our Canadian cannabis business and the contribution of Balanced Health under our U.S. cannabis business segment. Q2 cannabis sales comprised 43% of Village Farms consolidated sales, up from 21% from the same period last year.\n\nTotal cannabis adjusted EBITDA was 2.1 million compared with 7.4 million for the second quarter of last year, with the decrease being substantially the incremental SG&A spend in Pure Sunfarms for the investment in various commercial support activities, like the new Fraser Valley brand and some which are still to come, such as international exports, as well as the addition of ROSE operations in 2022, which we didn't have in 2021. Mike noted earlier, we are beginning to see the return on these investments in the form of higher sales and market share gains. Within cannabis, our Canadian operations delivered another solid quarter. As usual I will review our Canadian cannabis results in Canadian dollars, which provides a more accurate gauge of our period-to-period performance in the face of exchange rate fluctuations, as well as providing the ability to more accurately compare to Canadian market growth rates.\n\nOur Canadian cannabis operations once again generated strong year-over-year growth with net sales for Q2 of this year increasing 25% year over year and 38% sequentially to 38 million, which is a new quarterly record. Canadian cannabis net sales were composed of 48% retail branded sales, 29% nonbranded sales, and 3% distribution fees and commissions. We have previously called out the back half weighted seasonality of sales on our Canadian cannabis business, and we are again confirming this expectation this fiscal year. It may be even more pronounced this year as planned growth initiatives anticipated to drive additional sales, including the Fraser Valley brand launch and the start of shipments to additional international markets.\n\nOur gross margin for the Canadian cannabis business for Q2 remains solidly within our stated target range of 30% to 40% at 33%, down a tick from 34% in Q1. We have continued to benefit overall from continued gains in cultivation efficiency and production improvements, as well as the expansion of our footprint with the addition of the first half of the Delta 2 facility last year. Pure Sunfarms operations continued to run at their full capacity during Q2 and continue to do so today at 1.6 million square feet of production space. We continue to be focused on actively managing inventory levels as the biggest challenge, continually balancing demand and supply fluctuations, developments which can create lumpiness in our nonbranded revenues.\n\nAs of June 30th, our day sales outstanding was at its lowest level in 2022. Selling, general, and administrative expenses for the Canadian cannabis operations in Q2 were 10.9 million or 29% of net sales compared with 5.4 million or 18% of net sales for the same period last year. The increase in absolute dollars was a result of the addition of the ROSE operations in 2022, which accounted for roughly 1/3 of the year-on-year increase as well as investments referred to earlier that Pure Sunfarms is making to drive market share and accelerate sales growth domestically, as well as preparations for the start of exports later this year. In fact, compared to Q1 of this year, although up in terms of absolute dollars, SG&A was down several points as a percentage of revenue as sales increased at a faster pace than the expense line.\n\nWe expect several of the incremental initiative spends in the earlier part of this year to result in higher sales and margins resulting in a reduced SG&A percentage of revenues into the lower 20% for the balance of 2022. Our Canadian cannabis operations delivered their 15th consecutive quarter of positive adjusted EBITDA at $3.1 million, which, although down from 9.1 million in Q2 of last year, is driven by the incremental year-on-year SG&A expense. I will now turn to our U.S. cannabis operations.\n\nAnd in doing so, we will revert to U.S dollars. U.S. cannabis sales in Q2 were generated entirely by Balanced Health Botanicals, which were 5.8 million, generated a gross margin of 66%. Adjusted EBITDA was just shy of breakeven which was impacted by the write-down of our remaining VF Hemp inventory of roughly 300,000.\n\nAs Mike noted, Balanced Health continues to perform well and this is an environment that has become increasingly challenged in recent months. Importantly, it remained profitable for the quarter. However, with the continued impact of lack of regulatory clarity, slowing consumer spending on perceived discretionary items, we have tempered near-term growth outlooks. In assessing both valuations in these consumption pressures, we feel it is prudent to write down the value of Balanced Health's goodwill and intangibles by 29.8 million this quarter.\n\nThere is no impairment of our Canadian cannabis values, and we do not expect any write-down of this largely organically built and growing and profitable business segment. Turning now to fresh produce, Q2 saw an exasperation of the inflationary pressures we saw across our cost structure in Q1. Although we achieved another quarter of year-on-year sales increase on higher volumes due to continued supply demand imbalances, we still have been unable to pass on these costs to our customers. For example, year-on-year freight spend was $2.2 million higher in Q2 versus Q2 of 2021, almost solely due to the increased cost of diesel and trucking rates as a number of the trucks shipped to our retail customers was up 4% year on year.\n\nWhile painful for us, it is less than the year-on-year freight difference in Q1 2022 versus Q1 2021 of 2.8 million on a higher number of shipments in Q2. The incremental freight pressure has decreased a bit more in Q3 but is primarily a macroeconomic cost out of our control. Additionally, we continue to manage through the global tomato virus, brown rugose, which continues to cause incremental costs and significantly negatively impact our yields, resulting in higher costs of production than anticipated, as well as compared from a historical perspective. This resulted in a negative gross margin for fresh produce of $8.9 million, which drove negative adjusted EBITDA of 10.4 million compared to a negative adjust EBITDA of 4 million in Q2 last year.\n\nTurning now to cash flows, in the balance sheet at June 30th, we had approximately 33 million in cash and equivalents compared to 41 million at March 31st of this year. And we had approximately 78 million in working capital, excluding cash, compared with 101 million at March 31. During the quarter we had operating cash outflows of 13 million net of working capital adjustments. As a reminder, the vast majority of our year-to-date capex spend has been for the Delta 2 facility and the addition of more dry rooms in order to hang dry our entire Pure Sunfarms capacity, which Mike mentioned, which is the key operational and quality initiative that we expect to see substantive enhancements to our results.\n\nImportantly, we will continue to plan to produce to expected demand and will only expand production when we see incremental demand increases for our brands, both within Canada and in the export market. Given the uncertainty of inflationary pressures and their potential continued impact on Fresh produce, as well as the multiple cannabis growth initiatives before us that will require additional investment, this morning we will announce that we filed a prospectus supplement for an aftermarket offering of up to $50 million. Given the current state of the broader capital markets and with respect to the cannabis sector, more specifically, we believe the ATM mechanism in this environment is an efficient and flexible means by which to access additional capital when needed should we choose to do so. We also believe that it is a transparent fundraising tool for our stakeholders and a characteristic which is important to us.\n\nAnd now, I will turn the call back to Mike.\n\nMike DeGiglio -- Chief Executive Officer\n\nThanks, Steve. So, in closing, our Canadian cannabis business was designed and built to last. The Canadian cannabis market continues to exhibit robust growth, 20% year-over-year in May, but clearly this is not without problems. They need to be addressed thoughtfully by regulators and participants, such as taxation, elicit enforcement, and oversupply.\n\nAt the same time, there are many positive developments in the industry that play right into our hands. Consumer preferences are starting to emerge. Innovation is increasingly a differentiating factor, and brand strength matters. Our Canadian cannabis portfolio and future plans align perfectly with these trends.\n\nWe are more confident than ever that our Canadian cannabis business is positioned to be one of what we continue to believe will be just a handful of winners. And as we get it right and win in Canada, we have great confidence that we can get it right and win in other international markets. We firmly believe that all of our learnings and successes in Canada will translate to winning and what will be a very large global market developing quickly in the next years to come. And with that, we'll now turn the call over to the operator for any questions.\n\nOperator?\n\nOperator\n\n[Operator instructions] And your first question comes from Aaron Grey of Alliance Global Partners. Go ahead, please.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nHi, good morning and thank you for the questions. So, first question from me, nice growth in terms of retail sales within Canadian cannabis. I just wanted to ask in terms of any color in terms of anything with timing, so up 38% quarter over quarter, you know, while exceeding the market, you know, look at Hifyre data, you guys, you know, did pretty well in share, but this outdid that by pretty good margins. So, anything in terms of timing of provincial sales, I know we had that a little bit in 4Q 2021, which came back in the first quarter, but then you just still guided toward a stronger back half.\n\nSo, anything in terms of timing of shipments to provincials would be helpful. Thanks.\n\nMike DeGiglio -- Chief Executive Officer\n\nWell, we feel -- we're encouraged on back half for 2022. You know, what we've seen in the last couple years is seasonal trends emerging, not only by consumers but also the provincial buying offices and managing their budgets. But based on some of the emerging historical data that we can now look at that we think the second half of the year is going to typically be stronger than the first half. So, we're encouraged by what the third and fourth quarter may bring us.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nAll right, great. Thank you very much. And then with the launch of Fraser Valley, right, so you mentioned how you're looking to limit some of the cannibalization with Pure Sunfarms prioritizing British Columbia, as well as Alberta. So, probably some of the efforts you're looking through there, maybe in terms of how you're marketing it and position it so that you're more stealing share from some of the existing value players than cannibalizing your Pure Sunfarms brand?\n\nMike DeGiglio -- Chief Executive Officer\n\nSure. I'll let Mandy answer that, Aaron.\n\nMandesh Dosanjh -- Head, Canadian Canabis\n\nThanks, Mike. I appreciate the question, Aaron. I think Mike did a great job in the opening remarks talking about Fraser Valley is solely directed at that very price-sensitive consumer in the value space. Our customer insights and data analysis clearly show that large part of the market specifically in British Columbia, as well as Alberta is focused on that value segment.\n\nAnd Fraser Valley is really targeted toward that consumer. It's a really limited offering in terms of -- you know, it is strain-specific, large-format, 28-gram. And we've really offered it at that sub $100 price point per ounce. And we think that clear differentiated offering right at the kind of tag line of bulk high, bulk buy really hits home to that value-focused consumer.\n\nAnd like Mike mentioned, there'll be a little bit of cannibalization. But the reality is we're seeing such a large part of the market in both those two provinces being in the value space. And the marketing investment is very clear in terms of the price point to the value and the quality of the product. So, we're excited and continuing to push the BC Bud narrative into the hands of consumers.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nAll right, great. Thanks very much for the color. And I'll jump back into the queue.\n\nMike DeGiglio -- Chief Executive Officer\n\nThanks, Aaron.\n\nOperator\n\nYour next question is from Tamy Chen, BMO Capital Markets. Please go ahead.\n\nMike DeGiglio -- Chief Executive Officer\n\nHi.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nThank you. Good morning. First -- hi, first question I had, probably more for you, Steve. Could -- do you mind just kind of going back to the comments you made about the cannabis segment EBITDA, because on an absolute dollar basis, the quarterly amount has been coming down the past couple of quarters.\n\nAnd I think you gave a couple of reasons why, but I sort of missed some of them. Could you just elaborate again on why this trend is in place? And do you expect that the EBITDA dollars for the cannabis segment will eventually improve again?\n\nSteve Ruffini -- Chief Financial Officer\n\nYes. We certainly are expecting an improvement and the reason for the downward trend has been the incremental spend really of SG&A as a percentage of our revenue. The last few quarters a lot of those are initiatives that hit our SG&A line, product testing to be EU GMP certified, that's all expensive and unfortunately a long timeline. So, those are expenditures we're incurring.\n\nObviously, addition of ROSE, which is more of a distribution model. So, ROSE as a -- it's all Canadian cannabis, but ROSE as a division has a higher SG&A percentage to revenue than Pure Sunfarms does. So, those have all impacted our reported EBITDA.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nGot it. OK, and my follow-up question is more on cash flow. So, I think with respect to, I guess, inventory build and just, of course, the produce business has been challenging, and I think that's weighed on your cash burn. Could you just talk a bit about how you view that? Do you feel that the business as a whole, the company as a whole will be able to generate positive cash flow from operations at some point? Thank you.\n\nSteve Ruffini -- Chief Financial Officer\n\nWell, historically we've certainly generated positive cash flow from produce. It's been around 30 years, otherwise, we wouldn't be here. But as Mike said, it's been a very challenging time, both due to the virus and the incremental ongoing pressure. So, we're actively looking at solutions to that, and we'll make the proper strategic decisions.\n\nThe cannabis operations will generate positive cash flow. It generated negative cash flow over the last couple of quarters due to the capex expenditures. We've put a lot of millions into expanding our hang drying rooms. And I know some of the analysts have seen those.\n\nSo, that is that substantive cost cash outflow on capex, which will -- is now mercifully completed. And we're starting to see the results of that. So, we are expecting to see increased sales, which obviously will increase cash flow. So, we are projecting the Canadian cannabis business and U.S.\n\ncannabis business to generate positive cash flow going forward.\n\nMike DeGiglio -- Chief Executive Officer\n\nYeah, and I'd like to add some color to both of those points, too, Tamy. One on the SG&A we had communicated a couple of quarters ago that we saw our SG&A spend increasing in Canadian cannabis driving innovation, greater commercial efforts that we've talked about, strained development, brand launches. All those factors that, in the end, I think, are going to be at advantage for us to win at the end of the game. But those, as a percentage of sales, it will come back down to a percentage that we have communicated in the past.\n\nSo, we don't think of that as long term. But those investments are starting to pay off, and I think they'll demonstrate that in the next two quarters. As Steve said, I mean, we've been in a produce business a long time. And back, you know, two years ago we had a very strong year in produce.\n\nSo, it does -- it's volatile, and this is a tough time. But we've corrected before, and we intend to correct it. But at some point, you know, we don't want to lose sight of the optionality for our U.S. cannabis potential.\n\nAnd it's something that we just have to manage accordingly. And there will be years where we're positive breakeven and some years where we take a hit. But there's a reason that we're doing it. And so, thank you.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nYour next question comes from Rahul Sarugaser from Raymond James. Please go ahead.\n\nRahul Sarugaser -- Raymond James -- Analyst\n\nGood morning Mike, Steve, Mandesh. And thanks so much for taking our questions. So, just coming back to Fraser Valley recognizing -- Mike, you talked a fair bit about sort of the irrational behavior from many of your competitors. But we are finally seeing some of those birds come home to roost and some of them starting to really struggle or die on the vine now.\n\nSo, could you maybe speak a little bit at a higher level in terms of the strategy for the rationale behind Fraser Valley? We talked about some of the details in terms of potentially not cannibalizing Pure Sunfarms, and it's sort of everyday premium brand. And this is sort of the more, you know, in the value segment. But really, kind of at a macro strategy level, how do you see this as, you know, a way to start to grab more market share in a profitable way?\n\nMike DeGiglio -- Chief Executive Officer\n\nYeah. Well, I'm going to turn it over to Mandesh, but let me make this comment first. I mean, one of it is to try to -- we've been patient in trying to look at how the market is developing. OK? It's four to five years old.\n\nIt's very -- still a nascent industry. And before we went off sort of half caught just creating strains and brands and just having this plethora of launches out there, I think that the Pure Sunfarms team focused on the Pure Sunfarms brand as it mentioned as core. And with the insights that we're developing before we just went off and did something without having rationale behind it, we wanted to look at the data. And that's what first brand launch was now is Fraser Valley.\n\nSo, as far as, you know, oversupply, I think we're starting to see things changing. I mean, one of the negative, just some of this oversupply and shutdowns of some of these facilities are actually converting to tomatoes from cannabis. But that being said, I think we're starting to see changes in the marketplace. And I think the timing of us being much more innovative with SKUs and brand launches, coupled with consolidation and/or companies just throwing in the towel are happening.\n\nSo, Mandesh, you want to add color to that on specifically on Fraser Valley?\n\nMandesh Dosanjh -- Head, Canadian Canabis\n\nYeah, thanks, Mike. Good question, Rahul. I think one of the key pieces you have to look at Rahul is, in that valley segment, the pure value segment, which is, you know, index lower than Pure Sunfarms everyday premium price point, we weren't playing, and we tested over the subsequent quarters doing promotional activity on pricing, limited time available on strains to just understand that price sensitivity to the Pure Sunfarms consumer to understand how temporary or decreases on products would influence overall revenue growth and share gains in the Pure Sunfarms brand. And then obviously, with end-of-life strains, as we phase them out, again, just to see kind of the uplift.\n\nAnd we saw some good results, but nothing, you know, too uplifting. And so, we really felt that that value consumer who was existing prior, but is really kind of segmented in the market today and is -- and it grew over the last year in British Columbia and Alberta. We just weren't playing in that space, Rahul. And this is a consumer who is really walking into that store.\n\nAnd maybe on payday, they're looking for something a bit more on the everyday premium on the premium price. But throughout the week, they're really kind of looking at that price to potency equation and really shopping around brands. And so, while there might be a small set of cannibalization that comes out of the Pure Sunfarms customer, the capture of the share is larger for us as an organization by going after that consumer. So, Fraser Valley was really targeted as that consumer is walking in, looking at the best-priced potency relationship, and frankly might not be as brand loyal.\n\nAnd we think with this offering, we're targeting that consumer again to that price potency relationship and giving great everyday quality in that bag, because it's processed and cared for the exact same way in terms of hang dry. So, that's really what we've been after, Rahul, and it was what we were seeing on that consumer. So, it's a greater share of the overall pie for us. And we feel confident it's the right strategy and approach, as well as being able to then offer, you know, larger-format offerings of other products if we choose to, i.e., pre-rolls as we start to see assortment needs change and not being able to shove everything into one brand on the shelf and being able to own more of that consumer space in the store.\n\nRahul Sarugaser -- Raymond James -- Analyst\n\nGreat, that's really helpful, Mandesh. Thanks so much. So, my next question is, you know, for all of the success that the cannabis business is having, of course, you talked about the headwinds on the produce business, Mike. And one of the things that you alluded to in terms of addressing that is, I guess, consultants come in and, you know, addressing anything that you might be able to improve on.\n\nAnd given that you've been doing this for a very long time and seeing the ebbs and flows over time, you know, what are some of the other more sort of detailed things that we can kind of hang on to get some directionality for how that will play out over the next couple quarters, given that these macro pressures are unlikely to, sort of release for a little while. So, you know, where can we get a little bit of comfort in terms of the directionality for the management of those cons over the next few quarters?\n\nMike DeGiglio -- Chief Executive Officer\n\nYeah. Well, one of the reasons -- I mean, we've been doing this a long time. And from time to time, we've taken in outside consultants, because sometimes, you know, you can't see the forest and the trees. But that being said, we always look at operational efficiency.\n\nSo, that's nothing unusual. But it's more critical right now because of these the macro inflation issues. And one of the way we selected the consultants is to understand the macro dynamics. How long will they last? Is this something that's going to come back down? We spent about $6 million more on freight this year, not just because of diesel fuel, but there are so many less drivers on the road.\n\nAnd it's kind of interesting, there was an article out today that I got from Steve, just talking about how many drivers are not able to drive due to cannabis regulations that have been taken off the road. So, those two items have increased our freight because we deliver to our customers by $6 million. That's just one input, so to speak. So, we want to have -- we want to be able to have those conversations to understand.\n\nOn the items sort of in our control, we have a handle on, the items out of our control, what better way can we attack those and figure out what we need to do? What is the longevity of these macro issues? How long will they be there and find other solutions? And sometimes, when we can look at it with consultants, who look at other companies, that can come back in. So, I mean, we're not sitting here knocking our head against the wall. We think we have a way to get back to where we need to be. But we're not sort of ready to give up on the option out of the U.S.\n\nI could just tell you this, that I had a meeting with a titan, what I consider a titan in the industry, U.S. MSO. And in that meeting, it was told to me that that person very successful said, \"What's happening now on the cultivation in front in the U.S. is an experiment as to what will happen if there's comprehensive, total legalization in the U.S.\n\nmarket.\" That's where we shine. We've proven that model out. So, what we're trying to do is get our produce business to a size that is manageable while we maintain our optionality. And we're trying to continue to do that.\n\nNow, that may be hard for some investors to understand. I'm clear about that. But that's something we're going to do and getting some help to figure out where inflation is going to go, how long it's going to last is a big part of why we're going to bring some folks in to take a look at that.\n\nRahul Sarugaser -- Raymond James -- Analyst\n\nGreat. That's really helpful. Thanks again for taking our questions, and I'll get back in the queue.\n\nOperator\n\nAnd your next question comes from Scott Fortune from ROTH Capital Partners. Please go ahead.\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nGood morning, and thanks for the questions. I want to dig a little deeper. You spent a fair amount, very impressive facility I saw recently in the dry hanging stuff, but you spent the amount for, you know, scaling deeper into your flowering offering, new strains here. The core Pink Kush continued to do well.\n\nBut can you provide color on the growth or performance of these new strains, like Jet Fuel, and the percentage coming from new strains and, as a follow-on, the importance of these new strains in all segments that you can focus on to drive growth from a flower category side of things?\n\nMike DeGiglio -- Chief Executive Officer\n\nYeah, I'll let Mandesh answer that.\n\nMandesh Dosanjh -- Head, Canadian Canabis\n\nYes. Good to chat, Scott. Thanks for the question. And you're absolutely right.\n\nSeeing the Pink Kush return and growth has been a big focus and effort for us. Canada's No. 1 strain since legalization, continues to be, and we're really pleased with those results and the efforts of our commercial sales team. You hit the second point bang on, which is Jet Fuel Gelato.\n\nAnd Mike mentioned in the opening remarks, it launched in late Q4 of last year as one of our, you know, newest innovations last year. And the commercial sales team really put a focus on driving distribution and making sure bud tenders and since stores were ordering at the right levels. And we're happy to see the results through year to date. And just in July, you know, we try not to get forward-looking, but July has passed now, it became the No.\n\n1 SKU in Ontario. And so, having that has been the No. 1 SKU and I believe Pink Kush was No. 3 SKU, No.\n\n1 strain overall. Those are tremendous results. So it just goes to show you that, innovation is important and we believe in it holistically. But equally important is the emphasis on the sales side and the distribution.\n\nAnd we've spent a significant amount of time, and Steve alluded to in the SG&A piece, around building out our sales team to provide best-in-class service. But a key underpinning of that is our category management tools that we put in place where we've been able to aggregate data across Hifyre, the board, provincial sales data, as well as retailer data that we've purchased and built into our tools to make sure we're understanding how to drive those points of distribution on the -- at the SKU level that matter to the store and the region. And so, building that platform and seeing the results in Pink Kush and Jet Fuel Gelato are so important as we launched the new strains that Mike mentioned. So, launching Bubble Mints was really important.\n\nAnd then some of the newer strains, Sugar Cookies and Berry Cream Puff, the latter, which is a sativa, which was really absent in our portfolio, having a high-performing plus-20% sativa, early days in those just initially launched. We don't really segment and break it out. But it takes a quarter or so to really drive home that distribution. And we feel confident about is all the tools we've put in place in making sure as we're product and brand-led or data-driven and that we can prioritize at the store level where distribution needs to be.\n\nSo, hopefully, that gives you the color, Scott, about how we drove Pink Kush, how we brought up Jet Fuel Gelato, and how we're positioned on these new strains, not just for flower, all of our products about how we can really tailor it into the region and the market and make sure our sales team can execute with efficiency.\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nI appreciate that color. And then can you expand a little bit on the different product format categories, kind of near-term opportunities you're getting market share, especially on the pre-rolled side seems to be a big focus for you. As you ascertain, you still, you know, have a nice 6%, 7% overall Canadian market share, 9% flower side of things, and then other opportunities on the derivative or the 2.0 products for Pure Sunfarms going forward and what the provincial boards are looking at from that standpoint to add more product formats to the shelf for Pure Sunfarms here?\n\nMandesh Dosanjh -- Head, Canadian Canabis\n\nYeah. Mike, you want me to take that?\n\nMike DeGiglio -- Chief Executive Officer\n\nYes, go ahead.\n\nMandesh Dosanjh -- Head, Canadian Canabis\n\nYes. So, Scott, absolutely on the pre-roll side, it was one of our, our best-performing segments quarter over quarter. Again, we don't break it out, but, you know, close to 20% growth in, in that segment quarter over quarter. And we see that, right? Customers going for convenience, sometimes shifting away, especially in the summer months are a bit more in the occasion driven, shifting their whole flower either to a milled or to a pre-rolled and both segments saw a great performance.\n\nSo, we're continuing, taking kind of the success we've had with our strains into the pre-rolled business. We've accelerated our pre-rolled automation internally and doubled the amount of equipment that we have and seeing good growth in our in-house production to meet that those needs. So, we're always going to be flower first, lead with those strains, come in with some of the pre-rolled offerings to continue that expansion. And we're not losing sight at all of vapes, definitely a third important category for us.\n\nStill in the distillate-based flavored offerings, we launched one new SKU recently, and we're coming back on the back half with some more innovation on the vaping side of the business. What the boards are really asking for is continuing to see the innovation at a scale that's going to allow them to meet large scale needs across their provinces while still innovating whether it's in pre-rolled format. We're not going to give away too much, Scott, but we have some really good innovations coming on in the back half of the year around some emerging categories in the pre-rolled space, as well as on the flower space. So, lots more to come from us and definitely heavily weighted on the back half of the year.\n\nAnd we're excited given the setup we've had right now with our sales and brand team.\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nI appreciate the color. I will jump back in the queue. Thanks.\n\nOperator\n\nYour next question comes from Pablo Zuanic from Cantor Fitzgerald. Please go ahead.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nYeah, good morning. Just one question. You know, as you're launching all these new products, as these question marks are beginning to come out about your distribution capabilities, right, and you've answered the questions. But can you help us understand better your wholesale business? Because $8.6 million this quarter, right, 21.1 branded, what does that say about your distribution capabilities? I mean, are the people buying your product? Are they buying trim? Are they buying full flower? You know, are they doubling the price and selling it under their own brand? I'm just trying to understand better what they do with what they buy from you and what that may say about your distribution capabilities.\n\nThanks.\n\nSteve Ruffini -- Chief Financial Officer\n\nMandesh, I'll take an initial shot at that. So, our nonbranded business, it has a lot of trim in it, obviously. We're not in the business of growing trim. It's a secondary product of our flower product.\n\nDue to our potency and our quality and consistency, our trim is in high demand. We don't put any cost against that because we're not in the business growing trim. With respect to all flower that we grow, it's not a 100% grade A, large-bud, medium-sized bud that we can put into a Pure Sunfarms or even our other brands. So, that becomes available to others.\n\nAs to what they do with it, Mandesh, I'll toss that one to you. We're not in control, Pablo, of what they do with it. But most of what -- most of our nonbranded business which I alluded to is a fallout from the -- what we can and cannot do with the supply, our own supply with our own branded sales. So, if it doesn't meet our own quality specs, obviously, we're not going to put it in.\n\nIt's nothing to do with our distribution capabilities. It has to do with the quality and potency of the supply. So, Mandesh, you want to add any color to that?\n\nMandesh Dosanjh -- Head, Canadian Canabis\n\nYes, I think, Steve, you handled it beautifully. And the key point is, I don't think it speaks to our distribution capabilities. This is a build for our Canadian cannabis business on the branded side, acquisition and integration with ROSE, as well as the brands, we continue to launch, Pure Sunfarms, Fraser Valley Weed Co., and we'll continue to look at that. Steve mentioned it is about selling trim, extract-grade pieces that we can't use.\n\nAnd we're all going to be in situations where we may have an overproduction and outlet some of that excess inventory. You know, we've been building out the facility, Pablo, as you've seen Delta 3 and half of Delta 2. I mean, we're producing, and we want to, you know, continue to generate profitable growth for us. And we're not going to sit on that inventory if we can move it.\n\nBut the goal, and we've always said it, is to continue to build our branded business. It's going to take time. And so, if we can make profitable sales in the meantime, we'll continue to do that and have that, you know, grow there for us as we look to make the pivots. And Steve mentioned anyway, I don't always know what our customers do with it, but I will tell you that it's not a concern in terms of competing with us out on the branded side.\n\nWe have a plan forward. We have our data analysis and category management tools in place. We've expanded into new provinces over the last several months. We're laying down foundations for international exploitation.\n\nWe feel really solid, and, you know, the nonbranded sales piece, we'll always kind of be in that 20%, 25%, potentially 30%, in a quarter of revenue. But we feel really confident in our distribution supply chain capabilities and the branded sales team we've put in place and our ability to execute.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nThat's very helpful, thank you. Just one quick follow-up, I know we are almost out of time here. But, Mike, in terms of the strategic alternatives for the produce business, will it make any sense to just, you know, stop the tomato business at all and stop it 100% but keep the facilities for that optionality you talk about? Or that doesn't make any sense because it would be just too much stranded cost?\n\nSteve Ruffini -- Chief Financial Officer\n\nWell, you could say it probably made sense this quarter, the last two quarters. But when you -- when we looked at that all the time, I mean to mothball a facility of that magnitude, these are, you know, multimillion square foot facilities and you mothball them, you add up the property taxes, the insurance you need to keep on them, the maintenance to keep them up to speed because they'll deteriorate if they're not in operation. Like parking an airplane. If you park, it's the worst thing you can do.\n\nSo, when you add up security in a normalized year for us, it's better to produce even if we have a negative $2 million to $3 million, $4 million EBITDA, and that's always been our goal. Like I said, in 2020, we had positive $5 million EBITDA. This has just been a rough year. Inflation came up so rapidly, Pablo, and hit us so hard that these are some of the toughest numbers we've ever had.\n\nAnd that's why we're going to try to arrest it. But, yeah, obviously we've looked at that. And there are other things we're considering, I mean, down the road, but it has not penciled overall to just keep that optionality going so by just mothballing them. And if we mothball one or two of them, it just -- you know, if we wind up losing a key customer, it's going to be very hard to get that customer back, whether it be a Walmart or someone like that.\n\nBut those are the things we evaluate every day. So, I think it's a good question for sure.\n\nOperator\n\nYour next question comes from Eric Des Lauriers from Craig-Hallum Capital Group. Please go ahead.\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks for taking my question. How do you expect Canadian cannabis SG&A levels to progress in the second half and beyond? And when do you expect to see positive operating leverage return to that business?\n\nSteve Ruffini -- Chief Financial Officer\n\nWe, as I said in my remarks, we are projecting with the revenue growth that our SG&A spend will drop back into the lower 20% range for the balance of this year. That's -- we've mentioned in prior quarters, they is always going to be incremental spend the first half of this year. And we're expecting to see the fruits of our labor here in the short term over the next six months. So, we'll be reporting low 20% certainly going forward.\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nOK, that's very helpful. Thanks. And then I understood that provinces generally increase their purchasing in the second half. You've also increased production by over 50% here with Delta 2.\n\nCan you help us understand how you expect those volumes to sort of flow through sales versus inventory build over the coming quarters, just your overall expectations of what -- just the sort of total package, you know, understanding provinces do increase purchasing, but you also have a lot more volumes. Just kind of how to expect that to flow through here? Thanks.\n\nSteve Ruffini -- Chief Financial Officer\n\nWell, we're very confident and, you know, starting to see some of the provinces that have better than others with respect to giving us an indication of upcoming orders. So, we're very confident that we will see the continued seasonality, which we've talked about in prior years. Yes, September, October, November tend to be very strong months. And the provincial buyers, you know, build up their inventory for the December, January period.\n\nSo, with the new initiatives, new strains, new brands, obviously with the -- we'll have obviously naturally because of the -- we're now in Quebec as Canadian cannabis business. Obviously, that will be incremental to our Q3 and Q4 because we weren't in Quebec last year at this time. So, we do have a home for our expanded production and we are expecting to move those kilos, incremental kilos, year-on-year kilos into our -- out of the inventory into sales.\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nOK, great. Thank you for the color.\n\nOperator\n\nYour next question comes from Andrew Partheniou from GMP Securities. Please go ahead.\n\nAndrew Partheniou -- GMP Securities -- Analyst\n\nHi, good morning. Thank you for taking my questions. To start off with produce, part of this quarter's headwinds, you alluded to oversupply with Q2 being the typical seasonally highest quarter. I think last quarter you mentioned supply conditions could be better in Q4 this year with margins perhaps returning to positive in produce, understanding that, you know, you initiated an operational review here.\n\nBut are you still comfortable with your previous assessment that Q4 could show improvement on the produce side? Or do you think there's not enough visibility at this time to keep that expectation?\n\nSteve Ruffini -- Chief Financial Officer\n\nWe're still forecasting to have improved Q4 results. Seasonally, historically, Q4 has been better than Q2. A lot of that depends on both the global and the immediate impact of the brown rugose on our own crops. Any number of our competitors in North America are all experiencing, you know, the challenges.\n\nSo, a lot of that really depends on produce is very much a demand and supply business. And we can -- we're very dependent. Our profitability is very dependent on price. So, depending on where, you know, our competitor supply is and based on what we hear on brown rugose, it could be a strong quarter, but again, it's -- pricing is very dependent on real-time pricing.\n\nSo, we are, you know, forecasting improved fresh produce results for the balance of this year.\n\nAndrew Partheniou -- GMP Securities -- Analyst\n\nThanks for that. And my second question is on the Canadian cannabis business. It seems that OCS has been hit with some kind of distribution disruption. Just wondering if you have any color on that and when shipments could return to normal? Are we -- should we be thinking about modeling some kind of impact in Q3?\n\nSteve Ruffini -- Chief Financial Officer\n\nI haven't heard of that, but, Mandesh, you go ahead.\n\nMandesh Dosanjh -- Head, Canadian Canabis\n\nYes. So, Andrew's referring to there was some sort of a data breach on the OCS side that impacted their supply chain. It was impacting some of their orders getting out. Look Andrew, it's early days.\n\nWe're not anticipating any long-term ongoing issues. I believe this might be the second time that OCS has had a data breach. Not sure of the specifics and how it's impacted. It's not our business, it's the OCS.\n\nSo, I'll get some updates from the team. I'm not expecting any kind of material impacts to our business at all given that they've had this before. The encouraging piece is the OCS has come out to say that they will waive emergency order fees for retailers and are looking to get back on track. So, I think it's a short term blip, Andrew.\n\nAnd until we hear more, I don't anticipate any issues right now.\n\nAndrew Partheniou -- GMP Securities -- Analyst\n\nI appreciate that color. I'll get back in the queue.\n\nOperator\n\nYour next question comes from Doug Cooper from Beacon Securities. Please go ahead.\n\nDoug Cooper -- Beacon Securities -- Analyst\n\nHi, good morning everybody, just most of my stuff has been asked. But just a quick one, maybe Mandesh or Mike on the Fraser Valley targeting, let's call it the hardcore user. I guess, data that I've seen from other markets such as California is, that guy that you're talking about represents an over preponderance of the actual supply of product. So, if he is -- if that user you're talking about is 60% to 70% of the total cannabis volume in the country, what's the implication -- how much of your sales do you think Fraser Valley will end up being and the impact on margins?\n\nMike DeGiglio -- Chief Executive Officer\n\nGo ahead, Mandesh.\n\nMandesh Dosanjh -- Head, Canadian Canabis\n\nYes, sure. So, thanks for the question, Doug, good to chat. So, we're going to go back to some of the data insight just to target on the percentages, because we've looked at this through five, six months of this year. So, we took a look at flower sales through six months of this year compared to last year.\n\nAnd we segmented the businesses -- sorry, the regions British Columbia, Alberta, Ontario into three buckets. We used Pure Sunfarms as everyday premium is what I'll call core pricing. And then we looked at premium, which is indexed above and value, which is indexed below to try and take a look exactly like you said, I think you referenced, I don't know it was 60% in California. And so, I'll just throw out some key stats for you.\n\nSo, in British Columbia, as an example, we see about 45% of the flower business be in that value space and that core of what Pure Sunfarms plays about 30%. In Alberta, it's about 37%. And in Ontario, it's about 22%, where that core everyday premium is definitely the leader in kind of this space. So, British Columbia leads on the value side.\n\nAnd I think that's a bit of a function of the cannabis consumer understanding quality, understanding pricing, obviously, also having zero additional provincial excise taxes. So, some of that plays into it, so that's great for us. I mean, in the sense that that value segment, which, in theory, to a lot of other cannabis companies is not profitable for us. It still carries profitability.\n\nIt's our home province. It's got no additional excise taxes on it. So, you know, when I throw out those numbers to you, Doug, the 45% in the value space or 37% in Alberta. We don't believe it will make up that huge percentage of our sales.\n\nBut on the profitability side, it's definitely on the lower end of our margin calculations, but it's still a very great business for us. And it's early days to understand the full segmentation and to see the reach of how much of that Pure Sunfarms will index versus Fraser Valley. And I think over the next couple of quarters, we'll be able to assess. But we like the business profitable in that segment compared to most of our competitors, if not all of our competitors.\n\nAnd we like the early day trajectories of what we're seeing and the market share gains we're seeing as a result of it.\n\nMike DeGiglio -- Chief Executive Officer\n\nThank you, Doug.\n\nSteve Ruffini -- Chief Financial Officer\n\nAnd, Doug, I'll also throw in which hasn't been mentioned, the different brands have different strains, so we're very cognizant of the cost side of each of the strains. So, what goes into Fraser Valley it's, we don't break it out, cost by strain. But we are aware of the fact of trying to maintain our 30% to 40% margin on all brands in our branded category. So, that also impacts the gross margin percentage.\n\nDoug Cooper -- Beacon Securities -- Analyst\n\nOK, thanks, Steve. And just one clarification, the cannabis revenue, is there any medical or international sales in the quarter?\n\nSteve Ruffini -- Chief Financial Officer\n\nYes. On the international front, we continue to sell to Altum, which, obviously, is an investment of ours. We are providing funding enough medical cannabis in Australia since obviously recreational is. So, we are putting our flower into their branded medical, and over the last three quarters have sold roughly CA$1.1 million to Australia and are in the process of increasing our sales to Australia.\n\nAnd hopefully, we'll be announcing shortly some incremental export markets that we're not shipping to as soon as we pass the gauntlet of, you know, product clearances at the export company side. So, we're ready to go. We're just unfortunately waiting for regulatory approval on the import side.\n\nDoug Cooper -- Beacon Securities -- Analyst\n\nOK, that's it from me. Thanks very much.\n\nOperator\n\n[Operator instructions] There are no further questions at this time. Please proceed with your closing remarks.\n\nMike DeGiglio -- Chief Executive Officer\n\nThanks everyone for listening in today for the second quarter, and we'll talk soon. Have a great day.\n\nSteve Ruffini -- Chief Financial Officer\n\nThank you. Bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike DeGiglio -- Chief Executive Officer\n\nSteve Ruffini -- Chief Financial Officer\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nMandesh Dosanjh -- Head, Canadian Canabis\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nRahul Sarugaser -- Raymond James -- Analyst\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nEric Des Lauriers -- Craig-Hallum Capital Group -- Analyst\n\nAndrew Partheniou -- GMP Securities -- Analyst\n\nDoug Cooper -- Beacon Securities -- Analyst\n\nMore VFF analysis\n\nAll earnings call transcripts"
}