{
  "companyName": "Affirm Holdings, Inc.",
  "companyTicker": "AFRM",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/affirm-holdings-inc-afrm-q1-2023-earnings-call-tra/",
  "content": "Affirm Holdings, Inc. (AFRM 0.10%)\nQ1 2023 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. Welcome to the Affirm Holdings first quarter 2023 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded, and a replay of the call will be available on our Investor Relations website for a reasonable period of time after the call. I'd now like to turn the call over to Zane Keller, director of investor relations.\n\nThank you. You may begin.\n\nZane Keller -- Director of Investor Relations\n\nThank you, operator. Before we begin, I'd like to remind everyone listening that today's call may contain forward-looking statements. These forward-looking statements are subject to numerous risks and uncertainties, including those set forth in our filings with the SEC, which are available on our Investor Relations website. Actual results may differ materially from any forward-looking statements that we make today.\n\nForward-looking statements speak only as of today, and the company does not assume any obligation or intend to update them, except as required by law. In addition, today's call may include non-GAAP financial measures. These measures should be considered as a supplement to and not a substitute for GAAP financial measures. For historical non-GAAP financial measures, reconciliations to the most directly comparable GAAP measures can be found in our earnings supplement slide deck, which is available on our Investor Relations website.\n\nBefore turning the call over, we want to briefly note our shift to a quarterly shareholder letter instead of a lengthy press release and prepared remarks. We believe that this format will enable us to spend more time answering questions from the investment community. As such, we encourage to review the shareholder letter for commentary that we would typically include in our prepared remarks. In addition, we believe that the shareholder letter, when read in conjunction with our earnings supplement, will enhance our ability to communicate with the investment community.\n\nBoth documents are available on our Investor Relations website. This change was also influenced by feedback that we received from investors. We hope you find the shareholder letter informative, and we welcome any feedback. Hosting today's call with me are Max Levchin, Affirm's founder and chief executive officer; and Michael Linford, Affirm's chief financial officer.\n\nWith that, I'd like to turn the call over to Max to begin.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nThank you, Zane. We appreciate everyone taking the time to join us. Our results reinforce the confidence we have in our strategy and Affirm's ability to capitalize on our opportunities. Two years ago, that was time we were preparing for a journey as a public company.\n\nWe're now completing our eighth quarter as a publicly traded company, and it seems really good time to compare our results for the 12 months ending September 30, 2022, versus the 12 months ending December 31, 2020, which was the last calendar year as a private company for us. Since then, with comparison, we've more than tripled active consumers. We quintupled transactions almost. We grew transactions per active consumer 1.5 times, per transaction frequency by 50%, and near tripled our trailing 12-month GMV.\n\nBoth have doubled our revenue and almost tripled revenue less transaction costs growing at up to $732 million. All while, we've been in control of our credit results. Delinquencies and net charge-offs remain at or below pre-pandemic levels, very important to us. We remain focused while making sure to navigate the present macro volatility very possibly.\n\nWe're continuing to obsess over risk and transaction costs to maintain a strong unit economics. We will shift features that improve network scale and profitability like we always have. We're going to manage our opex carefully while investing in our highest conviction product opportunities. We're building deep connections with consumers and merchants who need us now more than ever before.\n\nBoth sides of our network can navigate economic uncertainty and we see this as an opportunity to solidify our position as a trusted and reliable partner. Back to you, Zane.\n\nZane Keller -- Director of Investor Relations\n\nThank you, Max. With that, we will now begin our question-and-answer session. Operator, please open the line for our first question.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of James Faucette with Morgan Stanley. Please proceed.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThank you very much. I want to talk first about this path to profits in 2023. Obviously, you reiterated that, but nevertheless, you're looking for little bit lower GMV and associated performance on the top line. How are you thinking about like the evolution of that timing and what you need to do to make sure you get to breakeven or profitability in 2023?\n\nMichael Linford -- Chief Financial Officer\n\nHi, James. Thanks for the question. Yes. We are still very much on time and on pace to achieve the profitability goal that we outlined, which just to recap everybody, we talked about getting to profitability starting in the first day of our fiscal '24.\n\nWe said on a sustainable basis, meaning that we'll intend to do it repeatedly most of the time and looking at adjusted operating income. And so for us, the challenge is some pretty simple math. We need our revenue less transaction costs to be greater than the adjusted operating expenses that we have in the transaction cost line. The key things for us then are making sure we're doing everything we can to maximize the unit economics in the business.\n\nAnd if you look at our back half of the year road map, we have a lot of focus on making sure we're doing all that we can and should do there as Max outlined in the letter. And we're going to be mindful about controlling our operating expenses. And to that, that means being very careful, in particular, on hiring, but also making sure that we're not having any pockets of waste in the business. As we continue to scale the business and make the right investments, we also don't want to have dollars waste in the system.\n\nIf you look at our kind of guidance, the back half of the year and the adjusted operating expenses that are implied by that, we feel like we'll put this in a really fit shape so that we'd be exiting right where we want to be to achieve that goal for next year.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nAnd then on -- a lot of places we could go but let's start with starting with delinquencies. You mentioned in the prepared remarks that you're still a bit below where you were pre-pandemic. However, directionally, you're starting to get pretty close to those levels now. And just wondering how you're thinking about like managing that, especially since I would think that there would be an increasing number of repeat customers in that 2023 versus pre-pandemic, which if they're repeat, you would think that they would tend to be better behaving in terms of at least delinquency, etc.\n\nSo where should we think that you'll try to top those out at? How are you going to manage that? And what's the -- I guess, the prognosis for when you would do that and under what conditions?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nI'll start and I think Michael can probably help quantify second half of the question. So just to set the stage, the most important thing to take away from us, we are not just managing credit outcomes, we set them. The whole point of these ultra short-term 4.6 months weighted average life of every loan, every transaction is underwritten. We have full control of transactions requiring down payment, or not, we control the amount of down payment, etc., etc.\n\nSo we have lots of levers we use to control risk. We've said about talked about this many, many times, but never gets old. And that gives us a lot of very nimble controls over the actual credit outcomes. So we set a number we want to hit.\n\nObviously, every week, we get a stack full of new formation going back all the cohorts that are still active, and we adjust credit that we have been now managing it quite actively to make sure that we get to the numbers that we require. Because the back book runs off very quickly, we have a lot of control. This compares pretty favorably with the rest of the industry that does things like credit card consolidation loans or personal loans that go back years and there's nothing you can do about it. So that's just a really important thing to understand.\n\nAnd again, I apologize for -- to those who from this sounds like just an old repeat, but this really is how this business works. And the reason our numbers are strong as they are today, and you can see this in the letter, is not an accident. It's not as though the world hasn't changed. There's plenty of stress on the consumer in the lower income brackets, lower credit quality.\n\nWe're just good at managing, and we do underwrite every transaction, and therefore, we have a lot of control. So that's sort of the backdrop. The counterpoint to this is the demand for BPL is increasing. We serve our consumers, we see demand in the application side of things.\n\nGenerally speaking, people are turning -- not just going to look at credit cards, people are turning to more than they used to do that. I mean we're not done in the higher income brackets spending through the pandemic stimulus, but they're getting closer, probably sometime mid-next year is when we'll see the exhaustion of those savings. But today, the lower income groups are already done and they're trying to turn to various forms of debt. We believe pretty firmly we have done the best alternative out there.\n\nWe have 85% repeat transaction from existing consumers to prove that. And so you have enough demand, and we do have a lot. We have enough diversity of merchants whereas folks shift out of Connected Fitness and finance our homewares you go for big box, more commodity purchase. We are there to help them with all those things.\n\nAnd so demand is still quite strong. If we have control, as we do all of our credit outcomes, we can manage to the number that we need at once. That's sort of how we're doing it. Michael can give you a little bit more data on exactly where we intend to run it.\n\nBut again, this is the choice we have as opposed to a thing we have to contend with.\n\nMichael Linford -- Chief Financial Officer\n\nThat's right. And it varies by product, and it varies by merchants that we're at. So I think your point is very well taken that we do see substantial improvements in credit quality as we see more repeat usage. And I'll note that we're still acquiring new users at a pretty good clip and thinking about the business is still feeling and we're not done with the acquisition side of the equation, certainly not on a gross basis.\n\nThe additional disclosures that we've got now in the shareholder letter would really encourage folks to spend some time with them, both looking at the delinquency trends, which we now show 30, 60, 90 as well as we've got the net charge-off curves for our monthly loans and then given you some trending that you can see on. And I think the biggest takeaway for all of those is that we are dialing in where these things are. It's going to be a week or a month that varies up or down, but we get to dial in where those losses, and that's such an important strategic piece of this business, that we can take that loss, then we can have confidence in how we think about the credit losses with respect to our capital partners, we have confidence in how it affects our P&L and allows us to confidently go approve to a very deep level. I think if you put us up against most of the people in the traditional financial institution world or most people who do unsecured consumer lending, our results are really good.\n\nAnd we feel like that is a real strength for us, and we're not going to treat it lightly. That's something we're going to continue to do, first and foremost, as it's an important aspect in everything that we do.\n\nOperator\n\nThank you. And --\n\nMax Levchin -- Founder and Chief Executive Officer\n\nWhile waiting, just for what it's worth, I'm not the only person who looks at credit at this company. I'm one of the very significant number of you does that. But when I look at our credit outcomes, I look at fried data basically performance by vintage? Strong plus one to Michael, please have a look at what we put out in the letter. We really wanted to communicate very clearly to our investors that this is the one piece of the business that matters to us, should matter for our investors, and we are in full control, and we look at these things on an over-debt basis as we think you should.\n\nOperator\n\nThank you. Our next question comes from the line of Moshe Orenbuch with Credit Suisse. Please proceed.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGreat. Thanks. In the past couple of quarters, we've talked about the potential to change price to consumers. Does the fiscal '23 guide for revenue less transaction costs assume any pricing changes? And if not, what would it take to get you to start that process?\n\nMichael Linford -- Chief Financial Officer\n\nExcellent question. So the short answer is there's a number against across merchant, consumer pricing and the rest of our transaction cost line items that are not reflected in our guide. Those remain as upside and a little bit, if you will, so how we think about the guidance, we want to be really careful to put in the guidance things that we are certain about as opposed to things that we hope will deliver and help close the gap. And that's why we, for example, look at the current forward curve.\n\nWe don't have a proprietary house view of rates. And we try to look at the current shift and live features of the product. And so there is some aspect of higher APR, but the majority of the opportunity for higher APRs to consumers is not reflected in the guide as is the opportunity we have on the merchant side from a pricing perspective.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGreat. Thanks. And as a follow-up, given the funding stresses that you and others in the industry have seen this quarter, could you, and maybe Michael, talk a little bit about what your plans are, obviously, given going into a quarter where you're going to generate a lot of interest-bearing loans? Do you have an outlet for them? And you mentioned in some of the text here about the potential for lower gain on sale. Could you maybe put some numbers around that, how much lower? And how should we think about it? Thank you.\n\nMichael Linford -- Chief Financial Officer\n\nYes. The thing we're pointing out in the letter is that we think we'll be slightly above the 5% equity capital required, which as you know, we've been running substantially lower than that over the past several quarters. That does reflect what we think will be a higher usage of balance sheet, in particular, where health financing into this quarter. So let me answer the broader question for assuming all the way out.\n\nWe have a lot of conviction and confidence in our ability to fund the business. I don't think we're worried about that at all. The question for us is going to be the shape of the P&L as it goes through the various funding models that we have. And it is the case that we will have slightly more on balance sheet, which means that as you see in the Q2 guide for that revenue less transaction costs, you have two factors that are really affecting that number in the quarter and the reason for the back half of the year acceleration.\n\nThey are the late in the quarter origination, late November into December origination of interest-bearing loans that end up on the balance sheet. That creates a lot of vertical pressure, meaning the period Q2 results will be depressed on a percentage of GMV. When you look out to the back half of the year, we're implying acceleration a pretty meaningful one in revenue less transaction cost. That is an assumption of a material change in the economics of the business that simply the stuff that we'll originate in Q2 flowing through the P&L in the back half of the year.\n\nThe opportunities in that again that you alluded to at the very top, those have actually just be on top of or in addition to the acceleration that we're currently going to.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Ramsey El-Assal with Barclays. Please proceed.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Thanks for taking my question this evening. I was wondering on the changes to guidance, if you could disaggregate the impact from Peloton, I think that you called out in the shareholder letter, versus other factors?\n\nMichael Linford -- Chief Financial Officer\n\nYeah. So I think there's two drivers, and then there's some math you can do. The biggest drivers are Peloton, both and most acutely in our second quarter. So to give you some context, in our second quarter, we talk about a GMV growth rate that would be 40% instead of the guided to 31% in the second quarter.\n\nAnd we'd estimate that on a revenue basis, we would be up 29% in the second quarter instead of 16%. Obviously, that's a very material headwind with respect to the top-line measures in the business. Back half of the year, that starts to attenuate quite a bit. But in the back half of the year, we are modeling the impact of the movement in rates.\n\nAnd we talked a lot about there being roughly 30 basis points of headwind, of which we're mitigating roughly half of that in our guidance in terms of the RLTC take rate. And so those are the two biggest drivers. It's important to talk about the cause -- those are the effects and the root causes. But one of the important things, as we were just talking about, is as we use the balance sheet a little bit more in Q2, you're going to, again, change the shape a little bit of that margin and that will continue on throughout the course of the year.\n\nBut we think it's more of a onetime change in terms of the warehouse usage that we'll see next quarter, and we'll run the business at that level for the next couple of quarters, which will result in more revenue that we'll earn later for originations, and that trend will show up as you'd expect.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nOK. And one follow-up for me. You also mentioned in the shareholder letter that your sensitivity to additional interest rate increases has decreased since you initially gave us a look at that in February. What are the drivers there? What is helping that number come down?\n\nMichael Linford -- Chief Financial Officer\n\nHonestly, I think it's as much anything actually observing the impact that our counterparties are flowing through rates. When we gave that initial framework back in February of this year, we were taking into account a lot of the potential first and second order effects. And obviously, we were doing it -- we gave you a framework to think about it as every 100 basis points, there's a second or third order effect, too, because the seatness of the curve begins to affect decisions and I think it's more just as we've observed and seen the impact, we're just updating the range for everybody.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nGot it. All right. Thanks so much. Appreciate it.\n\nOperator\n\nOur next question comes from the line of Mike Ng with Goldman Sachs. Please proceed.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nHey. Good afternoon and thank you very much for the question. I just have two. First, Max, I was just wondering if you could give us an update on new product development for things like brand-sponsored promotions and whether or not the CFPB report and things like that change the product roadmap strategy at all.\n\nAnd then second for Michael. I was just wondering if you could talk about what GMV may have looked like, excluding Amazon. And I hear you loud and clear on the RLTC and AOI margin path for the rest of the year. As we go into the back half, is that improvement in margin really driven by, I guess, like gross take rates on interest income and then servicing income because of that late fiscal second quarter originations? Thank you.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nSo probably the most important thing to respond to, the CFPB point. I don't know if you had a chance to read it. From my point of view, it's a great document describing the state of the industry. I think they did a pretty thorough job both interviewing and summarizing what the industry is doing.\n\nGratifying to have my S1 letter quoted in the CFPB report, that was an interesting highlight. No, I don't think our road map has changed at all. In fact, if you look in many ways, the letter essentially highlights that there's lots of companies in the BNPL space. And there's one that's very different.\n\nAnd they didn't go as far as naming us, but we're the only ones who doesn't charge late fees, doesn't have a sort of other shenanigans that regulators really dislike. And so I feel pretty great about what I said there. Probably the most interesting sort of material thing in their note is coming in the industry essentially to help consumers build their credit history and credit scores through the NPL loans. And we've been working pretty closely with the accredited reporting agencies and various other participants in the industry to help further that along.\n\nAnd so we'll definitely continue listening to what the regulators have to say in the matter and that our own ideas, etc. But generally speaking, I felt that it was a very positive thing for the industry and certainly for a firm. Our road map is not impacted. Brand-sponsored promotions are, I would say, you'll see more of them going forward.\n\nIt has two components to it. One is the build-out of the -- what takes engineering is the product has to be actually fully built and we are making pretty great progress there. I don't quite have all the building littles that I want, but it's a thing that's live in a bunch of places. And then it becomes a matter of sales where you actually have to bring it to merchants and manufacturers and brands.\n\nAnd so we're getting on that. Like everything else we do, these things will take time to build. I think we'll, at some point, break them out to sell off just how cool they are and how margin-rich they become, but that's probably a conversation for another time. I feel like I may answer the question.\n\nWas there more to it? Yes. No. Thank you. I think I covered it.\n\nI don't have to say more.\n\nMichael Linford -- Chief Financial Officer\n\nAnd then in terms of the kind of back half of the year. And I understand the question correctly, you're talking about that LTC as a percentage of GMV, improving pretty meaningfully in the back half of the year. It's really just really simple math. As you put more interest-bearing loans on the balance sheet, you defer or you earn the revenue as those interest payments are made throughout the course of the loan.\n\nSo if you take a 12-month loan that's originated on in December, for example, most of that income happened in the back half of the year. What's important, though, is the provision for credit losses for those loans will happen upfront. And so that means as you get less revenue, less transaction costs in the period, even though those loans are very good and profitable for us throughout the year. But then more broadly, I think it's just really important to remember how early we are with these large partners and with the program overall.\n\nWe talked about some mitigants earlier that are things that we're working on right now, but don't yet have reflected in the forecast. That's on top of the very long list of projects that we have that focus on the unit economics, as Max talked about in the latter. And that's the ordinary course of business. There's something special about that, but something that we would and will continue to do regardless.\n\nAnd those can range from settle optimizations that we have on the process play page, tweaks that we can make to how our app search feature work to really drive better revenue take in the period and the list goes on. And those optimizations and those opportunities represent for us a lot of the upside here. But the primary driver in the guidance is the flow-through of the larger balance sheet in experience.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nExcellent. Thanks, Max. Thanks, Michael.\n\nOperator\n\nOur next question comes from the line of Andrew Jeffrey with Truist Securities. Please proceed.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nHey. Thanks for taking the questions. This is Julian on for Andrew. Just want to talk -- go back to the credit side.\n\nI know you just mentioned that the provisioning would kind of, I guess, be more front half-weighted and then we'll see kind of it come down in the back half. Is that the right way to think about that?\n\nMichael Linford -- Chief Financial Officer\n\nYes. So we always provision at the time of purchase. Well, when we own it, strictly speaking. And so that's always the case.\n\nThe difference is as we -- on the margin, we'll have less marginal growth dollars being sold versus place on the balance sheet, you'll just -- you'll actually carry the provision versus getting the gain on sale and no provision. And so like the income profile just changes a little bit as you think about those loans being on the balance sheet versus off.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nGot it. OK. Thank you. And if I can just get one more in.\n\nCan you kind of quantify maybe the non-Amazon growth versus Amazon growth embedded in GMV this quarter? And then also, it seems like it's a pretty good 2Q guide, all things considered. So just kind of maybe quantify that a little bit.\n\nMichael Linford -- Chief Financial Officer\n\nThank you. We can't quantify. We're not disclosing GMV by partner here. What I would point you to is we do disclose the near 500% or over 500% growth in the general merchandise category that does pick up a number of merchants, including Amazon, Walmart, and Target.\n\nThose are big, all of which had growth and strong growth, but we're not breaking out GMV by part.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nGot it. OK. Thank you. That's it.\n\nOperator\n\nAnd our next question comes from the line of Reggie Smith with J.P. Morgan. Please proceed.\n\nReggie Smith -- J.P. Morgan -- Analyst\n\nHey, guys. Thanks for taking my question. You have a slide in your presentation that shows 30-day delinquencies. And I guess wanted some help kind of interpreting the data.\n\nSo when I look at kind of pre-pandemic, it appears that DQs kind of declined as the year progresses. But when I look at '22, it increased as the year progressed. And so what conclusion should we draw from this charge? Should we expect things to kind of follow the arc of pre-pandemic? Is that what you're suggesting or our DQ is going to continue to kind of increase? And I have a follow-up. Thanks.\n\nMichael Linford -- Chief Financial Officer\n\nYes. So there is a seasonal pattern to credit performance in our experience that relates to both the purchasing patterns consumers have as well as certain key cash flow milestones like, for example, the tax refund time lines. What you saw during the pandemic was pretty a big surge of available monetary supply and liquidity given to consumers, which really did affect pretty substantially what was in the ordinary pattern that you'd expect to see. And so as we're kind of shedding all of that excess consumer liquidity, I think you're going to see a more normal pattern for consumer credit trends in terms of the seasonality.\n\nAnd that's why we're referencing back to the pre-pandemic period. And if you see on Page 10 of our letter, you'll see us sitting around on top of the FY '20 pre-pandemic trends, which we feel like is, again, right where we'd like the business to be.\n\nReggie Smith -- J.P. Morgan -- Analyst\n\nGot it. That makes sense. There's another slide. I think you guys hinted at the potential of raising kind of merchant fees.\n\nObviously, interest rates have gone up a lot this year, but you've held your zero interest take rates relatively constant. Can you talk about, I guess, the process for raising those? Is it kind of like a bolt-on that goes out? Do you have a sense that there may be some merchant pushback? And everybody obviously recognizes that rates are higher, but how -- mechanically like how would that actually play out? And again, sensitivity, how sensitive do you think merchants are to higher zero interest rates?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nSo you're right. We have not, generally speaking, moved prices on either consumers or merchants to date. I think everyone -- but everyone understands that our largest supplier increased their price threefold, as Michael put it the other day. And at some point, one does pass the cost on to their customers.\n\nThe process with merchants is a little bit different based on the type of partnership. So obviously, some of our largest merchant GMV segments come from platform partnerships like Shopify. Others are individual platform like Editis, G Walmart, and Amazon. And then there's a whole list of directly any rigs that are either on the platform or not, but we have a direct relationship.\n\nThere's no third-party platform involved. Those are probably the buckets. In the case of fully directly integrated folks, it's a notification that there's different contractual time lines that we've committed to, to giving them notice change of price. Obviously, they have some ways of reacting, for example, like a virus in some cases, in other cases, they can try to negotiate, etc, in the platform and the really large quantity platform merchants.\n\nObviously, it's a little bit more of a conversation because they are responsible for a whole host of underlying merchants that have -- and have other financial relationships with those folks. So a lot of times, it depends a little bit on their schedule of raising their own prices, which they may or may not be thinking about. And so the merchant side of the equation is a little bit slower moving. The consumer side, we obviously have quite a lot more control because obviously, every transaction is underwritten and the price and it does change based on credit quality and what we're seeing, etc.\n\nAnd we have to follow their lending laws, so we can't change on one person or the other. So there's a fair amount of consideration there. All that said, we've done this before. At the very beginning of the pandemic, we went to our merchants and told them that we have no idea what's going to happen next, but we expect our risk to go up very substantially.\n\nAnd therefore, we will price it in with them. At that time, I think exactly zero merchants fired us or did anything but say, we get it, we're going to work with you because it's important for us to continue selling. So feel pretty strongly about our ability to command the price for our products and include the fluctuations that we see in our supply. But it's not an instant switch, but it's something that we've done before.\n\nI feel very confident we're able to execute on if we should decide to do so.\n\nMichael Linford -- Chief Financial Officer\n\nAnd I would say that the tone from a lot of merchants right now, there's two pieces that are tugging around this conversation. One is a lot are focused on margin. And all of our merchant partners, and clearly, anything that's perceived as an additional cost is under a lot of scrutinies. On the other hand, I think a lot of merchants are looking at their own outlook, the holiday season and to early part of next year and are looking for ways they can get back some of that growth in volume they had before.\n\nThose two things always net out to a good deal that allows us to the economist we need and drive the volume that we need to them. But it is unconstrained. Merchants do have real margin constraints services right now.\n\nReggie Smith -- J.P. Morgan -- Analyst\n\nGot it. Can I sneak one more in real quick?\n\nMichael Linford -- Chief Financial Officer\n\nYes. Go ahead.\n\nReggie Smith -- J.P. Morgan -- Analyst\n\nGot it. Perfect. So obviously, you guys report your reserve rate and it was down sequentially. Thinking about like how am I going to explain that to investors and the things that come to my mind are you've got more repeat customers, you got a better view of the customer.\n\nAnd then also your average life of your portfolio was only nine months now. Is there anything else I'm missing there? Or what else can we add to maybe address concerns about a declining reserve rate?\n\nMichael Linford -- Chief Financial Officer\n\nYeah. Again, I would -- I'd start with, first, just how we think about the reserve. I think some financial institutions have a team of economists who are thinking about the state of the consumer and trying to make a forecast with their reserves. If we did that by the time we got the answers from the every tower, the loans would have paid back.\n\nAnd so instead what we do is we look at the actual performance of the loans, and we look at the ITC score, the credit score that we get loans when they originated, and use those two things to indicate how those loans will perform. And then we look at whether or not those predictions of performance are holding up. And that's very math-driven. We're not sitting here with a lot of judgment up and down or prognostication about future trends and deterioration in credit.\n\nIt's very math and model driven. And if you look at, for example, again on Slide 11, our Page 11 of the letter, take our pain for loan performance. You see pretty material reduction in the credit losses that we have for our pay-for-product. While it does turn over very fast, it isn't the biggest part of our allowance, it is all on the balance sheet and will continue to be and therefore has, as you improve the quality of losses in that product, you're obviously going to see less need for it.\n\nAnd similarly, I think a lot of the stress that we talked about starting to see in the end of our last fiscal year, the mitigates that we took resulted in us originating a higher quality asset going into this quarter and into the back half of this year. And that higher-quality asset at would suggest it has a lower loss content. It's a good thing. It's not that it's not a bad thing.\n\nIt's a very good thing that we estimate less losses in the loans that we're originating.\n\nReggie Smith -- J.P. Morgan -- Analyst\n\nThat's helpful. Thank you.\n\nOperator\n\nOur next question comes from the line of Chris Brendler with D.A. Davidson. Please proceed.\n\nChris Brendler -- D.A. Davidson -- Analyst\n\nHi. Thanks for taking my questions. I'll start with another one on the credit side. Can you quantify at all sort of -- obviously, it's a more difficult environment across a number of issues.\n\nBut for consumer credit and sort of the tightening you've done, the trends are really impressive just given all the concerns we hear about the consumer. But how much of an impact does that had on your growth forecast maybe for this year? I don't think you really changed your guidance that much on GMV. So is that a factor? Or is there enough demand that that's offsetting the tighter product conditions?\n\nMichael Linford -- Chief Financial Officer\n\nThere's definitely an impact of credit on our volume. It's just nowhere near as substantial as I think some folks might think. The far bigger impact in the update in our guidance is the impact that we saw from Peloton. When you take a business that has a lot of headwinds like that, we thought we were being pretty conservative in our outlook for that business this year.\n\nAnd I think that it's underperformed even where we had set that bar. And that's the biggest driver of the reduction in the guidance for the year. We haven't given a way to quantify it, but we don't take that, for example, the movement in the guidance is because we sequentially have tightened our view on credit.\n\nChris Brendler -- D.A. Davidson -- Analyst\n\nOK. Great. Super helpful. A follow-up on the areas of demand and on their side, competition.\n\nI have to believe, I think we've really heard some competitors are struggling a lot more than a firm is. So are you seeing any benefits yet as you talk to merchants of the froth coming off in an improved competitive environment? And I'd love to hear sort of like your, I guess, take your temperature on your ability or sort of the thinking as you talk to merchants, is that going to be a conversation that you've already started? Or is that still one to come? Thanks.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nI'm going to try really hard not to sound glib and despite the football and take victory laps, etc., the short answer is yes. I've been saying this for a long time that we're about to quote about tide coming out and noticing that some people are swimming without trunks on. I wouldn't exactly classify our state of affairs as struggling, but I do believe some of our competitors are. And it is accretive to us.\n\nWe have merchants coming in and saying, \"Hey, would you guys consider side-by-side with a competitor?\" And where in the past, we would come in and ask them will they consider it, and they'd say they were fine, the approvals are good, and now approvals are not. And ours are still doing quite well. So that just makes it that much easier to take share. Sometimes side by side, sometimes and probably good rate of into brands that are turning us on either instead of or alongside some of our esteemed competitors because they feel they need to continue driving their top line and the competition no longer can approve as well as they used to.\n\nSo yes, it's been quite helpful to us, so long as we continue hitting our numbers on credit, which we absolutely tend to do, and keep approvals high, which should give you a sense that all these quarters I've been promising that the curve is really steep. We need to move our GMV just a little bit to reduce our prospective losses by a lot. It seems to be working out the way we promised it. So long as it keeps going, we'll continue taking share.\n\nChris Brendler -- D.A. Davidson -- Analyst\n\nAwesome. And congrats on a tough environment. And also thanks for all the disclosures on the credit. It's really helpful.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Kevin Barker with Piper Sandler. Please proceed.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nThanks. Thanks for taking my questions. I just wanted to follow up on -- considering your guidance, you've tightened underwriting, growth is slow to pay, but obviously a lot due to Peloton. When you look at 2023, are you assuming what the base case is for unemployment and whether it's slowing in spending? Or are you starting to put in place additional measures to assume that unemployment is going to spike or there's going to be something worse than what we expect beyond what most economists have in their forecast or the forward curve indicates? Is there something there that you're anticipating and managing for?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nI'll start on the credit side, and Michael probably has comments on the rate side of things. So we are anticipating some degree of worsening on the credit side of things. That said, we really concern ourselves with the next four and a half months of volume. That's just really, really important to mitigate.\n\nOur ability to manage credit to the numbers that we choose is a consequence of our ability to underwrite and get the data sources that we need make it -- do it very quickly. But probably the single most important structural part of how we're different from everyone else in the market is we have very short-term product. We're not granting lines, which means that a credit decision we made today, even if it's erroneous, will be the last time we made that mistake. And we're able to deal with a lot more demand that we choose to lend.\n\nAnd so as consumers feel more stretched, they come to us more often. That does not change that we apply the same level of diligence and care to every loan that we underwrite. And so we are primarily focusing on making sure that our data sources are fresh, that our models react correctly to the change in consumer behavior, which we have absolutely seen, given just over the last five, six years of operating, including the last six months of the current macroeconomic volatility. So all of that is fed into how we underwrite, but our ability to weather the -- whatever incoming storm might be headed our way is deeply rooted in the fact that we make very, very short-term, relatively speaking, credit decisions.\n\nAnd we have no shortage of demand for our product. I'll pause there. I just want to had another point to make, but Michael has a few.\n\nMichael Linford -- Chief Financial Officer\n\nNo. Just -- look, the way we approach it is always to take the current consensus, to take the forward curve or a rate assumption we don't try to grow. And there's a number of scenarios that could play out very differently. As you point out, we could enter into a recession and have more employment.\n\nOf course, that would probably have come with less pressure on rates than we're probably currently modeling. And the flip side is the rate probably could get worse and employment could continue to be very robust. And I think we're trying to just be middle of the road here and be very close around when we're assuming that the current macro consensus is where the business is what will play out, understanding that this forecast are always wrong, but we have to make of something. And so just like we did when we gave our guidance at the beginning of the year, we're going to peg it to the rate curve.\n\nAnd as rates move, you should expect that to impact our businesses with the framework that we give in.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nThat's really helpful. And then I appreciate the short duration of the product. Obviously, very --\n\nMichael Linford -- Chief Financial Officer\n\nOne last thing -- sorry, on that point, the point that I was going to make I blanked on. So one of the other things that we have because of the Adaptive checkout, which we had the presence of wanting to launch about a year ago, the menu of terms the consumer will see is programmatically determined by us. And so we have enormous amount of control over this, 4.6% average. The product isn't just in of itself short, we also get to decide whether a particular credit quality applicant sees the longest or longer durations versus the shorter ones.\n\nAnd so one of the things that you could say we're preparing to do, although we don't have to act on it right now, if we felt that the unemployment is about to spike or starting to go up really rapidly, we would necessarily pull in terms and make the 4.6% average go down just to make sure there are fewer opportunities for our borrowers to default. So that's another level of control that we have. And that typically corresponds very nicely just from research and past lives with the shift from luxury buying to general merchandise purchasing. People don't need to borrow quite as much, and therefore, shorter terms make more sense for the cash flow.\n\nSo this actually should not have the real impact on our take rate on the consumer side but will reduce our risk.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nSorry, Max. Go ahead. Yeah. I was just saying there's certainly quite a bit of advantage to having rapid velocity on your lending and being able to shift.\n\nWhen you think about the RTLC guide for the back half of the year implying quite a bit of improvement, do you feel like you could continue to hit that if things get worse? I mean, obviously, maybe there's a little bit of slowing growth and tightening underwriting, but you're going to focus more on profitability? Or does that get pushed out a little further, but still remains something that you can see in the future, at least in the near term, on hitting some of those guidance?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nI've attempted to make some sort of read my lips joke, but I will not. We will hit profitability on schedule. We are not pushing off profitability. The product we're focusing on are about creating more RLTC, creating -- mitigating some of the rate volatility.\n\nBut ultimately, we feel very good about our schedule. We are not suffering from any need to post on our data destiny. I think I'm not supposed to say that, but I like the alliteration.\n\nMichael Linford -- Chief Financial Officer\n\nAnd last thing we take our guidance really seriously even a lot onto it. And if our guidance moves because we think something has changed. And I think what you saw on the GMV outlook here, as we talked about, a pretty big impact of Peloton. And then obviously, we're digesting a pretty big headwind in rate.\n\nThere are certainly macro conditions that could make that goal and objective not come through, but we feel very confident as we sit here today.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nActs of God are not included in our guidance.\n\nOperator\n\nAnd our next question comes from the line of Bryan Keane with Deutsche Bank. Please proceed.\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nHi, guys. Just want to ask on two popular questions we get. Just on approval rates, it sounds like they stayed high, but maybe they were down a little bit in the quarter. Maybe you can just clarify that and then the outlook on approval rates, what do you expect?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nThe approval rate has actually stayed relatively flat throughout the quarter. In fact, they basically stayed flat for the last 9 months, if memory serves, with a slight uptick in the interim -- in the three months in between. The first three and the last three, we actually increased the approval rate a little bit. And so maybe this month -- this quarter, it went down a tiny time.\n\nBut this is sort of back to the products that we offer consumers. So we have an enormous amount of control over the actual shape of the risk we're going to take on. We, generally speaking, have a way of finding a way to say yes to a consumer. If somebody comes in and says, \"Hey, I want to borrow x $100 over y months or weeks,\" in some situations, the answer is, no, that's not going to happen because we just don't think you can carry this much cash flow burden on a monthly basis.\n\nHowever, we're very happy to help you with a lower monthly number if you're willing to prepay the delta basically. And that have a dozen other levers that allow us to shape the risk we take and the make sure we need the consumers where they are without adding unnecessary burden to our provision. So we have been certainly very active in using those levers. We do this at the merchant by merchant level, sometimes SKU by SKU level because we can infer which products are getting prioritized how and repayments and things like that.\n\nBut to date, we have not needed to slam the brakes on approvals. And again, and I said it before, credit is job number one. We will always prioritize matching to numbers that we feel we must hit to ensure capital partners see us as the best yield, most predictable yield generator for them. But that does not need for us that we have to turn people away the door.\n\nIt does mean that some people will have a slightly larger down payment request. In some cases, we will ask for more information. In some cases, this means that we need to see their cash flow data, which is somewhat burdensome, but it's better than being told no. And so we have a lot of confidence in our ability to maintain rates.\n\nAnd while we don't generally speak and contractually agree to guaranteed approvals with our merchants, the reason they keep us hired, if you will, and the reason they like to hire us over our competitors, because we always deliver on approval rates, first and foremost, and that helps them drive their top line and sales that wouldn't have happened without Affirm.\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nGot it. No. That's helpful. And then maybe just an update, Max, on the debit plus product and the rollout there.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nThank you for asking. I was wondering if somebody might remember. So actually trying not to be glib. So one of the things that I could do a year ago as the Product in Chief and don't feel like I can now is roll out a product with economics that I don't feel are fundamentally accretive to the business.\n\nSo sometimes I think in the beginning of last quarter or right around that time, we've basically taken the week list that we generated and given a pretty meaningful number of people sort of tens of thousands of active cards type level cards to observe the usage. As with every new credit product, you end up with economics you don't particularly like. And we spent the last three months just really chiseling away at all the various fraud vectors and loss possibilities and a whole bunch of new kind of losses that happen in debit loss. There's obviously pretransaction, which is very similar to -- for many of the product that we have inside the super app.\n\nThere's the post one, which is where you swipe and then you choose to split, how these are a 24-hour limbo with the transaction might turn into pay now or could become pay later. And then there's also inhibition funds, which is the pay now can become a default and bio. So there's a bunch of new vectors, both intentional, unintentional losses, spent the last three months just really making sure that we feel good about the unit economics of this product. We're almost there.\n\nI feel very good about it. And probably January 1 is kind of a realistic time line when we're going to start pushing this forward. Again, a product that is brand new. We're not going to, given today's reality of the question about our term profitability, nothing will be more frustrating than saying everything is awesome, we're hitting every number, except to debit loss turn out to be lost here than I thought.\n\nSo sorry about that profitability is postponed. That will not happen. That said, I feel quite good about where the profitability of that product is today. I'll feel a lot better in January when a whole bunch more planned.\n\nAnd that's when we expect to start actually delivering these cards. And you will know this pretty easily right now to get to debit plus, you have to either be in the selected group or we promote it or you kind of have to know your weight. I mean you can go on if you want it, but it's a little bit of work. The day you see Affirm app saying, hey, get yourself a debit plus, you'll know that we're starting to promote product quite aggressively.\n\nAnd again, we're not including anything in our guide about what debit plus will do for us in the volume or revenue on LTC basis just because it's a little bit too hard to model that right now. But we probably will talk about it quite more -- quite a lot more in terms of the actual expectations starting next calendar year. Hopefully, at least the point about, we will not risk our unit economics just to launch a product sooner than we're ready, those people give you to how we think about the economy today.\n\nOperator\n\nOur next question comes from the line of Mihir Bhatia with Bank of America. Please proceed.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thank you. I'm on for Jason Kupferberg. I just want to ask just a couple of questions.\n\nFirst was in your Q1 results in the first quarter, I think you mentioned higher interest rates impacting gain on sale with pricing with certain forward flow buyers. Can you talk about that a little more? Obviously, I mean, I understand interest rates are, but just trying to understand how often does that pricing get adjusted? And is the lower pricing like going to stay until I think these agreements tend to be two, three years? So just trying to understand, does the lower gain on sale now you're kind of locked into those lower gain on sales for the next couple of years? Or how does that exactly work?\n\nMichael Linford -- Chief Financial Officer\n\nThat's a good question, yes. And the commentary is really about the year-on-year comparison. The agreement is varying. Some agreements are locked in for the duration of the contract.\n\nSome have regular repricing triggers and it varies with six months to even floating arrangement. So we kind of have lots of different flavors. But I wouldn't -- we're not -- I'm not worried about being locked in at the worst rate. I think a decline in rates would be good for us and then.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nOK. And then I just wanted to ask about adjusted operating margin. The first quarter came in better than your guidance, but you -- I mean, obviously, the top-line guidance is coming in a little bit. But you've also -- you're also slowing down hiring.\n\nJust trying to understand, was there something unusual about the first quarter, like some expenses got pushed to the second quarter or something? Just what's happening there? Anything to call out?\n\nMichael Linford -- Chief Financial Officer\n\nNo. We did have a little bit of a benefit associated with some items that aren't repeatable throughout the course of the year, but the strength in the revenue less transaction cost is combined with slightly below hiring plan were the biggest drivers for us. In the first quarter, the reduction hiring plan is as much about managing the fiscal '24 number as it is about managing '23. Just think about the timing of the hiring that we have in the plan.\n\nObviously, an employee be higher in the last day of the fiscal year doesn't really affect the profitability in the year, but extra costs that we take into next year. And I think the focus for us is to get our units as healthy as possible and to get the operating expense as rightsized as we can going into next fiscal year when we feel like we want to be as fit and lean and strong as possible.\n\nOperator\n\nOur next question comes from the line of Eugene Simuni with MoffettNathanson. Please proceed.\n\nEugene Simuni -- MoffettNathanson -- Analyst\n\nHi, guys. Thanks for squeezing me in. Just got one question on the consumer engagement with the platform. So your transactions per active user keeps going up, which is great.\n\nIt's a great sign of better engagement. But if we do the math on sort of dollars spent per active consumer, that keeps going down. And I understand that there might be some mix factors in here, perhaps Peloton is influencing that. But can you talk about that trend a little bit? And do you see a path to getting consumers to spend more dollars with your platform over time? And how -- what are the leverage you might be able to use to encourage them to do that?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nSo I think the -- there are kind of two competing vectors here. And to be completely honest, I track slightly different metrics. I care about average ticket size for every transaction and number of transactions per active user. Those are kind of my contours of our consumers engaging.\n\nAnd it is, in fact, the case that if you ask someone to spend more money through you with you -- sorry, if you're trying to convince consumers to use you more often, more transactions, you are absolutely signing up for smaller tickets, right? People aren't going to buy an exercise bike every quarter, and they're going to buy maybe a couch once a year or so, but then you're really trying to get high frequency, which is certainly what we're chasing here. You're looking at things like apparel, maybe tickets, travel. And so we're very active in all those industries, general merchandise umbrella name for everything you that kind of happens all the time. So AOV is just expected to continue coming down.\n\nIt's an important measure of our success, frankly. I think the growth of transaction frequency per user is an indication of increasing spend in the pain for category, which is uniquely suitable for these shorter-term lower AOV transactions. And so that's for a lot of growth is coming from. As you might expect, we've dominated high longer periods for a very long time in the U.S.\n\nmarkets. We're still very rapidly expanding into the short-term lower AOV transactions. So I think in the long term, I care about trying to get to old transactions possible. And I think that will naturally result in the most possible number of dollars spent with Affirm by anyone active consumer, but for now, we're very focused on making sure that we're there for the consumer in paid for in motherly payments.\n\nIf the average ticket size goes down, that trend goes on success.\n\nMichael Linford -- Chief Financial Officer\n\nThing just real on the math. I think the average is maybe -- I'm not quite sure what math you're doing and how you're looking at it, but the averages can really lie here. One $200, $300 purchase can look like a lot longer share of wallet even if it's not repeatable as opposed to those consumers who maybe would never entertain a $200, $300 purchase. I think, for the consumers that are engaging on our platform today, we definitely believe we have a higher share of their spend.\n\nOperator\n\nThank you. And our final question comes from the line of Andrew Bauch with SMBC Nikko Securities. Please proceed.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nHey, guys. Thanks for taking the question. Just looking at the Affirm share of U.S. e-commerce spend, and this kind of dovetails with the prior question, is growing above the 2% in fiscal '23 and beyond and the trajectory of that, is that more of a function of you making progress on the consumer side? Or is it more around the continued expansion of wallet within merchants? I know they likely go hand in hand, but any other color you could provide would be great.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nWe are building a network. And 1 begets the other and back. I guess the -- assuming pretty good earlier today about 2% of e-commerce. And now I feel I got to shop with more soon.\n\nThe good news is that we are currently integrated at about 60% of all U.S. e-commerce. So we can increase that 2% penetration by getting more share of wallet with the merchants. Our merchants really dependent on us in these inflationary times because consumers need to stretch their dollar and we're there for them.\n\nAnd we have a really healthy business that is generated from our own services in our app that some of it is merchant integrated, but a lot of it is not. Still very excited about what the less will do for us. It extends us into things like daily purchase where we don't play today. And importantly, it gets us to offline, which is not included by 60% number, and for us is a nicely growing, but still very, very trivial amount of volume.\n\nSo we have lots of ways of getting above that, too. When we get there, we'll -- I'll expect this bell again at that point.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nJust looking at the industry mix, I mean one that kind of sticks out to us is a pretty sizable opportunity that could grow over time would be the travel and ticketing segment, thinking about getting further into airline purchases or hotels. Maybe you could just speak about that, the vertical inside that opportunity, and what obstacles or potential like roads to taking that 12% up over the next couple of years to be.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nIt's a great opportunity. I think it's a wonderful place to apply what we have to offer. We have a handful of really good partnerships in the travel industry today, both in airlines and hotels are probably least penetrated from our point of view. We have a bunch of online travel agency integrations that we've had for years and years and have done extraordinarily good work with them.\n\nDirect integrations with airlines is a little bit newer, and there's more to do there as well. The cool thing about travel, in general, it's kind of a sweet spot for what we know how to do. It's sort of a thing that other teams really do very well. All these things, including -- I'll start far, but I'll get here in a second.\n\nBut if you look at the work we've done with some of the largest big-box retailers and with the platforms, and now we're looking to do with hotels and expanding our work with OTAs, it is inevitably a thing you do not as much in credit and underwriting and understanding the consumer use case as you do in product. I can give you a very -- example. Hotels you sort of think back to the last time you checked out, you pay and checkout. -- except a lot of them if you don't check out, you leave the key in the room and you walk.\n\nAnd so the actual exact mechanics of this transaction is now real. We know as a total amount. And now we're going to turn into a loan and you'll pay it over time. Just very, very different between hotels and buying a couch.\n\nAnd so inevitably to do this right to do as well to convert a lot of consumers to really deliver the value that our merchants expect us to, you have to build a product that is fine-tuned to that particular industry. And all of our long-term growth opportunities are built around our ability to create products that are unique and are very hard for others to replicate. So I feel very strongly about it. Obviously, for a long time, I used to say Affirm is a machine, engineers in our LTC out being very careful with hiring.\n\nSo maybe some of these opportunities to get even bigger and faster, we'll probably the right amount of discipline to it, but definitely very sea travel. And there's probably 500 industries that didn't rattle off immediately where just the right product, and we'll break through and become bigger than average.\n\nOperator\n\nThank you. Ladies and gentlemen, this concludes our question-and-answer session. I would like to turn the call back to Zane Keller.\n\nZane Keller -- Director of Investor Relations\n\nWell, thank you, everybody, for joining the call today. We look forward to speaking with you again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nZane Keller -- Director of Investor Relations\n\nMax Levchin -- Founder and Chief Executive Officer\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nMichael Linford -- Chief Financial Officer\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nMike Ng -- Goldman Sachs -- Analyst\n\nUnknown speaker -- Truist Securities -- Analyst\n\nReggie Smith -- J.P. Morgan -- Analyst\n\nChris Brendler -- D.A. Davidson -- Analyst\n\nKevin Barker -- Piper Sandler -- Analyst\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nEugene Simuni -- MoffettNathanson -- Analyst\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nMore AFRM analysis\n\nAll earnings call transcripts"
}