{
  "companyName": "Limoneira",
  "companyTicker": "LMNR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/limoneira-lmnr-q3-2022-earnings-call-transcript/",
  "content": "Limoneira (LMNR -2.05%)\nQ3 2022 Earnings Call\nSep 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to Limoneira's third quarter fiscal year 2022 financial results conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, John Mills with ICR. Thank you. You may begin.\n\nJohn Mills -- Head of Investor Relations\n\nGood afternoon, everyone and thank you for joining us for Limoneira's third quarter fiscal year 2022 conference call. On the call today are Harold Edwards, president and chief executive officer; and Mark Palamountain, chief financial officer. By now everyone should have access to the third quarter fiscal year 2022 earnings release, which went out today at approximately 4:00 p.m. Eastern Time.\n\nIf you not had a chance to view the release, it's available on the investor relations portion of the company's website at limoneira.com. This call is being webcast and a replay will be available on Limoneira's website as well. Before we begin, we'd like to remind everyone that prepared remarks contain forward-looking statements, and management may make additional forward-looking statements in response to your questions. Such statements involve a number of known and unknown risks and uncertainties, many of which are outside the company's control and could cause its future results, performance or achievements to differ significantly from the results, performance or achievements expressed or implied by such forward-looking statements.\n\nImportant factors that could cause or contribute to such differences include risk detailed in the company's 10-Qs and 10-Ks filed with the SEC and those mentioned in the earnings release. Except as required by law, we undertake no obligation to update any forward-looking or other statements herein, whether as a result of new information, future events or otherwise. Please note that during today's call, we will also be discussing non-GAAP financial measures, including results on an adjusted basis. We believe these adjusted financial measures can facilitate a more complete analysis and greater understanding of Limoneira's ongoing results of operations, particularly when comparing underlying results from period to period.\n\nWe have provided as much detail as possible on any items that are discussed on an adjusted basis. Also, within the company's earnings release and in today's prepared remarks, we include adjusted EBITDA, which is a non-GAAP financial measure. A reconciliation of adjusted EBITDA to the most directly comparable GAAP financial measure is included in the company's 10-Q and press release, which have been posted to our website. And with that, it is my pleasure to turn the call over to the company's president and CEO, Mr.\n\nHarold Edwards.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThanks, John, and good afternoon, everyone. Operating income increased over 200% and our top line grew by 20% driven by record avocado revenues and strong fresh lemon sales in the third quarter of fiscal 2022 compared to the prior year period. Our strategic approach to fresh utilization enabled our sales and marketing team to successfully market our fresh lemons throughout the year. The investments we've made in technology and our supply chain have resulted in superior market timing compared to our peers and brought more grower partners to our company.\n\nEven though overall lemon pricing remain challenged in the third quarter as the domestic and global lemon markets continue to work through a surplus of inventory, we were able to offset many industrywide inflationary pressures and logistical issues. In addition, our avocados segment has continued to outperform expectations, with pricing almost doubling year-over-year resulting in record revenues of $12.6 million in the third quarter of 2022. Our results are even more impressive when you consider the fact that our industry continued to face rising labor costs and higher packing and supplier costs. But our strong top line and efficient marketing and selling plans more than offset these costs increases.\n\nLast quarter, we informed you of our plan to unlock the value of our many assets and better leverage our leading global citrus position by expanding our one world of citrus, increasing our avocado plantings and selling certain assets to dramatically increase our cash flow in the near future. Today, we are updating that plan and we expect the updated plan to increase our one world of citrus business by focusing on growth of asset lighter sales using more grower partner fruit in order to reduce the impact of pricing volatility and rising farming costs. We will continue to develop best-in-class grower services to recruit additional grower partners. We have over 15,400 acres of rich agricultural lands, real estate properties, and water rights in California, Arizona, Chile, and Argentina with a fair market value of over $600 million in today's market.\n\nYou had a book value on our balance sheet of $220 million because many of these assets were acquired years ago at low-cost basis. We believe selective monetization of certain assets in our portfolio creates a tremendous value creation opportunity for our shareholders. As a reminder, our board's objectives with our new directive include the following: reduce debt and right size our balance sheet. We also reiterated today that we expect to receive approximately $95 million over the next  five years from harvest at Limoneira, beginning this year with $8 million expected in the fourth quarter of fiscal year 2022.\n\nIn addition to harvest, we have identified assets that we will be monetizing and selling in the coming months to streamline our operations. Our updated strategic plan involves four specific initiatives. First, our transition -- our one world of citrus to an asset lighter business model. In order to unlock the value of our many assets and better leverage our leading global citrus position, we will be expanding our one world of citrus model, while also strategically selling certain assets and streamlining our operations to dramatically increase our long-term cash flow.\n\nIn order to accomplish this, we will be increasing our focus on growth of asset light sales using more grower partner fruit in order to reduce the impact of pricing volatility and rising farming costs. We will continue to develop best-in-class grower services to recruit additional grower partners. We will also be reconfiguring our global lemon packing network to better support our grower partner's fruit. This may include reducing certain orange and lemon acreage globally, while still maintaining the packing and marketing of the fruit grown on these locations.\n\nIn the coming years, we expect 30% of our lemon global supply chain to come from Limoneira fruit and 70% to come from grower partner fruit, while maintaining our overall growth goals. To put this in perspective, today, 50% of our lemons sold are produced on Limoneira properties. Number two, this asset lighter model will enable us to achieve improvements in the following metrics our board is using to measure progress and position us to improve shareholder value. The first is reduced investment risk outside of North America.\n\nThe second is to generate more stable and higher growth in EBITDA and earnings. And lastly to improve our annual return on invested capital. During the past 12 years, as we grew our one world of citrus offering, we also made certain investments and assets that were embedded in this growth and the overall infrastructure of Limoneira. Now we will be focusing on monetizing certain of these assets that have increased in value over the years and this will dramatically improve our return on invested capital.\n\nAs an example, today, we announced that we expect to generate $8 million in cash in the fiscal fourth quarter of 2022 from the sale of 17 acres to our joint venture with The Lewis Group to potentially develop an additional 200 or more residential units within harvest. Number three, we expect to also leverage our leading avocado position by increasing our avocado production based in Ventura County, and exploring additional ways to participate in the packing, marketing and selling of avocados as a complement to our One World Of Citrus. Number four, our four strategic objective is enhancing our ESG goals. Limoneira has a long history of sustainability practices, and this is one of the reasons our company has enjoyed almost 130 years of giving back to the community.\n\nWe build housing for farm workers, sponsor community programs, feed farm workers, reduce our carbon footprint with seven solar installations, manage green waste with facility -- with a facility that receives over 200 tons per day of organic green waste. We minimize pesticides and herbicides through integrated pest management programs, and we are a pioneer in water conservation. However, in order to ensure our land is here for future generations, we are redoubling our efforts on environmental, social, and governance standards. We are increasing our focus on regenerative agricultural practices, including expanding our relationship with third-party agronomist to further enhance and properly nurture our soil and water conservation efforts.\n\nWe continue to use new technology and improve our digital information system to increase efficiencies across our supply chain. This system will work in tandem with our ag practices by monitoring daily tree health and fruit growth, identifying labor and distribution needs, predicting the right time to harvest and match harvest fruit grades and sizes to meet global demand. Lastly, we are evolving our governance structure and last month we announced enhancements to our board of directors. Scott Slater was appointed chairperson of the board of directors.\n\nScott Slater, who joined the board in 2012 succeeds Gordon Kimball, who has stepped down as the chairperson due to health reasons and will remain a director of the company. In addition, Amy Fukutomi resigned as a director of the company and will now serve as our vice president of compliance and corporate secretary of the company. We believe this updated strategic plan will result in an asset lighter business model, a dramatic debt reduction, reduce volatility and an increase in EBITDA and earnings per share, higher returns on invested capital and increase in our quarterly dividend, higher ESG scores, expansion of global fruit packaged and marketed by Limoneira, and lastly, an increase in the packaging and marketing of avocado production. We will update you on a regular basis regarding our progress, and we believe we will be in a position to announce additional asset sales and streamlining of our business model in the coming quarters.\n\nAnd with that, I'll now turn the call over to Mark.\n\nMark Palamountain -- Chief Financial Officer\n\nThank you, Harold and good afternoon, everyone. As a reminder, there is a seasonal nature to our business with our revenue driven by varying harvest periods from year to year. Our first and fourth quarters as our seasonally softer quarters while our second and third quarters are stronger. Therefore, it is best to view our business on an annual not a quarterly basis.\n\nFor the third quarter of fiscal year 2022, total net revenue was $58.9 million, compared to net revenue of $49.1 million in the third quarter of the previous fiscal year. Agribusiness revenue was $57.6 million, compared to $48 million in the third quarter last year. Other operations revenue increased to $1.3 million in the third quarter of fiscal 2022, compared to prior year period of $1.2 million. Agribusiness revenue for the third quarter of fiscal year 2022 includes $27.8 million in fresh lemon sales, compared to $24.4 million during the same period of fiscal year 2021.\n\nApproximately 1,512,000 cartons of fresh lemons were sold during the third quarter of fiscal year 2022 and an $18.39 average price per carton, compared to approximately 1,144,000 cartons sold at a $21.34 average price per carton during the third quarter of fiscal year 2021. The company recognized $12.6 million of record avocado revenue in the third quarter of fiscal year 2022, compared to $4.1 million in the same period last fiscal year. Approximately 5.7 million pounds of avocados were sold during the third quarter of fiscal year 2022 at a $2.21 average price per pound, compared to approximately 3.5 million pounds sold at a $1.16 average price per pound during the third quarter of 2021. The company recognized $3.7 million of orange revenue in the third quarter of fiscal year 2022, compared to $2 million in the same period of fiscal year 2021.\n\nApproximately 209,000 cartons of oranges were sold during the third quarter of fiscal year 2022 at a $17.88 average price per carton, compared to 259,000 cartons sold at a $7.65 average price per carton in the prior year period. Specialty citrus and other crop revenues were similar to the prior year at $1.1 million for the third quarter of fiscal years '22 and 2021. Total cost and expenses for the third quarter of fiscal year 2022 were $47.9 million, compared to $45.8 million in the third quarter of last fiscal year. Costs as a percent of revenue decreased year-over-year as improvements in our cost structure offset industrywide inflationary pressures.\n\nOperating income for the third quarter of fiscal year 2022 increased to $11.1 million, compared to income of $3.4 million in the third quarter of the previous fiscal year. Net income applicable to common stock after preferred dividends for the third quarter of fiscal year 2022 was $7.3 million, compared to net income of $3.6 million in the third quarter of fiscal year 2021. Net income per diluted share for the third quarter of fiscal year 2022 was $0.40, compared to net income per diluted share of $0.20 for the same period of fiscal year 2021. Adjusted net income for diluted EPS for the third quarter of fiscal year 2022 was $7.5 million, compared to $3.7 million in the same period of fiscal year 2021.\n\nAdjusted income per diluted share was $0.41, compared to adjusted net income per diluted share of $0.20 for the third quarter of fiscal year 2021. A reconciliation of net income to adjusted net income as provided at the end of our earnings release. Adjusted EBITDA was $14.2 million in the third quarter of fiscal year 2022, compared to $7.8 million in the same period of fiscal year 2021. A reconciliation of net income to adjusted EBITDA is also provided at the end of our earnings release.\n\nNow turning to our balance sheet and liquidity. Long-term debt as of July 31, 2022, was $129 million, compared to $130.4 million at the end of fiscal year 2021. We believe the level of debt will continue to decrease throughout fiscal 2022 due to the monetization of certain real estate assets. Now I'd like to turn the call back to Harold.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThanks, Mark. We continue to expect fresh lemon volumes to be in the range of 4.5 million to 5 million cartons for fiscal year 2022. And avocado volumes were 8 million pounds, compared to our previous range of 6 million to 7 million pounds for fiscal year 2022. We continue to expand our product offerings in fiscal year 2022 by marketing another producer's oranges and specialty citrus through our One World Of Citrus program.\n\nWe have a growing list of customers that enjoy our ability to provide all of their citrus needs from one single supplier. And by increasing our oranges and specialty citrus offerings, we will be able to attract even more customers. In addition, our ability to successfully sell over 80% of our lemons fresh at competitive prices enables us to enhance our grower partner recruiting efforts. We continue to expect to receive $95 million from harvest at Limoneira during the next five fiscal years, beginning in fiscal year 2022, which includes $8 million during the fourth quarter of this fiscal year.\n\nThe breakdown of annual cash flows expected from harvest at Limoneira is as follows. Fiscal year 2023 is expected to generate $15 million. Fiscal year 2024 is expected to generate $27 million. Fiscal year 2025 is expected to generate $30 million, and fiscal year 2026 is expected to generate $15 million.\n\nThese expectations from harvest do not include potential opportunity of a medical campus in our East area to development. We also have a number of non-strategic real estate asset sales plan that we expect to be able to provide more color on during our fourth quarter call in December. Now I will open up the call to your questions. Operator?\n\nOperator\n\n[Operator instructions]. Our first question comes from line of Ben Bienvenu with Stephens. You may proceed with your question.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nHey, thanks. Good afternoon.\n\nHarold Edwards -- President and Chief Executive Officer\n\nHi, Ben.\n\nMark Palamountain -- Chief Financial Officer\n\nHey, Ben.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nSo you guys, it sounds like you're still relatively early innings on kind of monetization of noncore, non-essential assets. And we're kind of at the outset of a lot of cash coming in the door to the business. Can you talk to us a little bit about maybe the pipeline of reinvestment that you're considering? You talked about kind of the strategy shift to a more asset light toward a sort of model. But if you could talk to us a little bit about kind of the balance of returning cash to shareholders versus reinvesting it into a business transformation.\n\nAnd then from a financial perspective, sort of minimum return thresholds that you're thinking about, whether it's IRR or return on capital, that would be helpful paradigm for us to think about.\n\nHarold Edwards -- President and Chief Executive Officer\n\nGreat, Ben. That's a great question. And we'll -- I'll take a stab at the higher level sort of part of that question, and Mark might be able to dig in with some more granular components to it. But we're very interested in investing in new packing capacity in Chile, that we think will complement our North American lemon packing as well as potentially new packing operations up in the San Joaquin Valley that we're exploring right now, that'll give us better logistical control over our district one crop.\n\nWe're also -- as we've mentioned earlier, planning on expanding our avocado production in our Coastal California properties. And it'll -- that effort will serve two purposes. One, we find ourselves in sort of a chronically oversupplied situation in that debt growing district just because of too many lemons being produced at any one-time by too many producers. And so our pulling back our own production and converting to avocados, we believe will not only do a better job for strengthening the lemon pricing out of that region, but also allowing us to capture greater value with more avocado production.\n\nAnd then last, as we've alluded to, we're also exploring, potentially investing into packing and marketing avocados as a complement to our One World of Citrus, citrus product offerings. So those are the primary sort of directional shifts, you'll see operationally that we're contemplating. And in terms of hurdle rates or internal rates of return, we talk in general terms of, see of a 10% hurdle rate that we're working to achieve. We've just gone through a really interesting process with our board analyzing the last 10 years of acquisitions and doing a post completion audit of how those investments actually performed versus how we said they would perform and typical of any portfolio, I think, we had some investments that really hit the cover off the ball and performed extraordinarily well.\n\nAnd some that performed sub optimally. But it was a great process for us in the board to go through because we really were able to understand that a big part of the capital that we've invested over the years over the last decade anyways, a big chunk of that capital was embedded in land and water assets that we're fundamentally appreciating. But until they were monetized weren't really generating the returns on capital that we were hoping to achieve. So that's sort of the logic behind the strategy.\n\nBut I think that as we have success with monetization, we do look forward to increasing the dividend and sharing some of that, that benefit with our shareholders. But also taking the capital that we generate, reducing our debt to more moderate levels giving rising interest rates and the environment we find ourselves in today. And given the inflationary pressures and then also make those new investments that we think will be extremely accretive to us and our shareholders over time. Marketing any more color.\n\nMark Palamountain -- Chief Financial Officer\n\nYes, I'll just add that in our weighted average cost of capital is about 7%. And so reiterating that IRR 10 to 12, it's sort of how we've been looking at things. But as we've seen over the last 10 years, our cost of debt has been sub 2%. And we've got a really nice fixed piece now, just above three and a half, at 40 million, and then the rest is basically revolving.\n\nSo we'll have the opportunity to pay that down as this plan monetizes, and then reinvest into those projects that Harold had mentioned.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK, that's great. My second question, and you touched on it a little bit, just supply demand, it sounds like you guys are making an effort to repurpose production to avocados away from lemons. Can you talk about the demand piece of the equation for lemons? And maybe what the path back to a more constructive lemon price environment looks like? Is it others doing what you are doing? Is that multiple years of that sort of endeavor? Maybe just help us think about the sensitivities there?\n\nHarold Edwards -- President and Chief Executive Officer\n\nSo fundamental to that question, Ben, there's two pieces to it. One piece is, is going back to sort of pre-pandemic market growth rates. And remember, a big part of the story were emerging markets in Southeast Asia that were growing at double-digit rates. And then, because of the health and wellness trends, the United States seeing domestic consumption growing at 5% to 6% annually, I think we're really excited to see both food service and retail demand, finding its way back to those pre-pandemic growth levels that we're experiencing right now.\n\nSo we're really pleased with the domestic demand. The export demand in Southeast Asia isn't back 100%, it's still struggling with COVID-related issues and supply chain related issues. But as we have greater visibility into just, for example, the Japanese level of consumption and the Korean levels of consumption, Take China out of the discussion for a second, we're really excited to see that growth is right back to pre-pandemic levels, and that demand is right back there as well. So from a demand perspective, I think we're going to get back to where we were pre-pandemic.\n\nOnce we kind of wrestled through the sort of intrinsic supply chain challenges that I think were really COVID related and are working their way through and improving. And so I'm optimistic that you'll see the demand returned. One of the challenges is that as certain parts of California grapple with water challenges, Lemons consume a lot less water than other types of crops. And so you saw an over exuberance of lemon planting in each of the districts in California and Arizona.\n\nWe're all reading about what's going on the Colorado River and all the production of lemons that are feeding off of that water. And as well as all of the desert lemons in the Coachella, Imperial, and valleys. And then Yuma, Arizona, just because of the water situation there, you're going to see we're going to see a lot of lemon production coming out of production as following programs are put in place and then just access to water, it becomes more scarce and limited. District One is also over planted.\n\nBut this is year four in sub optimal lemon returns for many growers. So you're starting to see growers there begin to pull lemons out, but also you're seeing water challenges, their challenge, more lemon production. Finally, you come down to the coast where we are. And we're already seeing it.\n\nIn fact, if he if he got in the truck and drove around Ventura County with us your we can show you block shear blocks there have growers that have had it and have pulled out there -- pulled out their lemons and are basically thinking about planting other crops. So I think that the two to dynamics have an increasing demand landscape, and a decreasing supplier production landscape is really going to help. There's always the factor of a freeze or things that disrupt supply chains that also are there to help producers. And it's been a while since we've had, really nasty weather events.\n\nAnd I just I think that longer term, you're going to see the situation begin to improve. Right now we're actually beginning to see improvement in overall lemon pricing. And I expect that that will continue to be the case as both the demand and the supply situation worked themselves through.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK, very helpful. Thank you both.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThanks, Ben.\n\nMark Palamountain -- Chief Financial Officer\n\nThanks, Ben.\n\nOperator\n\n[Operator instructions]. Our next question comes from the line of Vincent Anderson with Stifel. You may proceed with your question.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nYes. Good afternoon, guys.\n\nHarold Edwards -- President and Chief Executive Officer\n\nHi, Vince.\n\nMark Palamountain -- Chief Financial Officer\n\nHey, Vince.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nYes. Ben had me thinking a little bit there with that growth in desert lemons, and lower labor costs, certainly the California I'd imagine it. Do you not still have that old packing plant down there? And is there any value opportunity to dust that off? And just really move to only a packing kind of outfit down in that growing region.\n\nHarold Edwards -- President and Chief Executive Officer\n\nWe have -- it's a great question and shows a lot of insight. So we continue to conduct that analysis of what happens if you take that throughput away of our very efficient Santa Paula facility and move it to a closer, logistically closer facility, but a lot less efficient in Yuma. And so far, the analysis says, keep it coming to Santa Paula, because the efficiencies you drive of bringing that much volume through a common facility outweighs the added cost of logistics versus if we packed locally. We are looking at that though.\n\nAnd it's just going to be really interesting to see as more and more of the Yuma lemons come out. You're going to see that analysis become more and more interesting, because it's not just us, it's all the producers that are dependent on the river that are going to be impacted in some way, shape or form.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nOK, that makes sense. And then I'm just trying to dig into avocados a little bit more. There's a couple of pretty big players out there. I think, both of them pretty well, on the packing and marketing side.\n\nSo you mentioned wanting to get into that game as well. And I'm just wondering, what's the attractiveness of that relative to lemons? Or is it more, avocados might be your best route to diversify into, say Mexican agriculture. And it's really about getting into Mexico.\n\nHarold Edwards -- President and Chief Executive Officer\n\nNo, I think it's just the opposite. I think it's really focusing on California. So we're one of the largest producers of avocados in the United States and in California, and we think we see a pretty good opportunity to establish leadership in California. Yes, as you mentioned, we're good friends and know very well, the other big players and they each have embraced different operating models that might not be as focused on California as we believe we might be able to be.\n\nAnd so -- but in order to be really strong in California, as you know, Vince, you need to have a Mexican program and probably a Peruvian program to round out your product offerings to your customers. So that's really all -- those are all the things we're exploring, but it's interesting this was our first year since 2005, that we marketed our avocados independently. And the results are really interesting. It was a, obviously was an interesting year because of the supply chain shortages coming out of Mexico that created a unique opportunity for California.\n\nBut we also pounced on it, and we're very, very aggressive to harvest earlier than we've ever harvested. Mother nature treated us very favorably and we had good size to actually get into the market earlier than historically we have. But we captured pricing that we've never seen because of our ability to really be aggressive in how we marketed and sold the fruit using a number of different handlers.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nInteresting. And I don't know much about avocado packaging, but is there an opportunity to retrofit like Oxnard, or even if there's enough spare capacity in Yuma or not Yuma, I apologize. The other California pack house, the main one.\n\nHarold Edwards -- President and Chief Executive Officer\n\nIn Santa Paula. So yes, I think you're getting right to the issue, which is we see a great opportunity to expand our campus, if you will, in Santa Paula. And the vision is to increase the amount of storage we have in Santa Paula for lemons as and then take advantage of other cold storage capabilities for other commodities that might help us in how we distribute market and sell our citrus offerings. And avocados could be a really interesting big piece of that, that it would be really easy to -- easy is a relative term, I guess.\n\nBut it would be possible for us to contemplate packaging, and then marketing and selling avocados from that common facility in Santa Paula.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nOK, excellent. I'll hop back into the queue for the other questions. Thank you.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThanks, Vince.\n\nMark Palamountain -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Ben Klieve with Lake Street Capital Markets. You may proceed with your question.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nAll right, thanks for taking my questions. First, congratulations, a really nice quarter here. First question, I apologize I'm going to make you guys repeat yourself here. I dropped off for a couple of minutes in the prepared comments.\n\nBut question regarding brokered fruit, it looks like from what I see in the queue, this was down a little bit, can you talk about the dynamics on the broker through side on, in the quarter, specifically in the kind of your outlook on full year and '22 and into '23? Mark, you want to jump on that?\n\nMark Palamountain -- Chief Financial Officer\n\nSure, yes. So, as you know a lot of the brokered fruit we get is from the southern hemisphere out of Argentina and Chile primarily. And as we saw dramatic increase in shipping containerized shipping costs, year-over-year more than doubling, and along with the low lemon price, there was a lot of hesitant from those shippers to send. So I think Argentina volumes are down about 30% year-over-year.\n\nJust from an industry perspective, our volumes weren't off as dramatically. I think you'll see us similar to where we ended up last year from a revenue perspective. But again, it's primarily just those shippers shipping it into a market that's less than breakeven for them. So and we've picked up some different commodities; we've been selling some picked up some navels, and mandarins and other baskets, to help offset that reduction in the lemon.\n\nSo you'll see a little bit of variety there.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nMaybe I'll just jump and add just going all the way back to Ben Bienvenu's question about what's going to make the lemon pricing better. One of the things that will make it better is the high logistical costs for southern hemisphere imports, in a way increases the opportunity to get better pricing protection for the domestic fruit. So that in a way, in a strange way, it helps now. In a way, it hurts also, because we do take advantage of those imports.\n\nBut we make more money with our domestic production, if that makes sense. So, ironically, the cost of a 40-foot container literally doubled from the southern hemisphere up to the northern hemisphere, year-over-year. So those costs are actually helping us improve the lemon pricing that we received for our domestic production.\n\nGot it. Yes. And all those dynamics absolutely make sense. I don't think that'll surprise anybody on the call, hearing about those challenges.\n\nI guess that brings up then a follow-up question, regarding the outlook for brokered fruit. If in a world, like we're in now, where commodity costs are challenged, or transportation costs are a challenge here and that business is subsequently a difficult one, given how you guys have talked about brokered fruit growing, kind of over the long-term. To what extent of that growth really depend upon a stabilization and improvement of the overall market. I mean, without an improved market, is the broker proof business going to kind of be going to be stagnant or is there an opportunity to really grow that materially, if these conditions continue.\n\nHarold Edwards -- President and Chief Executive Officer\n\nYes, I think there's going to be an opportunity to grow it materially as you're seeing from a year like this year though. It won't be linear growth. It'll be sort of ups and downs as the world changes and the dynamics change. But fundamentally, just Mother Nature is always messing around with supply chains around the world.\n\nBut also taking into consideration the true seasonality of each of the growing regions in the world gives us a real confidence in being able to continue to grow that broker, broker fruit business or we call an agency business, because it technically should be coming into a market that is underserved from domestic supplies. So it will every year that the fruit will migrate in the way that it will migrate based on the reality of the cost structures and the supply chains coming to serve customers. This year, it just so happened that the cost of the containers were so high that coming from southern hemisphere to the northern hemisphere and into a relatively oversupplied market because of the large crops that came out of each of the growing districts in California, Arizona, that it really prevented that level of brokerage business to grow as we had contemplated the year before. I suspect next year, you'll see us continuing to put our foot on the gas and getting more growth.\n\nBut we'll just have to see. And that's the neat thing about our model is that it allows us to be very, very flexible. And if the markets not there, then we won't chase it, and if the markets there, we will chase it. But the key thing is just to keep focusing in on our customers.\n\nSo as we get more and more market share every year, we're able to hang on to it because we act -- actively sourced the fruit efficiently to serve that market share that we've attained.\n\nMark Palamountain -- Chief Financial Officer\n\nYes, and just also I might add. As we open up more source countries that we haven't been to yet so for example, Peru, and Morocco, are heavy in citrus. And so those will provide more opportunities for that from a different varieties as well. So that will be a help in the growth.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nOK. OK. Very good. One more for me.\n\nAnd I'll get back in queue regarding the expansion of avocado production. How would you noted that perhaps some of the existing lemons acreage would be potentially converted into avocado production. Can you talk about the level of lemon acreage that you have? That is really agronomically optimal for avocado production?\n\nHarold Edwards -- President and Chief Executive Officer\n\nYes, that's a great question. So, in each of the growing areas or that each of the districts so it starts in a desert, and so we farm 1,300 acres in Yuma, but we followed 400 of those acres. So I think we still have 700 active producing acres of lemons there. That opportunity is not there because avocados don't grow in the desert.\n\nSo really, it's only the -- it's specifically in district two, which is coastal California. And so the total amount of lemons that we produce in district two, Mark, do you know that number?\n\nMark Palamountain -- Chief Financial Officer\n\nIt's about 3,000 acres.\n\nHarold Edwards -- President and Chief Executive Officer\n\nSo about -- yes, about 3,000 acres and so order of magnitude, then we're talking about 500 acres of transition.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nGot it. OK. Very good. That's helpful.\n\nAppreciate all the color. Again, congratulations on a good quarter and I'll get back in queue.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThank you.\n\nMark Palamountain -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Eric Larson with Seaport Research Partners. You may proceed with your question.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nYes. Thanks, guys. Good quarter. Thanks for kind of working me in here.\n\nSo can you guys hear me?\n\nHarold Edwards -- President and Chief Executive Officer\n\nYes. Thank you, Eric.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nOK. Sorry, I thought I kind of [Inaudible] you. So Martin and Harold that I think I'd really like to pursue sort of your deeper dive into your strategic actions. And I think this is probably the most important part of your stock price.\n\nAnd literally, it's kind of the next step for your whole company. So the asset sales, though, that you're talking about, it seems that you could maybe take death down on your balance sheet by I'm guessing you put a number on there $100 million. So tell me if I'm wrong, Mark and Harold, but at the end of the day, you have an opportunity to take this company to a whole different level. And that hasn't been part of the discussion here on the call today.\n\nAnd I think that's really important. So what do you do to as you get rid of these, let's say underperforming or low return assets, et cetera. You kind of reliquefy your balance sheet. What are you going to do with your balance sheet, the cash? I think that's probably one of the more exciting parts of your story.\n\nHarold Edwards -- President and Chief Executive Officer\n\nSo that's -- that is the exciting part of the story, Eric. And so as Mark would agree, I think it's extremely exciting. And I think the number you threw out $100 million is light. I think so right now I think we have about -- we had it in the script, but I think about $120 million of debt.\n\nSo there's easily more than $120 million of cash that should be coming back to the company in the near-term. Based on the sort of the near-term results we hope to execute on with the monetization strategy. As Mark mentioned, we have some really favorable fixed pieces to our debt structure. So we'll probably choose to keep those in place while we accumulate cash.\n\nSo then, that the big question for an investor is what do we do with all that, this reloaded balance sheet, and all those cash. So, certainly, increasing the dividend is going to be important as we achieve, historic related returns on invested capital results. So because the monetization of these assets come with huge appreciation potential built into them. So we hope to share some of that with our shareholders through a dividend structure.\n\nBut also, we look forward to reinvesting this, this capital into areas that we believe can produce more consistent and more reliable returns on invested capital, for example, our one of the one of the best investments that we made, last decade is into our modernized new packing house in Santa Paula. And we prove to ourselves that we could deploy the capital, we could operate the machine, and we could consistently achieve great returns on that capital and insulate ourselves from the volatility of market pricing, which as we're all experiencing, go up and down based on the sort of the circumstances of supply and demand and the lemon example is the perfect example right now. But insolate, completely insulated from that pricing exposure and the commodity is our ability to now provide services to our grower partners through packing, marketing and selling, where we have control and what we charge for those services. And we have control over our ability to manage those expenses.\n\nAnd we have control over our ability to drive good margins on our performance, and that's the most exciting part of our business, because that's the logic behind the transition in the model. And it's not necessarily at the expense of our own production, it's just to really focus on this growth by investing in new packing capacity around the world, where we can capture that more reliable return. And I think that's going to be really well received from investors who get kind of sick of the up and down of the inconsistent quarters. But by being more focused on this asset lighter model, we should be able to do a better job having more reliable earnings and more reliable cash flows.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nOK, thanks. So, this might be a question for Mark. So as you sell these assets, I'm assuming that they're probably pretty low-cost basis assets, and that there's some -- probably some pretty significant tax, cash tax outlays for that. Is there a way you can preserve? Can you preserve that? Can you do 1,031s? Is there a way for you to, you know, enhance through growth through the sale of these assets by actually transferring to other assets?\n\nHarold Edwards -- President and Chief Executive Officer\n\nYes, that's a great question, Eric. And we are actively reviewing those tax strategies right now. Fortunately, from being unfortunate, in the past few years, we've had, we've got about $16 million, or $17 million of net operating losses on the books from a tax perspective. So that paired with our pension, that we are terminating, at the end of this year.\n\nWe've got a little over $20 million of shelter already on any gains that will come. So and as you know, there are very low basis, some properties are appraised at more than double of what their book values are. So I think it'll be a combination. And we're certainly going to also look, if there were any tax 1031 opportunities.\n\nWe're trying not to get back into hard assets. So we probably will pay the tax on a portion of it, but again, we've got at least $20 million of that sheltered.\n\nMark Palamountain -- Chief Financial Officer\n\nAnd, Eric, just also to layer on there. Some of these assets are high basis. And so we're actually we are ringing the bell in terms of achieving some great appreciation above the high bases that we invested in. But I would just say as a placeholder none of the assets we're contemplating monetizing are the legacy, like the core assets like the Santa Paula assets that are on the books for $400 an acre but have a fair market value of $100,000 an acre.\n\nThose are what we're talking about.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nOK. OK. Great. Thanks, guys.\n\nThat's pretty good. That's very good. color. Thanks.\n\nWe'll follow up.\n\nOperator\n\nOur next question comes from the line of Vincent Anderson with Stifel. You may proceed with your question.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nYes, thanks. So I'm just trying to keep track of all of the different strategic options that you have. You have the avocados, those will take a while to grow. You want to stay asset light, but you're still pretty focused on this Chile and pack house.\n\nAnd then you have the balance sheet that you want to work back down. So can you maybe just looking out over the next two, three years, assuming the asset sales progresses, as you hope, maybe line up for us what might be the priorities?\n\nHarold Edwards -- President and Chief Executive Officer\n\nYes, so when we talk about asset lighter, we consider like an investment in a packing house, an asset ladder move. And the reason there Vance is because, yes, it's capital to put up the packing house. But it doesn't cost us anything to go out and recruit a new grower partner to come bring his fruit through our facility. So that's really the rationale behind that.\n\nSo to tee up the sort of the progression of investments, we're already working right now on the replanting of about 250 acres of avocado. So that's sort of going on right now. And that's basically looking at less productive lemon acreage that was going to be pulled anyways. And rather than going back into lemons, we're now going into avocados.\n\nSo that's already underway. I think the next thing you'd see that would be logical would be the expansion of our packing capacity in Chile, but also, we hope to do a much better job articulating our success in the expansion of our grower partner fruit domestically. So we formed a grower services team that's cross functional in nature. We've got some of our farming guys on that team, we've got our harvest guys on that team.\n\nWe've got people from Mark's accounting and finance on that team, we have IT people on that team. And basically together, they go out and create business solutions for grower partners, as hooks to get those grower partners recruited. And the better job we're able to do recruiting. And recruiting sort of starts with the competitiveness of our returns, but also then evolves into the quality of the services that are actually perceived as great services, enough to convince a grower to leave whoever they're handling their fruit today to go to Limoneira.\n\nThat's kind of the game that we're playing. And just the results that we've had over the last 12 months have been really gratifying in terms of our abilities to attract more grower partners into the Limoneira family to expand our supply chains that way. So that's really how we're going to grow. And the way to kind of look at that is look at the overall growth in sales that we had for year-on-year in the quarter.\n\nAnd a large part of that growth is because of our success in handling more grower partner fruit domestically.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nOK, excellent. And then if I can just ask one last one, digging into the brokers -- the brokering side of the business a bit more. What specifically would that entail from an investment perspective? And I'm thinking maybe specifically about like areas of growth, like South Africa seems to be gaining a lot of market share in Europe, you've got whatever crops, these new entrants to the 11 markets left behind in California that might be leaving a gap for you to take advantage of like, how are you approaching that? And what does it actually take to expand brokering operations?\n\nHarold Edwards -- President and Chief Executive Officer\n\nMark, you want to do that one?\n\nMark Palamountain -- Chief Financial Officer\n\nYes. So it's really actually -- it's just a human capital question. So a lot of hustling. We've got a team of two on it right now.\n\nAnd it basically can handle a few million cartons and I think this year, we're between a million and a million and a half. It's our target. Similar to last year. So it's really getting out onto the road trade shows.\n\nAs I mentioned earlier, markets like Morocco, we had a visit there to open up to mandarins. And so it's a travel budget and probably adding one or two more people, but we see that business growing as we stabilize in pricing and lemons and then flex out into other commodities, at a 10% rate is sort of our goal.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nAnd the other, the other you asked, I think Eric Larson asked the great question about how we should sort of think about where the capital would be deployed. And then, Vince, you asked sort of what the roadmap looks like? So a big part of the capability also involves forward warehousing and added value or value adding in your forward warehousing capability. So we're looking for a facility on the East Coast right now, we have been on this project for about six months and look to invest not an actual acquisition, but more through a long-term lease cold storage facility, which are close to the ports of Philadelphia, where we bring a lot of our fruit in on a brokerage basis. But then we can add value to it through repacking or bagging and get that fruit out to our Northeast, Southeast, and Midwest customers really effectively.\n\nHarold Edwards -- President and Chief Executive Officer\n\nYes, right now we're doing using third-party logistics for that. So internalizing that function will be a much better profit situation for us.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nOK. Excellent. That is perfectly clear, and very helpful. Thanks again, guys\n\nHarold Edwards -- President and Chief Executive Officer\n\nThanks, Vince.\n\nMark Palamountain -- Chief Financial Officer\n\nThanks, Vince.\n\nOperator\n\nLadies and gentlemen, we have reached the end of today's question-and-answer session. I would like to turn this call back over to Mr. Harold Edwards for closing remarks.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThank you for your questions and your interest in Limoneira. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Mills -- Head of Investor Relations\n\nHarold Edwards -- President and Chief Executive Officer\n\nMark Palamountain -- Chief Financial Officer\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nMore LMNR analysis\n\nAll earnings call transcripts"
}