{
  "companyName": "ESCO Technologies",
  "companyTicker": "ESE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/esco-technologies-ese-q3-2022-earnings-call-transc/",
  "content": "ESCO Technologies (ESE -1.01%)\nQ3 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the third quarter 2022 ESCO Technologies earnings call. [Operator instructions] Please be advised that today's conference is recorded. On the call today, we have Vic Richey, chairman and CEO; Chris Tucker, senior vice president.\n\nAnd I would now like to hand the conference over to your first speaker today, Kate Lowrey, vice president of investor relations. Kate, you now have the floor.\n\nKate Lowrey -- Vice President, Investor Relations\n\nThank you. Statements made during this call, which are not strictly historical are forward-looking statements within the meaning of the safe harbor provisions of the federal securities laws. These statements are based on current expectations and assumptions and actual results may differ materially from those projected in the forward-looking statements. Due to risks and uncertainties that exist in the company's operations and business environment, including, but not limited to, the risk factors referenced in the company's press release issued today, which will be included as an exhibit to the company's Form 8-K to be filed.\n\nWe undertake no duty to update or revise any forward-looking statements, except as may be required by applicable laws or regulations. In addition, during this call, the company may discuss some non-GAAP financial measures in describing the company's operating results. A reconciliation of these measures to the most comparable GAAP measures can be found in the press release issued today and found on the company's website at www.escotechnologies.com under the link Investor Relations. Now I'll turn the call over to Vic.\n\nVic Richey -- Chairman and Chief Executive Officer\n\nThanks, Kate, and thanks, everybody, for joining today's call. I'll start off with thanking our global sales. We continue to experience challenging operating conditions across all of our end markets that the teams are working tirelessly to deliver for our customers. We did see the benefits of this hard work during the quarter, with reported sales increasing by over 20%.\n\nThis is the second quarter in a row of sales growth in excess of 20%. This strong top-line growth translated to the bottom line, which reported earnings per share of over 50% and adjusted earnings per share up 33%, I'd say strong performance indeed. The other key highlight for the quarter was our ongoing order strength. During the third quarter, we saw orders increase by 25% and backlog ended at $707 million.\n\nAs we mentioned in the press release, this is a record level of backlog for us. It's great to be sitting with record backlog, it indicates healthy end markets and gives us some visibility as we plan for next year. We also are managing high levels of past due backlog. And this is something we are focused on bringing down.\n\nIn general, we still see supply chain issues as a key driver of our past due backlog situation. It's mostly focused on our Utility and Aerospace businesses. The teams have this in focus and we're proactive with our customer base to make sure they address the issues. Visibility is somewhat limited, as to when this will clear up, our main focus will be we'll remain on doing everything in our power to get customers to products they want when they want them.\n\nChris will get into some financial details in a few minutes, but I did want to offer some top-level commentary about each of our business segments. Starting with A&D, where we had a really nice quarter. Sales and margins both increased nicely. Orders also remained strong with 16% growth compared to last year's third quarter.\n\nAs we look across this business, we continue to see good trends with commercial aerospace, navy, and space all doing well. Just a few weeks back, we attended the Farnborough Airshow outside of London. It was encouraging to see the event so well attended. The show was very positive for us, and we continue to be well-positioned in this market.\n\nAs mentioned before, past due backlog is something we're watching closely for the A&D business. Supply chain challenges are persistent, and we hope the past dues would be normalized by now, but in spite of this, we're still achieving good results at A&D. Next is utility group, where we also had a strong quarter. If you exclude the acquisition impact, we had sales growth of nearly 17%, and that was after a very strong performance in Q2.\n\nSo it looks like this business has finally shaken off the market softness we saw through the pandemic and is starting to ramp up. When you add any acquisitions, the growth is up over 40%. We're excited about what the acquisitions brings to the table for ESCO and in -- and '22 is shaping up to be really transform of the year for utility solutions group. Let's turn now to the test business.\n\nWe continue to see a really great sales momentum. This is the second quarter in a row with sales growth in excess of 20%. We have a global footprint and a broad product offering, selling into strong markets. So it's really been a powerful combination for us.\n\nEven with a strong sales performance, we have continued to grow backlog. Order activity remains elevated, and the team continues to win business around the world. Overall, through the first nine months, we track to the plan we communicated last November. The third quarter is important, as we need to see sales and earnings improvement ramp up, and we're able to get that done.\n\nWe're in a good position and pushing hard to close out the year successfully. As you know, we still have a lot to get done here in the fourth quarter. The teams have this is sharp focus as we come down the stretch. And looking beyond this year is clear, we're setting up a strong foundation for '23 and beyond.\n\nSo I'll turn it over to Chris.\n\nChris Tucker -- Senior Vice President and Chief Financial Officer\n\nThanks, Vic. Once again, we'll have a chart presentation for you, and I'll walk through the material in those charts. We'll start on Chart number 3, which summarizes the Q3 results on a consolidated basis. It's great to have a chart like this, and we have all the arrows pointing upward this quarter.\n\nYou can see the strong performance here with orders and sales up 25% and 21% respectively. Adjusted EBIT dollars up 34% and adjusted EPS up 33%, all very strong numbers. I'll go through the segment results in a moment, but we had a strong sales growth across all three businesses with organic growth of nearly 14% and acquisitions adding another seven points of growth. On the margin side, we had adjusted EBIT of 1.4 points, as we continue to see good leverage on the sales increases.\n\nWe do continue to see significant inflation unfavorably impacting margins, but the teams across the company are doing a good job managing cost reduction efforts and price increases to help offset these impacts. If we can go to the next chart, we can take a quick look at cash flow and capital allocation. Operating cash flow is lagging so far this year. We are investing in working capital as the business grows.\n\nWe see this in accounts receivable and inventory balances, somewhat offset by accounts payable. Capital expenditures are up this year, driven by the first quarter building purchase at NRG and share repurchases year to date are just shy of $20 million. This represents our first share buybacks in a number of years and a good restart to this program. Acquisition spending is up driven by the NEco deal that was closed in the first quarter.\n\nOn the next chart, we have details for the aerospace and defense business. Really solid quarter here with 8% sales growth, the biggest growth coming from the commercial aerospace customers at PTI and Mayday. The navy and space markets also saw a nice growth, which was driven by a VACCO and Globe. On the margin side, we saw a really nice improvement with adjusted EBIT margins up almost three points as Westland, Mayday, and Globe, all delivered nice improvements compared to last year's third quarter.\n\nMoving to Chart 6. Utility solutions group, we had order growth here of 34% and sales growth of 41%. If you exclude the impact of acquisitions, the growth was 9% and 17%, respectively, very strong numbers. Year to date, sales growth for USG, excluding acquisitions, is 12%.\n\nAnd as Vic mentioned, we are hoping that this business is coming into a period of more consistent growth as Utility customers invest in their infrastructure. Adjusted EBIT margins here were up over one point as leverage from the growth more than offset the impact from acquisitions. Chart 7 is the final business we'll discuss, which is Test. As Vic mentioned here, two quarters in a row, sales growth in excess of 20%, but orders even better, up 32%.\n\nThis business has hit a sweet spot of growth with pretty broad growth across end markets and geographies. The adjusted EBIT margins were up a tenth, to 14.1%. We continue to battle some operational headwinds here, but expect the year to close out nicely, especially from a margin perspective. Our last chart, Chart number 8, where I'll quickly cover guidance.\n\nWe have tightened up the full year guidance range to a range of $3.12 to $3.18 per share, which represents more than 20% growth compared to 2021. You'll recall that we laid out initial guidance of $3.10 to $3.20 per share back in November, and we continue to track to this range. As Vic mentioned, this comes from a lot of hard work by everyone across the company as we meet the many challenges that the current economy is presenting. A lot of the inflation and supply chain challenges have been more severe than anticipated, so we feel good about being on track to deliver within the initial guidance range of earnings per share.\n\nWith that, I'll turn it back over to Vic.\n\nVic Richey -- Chairman and Chief Executive Officer\n\nThanks, Chris. Since I touched on quite a few of my thoughts earlier in my commentary, I'll just offer a few more comments before we move into Q&A. It's all the numbers from Chris, but overall, we had a really good first nine months in fiscal '22. We see a good momentum across all three business segments in spite of the ongoing difficulties that come in this current operating environment.\n\nWe hear a lot these days about the economy and fears of the deep recession. Certainly, we watch that very closely and be ready to act appropriately wherever the economy goes from here. With the continued orders and backlog strength are reassuring, I feel very confident in saying that the outlook for ESCO is positive. A few of our end markets are really just getting going with their recovery from the pandemic, and we think that has some runway even if the broader economies have been slower.\n\nAs I said, we'll watch this closely, but overall we're very optimistic. With that, I think we're ready for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question is coming from Tommy Moll with Stephens. Tommy, go ahead with your question.\n\nTommy Moll -- Stephens Inc. -- Analyst\n\nGood evening and thanks for taking my questions.\n\nVic Richey -- Chairman and Chief Executive Officer\n\nGood day.\n\nTommy Moll -- Stephens Inc. -- Analyst\n\nI wanted to start on Doble. It looks like another strong quarter. That makes at least a couple in a row now. And maybe even sequentially, it looks like it was flat to even higher in the quarter you just reported.\n\nSo I guess now there's some consistency here coming out of the pandemic when in prior periods, there was some volatility there. So if you wrap it all together, does it feel like you've hit a pretty good run rate here for Doble or would you point to factors that are still at least on the revenue side, holding you back where there could be a potential for another step change higher from this new level that you've hit the last couple of quarters? Thanks.\n\nVic Richey -- Chairman and Chief Executive Officer\n\nSure. So no, I mean, I think there's always opportunity here. I mean, as we've talked about some past calls, we took the time during COVID to do some significant product development, Doble, and at NRG and as well as Morgan Schaffer and so coming out of pandemic, we think that we should have a pickup of those new products. And I think we have developed some things in kind of a set function better than what we've had in the past even what competition has.\n\nAnd so I think there's not a governor on this that we should -- and therefore, we should be able to get some additional growth as we go forward, particularly in the next year. And even with the acquisitions, and we talked about some of the growth we had there, but as you know, the European economy has been a little more challenged than U.S. and what's going on with Ukraine. And so I think as those businesses are incorporated, I think we'll see a little more pickup in the European market as well.\n\nChris Tucker -- Senior Vice President and Chief Financial Officer\n\nYes. And one thing I would add, Tommy, you kind of mentioned incremental things. I mean one thing we do see there is that the supply chain challenges are still pretty acute. So the last couple of quarters, we probably had $6 million to $7 million each quarter -- each quarter end in kind of what we would call past due backlog there, where we've got the orders, but can't get the product to the customers because of supply chain issues.\n\nCertainly, we expected that will be a little better by now. So we're really kind of seeing a lot of challenges on the supply chain front, and hopefully, that will continue to work itself out as we move forward, and that can allow us to execute in the business a little bit better. But I can tell you, month-to-month, we continue to be doing a lot of kind of hand-to-hand combat there to manage different issues that flare up across the supply base.\n\nTommy Moll -- Stephens Inc. -- Analyst\n\nSo you anticipated my follow-up question, which was going to be on the past due backlog that you've mentioned a couple of times now. And you don't historically guide on cash flow, but maybe you could talk qualitatively versus what you had planned at the beginning of the fiscal year. Have these issues gotten worse? Were there some unanticipated items that arose? And then as you look forward, I feel like I got asked the question, how much visibility do you have? I mean, this has been a tricky issue for plenty of high-quality companies in this challenging environment. So if that forward visibility is limited, knowing that would be helpful, but whatever you could share there would be -- would be appreciated.\n\nChris Tucker -- Senior Vice President and Chief Financial Officer\n\nYeah. I think -- what I would say is that we talked a little bit and quantified in the Q1 numbers about kind of how much past due we had and how much that cost us. We haven't really done that the last couple of quarters, but I would tell you, it did get bigger from Q1 to Q2. From Q2 to Q3, kind of stable, so not a big increase.\n\nSo I would say the problem really isn't getting worse. But I would say we would hope that things would have gotten a little better by now or that some of these pressures would have started to ease. So I think what you're finding is, we don't have a lot of things that are six or nine or 12 months past due, we're getting things out the door eventually, they're just a little slower. And then you get to the next month and some other issue kind of arises.\n\nSo as I said, we just kind of have to battle through it month to month. As far as visibility on when it gets better and how that all kind of rolls into the numbers. It is hard to say. I mean, I wouldn't want to say, we've got a crystal ball that says it all gets better September 30th or whatever date you want to pick.\n\nSo I think visibility is tough to get on that front, but we continue to work it hard. And I think -- we feel good about what we've delivered here the last couple quarters in spite of some of those challenges. And so we'll continue to kind of push to do that.\n\nVic Richey -- Chairman and Chief Executive Officer\n\nYes. If I could just add, I mean, one real benefit of having the orders that we've had and the backlog that we have is it gives us some flexibility. I mean, in a number of places, we've not been able to get certain components, we're not able to get some outside processing done. So we've been able to kind of move around what we're going to deliver.\n\nSo the fact we've been having as many challenges that we've had, and we still be able to get the -- hit our numbers, I think is a testament to people's flexibility, to be honest, but having that backlog makes a big difference, because it does give us the opportunity to pull some things in.\n\nTommy Moll -- Stephens Inc. -- Analyst\n\nI appreciate it and I'll turn it back. Thank you.\n\nOperator\n\nAll right. Thank you, Tommy. Our next question comes from John Franzreb from Sidoti. John, go ahead with your question.\n\nJohn Franzreb -- Sidoti and Company -- Analyst\n\nGood afternoon, Vic and Chris. Thanks for taking the questions. I guess, I'm curious a little bit about the order intake. What's your sense of how much there is that's still deferred spending that's kind of flown through the booking profile or customers now spending based on the current market expectations?\n\nVic Richey -- Chairman and Chief Executive Officer\n\nYeah. I would say that the vast majority of it is just kind of people are buying what they need. I'd see the place where we're seeing a little bit of pent-up demand is in our test business. On the medical side, I think that was -- there was not as much of that capital spending going on as there to pandemic because they were focused on other things.\n\nAnd then the other thing is we do a good bit of sales to the test labs. And so they're playing a little catch up now, because they had kind of put a lot of their capital expenditures on hold. And you've seen some good pick-up there. And it's really across the board.\n\nWe've seen that in the U.S., we're seen in China, we've seen it in Europe. And so -- I'll talk a little bit about the European economy on the Utility side, we've seen that pick up and from an order perspective, in particular, we've seen a pickup with the test business and the test houses. I'd say there is a little bit of that on the Utility side, but I think on the Utility side, it's just kind of getting back to more normalized order rates.\n\nJohn Franzreb -- Sidoti and Company -- Analyst\n\nAnd you mentioned in your prepared remarks or concerns about the recession. Where would you see that first in your order book? Any particular business that would stand out?\n\nVic Richey -- Chairman and Chief Executive Officer\n\nI would say probably test. I think as we look at the business, and I wouldn't say we were trying to express concern about the recession as much as just acknowledging that there's a lot of chatter out there about it. I think from our perspective, the Utility business and the A&D business have some unique and good characteristics about where they are in their cycles right now that should give us, hopefully, pretty good foundation to move forward from. But I think in the test business, if you saw a big slowdown in some kind of overall business activity and capital and that kind of stuff, you could see a quicker impact there.\n\nI'd say that's probably where we'd expect to see it first.\n\nJohn Franzreb -- Sidoti and Company -- Analyst\n\nGreat. And one more, if I may. The organic growth is up 7% year over year. How much of that was volume versus pricing? How are you getting pricing?\n\nVic Richey -- Chairman and Chief Executive Officer\n\nYeah. We're getting price overall. I mean, when you look at -- it kind of nets out overall to about 3% or so on the revenue line and the rest would be volume. Again, you've got places where your kind of getting more than that obviously and you got places where you're not getting any, because of LTAs and things like that.\n\nSo it's kind of a -- lot of different circumstances that drive that overall number, but we estimate it would be in that range.\n\nJohn Franzreb -- Sidoti and Company -- Analyst\n\nGreat. Thanks. I'll get back into queue for now. Thank you.\n\nOperator\n\nThank you very much. We have one more question, and that is coming from Jon Tanwanteng of CJS Securities. Jon, go ahead with your question.\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nHi. Thanks for taking my questions. I actually wanted to follow up on the last one on regarding inflation. Is the net pricing improving as we go forward? Are you starting to see any moderation at all or maybe a pickup in your ability to pass price through? Or should we expect that margin to remain the same as we go forward here?\n\nChris Tucker -- Senior Vice President and Chief Financial Officer\n\nYeah. I mean I think we've saw it a few times as we moved through this year that we saw maybe that inflation was going to settle in a little bit, but then it kind of continues to rear it's like we had. So I wouldn't say we've seen a slowdown in inflation, but we would expect to continue to drive price as we move forward, so that we can get a little more favorability in that price cost equation. Generally, I think we feel good about where we are year to date.\n\nWe're kind of covering the issues we see with price, but we need to do a little better than that. So yes, Jon, we would expect moving forward, that will continue to get a little bit better.\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nOK. Great. And it's great to see you guys doing repurchasing again. It's been a while, I think, since we saw that.\n\nJust one question about your priority for capital allocation. Is it seeing repurchases a sign of not much in the M&A pipeline? Or are you still active there? And -- and put more of a balance than anything else?\n\nVic Richey -- Chairman and Chief Executive Officer\n\nI mean, we still want to continue to make acquisitions. We had a couple of things a few months ago. We did something in the first quarter. So there's still opportunities there.\n\nI can say I mentioned at Farnborough Airshow earlier. Unfortunately, the vast majority of my time there sitting in a conference room talking to investment bankers and other folks about opportunities. And so we certainly have a full core press out there still on that. I think there's some opportunities there.\n\nBut we're very judicious about that. And we've gone as some things that got away from us. But there are a lot of opportunities in there. So we're not putting that plan and -- are more as far as looking for good acquisitions.\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nOK. Great. And then one final one for me. Just the climate bill that's making its way through Congress.\n\nIt has got a big focus on renewables and the grid. I'm wondering, if there's anything in there for NRG or Doble or anything like that, that would make a difference to you guys?\n\nVic Richey -- Chairman and Chief Executive Officer\n\nYes. I mean the NRG business, we don't break that out separately, but they're going gangbusters right now. We anticipate that should help even more, right? So there's been some puts and takes this year where they're going to allow some of these imported solar panels and that kind of got pushed out where that's not an issue. But I think within this bill, there are things that certainly are going to -- it's going to help that business.\n\nChris Tucker -- Senior Vice President and Chief Financial Officer\n\nYes. And I would also say, Jon, even in the Doble business, that's maybe not directly in the renewables, the way NRG is. We still expect a good impact there as the grid gets kind of remade and modernized and gets more renewables added in, that's going to drive testing requirements as these new assets are commissioned and such. And so we think that's good for our business as well.\n\nSo yes, we -- maybe not anything in those bills that directly drive spend of our products, but we think it absolutely drives the whole market and it's going to benefit us.\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nOK. If I could sneak one more in there. Maybe attacking the Doble question from another angle. Are you back to where you were at 2019 levels in the legacy Doble business yet? Or is this somewhat into recovery there?\n\nVic Richey -- Chairman and Chief Executive Officer\n\nSo we project that by the end of this year, we'll be close, but not quite there. So within $5 million on the revenue line. So we're pretty close, but not quite there. So obviously, we would get there next year would be the plan.\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nGot it. Thank you, guys.\n\nVic Richey -- Chairman and Chief Executive Officer\n\nYou bet.\n\nOperator\n\n[Operator instructions] It appears we have no more questions. So I'd like to now turn it back over to Vic Richey for closing remarks.\n\nVic Richey -- Chairman and Chief Executive Officer\n\nOK. We'll end the call now then. So thanks, everybody, for dialing in. I look forward to talking to you on our next call.\n\nChris Tucker -- Senior Vice President and Chief Financial Officer\n\nThank you.\n\nDuration: 0 minutes\n\nKate Lowrey -- Vice President, Investor Relations\n\nVic Richey -- Chairman and Chief Executive Officer\n\nChris Tucker -- Senior Vice President and Chief Financial Officer\n\nTommy Moll -- Stephens Inc. -- Analyst\n\nJohn Franzreb -- Sidoti and Company -- Analyst\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nMore ESE analysis\n\nAll earnings call transcripts"
}