{
  "companyName": "Kirklands",
  "companyTicker": "KIRK",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/kirklands-kirk-q2-2022-earnings-call-transcript/",
  "content": "Kirklands (KIRK 8.91%)\nQ2 2022 Earnings Call\nAug 30, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, everyone, and thank you for participating in today's conference call to discuss Kirkland's financial results for the second quarter ended July 30, 2022. Joining us today are Kirkland's president and CEO, Steve \"Woody\" Woodward; COO and CFO, Nicole Strain; and the company's external director of investor relations, Cody Cree. Following their remarks, we'll open the call for your questions. Please note today's conference is being recorded.\n\nBefore we go further, I would like to turn the call over to Mr. Cree as he reads the company's safe harbor statement within the meaning of the Private Securities Litigation Reform Act of 1995 that provides important cautions regarding forward-looking statements. Cody, please go ahead.\n\nCody Cree -- Investor Relations\n\nThanks, Rocco. Except for historical information discussed during this conference call, the statements made by company management are forward-looking and made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements involve known and unknown risks and uncertainties, which may cause Kirkland's actual results and future periods to differ materially from forecasted results. Those risks and uncertainties are more fully described in Kirkland's filings with the Securities and Exchange Commission.\n\nI'd like to remind everyone that this call will be available for replay through September 6, 2022. A webcast replay will also be available via the link provided in today's press release, as well as on the company's website at kirklands.com. Now I'd like to turn the call over to Kirkland's own president and CEO, Woody Woodward. Woody, over to you.\n\nWoody Woodward -- Chief Executive Officer\n\nThank you, Cody, and good morning, everyone. As I reflect on the first half of this year, we've encountered a number of headwinds in our business, whether it be supply chain issues, rampant inflation or a depressed consumer spending environment. Working through these external pressures hasn't been easy, but I'm proud of the resiliency of our entire organization, especially as we make progress in transitioning our company for sustained long-term success. On today's call, I'm going to go over our performance in the second quarter, the current state of our customer acquisition strategy, our liquidity and inventory management goals for the remainder of the year, and what the consumer spending environment looks like as we head into harvest and holiday selling season.\n\nSo let's jump right into it. Our second quarter efforts were focused on reengaging with customers across our omnichannel platform while intentionally elevating our promotional activity to work through our excess inventory position. We knew that being in this promotional -- we knew that being this promotional while also experiencing higher costs within our supply chain would have an impact on our margins. However, we believe this was a necessary step to ensure we are on track to hit our target of being below 100 million in inventory by the end of fiscal year.\n\nI'm pleased to report that we remain on track to hit this goal. While our comparable same-store sales were down about 9% for the quarter, we were pleased to see improved sequential same-store sales trends from the first quarter. Our in-store traffic also improved each month throughout the quarter, with May starting down 17% to only being down 11% by the end of July. Additionally, our in-store average ticket increased 11% -- or 12% compared to Q2 of last year as a result of our shift to offering larger ticket items and more products within the better and best categories.\n\nIn our omni channel strategy, we're beginning to see some signs of normalization for e-commerce. Although our year over year comps declined 8% sales, for this channel, we were up nearly 50% compared to 2019 when we started to ramp up our e-commerce efforts. Similar to the strategy -- similar to our in-store strategy, we continue to drive sales in higher ticket items and AUR increased across almost all e-commerce channels. While traffic was still down 15% year over year basis, we did see trends improve month to month throughout the quarter.\n\nWe still believe that inflationary pressures and the slowing housing market have continued to impact consumer demand for home furnishings, as a majority of our categories were down on a year over year basis. However, our furniture category was a bright spot this quarter, with a 13% increase in sales compared to the prior year. We successfully launched our in-home delivery service earlier this quarter through our partnership with Ryder, which we believe will play an integral role in expanding our customer base and delivering a positive customer experience when ordering larger items like furniture and outdoor. Overall, customer demand across the retail landscape remains soft, and it's difficult to predict when the customers will increase spending on discretionary items again.\n\nThis should not come in surprise with many of our peers in the retail industry sharing similar sentiments. However, we are seeing more customers turn to value options, so we want to ensure that we have a clear message that consumers have high style home furnishings options at price points that should be attractive to customers looking for a great deal. While we've had to pull back on our marketing spend, we improve clarity of our messaging and began showing after-promotion pricing more clearly online. This is proving to be a vital component to driving customer interest, especially within the furniture sector.\n\nWe believe the improved messaging around pricing will not only further benefit our historical customer base -- our store customer base that is very discount-oriented, but also drive awareness with new customers searching for a value. As a reminder, Kirkland's Home has historically performed well during prolonged recessionary periods. And we believe -- and we want to be in the best possible position to capture value-focused customers. When we first embarked on our transformation journey, we made a conscious effort to shift away from our historical, discount-oriented customer base in favor of a new customer that would be willing to pay a bit more for higher quality merchandise in new categories.\n\nWhile this strategy initially worked, we had significant market tailwinds driving customer demand for home furnishings. Current market conditions have given us a new perspective and is causing esoteric strategy, at least in the short term. It's still our goal to drive brand awareness and bring as many new customers to our omnichannel platform as possible to shop for new, high quality merchandise we continue to introduce. However, we will also utilize the traditional high, low retail pricing strategy to further drive interest from our historical customer base of value-oriented customers.\n\nIt's important to note this type of pricing strategy is common across the home furnishings industry. We firmly believe we will be able to adjust these discounts to still be profitable while convincing customers that our new low price is the right price to buy. As I spoke earlier, we have been hyper focused on inventory management to significantly improve our liquidity profile by the end of the fiscal year. We made a clear effort to begin working through our inventory position as we turn through excess inventory -- excess product that we needed to clear off our balance sheet, knowing we would sacrifice margins.\n\nAs we're doing this, please keep in mind that we brought in inventory for harvest and began bringing in products for holiday. So the magnitude of this inventory clearance isn't as apparent in the numbers you'll see on our balance sheet for the quarter. As a result of the inventory build preparing for the next two quarters, we are currently sitting at our peak inventory position today, which we had planned for and spoken about on our last call. However, I want to reiterate that our inventory has turned at a faster pace than expected, and this benefit will really start to show in our fourth quarter after we had sold through the majority of our harvest and holiday inventory.\n\nThis directly relates to another topic of concern among most of our shareholders, our liquidity position. As expected, we continue to tap our revolving line of credit to bring the merchandise for the harvest and holiday season, and similar to our inventory position, we believe we are sitting at the peak of borrowings in August. However, as we begin to generate cash flow in the next few quarters, we will start to pay this balance down. In addition to prudently managing our operating expenses to ensure we appropriately maximize the value of every dollar coming into the business.\n\nI'll let Nicole drive further into these details later on. But I want to reiterate that inventory and liquidity remain top of mind and we believe the steps we were taken to put our balance sheet in a better position are working. Looking to the remainder of the year, the third and fourth quarters are historically our strongest sales quarters as harvest and holiday seasons drive customer demand. We move our way into these shopping seasons in a much better position than we were last year, with inventory on hand to sell.\n\nHowever, the demand side of the equation is still a bit unknown. While it's difficult to predict, we want to keep our expectations realistic. We are beginning to see encouraging results. Same-store sales during August continue to improve.\n\nWe're only being down 3% on a year over year basis and we've seen an approximately 500-basis-point improvement on landed margin from our Q2 rate. During the next two quarters, we will continue to lean on inventory promotional activity to drive sales as part of our high level pricing strategy we discussed. As a result, I expect to see more normalized discount rates across all categories. While these promotional activities will have a drag on our margins for the remainder of the year, we believe it's a necessary step we must take to want -- to work through the inventory and bolster demand.\n\nWe are also seeing input costs within the supply chain coming down as gas prices -- as gas prices and shipping rates start to normalize. However, due to the timing of when we bring in inventory, our margins will likely not see a benefit from this until early 2023. We are keenly aware of the macro environment -- we're keenly aware the macro environment can change on a dime, so we are managing -- or remaining vigilant in our cost management and keeping a close eye on promotional levers to drive demand. From an operational perspective, we believe we remain in great position.\n\nWe have found an excellent candidate in Mike Madden to be our new CFO. Mike brings extensive experience in our business and industry, having previously served in various senior leadership and executive roles at Kirkland. We believe Mike could be a stabilizing force for our finance organization and an integral part of our strategic efforts as we continue down the path for our transformation. While we expect to continue prudently managing operational and corporate expenses, we are looking forward to getting Mike sized on our cost structure to evaluate our store footprint and incremental cost savings initiatives that we can implement.\n\nWe'll likely have more to come on this front in the coming quarters. Overall, I feel like we've weathered the worst of the current storm. Despite the slowdown in consumer spending and the rising supply chain costs we've experienced over the past several quarters, we are still very committed to executing our own -- our transformation strategy in turning Kirkland's Home into a premier home furnishings retailer. The work we've done since embarking on our transformation has not been lost.\n\nWe have continued to find success through our omnichannel platform, improved product mix, direct sourcing, and now our in-home delivery option. We stand firmly committed to creating a better company, and we continue to preserve toward our vision of maximizing the value we drive in our -- for our shareholders. And with that, I'll now turn it over to our CFO and COO, Nicole Strain, who will provide detailed commentary on our performance in the second quarter and outlook. As we announced earlier in the quarter, Nicole will be moving on from her role in Kirkland's.\n\nI'm proud of what we've been able to accomplish together and wish her nothing but the best as she embarks on the next chapter. From all of us here at Kirkland's Home, we want to thank you for everything you've done for this company. Nicole, the floor is yours.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nThank you for the kind words, Woody, and good morning, everyone. Before getting into the specifics of the quarter, I want to provide an update on our liquidity and inventory position and how we expect that to play out for the remainder of the year. Going back to how we got here, we had accumulated a significant amount of already produced product in 2021 that had not shipped due to supply chain constraints. We chose to honor those orders and ship that product to ensure we had enough merchandise to satisfy demand.\n\nTo offset this influx of inventory, we purchased a limited new products for the first half of 2022. At the time, we believe this would be a short-term working capital impact and that we would have excess inventory with the expectation that it would normalize by the middle of the year. Additionally, we pulled forward both harvest and holiday orders to make sure we didn't have the same issues we had in 2021 with missing merchandise. What we didn't expect was the significant drop off in sales beginning in March.\n\nWe quickly removed approximately 50 million in receipts from the back half of 2022 and began to ramp up promotions in Q2 to turn this excess inventory into cash. As we mentioned on the last call, we expected early Q3 to be our peak in both inventory and borrowing on our line of credit. And I'm pleased to share that we are where we expected to be with inventory peaking in August and a current balance on our revolver of 60 million, which we don't expect to go any higher. As we start to sell through harvest, we are already seeing our working capital improve and expect to start gradually paying down our revolver and outstanding payables in the third quarter with most of the progress beginning in November.\n\nWe expect to end the year with inventory in the $80 million to $90 million range and to have less than $10 million borrowed. We intend to manage our inventory tightly and keep it lean throughout fiscal 2023 to further improve our working capital position. Coming into our results for the quarter, net sales were $102.1 million, compared to $114.8 million in the year-ago quarter, which included a comparable same-store sales decline of 8.6%, which was driven by the year-over-year decline of in-store and online traffic and conversion, partially offset by an increase in average ticket. Breaking down sales within the quarter, we had a total comp decline of 12.7% in May, a comp decline of 7.4% in June and a 5.8% decrease in July.\n\nE-commerce sales declined by 9.1% compared to the prior year quarter and improved from down 15.5% in May to down 1% in July. E-commerce was 28% of total sales in the quarter, which is similar to the prior year. Gross profit was 18.1% of sales, compared to 34.6% in the prior year quarter. The decline was primarily due to the increased use of promotional activity to move through inventory, as we discussed, as well as higher distribution costs and shrink from the elevated inventory levels and the impact of lower sales on various fixed-cost components.\n\nStore occupancy costs increased to 15.8% of sales, compared to 14% in the prior year quarter due to a lower sales base. DC costs increased to 5.5% of sales, compared to 4% in the prior year period, primarily due to operating inefficiencies with the higher inventory levels. Outbound freight costs from our distribution centers to our stores increased to 3.9% of sales from 2.3% in the prior year due to adding additional routes to move more inventory, along with increased shipping rates and fuel costs. E-commerce shipping costs decreased slightly to 4.8% of sales, compared to 4.9% in the prior year quarter.\n\nOperating expenses, excluding depreciation and impairment, were $38.5 million or 37.7% of sales, compared to $37.8 million or 33% of sales in Q2 2021. Our operating expenses are largely fixed in the first half of the year, which allows limited ability to reduce costs with sales decline. Adjusted EBITDA, excluding impairment and other minor non-operating expenses, was negative $16.4 million, compared to $5.1 million in the same period last year. Our normalized tax rate in the second quarter was 22.7%, compared to 24.4% in the prior year period.\n\nAdjusted loss per share, which includes non-cash -- which excludes non-cash impairment, normalized tax rate, and other minor non-operating adjustments was $1.31, compared to an adjusted loss per share of $0.01 in the prior year. GAAP loss per share, including these items, was $2.02, compared to earnings per share of $0.04 in the prior year. We ended the quarter with $10.3 million in cash and utilized $55 million in borrowings on our revolving credit facility. Inventory at the end of the quarter was $141.7 million, which was an increase of $49.7 million from the same time last year and up $27.7 million compared to the end of fiscal 2021.\n\nGiven the uncertainty in overall consumer demand we expect for the near term, we will not be providing guidance but can offer some color on what performance is included in our liquidity outlook. From a sales perspective, August is off to a better start in Q2, with a comp decline of 3%, which is more favorable than our expectations. We expect to be in a good seasonal inventory position and have product available for the scheduled set dates, which we believe will benefit holiday demand the most with the year-over-year sales trend improvement in the back half of October and the first half of November. From a comp perspective, the most opportunity exists in the fourth quarter as we didn't spend all of our holiday product to stores last year, given the late arrival.\n\nFrom a margin perspective, we will continue to be promotional for the remainder of the year as our first priority is improving our liquidity and inventory position to set us up for a successful 2023. However, our level of discounts will normalize from what we saw in Q2. We expect margins to sequentially improve from the second quarter, but continue to be down compared to the prior year by 400 basis points to 500 basis points in Q3 and 200 to 300 basis points in Q4. While we are seeing inbound freight rates decline, we won't see a significant benefit in our financials until the first part of fiscal 2023 as most of the inventory we will sell through this year shift to higher rates.\n\nLastly, as we discussed in our last call, we paused our share buyback program, given the restrictions our credit facility has in place well in a borrowing position and to maintain an appropriate level of liquidity needed to support the business. We still believe that share repurchases will be a valuable component of our capital allocation strategy over the long term, and we will provide any updates on resuming buybacks as we move into a better liquidity position in the coming quarters. Before we move on to Q&A, I want to thank everyone at Kirkland's Home for the opportunity to serve as CFO and COO. It's been a pleasure helping the company grow and transform into the specialty home furniture that it is today.\n\nKirkland's will be in the very capable hands of Woody and Mike, as well as our experienced financial and operations team supporting them along the way. Thank you to our valued shareholders who have stood by us and encouraged us through the years, and I look forward to seeing Kirkland's Home, unlock its true potential. Operator, we are now ready for Q&A.\n\nOperator\n\nThank you, ma'am. [Operator instructions] Today's first question comes from Jeremy Hamblin with Craig-Hallum Capital Group. Please go ahead.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nThank you. And Nicole, it's been a pleasure working with you. Best wishes on future success. I wanted to start by just making sure that I understood the expectations around gross margin improvement.\n\nYeah, I think what you said was that you expected to see sequential improvement by 400 to 500 basis points in Q3 versus Q2 and then another 200 to 300 basis points for Q4. Can you confirm that?\n\nNicole Strain -- Chief Operating and Financial Officer\n\nYeah. What I said was we do expect sequential improvement from Q2, but to be down four -- down to last year, 400 to 500 basis points in Q3 and 200 to 300 basis points in Q4. And that's actually landed margin. I think gross profit will likely be down a bit more than that as we're moving more inventory than we were last year.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nI see. OK. Those are the landed margins. OK.\n\nAnd the land margins, just remind me, in Q2 were down how much?\n\nNicole Strain -- Chief Operating and Financial Officer\n\nLanded margin was 49.1, which was down 1,070 basis points, 10 percentage points.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nGot it. OK. That's helpful. And then in terms of just thinking about the pivot here, Woody is grateful.\n\nObviously, you guys are doing the right thing. You're clearing lots of goods out, managing inventories down. And how you think about making that pivot, because I think even your brand new goods, your fall harvest goods that are just hitting stores now, you're marking down pretty significantly. How do you shift that messaging to your consumers, particularly when you have a lot of competitors that are also out there discounting, into one in which you can get back to more full-price selling or even selling at a reduced markdown level? How many quarters do you think that likely takes? Is that something that early in '23 you think can happen? Or do you think that's something that as we look into next year, it's going to take a little bit of time to kind of recondition your customer's mentality?\n\nWoody Woodward -- Chief Executive Officer\n\nWell, thanks for the question. Of course, I look at this year as kind of a perfect storm. We're very optimistic going into this year as we let our inventory really peak. But if we look at specifically the third and fourth quarter of last year, it was kind of a tale of two stories.\n\nWe had harvest in stock and we thought that the harvest sales would continue to offset some of the Christmas decline on the merchandise that wasn't going to hit the floor. And what the customer told us is that at a certain time, harvest is not as interesting to her as wanting to have the Christmas assortments in store. So our harvest this year -- and let me put a second caveat, both harvest and Christmas product has come in with a higher margin because we have some of this promotional activity built into the nature of how it liquidates. I mean, there is a really good formula for it.\n\nIt's got to be at 25 off at this point and 40 off at this point, and it's all built into the margin. So that part, I feel pretty confident that that we'll be able to work through. I think that we are good at meat at managing our seasonal product. It's the core products that we have to be much more disciplined on.\n\nWe did -- most of the inventory liquidation that we experienced within core products that we felt like we just had too much of. So I think that that's what we pull back for the balance of this year, but also trying to hit that goal for our liquidity, we want to really make sure that we are clean on the balance sheet with as little borrowings as possible at the end of the year and try to hit that nickel number of between 80 million and 90 million. And to do that, we just need to be really prudent. We feel like that inventory, we have to treat differently than we do the seasonal.\n\nBut it all works out. And I think that right now we are experiencing improved margins from a more disciplined discount strategy and then also discovering what motivates the customer in terms of how do you really motivate them to come in to the door and purchase. And right now our harvest product is doing good. Our furniture is still really exceeding our expectations.\n\nAnd then we have another category or two that's doing very well.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nJust to add a couple of things, Jeremy, we are seeing freight rates come down and I think we'll have a tailwind next year of 200 to 300 basis points on the margin line if nothing else changes, which will help margins. And also even if we stay at the same discount level, we do have the opportunity to price in some categories next year. So definitely looking at options that we may still have to be promotional in order to drive sales, but some options to offset that and still get back to higher margin rate.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nOK. That's helpful. And then I did want to talk or explore strategy in terms of your merchandizing strategy. So you've made -- you discussed on the call, you've made a pivot to, let's say, a more elevated assortment across your product mix.\n\nI know that was an intentional thought. Furniture is certainly, I think, a key part of that strategy. And some of it appears to have worked and some of it clearly have not. But I wanted to get a sense, Woody, in terms of go-forward '23 and beyond, do we stick with that strategy? How are you planning to pivot? And again where you've got a customer base that's a little bit under fire from higher -- from inflationary pressures and maybe a little bit of a weakening economy, how do you think about that strategy on a go-forward basis?\n\nWoody Woodward -- Chief Executive Officer\n\nYeah, that's a good question because I think what we have had to do is really look at that strategy and really pick the parts that are working and also make some adjustments on the parts that we felt like were not working, whether they be from a macro economic environment or just the customers are less accepted. With customer acquisition being expensive and difficult, we want to make sure that we're attracting both the new customer and satisfying the customer that we currently have. And that customer that we currently have loves a discount, and that's OK. I mean, we're supportive of that.\n\nSo what we need to do is make sure that two things. One, that we are -- appear to be promotional. Now, remember that we can be promotional and whatever issues that we've had in past years with layering that merchandizing promotion with also a coupon on top, so we decoupled those, which helps us still appear to be as promotional but not have to give up as much margin because I'm not positive the customer actually recognized that there was a coupon on top of the discount, so we decoupled those, which is helping for the future. And then we've gone back on our assortment for 2023 and really looked at supporting opening price points and some of the things that have traditionally motivated that customer, whether it be pick-up items or items that she can come in and purchase.\n\nAnd then she's been very supportive, our customer has been, of our upgraded quality and furniture. And furniture is one of our best categories right now, which was mostly the poster child of our new strategy, improve the quality, improve the packaging, improve the design, and still maintain great pricing. So we didn't want to say that we are walking away from that strategy, but we did go back and alter it with adding some items at opening price points. And then I think that we said in the call that Kirkland's has traditionally done pretty well during an economic downturn because people that might have purchased the higher end home furnishings retailer would look at our assortment as a value opportunity.\n\nAnd we had to do that in terms of really being able to compare our products with other retailers. And then we also needed to get in-home delivery and that's taken off and done a better job than what we had anticipated. And so we're looking forward toward that in the next several years, putting it in the set of somebody coming in and wanting to do a whole room and spending several thousand dollars and getting a fair delivery charge.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nRight. That's helpful color. And then one other thing that I think you mentioned on the script was that your marketing spend maybe was not quite what you had originally planned. I wanted to just get a sense for what that -- if you could provide a little bit more detail on that in terms of how much less did you spend than you expected to? And at what point do you think you can maybe get that ramp back up to a level that you were -- is more in line with your plan?\n\nWoody Woodward -- Chief Executive Officer\n\nYeah. We said on the call that we were focused in this year, specifically with our liquidity and managing through our inventory. And it just seemed like the wrong time for us to be spending so much additional dollars on customer acquisition. So we did pull back on that market test strategy, which was pretty expensive.\n\nWe're not abandoning it. We're just saying that it's not the right timing for us to spend additional marketing dollars when we're trying to manage through our liquidity and our inventory. We do have more marketing dollars in our plan for next year than we did in previous historical time. It'll probably be more focused on performance marketing versus -- and much of the customer acquisition.\n\nBut there is a component of what we saw during that two-month market test that we felt would work and we may be pulling some of those levers again next year as lower in the inventory and come into a period where we're not as motivated to be as promotional.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nThe biggest impact, Jeremy, is going to be in Q3. Q3 of last year, we spent more on marketing. We spent over 5% of sales because we were attempting customer acquisition and then later realized that it was better not during the seasonal time period. So we expect that to be 3 million to 4 million less.\n\nSo the biggest reduction is in the third quarter this year. Q4 is pretty similar to last year.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nGot it. Last one for me and I'll hop out of the queue. In terms of evaluating the kind of the store counts from here and obviously it's a challenge on profitability near-term. But again, as you look forward and with expectations of where things are going to kind of finish out the year, do you feel like evaluating store-level profitability, do you see any meaningful changes? I know Mike hasn't really had a chance to to go through where the store base is, but wanted to get a sense for whether or not you think just kind of modest contraction in store counts, is there something more meaningful that needs to be done to make the overall business more profitable?\n\nNicole Strain -- Chief Operating and Financial Officer\n\nYeah, I think -- I'll jump in. Definitely Mike has a background in real estate, and I think his perspective will be really good. I do think that over the next couple of years, if store trends don't change, there is an argument that there's a handful of stores that we would close. But at this point, I don't think it's any significant change in the overall structure.\n\nI think that that will likely be one of the earlier things that Mike digs into.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nGot it. All right. Thanks so much for taking all my questions. Best wishes.\n\nWoody Woodward -- Chief Executive Officer\n\nThanks, Jeremy.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] Today's next question comes from Anthony Lebiedzinski with Sidoti and Company. Please go ahead.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGood morning. I thank you for taking the questions. And Nicole, it was certainly a pleasure to work with you over the last few years and look forward to working with Mike Madden again and look forward to continuing to work with you, Woody. So first, just in terms of Q2 comp sales, just wondering if -- did you guys see any significant geographic differences in their markets or was it broadly consistent? Just curious about that.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nIt's been similar to the trend we've seen for a while. Definitely the Texas market and some of the Texas and Florida markets are stronger than some of the others. But I would say those two I would call out and then everything else I would say follows a pretty similar pattern.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nOK. So that's consistent with what we've heard from others as well. So in terms of the inventory increase, I know you mentioned that a good chunk of that increase that's showing up on the balance sheet is because of increased harvest and seasonal inventory. So if possible, I mean, if we were to exclude that impact, I mean that you're just wondering what would have been the inventory increase, so just want to get a better handle on inventories, is that possible.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nThe Q2 numbers, we really didn't break down that way because we record even if it's in-transit. So it's not a significant difference in the Q2 number but I can get you that number.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nOK. No worries. OK. Thanks.\n\nAnd then one of the initiatives that you guys had talked about previously but hadn't heard now was about direct sourcing. Obvious -- I know those -- the issue of too much inventory now, but where are you guys now? I mean, how should we think about that, whether that could be a potential improvement for margins next year or beyond? Just wanted to get a better sense as to where you are with direct sourcing.\n\nWoody Woodward -- Chief Executive Officer\n\nYeah. Anthony, the direct sourcing has really three components that make it effective for us. It does improve our profitability because we can buy it at a better rate, but it also improves the individualness of our design so that you can't buy the same products, that you can buy in Kirkland's Home as other places. So it gives us more exclusivity.\n\nAnd then the final thing is it helps us control the quality and packaging in a much better way. So we're very focused on continuing to build our direct sourcing this year. Some of those items had to be moved or canceled for the back half of this year. But I think we will still hit our goal of being in the 48% to 50% direct sourcing.\n\nAnd then next year, of course, our goal will be to grow that. And then I thought we said on one of the earlier calls that we would pause at around the 75% mark because the residual benefit has been that some of our wholesale partners have really sharpened their pricing and their packaging and their quality to match what we can get from direct sourcing overseas. So it's been kind of a little bit of a win win across both our direct sourcing and our wholesale purchasing. So yeah, very focused.\n\nI think that it will be a -- as things stabilize and the supply chain normalizes a bit, it'll still be a very important part of our strategy for improving margins and having more exclusive product.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. OK. And then you mentioned and we've heard from others about ocean freight costs coming down. What are you seeing in terms of other costs, like labor costs, anything else that you want to call out? Just wondering about just how you think about the cost structure kind of going forward.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nI don't think anything significant. Obviously will we're heading into in the next couple of months ramping up for holiday hiring in store. So I think we'll have a little bit better idea once we get into that. But that's the only other real significant potential inflation impacts.\n\nWe are obviously seeing on all of our contracts and everything, continue to see 5% to 10% increases. And I think that's probably across the board.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. All right. Well, thank you and best of luck.\n\nWoody Woodward -- Chief Executive Officer\n\nThank you, Anthony.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nThank you.\n\nOperator\n\nAnd ladies and gentlemen, our next question today comes from John Lawrence of Benchmark. Please go ahead.\n\nWoody Woodward -- Chief Executive Officer\n\nHi, John.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nYeah. Thanks. Yeah. First of all, Nicole, thanks for all your help over the years and good luck going forward.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nThank you. I appreciate it.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nWoody, could you talk a little bit about a little less a little less progress throughout the quarter and then into August? Is the customer broadening that basket a little bit are still focused and just the promo items or you're seeing that basket sort of build across product lines?\n\nWoody Woodward -- Chief Executive Officer\n\nYeah. I think the big winners for us at the -- in July and certainly going into August have been certain categories like furniture, where we're seeing that increasing as part of our overall sales numbers. Other categories like mirrors have been very, very successful. So and part of that could be that they're now able to get a room full of furniture delivered to their home versus having to pick it up in their car at the store and make some other kind of arrangement.\n\nSo we are hopeful and optimistic that the growth in our furniture business will be an ongoing part of our strategy. And it does help the AUR and the ticket. And I think we've also -- we've just realized that we -- when you have as much inventory as you -- as we were carrying in the second quarter and now peaking right now, it does affect your operations overall. We're really tight in D.C.\n\nwhere the stores are very full of inventory. And we want to make sure that we treat that inventory with respect. Now that we've gotten through the second quarter where we knew we just had to lower the overall number, and Nicole said on the call earlier that you're not seeing it as much because we are also bringing in harvest and Christmas at the same time, which has a very natural liquidation through the third and fourth quarter. But we made pretty significant progress on getting into our products that can get us in a better position going into next year with a leaner and cleaner inventory.\n\nWe really feel like other than the holiday, we don't have any significant pockets of problems. We were able to liquidate our outdoor products without having to carry that forward. And this year, we don't have an intention of carrying forward a portion of our Christmas product like we did last year. So I think we start off next year in a cleaner position and that should help us for the whole year.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nGreat. Thanks for that. And could you give me what -- what was the percentage of mix of furniture? I assume it will. It moved up a little bit in terms of mix.\n\nIt did in some weeks when we were promoting it, it went as high as 29%. But I think overall --\n\nNicole Strain -- Chief Operating and Financial Officer\n\n25.\n\nWoody Woodward -- Chief Executive Officer\n\n25 for the quarter.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nYeah. And what would that have been last year? It was in middle teens, right?\n\nWoody Woodward -- Chief Executive Officer\n\nYeah. It been in the -- maybe 15%.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nJust under 20.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nGreat. Great. Thank you. Good luck.\n\nWoody Woodward -- Chief Executive Officer\n\nThank you.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nThank you.\n\nOperator\n\nAnd the next question today comes from David Berman at Durban Capital. Please go ahead.\n\nDavid Berman -- Durban Capital Management -- Analyst\n\nHi. Hi, guys. I guess I was wondering -- I listened to some of the inventory calls -- I appreciate that inventory is up so much, and they seem to have gotten better from the prior quarter, the trends. And when I go online and look at Kirkland's and I look at the sales you're having, it's fascinating to see because it's reminiscent.\n\nAnd you can definitely come back. It's reminiscent of I think what happened with you guys. I don't know how long ago that was, maybe 10 years ago. But I'm trying to understand the elasticity of demand of your product in the sales.\n\nLike in others, I'm looking at the sale that was in 50 off whatever, 30 off. And I'm wondering what you're finding, when you do peak sales and it really helps you or doesn't offer you how much it helps you, how badly or how quickly you want to get rid of the inventory. And I'm curious what what your tactics are like and why they don't offer me this is to buy a few of your products. You got to have the big sale, the Labor Day weekend and Thanksgiving, when -- what is your strategy? But more important, elasticity.\n\nWhat are your thoughts on it?\n\nWoody Woodward -- Chief Executive Officer\n\nYeah. Yeah. Thanks, David, for asking the question. Our customer is very motivated by price.\n\nI think that might be something in the entire home furnishing industry that when you're buying a big ticket, you're wanting to buy it at the best possible price. We did make the strategy of taking the holiday time periods, such as 4th of July weekend or this coming Labor Day weekend. And using that when we know that there is demand and traffic out in the stores as being our most promotional. And then we've also been using more of the up to pricing.\n\nSo for our current Labor Day promotions that we have, it says up to 75% off, but that's mostly involving our clearance. Our regular promotions are in that 25 -- 25% to 40% off, depending on what the product category is. And I think that one thing that we have to do is just to acknowledge the fact that the home furnishing industry is motivated by a great deal and price point. And we needed to adjust our behavior with taking some price increases or putting higher input margins on some of the products that we just know are just going to be motivated through promotional activity.\n\nI hope I answered the question right. So if there's a follow up, let me know.\n\nDavid Berman -- Durban Capital Management -- Analyst\n\nYeah. So you find that when you take these big sales, sometimes it probably doesn't help if it's not a big sales day because you don't have the traffic and the funding that you did of do the bigger sales on the traffic days like this Labor Day weekend?\n\nWoody Woodward -- Chief Executive Officer\n\nWell it's funny because right now, our sales during the week when we're a little less promotional, have been pretty good. Now, weekend sales because of traffic declines or people maybe just being a little bit more reserved have not been as good. But we do find that the holidays are periods where customers really want to purchase. And then, of course, all this home delivery, in-home delivery that we charge for is new.\n\nSo we're able to tap into, hopefully, a new customer that says, I kind of liked what Kirkland's had in the past, but I didn't really want to pick it up in my car or my pickup truck or whatever. And now I'm able to come in and buy a whole linear group of furniture or dining room furniture and not have to worry about the stress of bringing it home.\n\nDavid Berman -- Durban Capital Management -- Analyst\n\nRight, right, right. And in terms of the urgency of getting rid of inventories, I mean, the sales are the basis. They really are high. I mean they have come down.\n\nAre you satisfied with the rate has come down? Do you expect them to come down faster? What is it your sense of urgency on that?\n\nWoody Woodward -- Chief Executive Officer\n\nInventory is one of our biggest assets. So we're really careful with how we bring it down. You don't want to just unbridled discount everything. So we took the position of taking categories that we knew we had more inventory, especially in core categories, and letting that inventory have a higher discount, which allowed us to have a good quality basis of inventory for the back half of the year and going into next year.\n\nThe worst thing that we could possibly have done would be to take great product that we know we would have to reorder next year and just liquidate it and give it away. So we've been pretty careful and strategic of how we marked it down. But yeah, it did. It has reached our expectations.\n\nAnd that's why I think on the call last time we said that we would be at about $100 million inventory and now Nicole is quoting between $80 million and $90 million. So we're making good progress. We feel like we start next year with it a more reasonable number than we had this year. And then we'll keep that number relatively lean throughout the entire year next year.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nIf it helps, David, in Q3 -- at the end of Q3, we think we'll be up 15% to 20% to last year and then by Q4, down about 20% to last year. So it is gradually going to work itself out through the rest of the year. And that is intentional.\n\nDavid Berman -- Durban Capital Management -- Analyst\n\nAll right. And your pain was obviously related to inventory. I see that's gone up to 62 million. And I'm sort of completing 66 days of inventory, which is just over two months.\n\nIs that I mean, it feels like that's your first all -- it's quite a lot, two months. Is that the normal terms or are you stretching the payrolls? And to what extent are you able to get fresh inventory, bring in fresh inventory at the moment? Or are you trying to just get rid of old inventory? Where are you on that mix it? There's quite a delicate balance to it to --\n\nNicole Strain -- Chief Operating and Financial Officer\n\nYeah, we are stretching payrolls a bit and we have had some vendors that have on holiday product lengthened their terms and that is always a challenge that we are paying for holiday most years before we start selling it. So we've had some vendors lengthen their terms to better align those. But similar to the peak on our line, we expect to catch up over the next couple of months on the payables that we've stretched. And I think to your last question, we when we canceled the receipts, we basically only protected seasonal.\n\nWe're really not bringing in anything of significance the rest of the year other than harvest and holiday. I mean, we'll work through the core product that we already had for the rest of the year and then be in a clean position as we look at 2023 to have complete sets and hopefully be back to somewhat of a normalized purchasing pattern.\n\nDavid Berman -- Durban Capital Management -- Analyst\n\nAll right. Thanks. So I guess after this -- actually, supposed to go shopping this Thanksgiving, this Labor Day weekend. I know at home I've actually got some incredible pictures.\n\nI'm going to like next to nothing 10 years ago. I was always had this dream of having an incredible dream.\n\nNicole Strain -- Chief Operating and Financial Officer\n\nYes, you do go shopping. Thanks, David.\n\nWoody Woodward -- Chief Executive Officer\n\nThanks, David.\n\nOperator\n\nAnd thank you. This concludes our question-and-answer session. I'd like to turn the conference back over to Mr. Woodward for closing remarks.\n\nWoody Woodward -- Chief Executive Officer\n\nWell, thank you, Rocco. I really appreciate it. We'd like to thank everyone for listening to today's call and we look forward to speaking with you when we report our third quarter 2022 results. Thanks again for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCody Cree -- Investor Relations\n\nWoody Woodward -- Chief Executive Officer\n\nNicole Strain -- Chief Operating and Financial Officer\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nDavid Berman -- Durban Capital Management -- Analyst\n\nMore KIRK analysis\n\nAll earnings call transcripts"
}