{
  "companyName": "Tilly's",
  "companyTicker": "TLYS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/tillys-tlys-q3-2022-earnings-call-transcript/",
  "content": "Tilly's (TLYS -0.55%)\nQ3 2022 Earnings Call\nDec 01, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings. Welcome to the Tilly's, Inc. third quarter 2022 earnings results conference call. [Operator instructions] I'll now turn the conference over to your host, Gar Jackson.\n\nYou may begin.\n\nGar Jackson -- Founder and President, Global IR Group\n\nGood afternoon, and welcome to the Tilly's fiscal 2022 third quarter earnings call. Ed Thomas, president and CEO; and Michael Henry, CFO, will discuss the company's results and then host a Q&A session. For a copy of Tilly's earnings release, please visit the investor relations section of the company's website at tillys.com. From the same section, shortly after the conclusion of the call, you'll also be able to find a recorded replay of this call for the next 30 days.\n\nCertain forward-looking statements will be made during this call that reflect Tilly's judgment and analysis only as of today, December 1, 2022. And actual results may differ materially from current expectations based on various factors affecting Tilly's business. Accordingly, you should not place undue reliance on these forward-looking statements. For a more thorough discussion of the risks and uncertainties associated with any forward-looking statements, please see the disclaimer regarding forward-looking statements that is included in our fiscal 2022 third quarter earnings release, which is furnished to the SEC today on Form 8-K, as well as our other filings with the SEC referenced in that disclaimer.\n\nToday's call will be limited to one hour and will include a Q&A session after our prepared remarks. I will now turn the call over to Ed.\n\nEd Thomas -- President and Chief Executive Officer\n\nThanks, Gar. Good afternoon, everyone, and thank you for joining us today. Our third quarter sales performance was stronger than we anticipated throughout the quarter, resulting in both top-line and bottom-line results exceeding our outlook and analyst consensus estimates for the third quarter. As expected, we saw a deceleration in sales trends from month to month as we anniversary last year's early holiday shopping that was driven by supply chain concerns and other pandemic-related factors in the later stages of the quarter.\n\nNot surprisingly, as we lap those prior-year conditions amid this year's highly inflationary environment, all geographic markets comp double-digit negative, and most merchandising departments comp double-digit negative with the expectations -- exceptions of footwear, which was just slightly negative, and accessories, which was led by strength in backpacks but still decreased by a single-digit percentage overall. Also, not surprisingly, customer store traffic and conversion both declined by high single-digit percentages compared to last year's record results. Despite current economic challenges associated with the inflation, we continue to believe that Tilly's has meaningful future growth opportunities in many of our existing markets, particularly California, Texas, the North East, and Greater Chicago area. With very few exceptions, our new store openings over the past several years have met or exceeded our expectations, and we believe it is important for our long-term earnings potential to continue to grow our store base, along with our e-comm business.\n\nIn the third quarter, we opened five new stores. In the fourth quarter, we have opened two new stores so far, with two more will be opening in a few more days, bringing our total new store openings to 11 for the year. We anticipate closing two stores in mid-January, bringing our fiscal year-end store count to 249. For fiscal 2023, we have a preliminary expectation to open up to 15 stores, assuming we can negotiate what we believe to be appropriate lease economics relative to the retail environment.\n\nAt this time, two of those potential new stores have fully executed leases, and we are engaged in active negotiations on the remainder, in addition to new stores, we continue to invest in company infrastructure during fiscal 2023 to support our future growth plans. We plan to upgrade our warehouse management systems to create greater efficiencies in managing inventory between our stores, e-commerce, and our two distribution centers, as well as to improve distribution labor efficiency. We are also planning to upgrade our merchandise planning and allocation systems with the goals of improving inventory efficiency, and reducing the volume of inventory transfers. In total, including 15 new stores, we've preliminarily expect our total capital expenditures for fiscal 2023 not to exceed $25 million.\n\nTurning to the fourth quarter of fiscal 2022, we are off to a softer start than expected. Total comparable net sales through November 29th, including both physical stores and e-com, decreased by 18.5% versus the record comparable period of last year. But Thanksgiving weekend, Thursday through Cyber Monday, we saw an improved relative trend, with total comparable net sales decreasing 13.4% compared to last year and a high single-digit negative comp on Black Friday specifically. Assuming our fourth quarter sales exceed third quarter sales, as has been the case throughout our history, except for last year, we believe we have an opportunity to produce an improved comp sales trend for the fourth quarter relative to recent quarters, although still below last year due to the much more difficult economic conditions in play this year.\n\nWe will continue to manage our business prudently relative to the current environment, but remain focused on our longer-term goals of continued growth and improved operational performance. I'd now turn the call over to Mike to discuss our third quarter operating results and fourth quarter outlook in more detail. Mike?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nThanks, Ed. Our third quarter operating results compared to last year were as follows. Total net sales were $177.8 million compared to a company record of $206.1 million last year. Last year's results were fueled by unprecedented pandemic-related factors, along with supply chain concerns about the holiday season, which we believe pulled sales forward into the third quarter last year.\n\nTotal comparable net sales, including both physical stores and e-commerce, decreased by 14.9%. Total net sales from physical stores were $141.5 million compared to $165.3 million last year, with a comparable store net sales decrease of 15.8%. Net sales from physical stores represented 79.6% of our total net sales this year compared to 80.2% last year. E-commerce net sales were $36.3 million compared to $40.8 million last year.\n\nE-com net sales represented 20.4% of total net sales this year compared to 19.8% last year. We ended the third quarter with 247 total stores, a net increase of four stores since the end of last year's third quarter. For additional perspective, our total comparable net sales for the third quarter increased by 8.7% relative to the pre-pandemic third quarter of fiscal 2019. Gross profit, including buying, distribution, and occupancy expenses, was $54.6 million, or 30.7% of net sales, compared to a company record of $76.7 million or 37.2% of net sales last year.\n\nBuying, distribution, and occupancy costs deleveraged by 360 basis points collectively due to carrying these costs against a significantly lower level of net sales this year compared to last year. Product margins declined by 300 basis points this year, primarily due to an increase in more normalized markdown rate compared to last year when full-price selling was at record levels. For additional perspective, product margins were down less than 100 basis points compared to the pre-pandemic third quarter of fiscal 2019, primarily due to lower initial markups and a higher markdown rate. Total SG&A expenses were $48.3 million, or 27.1% of net sales, compared to $47.7 million, or 23.2% of net sales, last year.\n\nThe primary increases in SG&A compared to last year were $0.6 million from store payroll due to having four net additional stores, along with higher hourly wage rates and $0.5 million from corporate payroll due to wage inflation. Partially offsetting these increases were a $1.8 million reduction in bonus expense due to the lack of any bonus accrual this year and a $0.6 million reduction in marketing costs. Operating income was $6.3 million, or 3.6% of net sales, compared to a company record of $29 million, or 14.1% of net sales, last year. Other income was $0.7 million compared to zero last year, primarily due to earning higher rates of return on our marketable securities investments and the absence of any costs associated with our former ABL credit facility, which were included in last year's results.\n\nIncome tax expense was $1.8 million, or 26.3% of pre-tax income, compared to $8.2 million, or 28.1% of pre-tax income, last year. Net income was $5.1 million, or $0.17 per diluted share, compared to a company record of $20.8 million in net income and $0.66 per diluted share last year. Weighted average shares were 30 million this year compared to 31.4 million last year. Turning to our balance sheet, we ended the third quarter with total cash and marketable securities of $105.8 million and no debt outstanding.\n\nThis compared to $155.6 million and no debt outstanding last year. Since the end of last year's third quarter, we paid special cash dividends to stockholders of $30.9 million in December 2021 and repurchased 1,258,330 shares of our common stock for a total of $10.9 million during this year. We ended the third quarter with inventories per square foot, down 6.9% compared to last year, following being up 4.1% to last year at the end of the second quarter. Total year-to-date capital expenditures were $11.9 million this year compared to $10.9 million last year.\n\nWe expect our total capital expenditures for fiscal 2022 to be approximately $19 million at the end of the year. Turning to our outlook for the fourth quarter of fiscal 2022, we remind you that last year's fourth quarter was a historic anomaly for us with fourth quarter sales below third quarter sales for the first time ever due primarily to supply chain concerns and other pandemic-related factors, which we believe pulled some holiday season sales into the third quarter last year. While some level of similar customer behavior may have been repeated this year amid the current highly inflationary environment, at this time, we assume that our fourth quarter sales performance will revert to a more traditional cadence, such that it would be the largest sales quarter of the year. Based on our quarter-to-date net sales results through November 29, 2022, that Ed shared earlier, in our pre-pandemic historical sales build patterns, we currently anticipate our total net sales for the fourth quarter of fiscal 2022 to be in the range of approximately $183 million to $188 million, SG&A to be approximately $54 million to $55 million, pre-tax income to be in the range of approximately $0.8 million to $2.6 million, our estimated income tax rate to be approximately 27%, and earnings per diluted share to be in the range of $0.02 to $0.06 based on estimated weighted average delinquent shares of approximately 29.9 million.\n\nThis compares to a company fourth quarter record of $204.5 million in net sales and $0.38 in earnings per diluted share for the fourth quarter last year, and total net sales of $172.5 million and earnings per share of $0.21 in the pre-pandemic fourth quarter of fiscal 2019. Operator, we'll now go to our Q&A session.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Jeff Van Sinderen with B. Riley. Please proceed with your question.\n\nRichard Magnusen -- B. Riley Financial -- Analyst\n\nHello. This is Richard Magnusen in for Jeff Van Sinderen. Thank you for taking our call. Can you provide more insight into how you are planning incoming inventory for spring? And do you expect the inventory to be up or down on a square-foot basis at the end of the fourth quarter?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nHi, Richard. We expect inventory to be down on a per square foot basis, finishing the fourth quarter. As we think about next year as a whole, you know, one thing to keep in mind is obviously 2021 was crazy to the good side of things. All year long, we've been going up against that.\n\nAnd, you know, you see the comparisons in the in the negative double-digit comp that we've seen all year. The last month that we will have that is February. February 2022, we had a plus 15 comp. After that, every month after that will be going up against this year's negative double digits.\n\nSo, you know, there's some optimism there that assuming we can stay on trend with our merchandise assortment the way we consistently have. We think there's an opportunity for us to be able to turn around back into positive comps once we get into 2023 and past the month of February, in particular, which is a small month. But we're expecting to improve our business in 2023 and do better business in the spring than we did this year.\n\nRichard Magnusen -- B. Riley Financial -- Analyst\n\nAll right. That sounds good. And can you provide some detail on the different trends that you saw in Cyber Monday and Black Friday sales at e-com.\n\nEd Thomas -- President and Chief Executive Officer\n\nIt was pretty erratic. I think we were going up against a lot of our competitors, were much more aggressive promotionally than us. And we elected not, as we consistently do -- we have elected to not play the aggressive promotion campaign. It may have somewhat negatively impacted our demand, but, overall, it was close to what we expected.\n\nRichard Magnusen -- B. Riley Financial -- Analyst\n\nOK. And then, can you remind me, when are the compares get easier for e-com?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nWell, as I just mentioned on the -- as a total business, we're going to be going up against double-digit total business strength.\n\nEd Thomas -- President and Chief Executive Officer\n\nSpring.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nYeah. It'll start right after the month of February. We had similar directional performance between stores and e-com. I'm looking at a chart here.\n\nE-com was up single digits in February and then down double digits for the next four months in a row. Still negative in July, August, and then back to double digits September, October and November. So, similar in nature to how stores compare.\n\nRichard Magnusen -- B. Riley Financial -- Analyst\n\nOK. And then my last question is, what are you seeing in the brick and mortar this week, if you can speak to that?\n\nEd Thomas -- President and Chief Executive Officer\n\nI wouldn't call it particularly strong. So, it's not --\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nNo, I'd say --\n\nEd Thomas -- President and Chief Executive Officer\n\nIt's --\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nYou know, in the past, we usually go through Black Friday weekend, and then there's a little bit of a lull --\n\nRichard Magnusen -- B. Riley Financial -- Analyst\n\nYeah.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nAfter everyone, you know, kind of goes through Black Friday promotions and all the buzz of that and Cyber Monday and those kinds of things. You tend to go through a lull, and we're experiencing that. We do think that the overall patterns for holiday shopping will be later this year than they were last year. We also think that's part of why our fourth quarter start was weaker than anticipated.\n\nBecause remember, we talked about the fact that we thought some early holiday shopping pulled into October. Well, it also pulled into early November because of all the supply chain concerns last year. So, I do think we are anniversarying, you know, lapping some of that early holiday shopping patterns of last year because of the supply chain concerns. Come to this year, everyone's got more inventory than they need and has pretty much all year long really promotional environment.\n\nWe do think that we'll see the holiday season come into being. It'll just be a later flow than it was last year. And we have contemplated that, and we've thought about our outlook.\n\nEd Thomas -- President and Chief Executive Officer\n\nJust to add to that toe is we're going into the next few weeks. The quality of our inventory, both in terms of quantity and the mix, it's really in great shape. So, we're positioned -- we feel like we're well positioned to do the business if it's there.\n\nRichard Magnusen -- B. Riley Financial -- Analyst\n\nOK. That's good. Well, thank you. I'll get back in the queue.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nThanks, Richard.\n\nOperator\n\nOur next question comes from the line of Mitch Kummetz with Seaport Research. Please proceed with your question.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nYeah, thanks for taking my questions. Starting with the Q4 today, I think, Mike, in the press release, it's down 18.5. Do you know what that is on a sales basis? And then, also, do you happen to know what both comp and sales are for that period versus three years ago?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nI don't. All I have is what we just reported as the comp number. I don't -- we have a closed fiscal November. We're in the process of closing fiscal November.\n\nSo, I don't have all-in sales numbers to report at this early date.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. And then, you referenced the pull-forward last year because of supply chain and some COVID. Can you remind us how -- so, I think last year you guys did like a 12.5 comp, if I have that correct. Can you remind us kind of how that flowed through the fourth quarter and maybe on a monthly basis just so we have a better sense of the compare?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nYeah. So, last, last year, '21 versus '20, November was the strongest month in terms of comp at a plus 21. Then December was about half at it, 10.5. And then January was a plus four.\n\nSo, it gets easier as the quarter goes in terms of those comparisons, which is another reason why, you know, despite how slowly November started, we -- you look at all the historical relationships of how we just finished Q3, how we finished Q3 relative to 2019. It just -- it all points that if history means anything at all, you know, we have to be somewhere in the 180 million range for the fourth quarter. We just reported 178 for the third quarter. If fourth quarter is larger than third in any way, shape, or form, the way, it traditionally was other than last year.\n\nYou know, you're in the 180. So, it seems to make sense. Again, if history proves to be accurate at all, if something else happens, there's no way I can predict it. I have to believe, despite our slow start in November, that the holiday season will come and that some sense of a normal cadence of Q3 to Q4 will take place, coupled with the fact we did just do nearly a plus nine comp to 2019 in the third quarter.\n\nYou know, some level of positive comp in the fourth quarter relative to 2019 also get you in that one area. When you contemplate, we have nine additional stores than we did then. So, it seems to line up despite the soft start. Those other metrics seem to point you to a place that says, you know, the business will come it's just later than what it was last year.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nYeah. And do you have a sense as to how much of the quarter is in the books through November 29th? I imagine the vast majority is still in front of you.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nIt is. The largest weeks are, you know, right around Christmas, as you would expect. Thanksgiving week is one of the largest weeks. But that last full weekend before Christmas, that last full week before Christmas, those are the hugest weeks of the quarter.\n\nThose two. And then, usually the first week right after Christmas is pretty, pretty big before. Then for the rest of January, the weeks get really small. So --\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nYeah.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nThe great majority of the quarter will be in once December is done.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. And then lastly, Ed, you know, there's been a lot of talk on other retail earnings calls about how challenging the apparel environment is in particular. Can you just elaborate on what you guys are saying?\n\nEd Thomas -- President and Chief Executive Officer\n\nYeah. You know, the apparel environment has been challenging. Honestly, I think part of it's because there's no dominant trend, particularly in our -- catered to our age group. And for us, what we've seen is one of our best performing categories is long bottoms, so that's been good.\n\nSo, I'm not saying denim, other long bottoms.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nMmm hmm.\n\nEd Thomas -- President and Chief Executive Officer\n\nBut the other typical categories that are really strongest have slowed down. And I think part of it is economic, and part of it is lack of really dominant trend.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. That's helpful. Thanks, and good luck for holiday.\n\nEd Thomas -- President and Chief Executive Officer\n\nThank you.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nThanks, Mitch.\n\nOperator\n\nOur next question comes from the line of Matt Koranda with ROTH Capital. Please proceed with your question.\n\nUnknown speaker\n\nHey, guys. This is Ray on for Matt.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nHey, Ray.\n\nUnknown speaker\n\nM questions were -- most of my questions were already asked. But maybe if you guys can talk a little bit about how Black Friday and Cyber Monday, I guess, how much of that -- sorry, OK, let's -- maybe in like Q4, how much of the revenue actually come from Black Friday and Cyber Monday, and kind of like understanding that last year was a little bit out of the norm?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nI don't have any data points on Black Friday as a piece of the quarter. I mean, it's in the top five sales volume weeks of the quarter, top four. But, you know, the real bulk of the business comes around Christmas typically. And again, because of the difference of last year to this year, it's going to come later.\n\nThere is an extra day of shopping before Christmas Day later this year. So, there's still a lot of business to be done yet. We did see during the Black Friday weekend, as we referenced, you know, the month as a whole was down 18. We were down worse than that in the first three weeks of November.\n\nAnd then, Black Friday weekend was down about 13. And Black Friday itself was only down nine. So, during that particular peak weekend, we saw a meaningful improvement in the trend of our business. And given that we are expecting a later flow of the holiday shopping versus what it was last year, you know, we'd expect to see, you know, similar sorts of behaviors during those key peak weeks in the mid to latter part of December, in particular.\n\nUnknown speaker\n\nOK. Thank you. That was helpful. Yeah, I think most of my questions were answered, so I'm going to hop back in the queue.\n\nThanks.\n\nEd Thomas -- President and Chief Executive Officer\n\nThank you.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nThank you, Ray.\n\nOperator\n\n[Operator instructions] And it looks like we have reached the end of the question-and-answer session. I'll now turn the call back over to Michael Henry for closing remarks.\n\nEd Thomas -- President and Chief Executive Officer\n\nHi. Unfortunately, it's Ed. But thank you for joining us on the call today. We look forward to sharing our fourth quarter results with you in mid-March 2023.\n\nHave a good evening.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nThanks, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGar Jackson -- Founder and President, Global IR Group\n\nEd Thomas -- President and Chief Executive Officer\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nRichard Magnusen -- B. Riley Financial -- Analyst\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nUnknown speaker\n\nMore TLYS analysis\n\nAll earnings call transcripts"
}