{
  "companyName": "Citi Trends",
  "companyTicker": "CTRN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/29/citi-trends-ctrn-q3-2022-earnings-call-transcript/",
  "content": "Citi Trends (CTRN -2.07%)\nQ3 2022 Earnings Call\nNov 29, 2022, 9:00 a.m. ET\n\nOperator\n\nGreetings and welcome to the Citi Trends 3Q 2022 earnings conference call. [Operator instructions] Afterwards, we'll conduct a question-and-answer session. [Operator instructions] As a reminder, this conference is being recorded, Tuesday, November 29, 2022. I would now like to turn the conference over to Nitza McKee, senior associate.\n\nPlease go ahead.\n\nNitza McKee -- Senior Associate\n\nThanks, Mallika, and good morning, everyone. Thank you for joining us on Citi Trends third quarter 2022 earnings call. On our call today is our chief executive officer, David Makuen; and chief financial officer, Heather Plutino. Our earnings release was sent out this morning at 6:45 a.m.\n\nEastern Time. If you have not received a copy of the release, it's available on the company's website under the investor relations section at www.cititrends.com. You should be aware that prepared remarks today made during this call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Management may make additional forward-looking statements in response to your questions.\n\nThese statements do not guarantee future performance. Therefore, you should not place undue reliance on these statements. We refer to you to the company's most recent form -- recent report on Form 10-K and other subsequent filings with the Securities and Exchange Commission for a more detailed discussion of the factors that can cause actual results to differ materially from those described in the forward-looking statements. I will now turn the call over to our chief executive officer, David Makuen.\n\nDavid.\n\nDavid Makuen -- Chief Executive Officer\n\nThank you, Nitza. Good morning, everyone, and thanks for joining us today on our third quarter fiscal 2022 earnings call. I will begin the call with a review of our third quarter results, as well as some fourth-quarter-to-date insights. Heather Plutino, our chief financial officer, will then elaborate on our financial results and a few other items related to the rest-of-our-year outlook.\n\nThen we'll open the call up for your questions. To begin, we delivered 192 million in top-line sales, which equates to a three-year comp stack of 1.4%, both of which were in line with our expectations. Our buy, move, and sell teams work tirelessly to deliver compelling, value-driven trends, coupled with an engaging in-store experience to post a 39.8% gross profit, our 10th consecutive quarter of expanding gross profit when compared to pre-pandemic 2019 levels. Additionally, we continue to manage inventories tightly with a high freshness factor.\n\nTotal inventory at the end of the quarter was only 1% higher than 2021, an improvement from 26% higher at the end of the second quarter. Lastly, I'm pleased to share that we delivered a positive operating income of 2.4 million. I want to spend a few minutes on how we got here. It all starts with people and our team's ability to be both scrappy and strategic within a challenging macroeconomic backdrop.\n\nOur mantra is to remain laser-focused on controlling what we can control, from front of the house to the back of the house. At the end of the second quarter, we committed to lowering our expense structure while shoring up our foundational infrastructure and, most importantly, offering an exciting, curated assortment that will never break the bank for our customers. We are right on track on the expense savings front, and Heather will provide more detail. What I will focus on is how we are driving the top line in margin.\n\nMore specifically, we focused on four key areas to ensure we met expectations in the third quarter while preparing for a successful fourth quarter holiday season. They were, number one, we shipped record amounts of pack-away inventory, chock-full of incredible values to excite our customers. Number two, we continue to roll out new zip codes in our product cities, including Q merchandise, missy size ranges, and tween girls offerings. Number three, we infused hot price points in key categories to capture market share from value shoppers.\n\nAnd number four, we successfully lap last year's macro supply chain issues to deliver an on-time gift assortment for a strong start to the fourth quarter. It's important to recognize that the inflationary backdrop our core customers are facing is truly unprecedented, particularly in the areas of rent, food, utilities, and transportation. Our core customer, with an annual household income of about $40,000; and 50% of our customer base having an annual household income of 25,000 and below have been hardest hit from these extreme macro pressures. Having said that, the Citi Trends customer is doing an admirable job adjusting his and her shopping patterns.\n\nWhat we saw in the third quarter is that our customers shopping much closer to need, employing a buy now, wear now strategy for important events and end-use needs in their lives like back to school, which I'm pleased to report was a solid performance for Citi Trends this year. Throughout the third quarter, our traffic and conversion rates remained steady and strong and our average dollar basket size continues to hold up very well against last year's results. Through it all, I can assure you, and consistent with my points in the past, that Citi Trends customer relies on our presence in the heart of neighborhoods. We are the primary destination for their family apparel, accessories, home and essential needs.\n\nBefore I turn the call over to Heather, I want to highlight a few remainder-of-the-year points. First, we are set up really nicely for the remainder of fourth quarter. We generally excel during need-based events. We are confident that our families will gift big and spend less at Citi Trends this year.\n\nAs we exit a strong Black Friday week, our stores are full of great values across gifts, stocking stuffers, and wonderful self-purchase outfits. Next, we are reiterating our second half guidance provided at the end of the second quarter. And lastly, it's no secret that the marketplace is ripe for procurement of high-quality, high-value goods. Our flexible and agile operating model, combined with our strong balance sheet, allows us to be quite active for spring and fall of 2023.\n\nWith that, I'll turn it over to Heather. She'll discuss our third quarter results in detail, as well as our outlook for the second half of the year. Heather.\n\nHeather Plutino -- Chief Financial Officer\n\nThanks, David, and good morning, everyone. As David mentioned, our third quarter results were in line with our expectations despite the challenging macro backdrop and the significant inflationary headwinds our customers are facing. We managed the business prudently, and our teams continue to execute against our transformation strategy, delivering strong growth margins and a reduction in SG&A dollars for the quarter. We ended the quarter with a strong balance sheet, including 77.8 million of cash, well-controlled inventory, and our $75 million revolving line of credit remained unused.\n\nWe also completed the sale-leaseback transaction on our Roland, Oklahoma distribution center for 36 million in proceeds. The strength of our balance sheet positions us well to continue to navigate the current environment while focusing on our strategic initiatives. Now, let's turn to specifics of our Q3 financial results. As mentioned in our earnings release, we are comparing select operating results for the third quarter and 39 weeks of 2022 relative to the same period in 2019 in order to provide a more normalized comparison of performance.\n\nTotal sales for the third quarter were 192.3 million, a decrease of 15.6% versus Q3 2021 or an increase of 5.1% versus Q3 2019. Comparable sales decreased 18.3% compared to Q3 2021, lapping a 19.7% increase in Q3 2021 versus Q3 2019, representing a three-year stack of 1.4%. Comparable store transactions versus prior year sequentially improved 760 basis points from Q2 to Q3, an improvement of 1,270 basis points from Q1. Gross margin was 39.8%, versus 40.3% in Q3 2021 and 37.4% in Q3 2019.\n\nOur strong gross margin results are reflective of our disciplined inventory management and product assortments that continue to strongly resonate with our customers. While SG&A expense dollars declined 7.6% versus Q3 2021, we experienced SG&A expense deleverage of 310 basis points versus Q3 2021 to a rate of 35.9% of total sales. We announced last quarter that we are streamlining our organization and are aligning SG&A expenses to our sales expectations as a result of the difficult macro backdrop. In the third quarter, we made terrific progress rightsizing our expense structure and driving operating efficiencies across our business.\n\nAs a result, we remain on track to deliver approximately 10 million in expense savings for the second half of 2022, or about 7% of total SG&A expense. We will continue to manage expenses with a heightened focus on building further operating efficiencies across the organization. Operating income was 31.6 million in the quarter, or 2.4 million as adjusted for the gain on the sale of our distribution center, compared to operating loss of 1.6 million in Q3 2019. Third quarter adjusted EBITDA was 7.5 million, compared to 2.9 million in Q3 2019.\n\nGAAP net income was 24.6 million in Q3 2022, compared to net loss of 1.1 million in Q3 2019. Earnings per diluted share was $3.02, or $0.24 as adjusted, versus diluted loss per share of $0.09 in Q3 2019. Turning to our 39-week results. For the fourth -- for the first nine months of 2022, sales were 585.6 million, a decrease of 22% to prior year and a 2.6% increase to 2019.\n\nComparable store sales declined by 24.5% versus 2021, on top of a 26.9% increase in 2021 sales versus 2019, a three-year stack of 2.4%. Gross margin was 39%, versus 41.3% in 2021 and 37.4% in 2019. EBITDA in the 39-week period adjusted for the gain on sale of our two distribution centers was 19.6 million, versus 82.2 million in 2021 and versus 22.6 million in 2019 as adjusted. Year to date, earnings per diluted share was $6.34, or $0.35 as adjusted for the two sale-leaseback transactions, compared to $5.71 in the first nine months of 2021 and compared to $0.60 in 2019, $0.67 as adjusted.\n\nNow, turning to our balance sheet. As David mentioned, total inventory at quarter-end increased only 1.3% to Q3 2021, versus an increase of 25.5% at the end of the second quarter. Compared to Q3 2019, total inventory decreased 5.1%, while sales increased 5.1%. Average in-store dollar inventory was down 19% compared to 2019, with units down 29%, reflecting our focus on turning goods fast and offering our customers fresh merchandise each and every time she shops.\n\nOur pack-away goods decreased almost 40% from Q1, as planned, as we released these exciting products to support fall and holiday sales. We continue to leverage this important merchandising strategy, packing away near to current season goods that represent a tremendous value for our customers while supporting our high gross margin rates. We are comfortable with our level of inventory and are super proud of our team for their continued commitment to agile, disciplined inventory management. Turning to our fleet.\n\nDuring the quarter, we opened two new stores, closed four locations, and remodeled three. Year to date, we've added 12 new stores, closed six stores, and remodeled 35 locations. As it relates to our buyback program, year to date, we repurchased approximately 331,000 shares at an aggregate cost of $10 million, leaving approximately $50 million remaining on our program. Capital allocation remains a primary focus of our board of directors.\n\nAnd in light of the dynamic macroenvironment, we are carefully evaluating our cash and investments to ensure we maintain adequate liquidity. Now, turning to guidance. We are reiterating our second half 2022 guidance provided with our second quarter earnings. That guidance, including the impact of the sale-leaseback of the Roland distribution center, included low single-digit increase in second half total sales compared with first half total sales, gross margin in the high-30s to low-40s range for the second half, less SG&A deleverage versus prior year in the second half compared to the first half due to aggressive expense reductions net of incremental lease expense from the sale-leaseback transaction, second half operating income approximately in line with results from the second half of 2019, and year-end cash balance of approximately $85 million to $100 million.\n\nIn summary, we are pleased with our third quarter results in light of the difficult inflationary environment. While we expect these challenges to continue, our teams are focused on managing inventory and expenses while continuing to execute against our transformation. Combined with our growth strategies, this gives us confidence in our ability to continue to delight our customers, especially during the upcoming holiday season. With that, I will turn the call back to David for closing comments.\n\nDavid.\n\nDavid Makuen -- Chief Executive Officer\n\nThanks, Heather. With three quarters of 2022 on the books and with plenty of data patterns to study, we have work to do to be better. Most of our insights center on reacting faster to trends and keeping pace with our fashionable customer base. They really do live our purpose of live bold, live proud, respect all on the daily.\n\nWe've got to source faster, ship faster, and react faster. The great thing is nothing structural is in the way. Our foundation is strong and our start-up mindset is in full gear. I'm committing to you that our amazing people are becoming excellent operators so that we can dial into our customer's needs better than we do today.\n\nReimagined processes, revved-up leadership, and important new technology and infrastructure solutions will drive our momentum on top of a solid foundation. As we think about what's next, it's important to note that based on many external data sources, discretionary retail will likely be affected by inflationary pressures into a portion of 2023. Let me assure you, this will not slow us down from making continuous improvements to our operating model. You've seen us play offense, you've seen us course correct when needed, and you've seen us involved the Citi Trends brand to be as relevant as can be.\n\nI will highlight what we'll spend our full days and probably some nights on. Number one, driving comp sales and margin. Continuing to broaden the appeal of Citi Trends to new multicultural lower-income households in search of trend-right apparel, home, and accessories at prices that don't break the bank. Number two, upgrading our fleet.\n\nContinue to upgrade our customer experience via our CTx remodel program, with 42 remodels to date, and combined with new stores to date within the CTx format, 78 stores, or 13% of the fleet in the CTx format, with many more to come. Number three, maximizing our tech and DC investments, leveraging our recent DC upgrades, along with our upcoming new ERP system that will be a game changer for our buy team. Number four, actively managing our balance sheet. Long a strength of Citi Trends, Heather is focused on applying fresh and innovative thinking to managing operating expenses, working capital, and cash usage.\n\nAnd finally, number five, expanding our CITIcares program, our platform for both CSR and ESG. Some exciting things are afoot here when it comes to giving back and focusing on our CSR initiatives, which we'll share in early 2023. And of course, we'll conduct our third annual Black History Makers event during February. As we speak, we are knee-deep in 2023 planning.\n\nI got to say, we are pretty excited about what's on the horizon. The off-price value space is ripe for evolution. As we improve our execution and take advantage of new long overdue tools, we are optimistic about delivering better efficiencies and productivity throughout many areas of the business. As always, I want to thank the entire Citi Trends team, all the people that are the face of our brand, creators of our culture, and drivers of our customer engagement.\n\nTheir hard work and endless efforts in making a difference in the neighborhoods we serve never goes unnoticed. Their passion to live our purpose is shining bright and will carry us into the future. We are now ready to take your questions. Mallika, over to you.\n\nOperator\n\nThank you. [Operator instructions] Our first phone question is from the line of Jeremy Hamblin with Craig-Hallum. Please go ahead. Your line is open.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nThanks, and nice job in a tough environment. I wanted to see if I could get into the kind of the cadence of sales trends that you're seeing in terms of maybe using 2019 as the best baseline but to get a sense for, you know, how things flowed August, September, October. And here, you know, as we get started in Q4, it sounds like you're encouraged by what you saw over kind of the past week, but wanted to see if you might be able to provide a little bit more detail around the cadence of sales trends.\n\nDavid Makuen -- Chief Executive Officer\n\nSure. Hi, Jeremy. Thanks for joining us today. Good question.\n\nI'll take the first portion of that and Heather can enhance, if needed. But at a high level, couple of things. We had our first really normal back to school since '19, and that proved to be a really strong selling period for us. That started kicking in at the end of July and kind of peaked during the main weeks of August and a little bit in September.\n\nSo, we were very pleased with the performance of that time period, of course, driven by outsized performance in our kids business, and that was driven by some excellent pack-away goods. All that panned out like we thought. As we careened into the rest of the quarter, we had some puts and takes based mainly on weather, but overall, our traffic conversion and sales flow was relatively consistent throughout the rest of September and October. The only thing that we really saw was affected was the warm weather trends in late October into early November clipped some of our basket because she and he bought less higher priced outerwear and heavier-weighted clothing that tends to have a higher resale.\n\nIt wasn't for that, we would have been better than we thought, honestly, on that front. So, overall, nothing to be concerned about. The warm weather was certainly a slower, if you will, but we bounced back right away when the cold snap came in November Week 2, and we've been strong ever since.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nGreat, helpful color. And then in terms of just the environment that we're seeing out there or that you're seeing, you know, clearly, there has been a lot of shift in focus toward value messaging, which is a sweet spot for Citi Trends. You know, not everybody -- you did a remarkable job of managing your inventory levels, but not everybody and every apparel retailer has done quite as good of job. I wanted to get a sense for, you know, what you're seeing in terms of, you know, either the promotional environment, the markdown environment that you are seeing in Q4 as it relates to Q3 in your competitive set.\n\nHeather Plutino -- Chief Financial Officer\n\nHey, Jeremy, it's Heather. Thanks for the question. Really appreciate it. And thanks also for the comment about inventory.\n\nWe are -- we're really proud of the team and the way that they managed inventory throughout the quarter and that they will continue to manage inventory in Q4. It's a real focus, and it's really paying off, as you saw with our strong gross margin rate. There's no doubt that the fourth quarter is always a highly promotional season. So, that won't change.\n\nThat won't shock you. What I will remind you, though, is that we serve an underserved customer in their community. So, our strategy of being in their neighborhood and being everyday low price, you know, we're not high low, we're not promotional. We don't need to be because we are value all day long, and our customer knows that and trust us for it.\n\nSo, we're feeling good about the way we're positioned for the holiday season because of that, plus the fact that we've got amazing products ready to go to really fuel their holiday needs. And our price points are, to quote David Makuen, hot. And the assortment is really, really great. So, we're feeling really good about the way we're set up for the holiday season.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nI like that. I just want to clarify. Maybe if I put it in more context of, you know, the -- is the environment more promotional in Q4 relative to a normal Q4 as compared to the traditional promotional environment in Q3 relative to a normal Q3? I'm just trying to get a sense for, you know, whether versus historical context has gotten -- you know, if it's unchanged, if it's a little bit more promotional or a little less promotional than what you're seeing out there.\n\nDavid Makuen -- Chief Executive Officer\n\nYeah. Jeremy, I'll take that one. I think within our brand positioning and where we're located, we're not seeing that big a difference, quite frankly, in the promotional environment. It appears to be relatively consistent, again, within the neighborhoods that we played in.\n\nI think if we broaden the lens a little bit and go out to the outer rings, call it the mall ring and the A and B centers that are kind of a little bit away from our neighborhood, you know, we're seeing, I would say, a heightened sense of promotional activity. But again, what I've learned over the course of many years is Q4 tends to be promotional no matter what year, no matter what backdrop you're in. Black Friday sales have always started earlier for the last few years, Cyber Monday, etc. And then, you know, you get into the last 15 days, Super Saturday and so on, a little later Christmas.\n\nYeah, it's going to be promotional. But again, for us, we tend to find ourselves more insulated from that activity because where we sit in the neighborhood and given our primary destination nature to our customers, we don't feel it as much. So, I think we're -- you know, we're watching it, we're looking at it, but it doesn't really change our behavior all that much. What we've got to stay focused on is just making sure that the right gifts and stocking stuffers are in-stock at the hot price points that we planned months ago to be in our stores.\n\nAnd that's all unfolding nicely for us as we speak.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nGot it. Last one for me, and I'll hop out. But just in terms of, you know, store hours for Q4, typically, you'd need a little bit more staffing and sometimes you have a little bit of extended hours. You did less of that, you know, maybe, you know, in some years.\n\nBut I wanted to just get a sense for, you know, with the addition of the rent expense, you know, from the DCs into your SG&A, you know, is it fair to assume that your Q4 SG&A, even despite the expense management and the savings that you're going to realize, is a little bit higher than what you saw in Q3 on an absolute basis? Is that a fair assumption?\n\nHeather Plutino -- Chief Financial Officer\n\nIt's a fair assumption, Jeremy. I mean, we've got -- Q4 is typically a higher sales month than Q3. And you're right, there's extended hours to support that. There's a lot of product flow to support the sales.\n\nSo, yes, on an absolute dollar basis, but we lever better in Q4 than in Q3 as well.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nGot it. Thanks so much for the color. Best wishes.\n\nDavid Makuen -- Chief Executive Officer\n\nThanks, Jeremy.\n\nOperator\n\nThank you. Our next question is from the line of Chuck Grom with Gordon Haskett. Please go ahead. Your line is now open.\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nHey, guys. Good morning. Nice quarter. Question for you, Heather, just to follow up on Jeremy's question on implied fourth quarter guide, it looks like it packs into around roughly a 4% or so operating margin, which would be a -- would be below what you guys posted in the fourth quarter of 2019.\n\nSo, I'm curious what the pressure points would be. In the third quarter, you guys are showing nice improvement relative to the third quarter of '19. So, maybe just dive into the expectations for the fourth quarter and I guess why relative to '19, you expect the compression to occur.\n\nHeather Plutino -- Chief Financial Officer\n\nYeah. So, just a friendly reminder that our guide is for the fall season, right? So, just want to make that point. Versus 2019, there are a couple of pressure points that we just want to keep in mind. One is we think about the freight environment.\n\n2019, we're told by our external sources is levels of freight rates that we might not see any time in the near future. Even though we're starting to see some relief there, that compare will always be tough for Q4 versus 2019. The other, on the SG&A front, of course, we're carrying the lease expense from the two sale-leaseback transactions versus 2019. And so, we'll have a -- we'll -- that'll make for a harder compare as well.\n\nAnd then within SG&A -- continuing within SG&A, merit increases from 2019 to 2022 in stores, DCs. You know, we're not immune to that. Want to make sure we keep our people, keep them happy. So, those compares are what I would ask you to keep in mind.\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nThanks. And just to follow up on that, can you just remind us of the impact to the fourth quarter and I guess maybe on an annual basis, the impact the rent expense from the two sale-leasebacks that you did this year?\n\nHeather Plutino -- Chief Financial Officer\n\nYeah, for sure. I will tell you, in the third quarter, it was $1.6 million. So, use that as a proxy for fourth quarter. 2.8 million on a year-to-date basis through the third quarter.\n\nAnd then on an annualized basis, think 7.6 million for the two.\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nOK, great. Thank you very much. And then, David, when you take a step back, you know, 2021, your sales per square foot, you know, is close to 150. This year, you know, back to 120, which was, you know, pretty consistent with 2019 and 2020 levels.\n\nWhen you look out over the next couple of years, can you share with us your thoughts on where you think you can grow that productivity? And then also, you know, force rank the initiatives that you have laid out for us in terms of CTx, the new ERP system, Q lines, some of the assortment upgrades to women's and missy's, just, you know, what has you most excited and where do you think you can grow that productivity level over the next couple of years? Thanks.\n\nDavid Makuen -- Chief Executive Officer\n\nThanks, Chuck. Appreciate the [Inaudible] words and happy to answer this question. Yeah, I think, look, as we look over the next few years, there's no doubt that we have a number of initiatives that we intend to use to fuel productivity gains and obviously overall top-line gains while continuing to expand our gross margins. From a kind of top-line sales point of view, which I'll sort of win on, the opportunity to grow productivity, we think, is very, very bright and possible based on some serious initiatives that heretofore really haven't been part of our mix.\n\nAnd so, as you asked, we'll sort of force rank them. The first and foremost is product, and it's what you hit on, it's the adding of key options to our guys and women and kids that we haven't had prior. And so, I probably put it in kind of one lump bucket, which is enhancing our juniors business, that anchored really by offering missy sizing. From the men's standpoint, we're beginning to see incredible traction in appealing to a more multicultural guy where we were really zeroed in on the African American guy, we're now zeroing on the Latinx and African American guy, and we're seeing some excellent traction there.\n\nSo, that will grow sales per square foot in the guys' business and then obviously contribute to the box. And then on the kids front, I think where we have the biggest opportunity is growing our girls business and specifically appealing to the tween girl, which is kind of in between the younger girl and first entry into a junior size range. And we've been testing that throughout 2023 with, excuse me, 2022 with some great results, you know, in a limited number of stores. But like you've seen us do in the past two years, we'll scale that pretty quickly across '23 and '24.\n\nSo, product, product, product for sure. The second thing would be the systems. There's no doubt that the systems, the new ERP system that you picked up on, really is a game changer for us. It will give a new toolset to our buy team, in particular, so that they can plan and allocate smarter based on climate, based on trend, based on replenishment needs or not, and so forth and so on.\n\nAnd so, we really don't have those sophisticated tools that many other retailers have had for years. And so, we're looking very much for that. So, that's number two, and it kind of sits in concert with the product initiative, as you can imagine, because we want to put all those product initiatives in the right stores and so on. And then third would be the remodel program.\n\nThird only because the product and the system will drive us to a higher level of sophistication, and then the CTx should really kick into gear even better than they are today because we'll be even smarter when it comes to nurturing those CTx remodels in the future. So, that's a little bit of a force rank. I think I'd add one more thing, which would be our ability to utilize data, in general, across the business and just get smarter across all our functions. And so, part of our ERP rollout is a new data center of excellence, and that'll be used by all functions in the business, which will make us more efficient and productive in our DCs and across our stores from a labor and other standpoint in store.\n\nSo, much to come, but that's a little overview for you. And I think that will all contribute to productivity.\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nYou know, it's a great answer. And just one more to follow up, and this might be a little premature, but when you think about the number of stores you could add in 2023 and the number of remodels, is there any metrics you can share with us at this point in time, or you want to wait until January just because, you know, 13% of the fleet in that nice new CTx format, you know, could be a big driver for you guys next year?\n\nDavid Makuen -- Chief Executive Officer\n\nYeah. No, I'm glad to hear your view on that. A little premature for us to share any specifics. Like I mentioned in the call, we're knee-deep in planning, but I can assure you that all of what I ranked and then some are in kind of our sights to plan against and to develop a point of view for '23 that we'll share early next year.\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nGreat. Thanks, and congrats.\n\nDavid Makuen -- Chief Executive Officer\n\nThanks, Chuck. Take care.\n\nOperator\n\nThank you. Our next question is from the line of Dana Telsey with Telsey Advisory Group. Please go ahead. Your line is open now.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi. Good morning, everyone. The gross margin and the inventory levels definitely came in better than expected. Can you unpack the puts and takes of the gross margin and how you're thinking about inventory levels going forward? And then when you think of your core customer base, David, anything that you're noticing different regionally or share gains that you may be making given the trade down? Thank you.\n\nDavid Makuen -- Chief Executive Officer\n\nHi, Dana. Thanks for calling in.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi.\n\nDavid Makuen -- Chief Executive Officer\n\nSure thing. We'll take these. I'll actually start with the customers, and I'll turn it over to Heather for inventory and gross margin. But from a customer standpoint, we are pleased with the patterns we're seeing.\n\nAnd one of the biggest patterns that's exciting us is we're attracting kind of more of that higher end of our income range. So, keeping in mind our average income is about 40K, we are seeing folks more than we normally see above that number, you know, kind of up to that 50K, 55K range. And so, we're seeing some nice new customer capture there, and they're responding to the portion of our mix that is the higher retail. So, even though they're coming to us for what we're known for, meaning everyday values, great trend-right products, they're scooping up some of the higher retails, which is just really incredible to see.\n\nAnd remember, our higher retails are generally associated with better quality and improved features and benefits on the garment or accessories. So, that's really great to see. And then on the sort of other end of the spectrum, while we certainly see the pressure on the 25K and below households, we are seeing, as I mentioned, a really interesting adjustment by those households. We've done a couple of informal focus groups across our fleet.\n\nAnd what we're hearing is they're doing their best to adjust to mainly a rent landscape that's quite different than in the past. Food, with the assistance that they often get, is manageable. And then gas, as you know, is getting a little better. So, if you put that all in a blender, they're adjusting better than we thought.\n\nAnd it's our job to make sure our assortment on the other end of the AUR spectrum, the extreme value price points, think 9.99 and below, it's our job to make sure we offer those on a consistent, everyday basis, replenish them and keep them fresh and new. And that's exactly what the team is doing. So, we've learned a lot across Q3. Back to school was a terrific learning opportunity because we saw higher velocities, and we were able to try a lot of new things this past back to school that are definitely bearing fruit, many of which continue on through the end of the year and into '23, meaning they just weren't back-to-school product.\n\nSo, that's all good on the customer front. I'll turn it over to Heather for the inventory and margin data that we're certainly very pleased with.\n\nHeather Plutino -- Chief Financial Officer\n\nYeah. Good morning, Dana. Thanks for the questions. Appreciate it.\n\nLet me start with margin. I'm really proud of where our margin came in for the quarter at 39.8%. I would say the strength is really across the components, right? There's IMU expansion. Our team is very focused on that.\n\nWe had lower markdowns on inventory discipline. And then we're continuing to focus on managing our freight expense as well. So, really across the board, good news from a margin perspective. I'll tie into between margin and inventory.\n\nObviously, the two are very intertwined. I'm going to talk about our pack-away strategy, right? I mean, we spoke about this last quarter. We put some really -- the way I describe it, we put some really great product in the rafters in the beginning part of the fiscal year -- tail end of the last fiscal year. And we're excited to move those goods to the stores.\n\nIt's exciting product that is really intriguing to our customers, and the margins are really good. So, it's a strategic investment that's working, and we're seeing it play out both in the margin and in our inventory levels, right? So, the team has been very, very focused on managing inventory to make sure that we aren't going back to what I understand have been 2019, you know, kind of the old retail, if I could, maybe pilot high, let it fly approach, we're not doing that. And we can point to our average in-store dollar inventory, down 19% to 2019, with units down 29%. So, we're really working on making sure that the velocity is right on the products that we bring into the stores, that the margin is right, and that it's exciting, compelling product for our very important customers.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nHeather Plutino -- Chief Financial Officer\n\nThanks, Dana.\n\nDavid Makuen -- Chief Executive Officer\n\nThanks, Dana.\n\nOperator\n\nThank you. Next question is from the line of John Lawrence with Benchmark. Please go ahead. Your line is open now.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nYes. Thanks. Congrats, David, in the quarter, and Heather. David, would you talk just a little bit about -- I mean, the 13% of the fleet that we've talked about, the CTx.\n\nCan you give any sense of still providing that lift? You've talked about mid-single digits or something like that in terms of productivity of those new units.\n\nDavid Makuen -- Chief Executive Officer\n\nHey, John, Thanks for calling in. Yeah, yeah. Simple answer. We're still seeing some healthy lifts in our CTx remodeled stores.\n\nWe've said that, you know, single-digit lifts -- mid-to-high single-digit lifts. And we're learning a lot from them, and we're getting better and better at operating them as we look forward to doing many more in our future. And now, we have a lot across a lot of geographies. So, we're seeing a nice consistent performance across the southeast, southwest, northeast, Midwest.\n\nSo, it's good to see. We're excited about it.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nYeah. Just to go one step further there. As you put out and look for those locations, are you seeing anything in this environment, real estate-wise, across the country that would change or make it easier or facilitate getting into some of those units maybe earlier?\n\nDavid Makuen -- Chief Executive Officer\n\nI think from a macro perspective, not too much of a change in the real estate landscape from a remodeling perspective. What I can tell you, though, is our head of real estate is doing a great job getting tenant allowance funding for as many remodels as we can, which really brings down the cost of a remodel. So, that's a good development. You know, we don't get it in every instance, but we got a pretty high batting average on that front.\n\nSo, I would say that's the new development. But overall, you know, most landlords look forward to it, you know, more and more. Now, I can see one nearby, and we can pitch why it's great and pitch them why TA is also great, helping upgrade their center, and so forth. So, otherwise, you know, all systems go kind of like we've been doing for the last 18 months.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nYeah. Thanks a lot for the color. Congrats, and good luck.\n\nDavid Makuen -- Chief Executive Officer\n\nThank you, John. Take care.\n\nOperator\n\nThank you. And at this moment, there are no further question on the phone lines.\n\nDavid Makuen -- Chief Executive Officer\n\nGreat. Mallika, thanks so much. Thanks, everybody, for joining. Happy upcoming holidays.\n\nWe'll see you next time. Bye bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNitza McKee -- Senior Associate\n\nDavid Makuen -- Chief Executive Officer\n\nHeather Plutino -- Chief Financial Officer\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nChuck Grom -- Gordon Haskett -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nMore CTRN analysis\n\nAll earnings call transcripts"
}