{
  "companyName": "Pinterest",
  "companyTicker": "PINS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/pinterest-pins-q3-2022-earnings-call-transcript/",
  "content": "Pinterest (PINS 1.93%)\nQ3 2022 Earnings Call\nOct 27, 2022, 4:30 p.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen. Thank you for attending today's Pinterest third quarter 2022 earnings conference call. My name is Tia, and I will be your moderator for today's call. [Operator instructions] I would now like to pass the conference over to your host, Neil Doshi, head of investor relations.\n\nYou may proceed.\n\nNeil Doshi -- Head of Investor Relations\n\nThank you. Good afternoon and thank you for joining us. Welcome to Pinterest earnings call for the third quarter ended September 30, 2022. I'm Neil Doshi, head of investor relations for Pinterest.\n\nJoining me today on the call are Bill Ready, Pinterest CEO; and Todd Morgenfeld, our chief financial officer and head of business operations. Now I'll cover the safe harbor. Some of the statements that we make today regarding our performance, operations and outlook, including the impact of the COVID-19 pandemic, may be considered forward-looking, and such statements involve a number of risks and uncertainties that could cause actual results to differ materially. In addition, our results, trends and outlook for Q4 2022 and beyond are preliminary and are not an indication of future performance.\n\nWe are making these forward-looking statements based on information available to us as of today, and we disclaim any duty to update them later unless required by law. For more information, please refer to the risk factors discussed in our most recent Forms 10-Q or 10-K filed with the SEC and available on the investor relations section of our website. During this call, we will present both GAAP and non-GAAP financial measures. A reconciliation of non-GAAP to GAAP measures is included in today's earnings press release and -- in today's earnings press release, which are distributed and available to the public through our investor relations website located at investor.pinterestinc.com.\n\nBefore we jump in, I'd like to note that we've decided to change our format for earnings communications. We will no longer be publishing a shareholder letter so that we can focus on providing key updates on these calls. And now, I'd like to turn the call over to Bill.\n\nBill Ready -- Chief Executive Officer\n\nThanks, Neil. Hi, everyone. Thanks for joining our Q3 earnings call. I'm proud of our team's execution in Q3 across user growth, monetization and operating discipline.\n\nOn the user side, we stabilized the user base and grew sequentially as we return to seasonal growth trends. Our global MAUs of 445 million were above Q3 2021 as we've largely lapped headwinds from the pandemic unwind and have driven improvements in user engagement. Our U.S. and Canada MAUs grew sequentially for the first time since Q1 2021 to 95 million.\n\nDespite continued macroeconomic uncertainty, we grew revenue by 10% on a constant-currency basis to $685 million for Q3. We delivered adjusted EBITDA of $77 million and adjusted EBITDA margin of 11%. Each of these points demonstrate that our team is operating with heightened focus and discipline, finding ways to grow the business and drive efficiencies despite the difficult macroeconomic environment. My remarks today will focus on three topics: first, how we're making Pinterest more relevant and engaging; second, how we're driving more inspiration to action, including greater shoppability; and third, how we continue to improve our monetization efforts to drive value to our advertising partners.\n\nBy making Pinterest more relevant to our users, we can increase and deepen their engagement with the platform. We're doing this in multiple ways, including improving the personalization on our core services, leveraging our unique opportunities as the content platform and broadening our appeal to emerging demographics. On personalization, we're creating much more relevant experiences for users by combining the unique first-party signal on our platform with advancements in machine learning to recommend highly relevant content to users. In Q3, this work was a meaningful driver of our return to seasonal sequential growth in global and U.S.\n\nand Canada MAUs. It also resulted in year-on-year improvement in engagement as measured by metrics such as sessions, impressions and saves. In fact, sessions in Q3 grew meaningfully faster the MAUs, which indicates that we are deepening engagement with our users. We believe growing sessions should drive multiple top-line benefits, such as reducing user churn, improving overall monetization and growing revenue per user.\n\nWe're also making Pinterest more relevant to users by leveraging our unique human-curated content and upgrading our overall content ecosystem. In short, we want content that not only inspires users but also helps them make, do or buy things. With this goal in mind, here's how we're thinking about human curation and rich media content, which are the two biggest types of content we have on the platform. The human curation at scale that happens on Pinterest is a highly differentiated and viable source of content generated by our users.\n\nWhile machine learning helps us serve a personalized recommendation for a pair of women's hall boots, human curation at scale makes it possible for us to further suggest the best skirt and sweater options to complete the look, which we can do because those boots or ones like them have been saved as part of outfits on other boards on Pinterest. This type of curation is very unique to Pinterest and is fundamentally different user activity than what typically occurs on other platforms. This creates a highly efficient way to get relevant content for users across our ecosystem. User-curated content is a key aspect of our content strategy, and we expect it to remain a significant differentiator.\n\nIn addition, we're increasingly sourcing rich media content that is uploaded to our platform from a wide variety of sources, including publishers, creators, brands and users. In Q3, content uploaded to Pinterest accounted for nearly half of our saves, which demonstrates that users are finding this type of content highly relevant and engaging. One of the uploaded rich media formats we're particularly excited about is video. Videos often make it easier for users to get inspired and to make, do or buy something.\n\nThis is especially true for Gen Z users. We've been ramping our video efforts over the past couple of years. Last year, we focused almost exclusively on attracting creators to upload videos on our platform. However, we've since learned more about the types of videos that resonate with our users and found that we can also obtain high-quality videos and other forms of rich media content from sources beyond creators.\n\nThis is both highly efficient and effective. While creators are an important part of this equation, A larger portion of our rich media corporates is coming from users, brands and publishing partners like Tastemade, Refinery29, Chef Club, Jelly Smack and Blavadye. Over the past year, as we've evolved our video upload tools, we've grown our video supply by three times. Additionally, in October, we announced partnerships with Warner Music Group, Warner Chapel Music, Merlin and BMG to expand the music experience on Pinterest.\n\nThrough these deals, users will be able to add popular song tracks through a new user experience, which we believe will enable users and creators to engage more deeply and creatively with the platform. Finally, we're working to expand the relevance of our platform to emerging audiences, specifically Gen Z, by building products and experiences that resonate with them. Over the past three years, growth from our global Gen Z demographic has outpaced growth from all other demos, and Gen Z users continue to grow despite the pandemic unwind and SEO headwinds. In Q3, Gen Z grew double digits year over year, accelerating from Q2.\n\nThis trend supports our thesis that Gen Z gets something on Pinterest that is distinct from what they get on other popular platforms, namely a place to discover with intent and purpose and to explore their creativity. Nowhere was this more clear to us in Q3 than in the enthusiastic reception of Shuffles, our stand-alone collage-making app, which is available on an invite-only basis to iOS users. The vast majority of Shuffles users are in the Gen Z demo and have been watching with interest as they find novel ways to use Shuffles, such as remixing each other's Shuffles to collaborate on ideas like creating the perfect Stranger Things Halloween costume. We continue to iterate and learn from this beta launch and plan to add new features and functionality to Shuffles as we make it more widely available.\n\nNext, I'll discuss our approach to driving more inspiration and intent to action. At the highest level, we believe shopping on Pinterest drives and informs the core experience of the service rather than being distinct from or bolted on to that core experience. This is supported by the fact that more than half of users we've surveyed view Pinterest as a place to shop. Over time, we expect to make every product that the user encounters on Pinterest shoppable, even when that product may be in a scene or other user-generated content.\n\nThis means pins on all our surfaces should be shoppable, not just the ones on a designated Shop tab. While we have computer vision capabilities, machine learning, human curation at scale and over 1 billion items in our product catalog, we also need to continue growing our product catalog to enable more of these shopping experiences. To that end, we released our API for shopping to general availability in Q3 across all of our shopping-enabled countries, which include the U.S. and our largest markets in Europe, Latin America and APAC.\n\nOur API for shopping makes it easier for merchants to upload their catalogs and metadata while also sending real-time data on SKU-level pricing and inventory. On the discoverability side, we're leveraging both machine learning and the first-party signals we get from the unique human curation on Pinterest. If you're looking for a mid-century modern couch, we should be able to show you tables, rugs and lamps to complete that room based on how millions of users have saved and organized home decor content. I think, this is a superpower for us as we become the home for digital taste base shopping.\n\nFinally, we have an opportunity to become an even more trusted partner to retailers by helping send more traffic, attributable conversions and customers to their businesses. We can deliver high-quality shopping experiences in partnership with retailers by creating frictionless handoffs with the merchant for things that people want to buy. For example, we're piloting a hosted checkout program with Shopify that allows users to check out directly with the merchant while on Pinterest. We are also testing mobile deep linking that takes users straight to the retailer's app and checkout page.\n\nOur efforts on personalization relevance and shopping are also instrumental in creating more value for advertisers. Pinterest is a unique place for advertisers because our users seek inspiration and discovery with intent and purpose. This has a number of implications. To begin with, we have on-platform, first-party signals like searches, saves and board curation that translate into highly valuable and monetizable customer insights for advertisers and resilient on-platform ad personalization and optimization.\n\nIn addition, we have full-funnel ad solutions as users come to us throughout the stages of their purchase journey. We've built our ad platform so advertisers can meet users at every stage of their purchasing journey as they move from ideation, where brand advertising is most effective; to consideration, where a traffic campaign makes sense; to taking action, where conversion objectives are optimal. Revenue from our ads align with these three objectives with approximately one-thirds of our revenue coming from each. Moreover, we're making ads more performant on Pinterest through insight-led selling, better automation and improved tools, measurement and formats.\n\nOur results show that this is working. Approximately 90% of our active advertisers now use automated bidding. And in Q3, our attributed conversions grew over 20% year on year, driven by improvements we've made in ads optimization and conversion visibility. Before I hand over to Todd, I want to share my thoughts on how we operate the business.\n\n2022 was a year of elevated investment for Pinterest as we leaned into a number of initiatives that we believe will drive durable, long-term growth. Additionally, the team and I have gone through an extensive review of our portfolio of initiatives to be sure we're focused on the highest-yielding activities. The benefits of that additional investment and heightened focus are coming through in product impact, particularly in engagement and revenue. We're also focused on driving efficiencies in the business.\n\nAs we discussed on the last call, we intend to return to meaningful margin expansion next year and have already started those efforts. Lastly, we have a strong balance sheet with roughly $2.7 billion in cash and cash equivalents, and our business continues to generate strong free cash flow. Our primary use of capital is to invest in the business to drive continued growth. In addition, Todd and I continue to evaluate our broader capital allocation strategy, including a plan to manage dilution from stock-based compensation.\n\nNow I'll turn it over to Todd to discuss our financial results and guidance.\n\nTodd Morgenfeld -- Chief Financial Officer and Head of Business Operations\n\nThanks, Bill. Our Q3 financial performance demonstrated the effectiveness of our full-funnel advertising platform, a platform that mirrors the user journey from inspiration to action and that delivers compelling results for advertisers across multiple objectives, including awareness, consideration and conversions. When you can address the entire consumer journey, it presents a significant monetization opportunity. We've been focused on this strategy for a while, and it's been working.\n\nOver the last three years, from Q3 of 2019 to Q3 of 2022, we've grown our global users at an 11% compound annual growth rate. In the same time frame, our revenue grew more than three times faster at a 35% CAGR. This ability to grow revenue faster than users has been driven by ads innovation. And while we're happy with our results today, we think there's a lot more to come in this area.\n\nWe also believe that we have an opportunity to further grow our revenue per user by deepening engagement with existing users who visit Pinterest more episodically than monthly active users. Bill mentioned the momentum we're seeing in sessions growth, and we're now leaning into this strategy. Turning to our engagement trends in the third quarter. During the quarter, 445 million global monthly active users came to Pinterest, flat year over year and up 12 million or 3% quarter over quarter.\n\nWe believe that the investments we've made and the user experience were the primary drivers to return to seasonal growth patterns from Q2 to Q3. We also received a modest onetime benefit from the iOS 16 update in September, which contributed to our sequential growth in global monthly active users and U.S. and Canada monthly active users. Looking at the U.S.\n\nand Canada. MAUs were 95 million, increasing 3% sequentially with the addition of 3 million users. This is the first time monthly active users have grown sequentially in this region since the first quarter of 2021. Our global mobile app MAU growth accelerated to 11% year over year in Q3, and U.S.\n\nand Canada mobile application users grew 3% year over year, showing positive growth for the first time this year. So while our desktop and mobile web MAUs declined in Q3, our mobile app MAUs continued to show greater resilience. As a reminder, mobile application MAUs account for over 80% of our total impressions and revenue. Looking ahead, we've moved beyond the pandemic unwind.\n\nAnd by the end of the year, we will have lapped the Google Search algorithm update from November 2021 that had an impact on our ability to grow MAUs. We feel good about the health of the user base, and we're much more focused now on deepening engagement and driving revenue per user. Turning to our financial performance. Third quarter global revenue of $685 million grew 10% year over year on a constant-currency basis or 8% on a reported basis.\n\nTotal U.S. and Canada revenue was $575 million, an increase of 9% year over year. This is an acceleration from last quarter's 7% growth rate. U.S.\n\nand Canada ARPU of $6.13 grew 15% year over year. Better-than-expected strength came from large U.S. retail advertisers who have been more resilient and often seek lower-funnel objectives and shopping goals. CPG advertiser revenue grew modestly year over year for the first time all year as we lapped the initial supply chain issues that these businesses faced this time last year.\n\nOur shopping ads revenue, which comes from promoted catalogs, grew 50% year over year, accelerating from the quarter prior. We're beginning to see traction in some of our emerging verticals like automotive, financial services and travel. These segments grew significantly faster than our overall revenue. And in general, we continue to evolve more from a previously experimental platform into an always-on and trusted advertising partner.\n\nTotal revenue from Europe was $86 million, growing 8% on a constant-currency basis but declining 4% on a reported basis due to significant foreign exchange headwinds. Our European advertisers remain concerned about the current recession impacting that region as inflation and energy costs are affecting consumer demand. Total revenue from our Rest of World region was $24 million, growing 41% on a constant-currency basis and 36% on a reported basis. During the quarter, we launched advertisements in Argentina, Chile and Colombia as we added to our presence in the Lat Am market.\n\nHowever, weak consumer spending created challenges for our more price-sensitive global mid-market and SMB advertisers. As I mentioned earlier, we've been focused on building a durable performance advertising business that allows advertisers to meet users across the entire funnel. This has never been more important than today when CMOs are focused on marketing spend that drives measurable returns. In addition, our positive platform, our users' commercial intent and our ability to deliver insights-led selling drive unique value for advertisers that's just difficult to find elsewhere.\n\nIn Q3, we expanded the Pinterest Trends tool from beta to general availability to help advertisers around the world get deeper insights into user planning behavior to inform the early campaign planning stage. Aligning with trends on Pinterest helps advertisers develop relevant campaigns that resonate with their audience based on real-time interests, leading to increased performance. In October, we announced that we've expanded the Pinterest Trends tool from the U.S., U.K. and Canada to 30 additional countries.\n\nFor example, Ashley Furniture Canada tapped into growing home trends on Pinterest using our Pinterest Trends tool to align their products with emerging home decor styles. Knowing that terms like Boho chic and modern farmhouse were top home decor trends on Pinterest, they designed their campaign visuals to highlight how their products could bring these trends to life. In doing so, Ashley Furniture drove a 71% increase in click-through rates and a 12% increase in returns on ad spend in their conversion campaigns. We continue to innovate in tools and formats to improve automation.\n\nOur new API for conversions helps explain Pinterest's contribution to attributable conversions to advertisers. We're seeing encouraging adoption of the tool by our advertisers with its most frequent use case being lower-funnel actions such as checkouts. Beta results have shown impressive performance with a 30% -- 36% increase in attributed conversion volume when using both conversion API and tags compared to using tags only. Turning to our expense profile.\n\nCost of revenue increased both year over year and sequentially. We're investing in models to make product experiences more personalized and relevant for our users while also delivering improved ROI for our advertisers. We're beginning to see impact from these investments in our current results and believe that they will continue to drive further improvements in engagement and revenue over time. Non-GAAP operating expenses were $434 million in the third quarter, up 38% year over year and up 4% quarter over quarter.\n\nThis was lower than our prior guidance in part due to a decision to shift a portion of our brand marketing spend from the third to the fourth quarter. Adjusted EBITDA was $77 million in the third quarter with an adjusted EBITDA margin of 11%. We ended the quarter with about $2.67 billion in cash, cash equivalents and marketable securities. Turning to our preliminary outlook for the fourth quarter.\n\nWe expect revenue to grow in the mid-single digits percentage range year over year. That includes approximately 3 percentage points of headwind from foreign exchange, slightly greater when compared to the third quarter. Many of our advertisers are navigating a challenging environment with higher inflation and weakening consumer demand. This creates a volatile demand environment globally.\n\nGiven this uncertainty, we believe there could be a wider range of outcomes this quarter, including some downside risk, especially as our Q4 revenue tends to be back-end weighted. On expenses, we expect non-GAAP operating expenses to grow in the low double digits percentage range sequentially as we shifted a portion of our brand marketing campaign into Q4. For the full year, we expect non-GAAP opex to grow around 35% year over year, at the low end of the range we communicated at the start of the year. We firmly believe the investments we made this year will enable us to continue innovating to enhance both the user experience and our advertising platform.\n\nAs we exit 2022, we're focused on maximizing the return from these investments. We are still committed to meaningful margin expansion in 2023. Now I'll turn it back over to Bill before we open it up to Q&A.\n\nBill Ready -- Chief Executive Officer\n\nThanks, Todd. I want to say a few words about how I approach these earnings updates because it's a bit different from how we've done things in the past. I consider communications with and feedback from investors a key priority. I view our quarterly earnings calls as one of the best channels to inform investors and analysts about the most important topics in the business, and I expect to increase the overall dialogue with our investors and analysts.\n\nAnd I look forward to sharing more with you when we set our investor day in 2023. Finally, I want to thank our team Pinterest, our advertising partners and all the people that come to Pinterest to find inspiration. And with that, we can open it up for questions.\n\nOperator\n\nWe will now begin the Q&A session. [Operator instructions] The first question is from the line of Eric Sheridan with Goldman Sachs. Please proceed.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the questions, and hope everyone well on the team. Maybe coming back to a point you both made in the prepared remarks, as we turn the page on '22 and what you highlighted as an investment year, how should we be thinking about what those key investment priorities, whether it's product or platform or as we go from '22 and to '23? And if we're trying to think about what the potential impact of those priorities are, whether it be revenue growth building in '23 and beyond or the potential for margin expansion and potential in '23 and beyond, how would you frame the output from those investment priorities? Thanks.\n\nBill Ready -- Chief Executive Officer\n\nThanks, Eric, for the question. So a couple of things I'd say. First of all, we've really been focused on bringing clarity, focus and operating discipline to the business. And on each of those, I'd say, on the clarity side, we're a visual discovery platform with three really unique attributes: first, that we're a positive place on the Internet; second, that our users come here with high intent.\n\nSo while we're a discovery platform, users have intent, which is quite different from other platforms; and then third, the human curation that happens on our platform is quite unique. And so, with that clarity, we're really focused on things that can drive differentiation based on those unique attributes of our platform and making sure that we're operating well and tying these initiatives across our different functions and making sure that we're focused on the highest-yielding activities. As we go into '23, we're glad that we've stabilized the user base and returned to seasonal growth on users. And we think we've got a great ARPU story as we continue to move forward with the business.\n\nWe're driving more relevance with users, and we're doing that really by leaning into these unique attributes of the platform, both in terms of how we take inspiration to action with things like shopping, making more of the content that users find on Pinterest actionable and bringing more relevant content to users, particularly content that is coming from efficient sources like user-generated content on our platform as well as what we can do with publishers and then, of course, creators also. And then, finally, innovation on ad tech, where we've been making really good progress on what we're doing on the ad tech side, but we think there's a lot more that we can do there. So again, I think you're seeing some of this reflected in the results this quarter, but we think there's a lot of upside yet to go on each of those points. I'll pause.\n\nIs there anything, Todd, do you want to add to that?\n\nTodd Morgenfeld -- Chief Financial Officer and Head of Business Operations\n\nNo. I don't have much to add. I would say that, to Bill's point on starting to see the results, you saw it in the financial results with strength from many of our core customer base in large retail and even some falling in the CPG market for us. But it's also worth noting that in addition to the stability in the user base and even the sequential growth that we saw, Bill had referenced some sessions growth meaningfully above our user growth.\n\nWe saw an improvement in saves, impressions, board creates in the U.S. and other good signals that we're now in a position to drive that ARPU story that Bill described.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much.\n\nOperator\n\nThank you. The next question is from the line of Colin Sebastian with Baird. You may proceed.\n\nColin Sebastian -- Baird -- Analyst\n\nGreat. Thanks very much. I have a couple. First off, Todd, I was hoping you could expand a bit on the puts and takes with respect to the Q4 guide just given the moving parts you discussed on the macro front and the various platform initiatives.\n\nAnd then, Bill, I was hoping you could then maybe expand on the lower-funnel shopping integrations, including checkout and some of the beta tests, if your view or strategy here has evolved since you first joined Pinterest and if these are already moving the needle or if they have a longer cycle time, perhaps in the next year, before they contribute meaningfully to growth. Thank you.\n\nTodd Morgenfeld -- Chief Financial Officer and Head of Business Operations\n\nColin, thanks for the question. I'll start with your first one on puts and takes around Q4 guidance. And then, as you mentioned, Bill can speak to some of the lower-funnel work that we're doing. Currently, the headline is that October is trending, very roughly speaking, at the low end of our Q4 guidance of that guidance range that we described in the opening remarks.\n\nWe've been executing very well in this environment overall and relative to others in the industry, which have been very encouraging. As you know, though, Q4 revenue is back-end weighted to November and December given holiday seasonal moments. And given this and the overall ad market volatility, there could be a wider range of outcomes, including some downside risk to our guidance. When we gave our Q3 guidance of mid-single digits growth during our Q2 earnings call in July, we indicated that July was trending slightly above that guide.\n\nAnd at this point, October today is trending at the low end of the Q4 guidance range, and our guide assumes a modest pickup in demand for November and December from today. It's also worth noting that our guide includes about 3 percentage points of headwind to revenue growth rate in the fourth quarter from foreign exchange headwinds, which is slightly greater when compared to the third quarter.\n\nBill Ready -- Chief Executive Officer\n\nYeah. And on your questions on lower funnel and shopping, Colin, we think there's a lot more we can do to drive intent to action across the platform. This is one of the things we think makes us very different than other discovery platform is that we have discovery with intent and purpose. And so, there's a lot more that we can do to drive that intent to action.\n\nShopping is a particular area of focus for us on that. On the strategy there, what we're really doing is looking to go meet the user where they are on the platform. We see that more than half of users on Pinterest are here to shop. They're telling us that directly.\n\nAnd we've had experiments with things like shopping tabs that have been sort of a part of the experience but not necessarily been core to the experience. Moving forward, we're making shopping more core to the experience. That's what users are looking for from Pinterest already. So we're quite confident in that meeting a real user need.\n\nAnd you can see progress on the shopping front already. For example, our Q3 revenue from shopping ads grew 50% year on year. So that's a good indication of the progress there. And the things you can look to see more from us, as I mentioned in my comments, starting to make every product you encounter on Pinterest shoppable regardless whether that product appeared in a scene or user-generated content.\n\nAnd then, taking the discovery that's happening on Pinterest and making sure that for all that great discovery of products that users are finding on Penterest, they have a clear way to take action on that, which has not always been the case historically. So going forward, we want to make sure there's much more actionability on that. And that actionability can be a hosted checkout like what we're doing with Shopify, where the user still is checking out directly with the merchant, but they're doing it in context on our platform or it can be a high-quality handoff to the retailer or the merchant like with the mobile deep link that gives the user a seamless connection with where to buy. And as we do that, we think that not only can address a lot of leaked engagement on our platform because historically, since the actionability was less, users would find things on Pinterest and then oftentimes have to go search someplace else to find where to buy them.\n\nAs we give the user more actionability, we think that not only plugs leaked engagement from the platform, brings engagement back to -- deep engagement on our platform, it's also a very highly monetizable event as well. And you're already seeing that progress in our shopping ads, and we expect more of that to continue.\n\nColin Sebastian -- Baird -- Analyst\n\nGreat. Thank you.\n\nBill Ready -- Chief Executive Officer\n\nNext question, operator.\n\nOperator\n\nThe next question comes from the line of Mark Mahaney with Evercore ISI. You may proceed.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nCan I try two questions, please? First, these music partnerships that you talk about, would that possibly lead to newer revenue streams? Are there different ways to monetize if you bring in music? And then, secondly, Bill, I want to ask you just about AI and machine learning investments, and there seems to be a dramatic step-up in investments kind of across the industry just in that. How do you see -- is there something dramatically different that you think can be done at Pinterest with greater investment in artificial intelligence and machine learning? Thanks. That's it.\n\nBill Ready -- Chief Executive Officer\n\nThanks for the questions, Mark. First on the music partnerships, we look at that really as a way to make our content more attractive for users. You've seen us making good progress on that, particularly in finding efficient ways to source new content. If you look at where we had been, it was almost entirely focused on creators.\n\nWe now look at creators as a part of that strategy, but there's a broader strategy on content and is looking at all the sources of content, including from publishers and partners. And this is an example of a partner. So I view this more in our broader content strategy and how we're getting more refined on the kinds of content that resonate with our users, which tend to be content that helps users satisfy intent and has a purpose and the fact that we're broadening out our sources of content for that, which generally should lead to better monetization opportunities overall over time. On your machine learning question, it's a fantastic question.\n\nAnd one of the things that I found quite compelling about Pinterest as part of why I joined is that machine learning is a utility that many have access to. Machine learning, though, is only as good as the signal that it's acting upon. And the human curation that happens on Pinterest, I think, is fundamentally different than the user engagement that happens on other platforms. Most of the other platforms in the discovery arena tend to be lean-back consumption platforms.\n\nAnd I think this is why you see as platforms like Apple have implemented privacy changes and diminish the ability to use signals like third-party cookies. And you're seeing that have different impacts on different platforms. In a platform like Pinterest that has user intent on the platform, you're seeing that stand out. You're seeing that be more resilient and being able to show relevant things to users.\n\nBut the human curation on our platform, the fact that users come to Pinterest and tell us what types of outfits go together, what types of home decor go together, what kind of decorations go together well, that is really rich signal that our machine learning can act upon. That is fundamentally different than the signal that you would get on a lean back consumption platform where your signals primarily views versus here, we have the user lean forward, engaging, curating, creating, making these associations directly on our platform. And we think that's a very powerful signal that is feeding our machine learning and where we think we can continue to make really great advances and relevance and really outpace what we think is happening in a lot of the rest of the visual discovery arena where there's a lack of intent -- or tends to be a lack of intent. And so, it's a place where you're seeing that in our user engagement results already and some of the improvements there.\n\nBut we think that's something where we have a lot of future potential to continue.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nThank you, Bill.\n\nOperator\n\nThank you. The next question is from the line of Ross Sandler with Barclays. You may proceed.\n\nRoss Sandler -- Barclays -- Analyst\n\nHey, guys, nice job on the quarter. A question on international. So if we look at the international ad revenue opportunity, there are some countries where consumers engage with shopping apps different than they do in the U.S. There's like live commerce, other things going on.\n\nAnd hence, the monetization opportunity could be more robust in one country versus the other. And if we look at like some of your more mature peers like maybe Facebook, there's a pretty normal spread between the ARPU in the U.S. in places like Europe and ROW. And the gap here with Pinterest is, obviously, reflecting that your U.S.\n\nbusiness is far more mature than these international countries. So the question is like, is there anything structural that we should think about that would make your international story different? And then, how quickly do you expect these new countries that you're lighting up to ramp up? Is it direct sales, self-serve? And kind of can you just explain like a Japan or some of these newer countries, how quickly they're ramping up? Thanks a lot.\n\nBill Ready -- Chief Executive Officer\n\nAll right. Thanks for the question. I'll start there and then give it to Todd to fill in some more on it. International, we definitely think there's opportunity there.\n\nYou see good growth from us in some of the markets, and Todd will talk more about that. What I would say generally on shopping is we -- the thing that we believe makes us very different than other platforms, which I talked about around the intent on our platform, the human curation on our platform that gives us much richer signal than you would find in a lot of other visual discovery platforms, I think puts us in a really great position to solve the full funnel for shopping. We're a full-funnel platform, and I think you see that resonating with advertisers on our platform. And we've historically been stronger in upper and mid.\n\nWe're doing more in lower funnel. So I think we're uniquely positioned across markets to address that full funnel. In a lot of ways, the first 20-plus years of e-commerce were solving for buying and not as much for the shopping part of the equation, which was sort of walking a bazaar, going into the mall and not knowing what you wanted to buy but having a general sense and then discovering. That hasn't been fully solved in the digital world.\n\nAnd I think -- what you see from us around our ability to create great visual exploration with really great recommendations and really rich first-party signal lets us go solve that full fundamental experience in the digital world in a way that just has not been fully solved as of yet. I think that's our primary differentiator, and it cuts across markets. And there may be things that are specific to different markets that we may tune to in one market or the next. But I think that differentiation in tying that full funnel together, I believe, is quite unique in e-commerce generally and cuts across markets.\n\nAt the same time, we are managing to grow in international markets. We launched shopping last year in the EU. So it's relatively new, but we're seeing it grow well. And maybe I'll hand off to Todd there to talk about the various efforts across the markets there.\n\nTodd Morgenfeld -- Chief Financial Officer and Head of Business Operations\n\nRoss, thanks for the question. I think, when you take a step back and you think about the user experience and the use cases that people come to Pinterest for, the mindset of our users, that same commercial intent and planning mindset that folks bring to Pinterest in the U.S., that's very similar in our non-U.S. markets, too. So similar use cases, generally similar demographics, which is a good starting point.\n\nWe were just later to begin monetizing outside of the U.S., starting more in Western Europe and then moving to Latin America and then just launching in Japan a few months ago. So very early in general, but especially early in Lat Am and in APAC. There are aspects of these markets that's a little unique. So for example, you may recall when we were talking about scaling in EMEA or Europe that we noted at the time that one of the differences in the market is more agency concentration or more agency-centric selling.\n\nAnd so, we talked about launching business access as a tool to help us navigate the agency relationships there. So there are aspects of the product experience that need to be tweaked for these markets. But when you start with why do people come to Pinterest, what do they use it for, what is their mindset, the full-funnel experience that Bill described going from idea or intent to action and marrying that against advertiser objectives, it's very similar. And it's just a question of the depth of the ad market and the prices folks are willing to pay for those slots.\n\nIs that helpful?\n\nRoss Sandler -- Barclays -- Analyst\n\nYes. Super helpful, guys. Thanks.\n\nOperator\n\nThank you. The next question is from the line of Brian Nowak with Morgan Stanley. Please proceed.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nGreat. Thank you for taking my questions. I have two. I appreciate the color about session growth.\n\nIt's pretty interesting. I'd be curious to hear about what you can share on search behavior, whether it's search queries or number of people who are searching, anything, Bill. I know with your search background, you could help us understand the behavior you see in searching, perhaps another monetization driver. And then, the second one, maybe it's a little technical, but I'm just curious to hear -- the Shopify partnership has been around for quite some time now.\n\nCan you just give us some examples of blocking and tackling in the back end where you're going to be able to accelerate the merchants and the SKUs per merchant that really come on to the platform and are integrated into the experience at a faster pace? Thanks.\n\nBill Ready -- Chief Executive Officer\n\nThanks, Brian. Great questions. So on the session growth, yes, we were feeling good about the progress there, indicating that we're deeply engaging with our users and we think highlights the opportunity for us to continue to drive ARPU growth, which we think of as even more important than MAU growth going forward given the opportunity to do more to bring those users from episodic usage to more frequent usage. Answer on your question, we -- search is a part of what you come to the platform for.\n\nAnd if you look at the upper, mid- and lower funnel, and I touched on this in the comments, our revenue is split roughly third, third, third across those stages of the funnel. I'd say that lower funnel is the place where the product is even more nascent. So even though we see considerable search volume on the platform today, the fact that we do have such high intent and so many people are here to shop, we do think that lower funnel is a place that we can strengthen more and more shopping is a key part of that. And so, to your second question around accelerating efforts to bring those merchants on -- so we've had good integrations with Shopify.\n\nI talked about the shopping API that we put out that really makes it much easier for merchants to go publish our catalog to us. We're at 1 billion items in the catalog now. We think there's billions more that we can add to that. And so, having an API that retailers can use to not only publish our catalogs to us but also give real-time updates on inventory and pricing, we think will really help that.\n\nBut then, the other part of that that is really important, and I mentioned this earlier, is shifting from shopping being a separate tab or a separate activity or a thing that the user has to seek out on the platform versus meeting the user where they are in making the products that they encounter naturally on the platform naturally shoppable. And so, as we do more and more of that, we think that will really create a lot more opportunity to drive that lower-funnel activity, and search is a part of that. But really, it's the visual discovery journey and the fact that we know we have users here with intent and making that intent much more easily actionable, we think, is the broader opportunity for us. And again, you see progress on it from us already with the shopping ads growing 50% year on year.\n\nBut we're still relatively early days there, and so we're excited. There's a lot to go.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nGreat. Thanks, Bill.\n\nBill Ready -- Chief Executive Officer\n\nThanks, Brian.\n\nOperator\n\nThank you. The next question is from the line of Rich Greenfield with LightShed Partners. Please proceed.\n\nRich Greenfield -- LightShed Partners -- Analyst\n\nThanks for taking the question. I got two. One, I just want to follow up. Bill, you sort of inferred or implied in talking about October being sort of at the bottom end of the range.\n\nJust given sort of the macro headwinds that we've heard from whether it be Meta or Snap or Comcast this morning or just a few minutes ago, Amazon printing, everyone is sort of talking about sort of a very rough challenging macro. I guess, I'm curious, why not just be more conservative in the Q4 guide given where October was trending? Is there something specific that you're looking to that gives you confidence in sort of a pickup in November and December? Is it sort of due to sort of the shopping nature of Pinterest and why you think you sort of accelerate or improve in the back two months of the quarter? And then, just -- you laid out a lot of, I think, really good plausible drivers of Pinterest over the course of the next few years. Now that you've had a few months sink your teeth and if you had to kind of point out one thing, whether you mentioned it or not on the call so far. But what's sort of the one thing that you're most excited about creating value at Pinterest over the next 12 months? Thanks for taking the question.\n\nBill Ready -- Chief Executive Officer\n\nAll right. Thanks, Rich. I'll start with a couple of thoughts on your question on the macro and then give it to Todd to fill in there. If you look at this quarter, I think you look at us relative to our peer set.\n\nAnd I think it's pretty clear that in a tough macro, we found ways to differentiate and outpace a decelerating ad market. And yes, as we go into Q4, you're seeing projections from others, there's a lot of expectations around that that will continue to decelerate. At the same time, we think there's a lot that we're doing that is cutting through. But Todd talked about the wider range around the outcomes is an inherently back-weighted quarter with holiday shopping.\n\nAnd holiday shopping is something people spend a lot of time on Pinterest for holiday activities, not just shopping, but things like how they think about their decor, how do they think about planning for events, how do they think about recipes and all these kinds of things that really drive a lot of engagement during Q4. But as Todd mentioned, it's a back-weighted quarter. And so, that's why there's a wider range around that. I'll pause and let Todd add into that before I come to the second part of your question.\n\nTodd Morgenfeld -- Chief Financial Officer and Head of Business Operations\n\nYeah, Rich, I mean, for sure, wanted to make sure -- I want to make sure folks understood that we're keenly aware of the environment we're operating in and what's happening in the industry. And I was hoping to call that out, the wider range of outcomes, the back-end-weighted nature of the quarter in general in Q4 for us and call out some of that risk and the wider range that may unfold. But this is our best call on where we're headed for the quarter. And I think what you can take away from that is we have a large concentration of larger retailer advertisers and large CPG advertisers that if you roll the clock back a couple of years when we were in the earlier days of the pandemic, those were the advertisers that were disproportionately slowed.\n\nAnd we looked relatively weak compared to the industry because we didn't have crypto, gaming apps, app download to the extent that others did. In this environment, we're seeing relative strength with those larger retailers. And with the falling in the CPG market, we saw more resilience there in the third quarter, and we're expecting some more resilience there in the fourth quarter. The last thing I would say is that we had called out -- I made mention of it in words in my script around graduating from experimental to kind of always-on budgets.\n\nAnd we had talked about last quarter how our joint business partnership deal volume had grown in the first half of the year, 25% year over year. Those are noncontractual but indications of large advertiser spend commitments. We saw that number grow to 35% year over year -- year to date in terms of JVP deal volume, joint business partnership deal volume in the third quarter. So that gives us some indication that we are an important platform for advertisers that really need to reach consumers during a period when they're shopping.\n\nAnd I'm hopeful that it plays out the way we described.\n\nBill Ready -- Chief Executive Officer\n\nOn your second question, Rich, you asked me for one thing that we cut through the most. I'll give you two, but they're related. So the first I've talked about a bunch, which is driving more of the intent to action. We know the user has strong intent here, but we haven't always made it as easy as it could be for them to take action on that.\n\nSo we think as we make more of the things people are discovering on Pinterest directly actionable, we think there's a lot of lift in engagement that comes from that. But the same thing that's related to it is our ad platform is younger than many of the other platforms out there. And so, you're seeing us make advancements in maturing the platform. As we drive greater maturity in our ad platform, there's a lot of upside in delivering more insight, more measurability to our advertising partners.\n\nAnd again, I think you see some of that reflected in our results with conversion year on year being up 20%, us giving more tools to advertisers and insights around these things. As we make that more and more mature, we think there's a lot of upside opportunity on that as well. And obviously, these two things relate to one another because that intent to action really rounds out the lower-funnel part of our story, making us a truly unique full-funnel platform that can engage with the user across every stage of their purchasing journey. So those are the two very related things, I would say, I think, have the most opportunity to really cut through and drive continued improvement for us as we go into next year.\n\nRich Greenfield -- LightShed Partners -- Analyst\n\nThat's really helpful. Can I just ask a follow-up on that, the acceleration in the back half of the quarter or the back two months of the quarter? Is the Google sort of lapping which happens in November, how does that factor into that as well? For Bill or for Todd?\n\nTodd Morgenfeld -- Chief Financial Officer and Head of Business Operations\n\nWell, it's a little bit indirect, right? The Google lapping was an algorithm change that effectively slowed the traffic we were getting from search to the platform, so users coming to the platform through search activity, which, in general, tended to be more web-based users. I called out the success we've had in growing our mobile application user base, which has been the most resilient part of our user engagement story. That's where we make almost all of our -- I mean, not all, a significant majority. Over 80% of our revenue and our impressions come from those mobile app users.\n\nSo I would disaggregate the Google Search impact to revenue because we've been able to continue our financial performance despite some search algorithm changes. We did see, as I called out, resilience and stabilization and even a return to our normal seasonal growth patterns with users in the third quarter, and I would expect that to continue. But we are lapping that SEO change at the end of last year. I guess, if you were to really pick at it, you'd say that we would hopefully see some increase in monetizable supply as a result of some of these changes, but that would be at the margin.\n\nBill Ready -- Chief Executive Officer\n\nOperator, next question.\n\nOperator\n\nAbsolutely. The next question comes from the line of Lloyd Walmsley with UBS. Please proceed.\n\nLloyd Walmsley -- UBS -- Analyst\n\nGreat. Thanks, guys. First, Bill, I just want to thank you for your interest in engaging with investors and analysts. Not necessarily the norm in the space, so nice breath of fresh air.\n\nFirst question, just wanted to go back to the comment on seeing more always-on budget. Traditionally, we think of that as more direct response and a function of ROI improvements. And when that happens, budget tends to scale up, not just kind of be always on but leaning into ROI. So is that what we're seeing? Are we thinking about it right? It's mostly DR and really kind of position you to see kind of same client budget scale? And then, the second one would just be about the third-party video content that you talked about at the beginning of the call.\n\nCan you just help us understand the margin implications of that and kind of what those deals look like? Are these like typical rev shares? Are they fixed cost licensing deals? Do any of the partner sell ads and like share revenue with you? And like how do we think about all the impact of those deals on the P&L? Thanks.\n\nBill Ready -- Chief Executive Officer\n\nYeah. Maybe I'll take the second one first and then give it to Todd on your first question. On the video side, I would say, each of those deals are -- I would not expect to have a material impact on margin or things like that. The macro point to take away is as we have refined our content strategy, we're finding efficient ways to go get really high-quality content that resonates with our users.\n\nSo while the teams have been experimenting with short-form video for a couple of years now, there's a lot of good learnings there around the type of video content that resonates with users on Pinterest, which is oftentimes different than the video content that may resonate for those users or -- resonating for users on other platforms because users have more intent and purpose here. It's less about entertainment, and it's more about intent and purpose, which means there are often different kinds of videos that are resonant. And so, finding partnerships to source those is quite efficient as compared to creator ecosystem. Again, creators are an important part of that strategy.\n\nBut whereas they were most of the strategy previously. They're now a part of that strategy. And I look at these third-party partnerships as broadening out the content strategy, broadening our sources in a way that is more efficient than what you would have seen in a content -- or a creator-only content strategy. So while these deals specifically don't have some sort of negative impact to margin, I think on our longer-term strategy, you're seeing us focus on efficient ways to source content both of these third-party deals.\n\nAnd then, I'd finally call out the creation and curation that happens on our platform is really important content as well. I've talked several times about the value of the human curation on our platform. That curation is content creation, and it's a lot of the content that our users are seeking as they're trying to put together an outfit or put together a room or put together a holiday party. The pins that come onto our platform, the board is the people curing on our platform are giving a lot of that content that we really need to service.\n\nSo that's really efficient content sourcing as well. And I'll turn it over to Todd for the other part of your question.\n\nTodd Morgenfeld -- Chief Financial Officer and Head of Business Operations\n\nLloyd, thanks for the question. What I wanted to make sure you understood is -- Bill spent a lot of time in his opening remarks talking about this full-funnel platform that we've built. We have our users that go from intent to action. Our advertisers want to be there with awareness, consideration or traffic or conversion campaigns and shopping campaigns at the lower part of the funnel.\n\nWhen I talked about our success in driving those joint business partnerships, again, they're not contractual deals. They're indications of interest to spend, and they're not necessarily designed against a specific objective. What we're seeing is that we're getting -- we're having success even with advertisers that are typically more awareness-oriented, so think traditional CPG advertisers, exploring ways of moving down funnel. With our retail advertisers signing these commitments, we're seeing them move up funnel.\n\nAnd so, we're -- to Bill's comments about us being a full-funnel platform, in these joint business partnerships, we're seeing an interest in advertising against awareness, consideration and conversion objectives, and that's been really encouraging to me. And then, lastly, we have seen that total deal volume dollars under those commitments grow now year to date 35% year over year, which is 10 points faster than what we were last quarter. So pretty good -- I think a lot of confidence with large sophisticated advertisers in the platform.\n\nBill Ready -- Chief Executive Officer\n\nOperator, we'll take our last question.\n\nLloyd Walmsley -- UBS -- Analyst\n\nOK. That's helpful. Thanks.\n\nOperator\n\nThank you. And of course. The last question is from the line of Doug Anmuth with J.P. Morgan.\n\nPlease proceed.\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nThanks for taking questions. Just two quick ones. Bill, you mentioned just innovation in ad tech going forward. Can you just talk for a minute about building out self-serve and how far along you are here? And then, also Shuffles driving a lot of the Gen Z growth in 3Q, how do you leverage that into the core platform to drive repeated use and engagement? Thank you.\n\nBill Ready -- Chief Executive Officer\n\nThanks, Doug. On the ad innovation side, as I mentioned, like we're early on in our ad -- relatively early on in our ad platform compared to others. And I think some of the things we've talked about in terms of better conversion visibility, better trends visibility, the adoption of automation by our advertising partners, these are all things we think there's a lot of continued yield. Self-serve is an opportunity for us.\n\nWe're probably even more nascent in our self-serve capabilities. So longer term, I'd say there's a large opportunity for us. I'd say in the near term, a lot of those smaller advertisers that would be more inclined toward self-serve have been some of the hardest impacted. And so, fortunately, that's a smaller part of our business.\n\nIt's one that we still very much believe in over the long term. But our focus is on building out the maturity of the ad platform more broadly right now. And then, self-serve, we'll continue to invest there, but we view it as smaller in the near term, but it's still quite important in the long term. And then, on the Shuffles side, yes, Shuffles has seen really phenomenal reception.\n\nAnd I think it really speaks to interesting use cases that people expect on Pinterest. The user is just in a different mode on Pinterest than they are on other platforms. I talked about the users in a lean-forward mode on Pinterest versus a lean-back mode on other platforms. And it's very hard to change the sort of headspace the user's in when they're in an app or on a platform.\n\nSo the fact we have user in that lean-forward mode, I think Shuffles is just one example of the way that we can extend use cases with our users that are uniquely Pinterest, take advantage of the lean-forward mode that you just have with us. And then, to your question on Gen Z, I want to be clear, and I think I touched on this in my comments, our Gen Z traction is not just about Shuffles. We're finding really great Gen Z traction in the core platform already. So I cited some of those stats around the growth there in my prepared remarks.\n\nShuffles we think only adds to that. And to your question, we are looking at ways we can draw more connectivity between Shuffles and the Pinterest app. So it's already the case that when you're in Shuffles, you can connect your Pinterest boards and these kinds of things. So there's connections between these two already.\n\nAnd we think there's more and more of these natural connections that can happen between the two, so that each is enhancing the other. All right. Thank you, again, to all of you for joining the call and for your questions. And as I mentioned earlier, we really look forward to keeping this dialogue going with all of you.\n\nWe appreciate your feedback, and enjoy the rest of your day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNeil Doshi -- Head of Investor Relations\n\nBill Ready -- Chief Executive Officer\n\nTodd Morgenfeld -- Chief Financial Officer and Head of Business Operations\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nColin Sebastian -- Baird -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nRoss Sandler -- Barclays -- Analyst\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nRich Greenfield -- LightShed Partners -- Analyst\n\nLloyd Walmsley -- UBS -- Analyst\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nMore PINS analysis\n\nAll earnings call transcripts"
}