{
  "companyName": "Joann",
  "companyTicker": "JOAN",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/13/joann-joan-q3-2023-earnings-call-transcript/",
  "content": "Joann (JOAN 10.04%)\nQ3 2023 Earnings Call\nDec 12, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to the JOANN third-quarter fiscal 2023 earnings conference call. All participants will be in listen-only mode. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Ajay Jain, head of investor relations.\n\nPlease go ahead.\n\nAjay Jain -- Head of Investor Relations\n\nThank you, Chad, and good afternoon. I'd like to remind everyone that comments made today may include forward-looking statements, which are subject to significant risks and uncertainties that could cause the company's actual results to differ materially from management's current expectations. These statements speak as of today, and the company undertakes no obligation to update or revise any forward-looking statements to reflect subsequent events, new information, or future circumstances. Please review the cautionary statements and risk factors contained in the company's earnings press release and the recent filings with the SEC.\n\nDuring the call today, management may refer to certain non-GAAP financial measures. A reconciliation between GAAP and non-GAAP financial measures can be found in the company's earnings press release, which was filed today with the SEC and posted to the Investor Relations section of JOANN's website at investors.joann.com. On the call today from JOANN are Wade Miquelon, president and chief executive officer; and Scott Sekella, chief financial officer. During the question-and-answer portion of the call, we'll also be joined by Chris DiTullio, JOANN's executive vice president and chief customer officer.\n\nI will now turn the call over to Wade for his prepared comments.\n\nWade Miquelon -- President and Chief Executive Officer\n\nThank you, Ajay. Good afternoon, and welcome to JOANN's third-quarter fiscal 2023 earnings call. I'd like to first ask those on the call to join me extending a very warm welcome to our new chief financial officer, Scott Sekella. Scott brings more than 20 years of experience in finance for several multinational brands, most recently serving as vice president, corporate FP&A head at Under Armour.\n\nIt's remarkable to me how fast Scott has hit the ground running, and we are very excited to have Scott on board as a senior executive. In the days ahead, I look forward to introducing Scott to many of you in the analyst, investor, and lender communities. As we entered the peak of our holiday season, I want to take a minute to thank our more than 21,000 hard-working team members at JOANN for their dedication to our organization's success. I also want to acknowledge the continued support of our customers and to express my gratitude to all the loyal selling and crafting enthusiasts who continued to support JOANN despite unique challenges many are experiencing during this difficult economic climate.\n\nIn the third quarter, while our results showed some internal signs of strengthening, overall, we were disappointed. Our sales comparison versus last year was a decline of 7.9% and versus fiscal year '20, which was our pre-pandemic year, our sales declined by 1.1%. Gross profit dollars on an adjusted basis were down 9.3% versus last year and increased by 5.5% versus fiscal year '20. As stated on the Q2 earnings call, our sales comparison have progressively strengthened through the end of Q2 and as we entered into Q3.\n\nHowever, midway through our third quarter, this trend worsened. This slowing was not incompatible with what our blind data illustrates for the specialty retail industry overall. This slowing was primarily caused by fewer items per basket as opposed to a downturn in customer traffic trends overall. Further, this reduction in items per basket was skewed to both our lower end database customers and our customers not in our database.\n\nDuring the third quarter, we continued to see strength in many large and important parts of our business, such as fashion apparel, special occasions, needle arts, and fleece categories. In addition, our Halloween seasonal business grew approximately 8% and related categories performed very well. However, the fall seasonal decor and floral categories underperformed, as customers seem much less inclined to indulge and decorate versus the prior year. Additionally, consistent with broader industry trends in this category, we experienced a meaningful slowdown in our craft technology business.\n\nOur general belief is that the ongoing inflationary environment has continued to pressure our customers' level of discretionary spending. We've talked many times about JOANN's resiliency through recessionary times. However, what I feel is a bit nuanced of the extreme inflationary factor, which has not been seen in four years. Increasingly, we're seeing that consumers are feeling the sting of inflation, but the recent shift in shopping behavior has skewed much more toward essentials and basics with less emphasis on discretionary purchases.\n\nThese budget-conscious consumers have been under a prolonged period of stress for many months now, and they are getting more selective with their purchases. Fortunately, there are some signs that these inflationary trends are beginning to side even as we potentially head into something more typical of a recessionary environment in the short term. During the quarter, we continued to advance our key strategies, including enhancing our store experience, which, among other things, includes our journey to refresh our current and relocate stores. We had 13 grand openings in the quarter in which all but one was either relocation where we're able to increase our square footage or enter into a net new market force altogether.\n\nOn balance, we're very pleased with the results of these locations as we were able to showcase the full breadth of the JOANN brand in a way which we could not in our previous smaller footprints. We have four additional stores opening in the fourth quarter to complete this year's projects. Our second core strategy is to enhance our multichannel proposition. Our omnichannel efforts yielded an additional bright spot in the quarter with sales representing over 11% penetration of JOANN's sales, plus 40 basis points to last year and over 600 basis points to fiscal year '20.\n\nOmni revenue continued to outpace total sales for the quarter with a moderate 4% decline compared to last year. Backing out the challenged technology business, which penetrates higher online, sales were flat for the quarter. We've been able to maintain much of our COVID lift to our online business as Q3 sales increased 126% as compared to fiscal year '20. Importantly, over the past few days, we have worked hard to improve our omni profitability -- the past few years -- sorry about that.\n\nOur profitability and that trend continues with respect to both our gross and our net omni margin. To further enable our omni efforts in October, we officially began filling orders out of our multipurpose distribution center in West Jefferson, Ohio. This distribution center will enable us to reduce split shipments, improve line fill rates, and expand our assortment tail. We are ramping up the production capability as we speak.\n\nAnd the impact of this holiday season will be nominal. However, we anticipate that the impact on value creation will grow substantially and meaningfully over time. Also related to our online business and online selling competitors shut down near the end of Q3, and we are very encouraged by the sales increases that we are seeing thus far. Now, let me shift to what we are seeing as we are in and moving through Q4.\n\nWe remain cautiously optimistic about our fourth quarter, which we call is our largest and most important quarter due to the seasonality of our business. We typically provide more interquarter color for Q4 on this earnings call than we do for other quarters simply given how material it is to our annual results. As we are now in the midst of the holiday season and less than two weeks from Christmas, I have a high level of conviction that we have been doing the right things right with respect to what we can control in order to win the day with our customers. Our assortments are relevant, our in-stocks are strong, and our promotional offers are competitive.\n\nBased on the voice of the customer and our Net Promoter Scores, our operating metrics, including our customer service remain at all-time high comparison levels at JOANN, even despite the labor pressures that JOANN and most service lead companies are experiencing. November started slower than we anticipated, and, indeed, there seems to have been some cycling of last year's fear of missing out from clogged supply chains leading to an early consumer holiday shopping spree. Having said that, our pace has picked up with our Black Friday and Cyber Monday events and continued momentum into December. We anticipate finishing the fourth quarter with solid sales momentum as we move out of this fiscal year into next.\n\nNow, let me shift to a few of our major focus areas moving forward. There is no denying the fact that the current inflationary environment has driven massive annual cost increases and has taken a significant toll on both our cash flow, as well as our operating earnings. Fortunately, we are seeing stabilization across our cost structure and deflationary opportunities are now arising based on healing supply chain, stabilized commodity prices, and the strength of the dollar. To be successful, we are rethinking and taking fresh eyes to all costs and are working to root out anything that is not adding imminent value.\n\nI can assure you we will leave no stone unturned in order to strengthen our balance sheet and return to the company to double-digit EBITDA margins as soon as possible, while maintaining our focus on a strong customer experience. In that vein, in October, we launched a program that we have coined as focus, simplify, and grow, which is targeting approximately $200 million in annual cost reductions to be fully delivered by early fiscal 2025. We anticipate that 50% of these savings will be supply chain related, 30% will be from COGS improvements, and the balance will be from reductions to overhead costs. We also expect additional cash savings from other adjustments we are making to the business in areas such as capital expenditures and working capital.\n\nOf note, we anticipate the majority of supply chain savings to come from reductions in ocean freight costs, and the majority of these savings will offset the phase out of the ocean freight adjustment, which we have been making over the past five quarters in which we anticipate will be fully eliminated in the first half of fiscal year '24. While we are off to a good start, it's still early in the process. And, therefore, we will be providing updates on this effort in future quarters. I also want to comment briefly on our dividend.\n\nAs announced in our earnings release, we made the decision to pause our quarterly cash dividend payments. As a public company, our dividend has been an important part of our capital allocation strategy. This decision was not made lightly. However, we find ourselves in a period of record inflation, rapidly rising interest rates, and a more likely than-not recession.\n\nNo priority can be more important in working to ensure that we can successfully weather any storm while not compromising on the most critical business investments, business investments that are critical to winning with our customers and also creating significant shareholder value long-term. We fundamentally remain committed to returning capital to shareholders and being responsive to the needs of all of our key stakeholders. And this pause does not preclude us from resuming our dividend at a later date. I would like to close out with some very exciting words regarding two of our blue ocean initiatives, the first of which is the SINGER DITTO, our 50-50 joint venture with SINGER, Viking, and PFAFF.\n\nDITTO is a revolutionary product and platform for sewers and craft enthusiasts everywhere. We have been working on this initiative for over four years and now nearing launch during New York's Fashion Week in February. Units are in production and being shipped as we speak, and we will be launching in the United States in mid Q1 of the next fiscal year. As I've said many times, traditional sewing patterns are both the heart of selling projects, as well as the most painful part of the process, as the format is literally not changed since the 1800s, in fact, since the days of Abraham Lincoln.\n\nOur patented DITTO system will allow customers to turn patterning into the most fun part of the sewing process using an AI platform integrated with a digital laser projector system that will enable a multitude of designs and permutations and literally take so is from ideation to sewing in minutes versus hours. Of note, DITTO receives one of the highest ever purchase intent scores by our external design partner, a partner who has over 1,300 commercialized patents. There are about 30 million households in the U.S. alone that actively sew and a much greater number in the 180 plus countries SINGER, Viking, PFAFF, and their respective dealers operate in.\n\nWe believe that many of these sewing households would like to have access a DITTO. In fact, DITTO has been vetted with expert seamstresses, design students, and beginner sewers and crafters and the like, and acceptance and excitement across the various constituents is universal. In the coming months, we are working on a way to bring -- to best bring into life the DITTO for all of our stakeholders so that you can see it in action firsthand and get a better idea as to why this is so revolutionary. The second blue ocean I will briefly mention today is our wholesale initiative, which is in the early innings but exceeding our internal expectations based on revenue contribution.\n\nWe signed up over 200 new B2B customers in the third quarter, and we have significant momentum with additional customers as well. The commercial website for our marketplace platform is scheduled to launch over the next two months. This website will provide greater operating efficiencies with added checkout capabilities for our B2B wholesale customers. So, let me just close by thanking all of you for listening today.\n\nWhile we have faced a series of challenges over the past few years, including Section 301 tariffs, record inflation, and rapidly rising interest rates, we have also had many reasons to be optimistic. JOANN, starting with our stores, has a highly resonant and differentiated customer proposition that is very hard to replicate. Our omni business continues to gain momentum and is prime for significant profitable growth. Input costs, including supply chain costs, have reached an inflection point from highly inflationary to deflationary, and we are organizing to capitalize on the reversing trend and capture significant value.\n\nAnd lastly, our blue ocean growth initiatives are now coming to fruition and hold the promise to create significant value. DITTO specifically has potential to take an entire sewing industry to an entirely new level of technology, engagement, and fun. These initiatives, combined with our recent business momentum, give me optimism that we are on the right path as we transition from fiscal 2023 into fiscal 2024. And with that, I'll turn it over to you, Scott.\n\nScott Sekella -- Chief Financial Officer\n\nGood afternoon, and thank you, Wade, for the introduction and a warm welcome. I'm very excited to join the JOANN team and eager to meet many of you joining us on the call today. JOANN's leadership position in the sewing and crafting industry is certainly well documented. Although I joined the organization recently, I've been particularly impressed by JOANN's strong cultural foundation, and I look forward to the opportunity to contribute to JOANN's continued success.\n\nAs an organization, JOANN has experienced significant external cost pressures over several years now. More recently, we've also seen a noticeable shift in spending patterns by consumers who are prioritizing consumer staples and essentials over discretionary items. In what is now an increasingly uncertain economic environment, we are taking the opportunity to reset our cost structure, simplify and streamline our operations, and refocus our efforts for growth opportunities in areas that will maximize our long-term profitability. We also intend to capitalize on the stronger dollar in our sourcing efforts and take advantage of easing supply chain costs to generate greater operational efficiencies.\n\nWe firmly believe that recent challenges provide us with the unique opportunity to carefully reassess our existing operations, and nothing is off limits. As Wade mentioned, we launched our focus, simplify, and grow initiative and are targeting approximately $200 million of annualized cost savings by the early portion of fiscal 2025. I'm excited to see how the organization has embraced this challenge and tackled it head on. These initiatives are intended to combat inflationary pressures we have experienced and create financial flexibility during these uncertain times.\n\nI would now like to recap our third-quarter results and then provide some additional color about our near-term outlook. As Wade touched on earlier, we experienced some deceleration in our sales trends during Q3 as the quarter progressed, particularly toward the end of the quarter. Net sales for our third quarter totaled 562.8 million, a decline of 7.9% compared to last year with total comp sales decreasing by 8%. Relative to pre-pandemic levels in the third quarter of fiscal 2020, our total comp sales were slightly negative, declining by 1.1% over the corresponding period.\n\nWhile Halloween was a significant bright spot in Q3, we experienced some pullback in demand for fall seasonal categories, as well as continued softness in our craft technology business. Our average ticket increased by 1% in the third quarter over last year, driven by price increases and partially offset by fewer items per basket. Our e-commerce or omnichannel business declined by 4.4% versus last year. Our omni business continues to outpace our overall sales performance and has more than doubled relative to pre-pandemic levels.\n\nGoing forward, our new multipurpose distribution center remains the cornerstone of our online strategy, and we are focused on bringing it to full capability. Over the long term, it will drive significant operational efficiencies, improve fill rates, and reduce split orders. On a GAAP basis, our gross profit in Q3 was 281 million, a decrease of 11.9% from last year and a decline of 1% from pre-pandemic levels in fiscal 2020. We absorbed 18.5 million of excess import costs during the quarter.\n\nWhile this figure reflects a 7.2 million increase over last year, the amount was lower than expected as we continued to benefit from improving conditions in the spot market. After adjusting for excess import freight costs for both corresponding periods, our gross profit of 299.5 million declined by 9.3% from last year. Our core merchandising or POS margin was slightly higher compared to last year in spite of deeper promotional activity that we incurred late in the quarter in relation to fall, seasonal, and floral categories. While up close to 5% from last year, our average unit retail metric moderated slightly in Q3 on a sequential basis due to increased promotional intensity.\n\nConcurrently, our average unit cost increased on a sequential basis. However, these costs were anticipated. As we communicated in our previous earnings call, we've continued to experience spillover effects from higher inventory costs incurred during the peak period of last year's supply chain headwinds. It typically takes six months or more for inventory costs to work their way through our P&L.\n\nOnce we complete the process of renegotiating our contracts for next year, we expect the outlook for average unit cost to improve in fiscal 2024. Our gross margin on a GAAP basis was 49.9% in Q3, a decrease of 230 basis points from last year. In addition to the impact of excess import costs, we experienced higher domestic freight expense as a result of higher carrier rates and fuel costs. Since we are now cycling the impact of extremely high ocean freight costs from the back half of last year, the year-over-year decline in our GAAP gross margin was much more moderate in Q3 and compared to the 730-basis-point decline in the prior quarter.\n\nAfter adjusting for excess import freight costs, adjusted gross margin of 53.2% represents a decrease of 80 basis points from last year, driven by the timing of clearance activity, increased carrier and fuel rates, as well as split shifts. On a sequential basis, the decline in our adjusted gross margin in Q3 was more moderate, compared to the 150-basis-point decline in the prior quarter. As Wade mentioned in his remarks, we are encouraged by the fact that we are finally reaching an inflection point with regards to supply chain costs and cost of goods inflation. Of particular note, excess import freight costs have now effectively transitioned from headwinds to tailwinds and we expect that will be clearly reflected in the fourth quarter from a P&L perspective.\n\nThat said, we realized 32 million of cash benefit from lower ocean freight rates in Q3. The fourth quarter of fiscal 2023 represents the first of what we expect will be several consecutive quarters of P&L benefit from improving ocean freight rates. In Q4, ocean freight expenses are expected to be around 15 million to 20 million favorable relative to last year from a P&L perspective. On a cash basis, we also expect to realize 15 million to 20 million of improvement in the fourth quarter from lower ocean freight expenses based on favorable comparisons to last year and ongoing improvements in the spot market.\n\nTurning to expenses, our selling, general, and administrative expenses increased by 4.4% from last year. Although we managed to optimize store labor hour successfully during the quarter, our operating expenses were negatively impacted by higher preopening and closing expenses relative to last year and incremental cost for our new multipurpose distribution center in West Jefferson, Ohio. We also cycled a significant reduction to incentive compensation from last year, resulting in unfavorable year-over-year comparisons, as well as experienced higher stock-based compensation expenses from a change in our retirement policy. Our net loss in Q3 was 17.5 million, compared to a net income of 22.8 million over the same period last year.\n\nAdjusted EBITDA in the third quarter was 40.2 million, compared to 72.6 million last year. Moving on to our balance sheet, our cash and cash equivalents were 27.5 million at the end of the quarter. As of October 29, we had 74.5 million of availability on our revolving credit facility. Our long-term debt net at the end of Q3 was close to 1.1 billion, reflecting an increase of 209 million from the same period last year and a leverage ratio of 6.6x as measured by net debt relative to credit facility adjusted EBITDA on a trailing 12-month basis.\n\nThe majority of this increase in borrowing was driven by higher import freight costs that we've absorbed on a cumulative basis over the past year. Our inventory at the end of the third quarter was nearly flat year over year and lower than we anticipated on our last earnings call. We continue to manage our inventory receipts in line with current business trends. The plans that we previously outlined to lower inventory receipts in the back half remain on track.\n\nYou'll recall, on last quarter's call, we indicated that during the back half of fiscal 2023, we would generate a significant amount of cash flow with a particular emphasis on fourth quarter. We still expect the fourth quarter to be cash-flow generative but not to the extent we previously expected. We previously indicated we expected net debt to be in the low to mid 800 million range. We now anticipate around mid 900 million for our year-end net debt.\n\nApproximately half of the increase is due to lower sales in the back half while the majority of the remaining increase is related to timing of inventory receipts. This timing impact will now positively impact Q1 of fiscal 2024 instead of fiscal 2023 as previously expected. We have also narrowed our capital spending plans to a range of 65 million to 70 million for fiscal year 2023. The total number of store projects remains unchanged for fiscal 2023.\n\nThrough the end of the third quarter, we completed 30 projects with another four planned for the fourth quarter. Consistent with our intense focus on capital allocation, we will continue to assess the macro environment and adjust our capital spending in fiscal 2024 accordingly. Overall, we remain committed to enhancing the in-store experience, and our store refresh program remains a key part of this growth strategy. As Wade mentioned, we've carefully made a decision to pause our dividend at this time to focus on strengthening the balance sheet and improving liquidity.\n\nI also want to clarify that the cash impact from the pause in our dividend is incremental to the 200 million of planned cost reduction. The steps we are taking to streamline our operations are intended to both respond to a rapidly evolving consumer backdrop and to offset the wide range of cost pressures we have -- that have taken shape for several years now. To recap, we are focused on cash generation and are positioning our business for a significantly improved cash flow outlook in fiscal 2024. It's also clear that consumers are being more selective and demanding more value in the current economic environment, which is defined by continued uncertainty and by a noticeable pullback in discretionary spending.\n\nThese challenges provide us with a fresh opportunity to reset the bar through cost optimization and to better position ourselves for growth once demand and economic conditions begin to normalize. With that, we'd be happy to take your questions. Operator.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] At this time, we will pause momentarily to assemble our roster. And the first question will be from William Reuter with Bank of America.\n\nPlease go ahead.\n\nWilliam Reuter -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good afternoon. So, in terms of your savings, the $200 million program you expect to achieve by early fiscal year 2025, do you have a sense for what you may be able to achieve during fiscal year '24 at this point?\n\nWade Miquelon -- President and Chief Executive Officer\n\nYeah. We aren't putting out specific numbers, but, you know, I would suspect it would be very substantive. I would hope more than half. I mean we already have a lot of runway on the supply chain savings, as spot rates are normalizing, in particular, that's a very, very big number.\n\nBut as we go forward in future calls, we are going to try to provide a little bit more guidance in terms of the cadence of this. But we are actually starting to incur savings on all the three core work streams. Some will take longer than others. But I think supply chain is one that can be most immediately realized.\n\nI would also though just warn you that, first, we're going to see the cash benefit of these then we are going to see the P&L benefit because some of these things such as ocean freight and COGS, in particular, those two items work their way through our inventory. So, there can be a six-month lag before some time to the cash benefit to the time of the P&L benefit.\n\nScott Sekella -- Chief Financial Officer\n\nYes. Hi, William. It's Scott. Yes, I just want to reiterate what Wade said there, particularly at the end, that we do expect to see this impact on a cash basis first and more significantly than on an EBITDA basis in fiscal 2024, because with both ocean and those product cost savings, which is a good chunk of that 200 million, that's going to need to roll through the balance sheet.\n\nAnd, oftentimes, those costs take six months or more to impact from an EBITDA perspective.\n\nWilliam Reuter -- Bank of America Merrill Lynch -- Analyst\n\nGreat. That makes sense. And then just a second question for me. It sounds like it's the more discretionary, I assume higher ticket items, which may be experiencing greater softness.\n\nI guess, is that the case, and are you seeing divergent trends between arts and crafts versus your core sewing products?\n\nWade Miquelon -- President and Chief Executive Officer\n\nYes. I'll say a few things, and maybe Chris can build on it. You know, I think it's -- what we see is one is in kind of the technology sector. I think some of what we see there is I don't think is a factor as much discretionary spend is the fact that there was just so many -- so many sales during the pandemic.\n\nSo, you had a little bit of saturation on the core products that will eventually work its way through. But I think where we are seeing kind of the tightening is actually really in our seasonal product, not the basic so much, but it's the -- in particular, it was the fall decor. We have a strong Halloween with the fall decor where people chose not to spend the money to decorate, as well as some of the other seasonal floral items that go with that. But on the core basics, you know, we are seeing actually pretty strong, steady demand.\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nYeah, I'd agree, Wade. And hi, William. It's Chris. You know, one of the things that we are seeing is our core customer is really strong and strengthening, especially the more advanced sewer, the more advanced crafter on both sides of the house.\n\nSo, we are seeing some very good underlying trends in a number of our categories, both in craft and sewing. It's just that we are also, at the same time, dealing with some headwinds from those pandemic boosted categories over the past couple of years in craft technology and then more cotton-related fabrics, which were the two categories that really had the biggest boost over 2020, 2021 calendar.\n\nWade Miquelon -- President and Chief Executive Officer\n\nI'd also say as we sit here, I read on -- as we look at the fall of decor, it appears that people were less inclined to spend money there. But on the holiday sales there, I think a bit of that way I talked about that fear of missing out where they were waiting a little bit longer than last year, looking for deals versus last year. People were afraid there wouldn't be anything to buy because of supply chains. And I think that's part of why we are saying that our most recent read here is showing some pretty good signs of traction.\n\nWilliam Reuter -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. Very helpful. Thank you very much.\n\nOperator\n\nThe next question will be from Paul Kearney from Barclays. Please go ahead.\n\nPaul Kearney -- Barclays -- Analyst\n\nHey, everybody. Thanks for taking my question. Just a quick clarification. On the $200 million of cost savings, I think you said some of this is from the excess import freight costs that was already recognized.\n\nOne, is that correct?\n\nScott Sekella -- Chief Financial Officer\n\nSo, Paul, it's Scott. Yeah. I mean, a good chunk of the 200 million is going to be from reduced ocean freight, but we haven't really recognized that. We are just going to see the first P&L benefit here in Q4 around 15 million to 20 million.\n\nIt was -- the ocean freight was still a headwind from a P&L perspective in Q3.\n\nWade Miquelon -- President and Chief Executive Officer\n\nAnd so, recall, a lot of these savings will eliminate our add back real cash savings with elimination of add back, which we are going to phase out next year. And then how far below what we've called normalized will remain to be seen as we get through it. Again, we are pretty encouraged by the current spot markets out there and some of the other signs, but not everything will be in the adjusted EBITDA component.\n\nPaul Kearney -- Barclays -- Analyst\n\nOK, thanks. And secondly, can you just comment maybe on the promotional environment you're seeing? Has it become deeper following Black Friday events, and how is it kind of progress to the holiday season? And what are you expecting that to look like into next year? Thanks.\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nSure, Paul. It's Chris. You know, the promotional environment in many ways is still a very rational environment that we've talked about. I would say the one area being the exception, I would say, from both us and competitors, has been some of the seasonal categories that we referenced.\n\nSo, whether that was fall product in Q3 or some holiday product here in Q4, you know, that's been where we've chosen to be competitive and aggressive and ensuring we win the day. But I would say on the balance of our business, which, again, most of our business is basic versus being seasonal, still pretty rational.\n\nPaul Kearney -- Barclays -- Analyst\n\nThanks. Best of luck.\n\nWade Miquelon -- President and Chief Executive Officer\n\nYes, I just would add on our media competitor space, last year, it was hard to get products in. One of our competitors was very thin, product came in a little bit later. This year, I think everybody has had a lot of product in stock. And so, I think it's been an environment where there's plenty to buy out, a lot more than it was a year ago.\n\nOperator\n\nThank you. And the next question will come from Laura Champine with Loop Capital. Please go ahead.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nHey, thanks for taking my question. On the 200 million in cost savings that you've targeted, how much of that are you expecting to come from you -- from macro things such as the spot rate improving, etc? And how much of it do you need to drive internally with your own execution?\n\nWade Miquelon -- President and Chief Executive Officer\n\nProbably, if I had to just kind of swag it, I'd probably say about 30% to 40% is kind of macro. These are those spot markets moving. It doesn't mean it's just going to hand it to you. There's still a lot of work.\n\nAnd then, you know, even on the COGS side, right, why you've got input cost and other things moving. There's a lot of work to do there to open up new bidding sources. So, that probably -- you might have your own math. But I probably would say 40% kind of macro, 60% heavier lifting than that.\n\nScott Sekella -- Chief Financial Officer\n\nYeah. I would agree. This is Scott. I would agree with the 40%.\n\nA big chunk of this is going to come from the product cost side, which is a lot of individual negotiations and discussions, as well as just attacking our cost structure overall.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nAnd is it fair to say that those cost cuts at this point, you don't expect those to lead to lower pricing?\n\nWade Miquelon -- President and Chief Executive Officer\n\nI mean we are separating the two. I think right now, we feel that we've been -- you know, we are pretty competitive out there in terms of our offers, and we make adjustments where it need to be, but I don't feel right now that we feel that we are not competitive. So, I really kind of separate A from B. We have incurred over the past two years on an annualized basis over $200 million of incremental costs if you add it up.\n\nAnd now, at least relative to our business, all the kind of core underpinnings, all the input and feedstocks are moving in a deflationary manner. And so, we are going to go clawback.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nThe next question will come from Cristina Fernandez from Telsey Advisory Group. Please go ahead.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nGood afternoon and thank you for taking my question. I wanted to ask on the 200 million, are there any savings related to stores that have changed your plan to open stores or take on remodel projects or any changes in labor as it relates to store base?\n\nWade Miquelon -- President and Chief Executive Officer\n\nYes. So, two things, and Scott can go into more detail. You know, we are going to have a capital and working capital cash savings apart from the 200 over and beyond, as well as the dividend over and beyond. So, the 200 is a component of the total cash that we will be driving.\n\nWe are going to adjust the number of stores and [Inaudible] we do, although we are not turning the engine off for example. I would say there are some -- we say that everything is on the table, but one of the things that's very sacred to us is making sure they have a great in-store experience. So, we are not going to do anything on our store labor front that's going to compromise where we are right now, which is kind of actually in some of the rarefied air for that customer service metric. It doesn't mean there might be some opportunity there, but that's something that we are going to protect at all costs.\n\nScott Sekella -- Chief Financial Officer\n\nHi, Cristina, it's Scott. Just to reiterate Wade's point, part of our initiatives, looking at how do we optimize store labor without sacrificing that in-store experience. And that could mean reducing. That could also mean increasing to drive incremental top line.\n\nSo, we will be taking a look at all of that.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nAnd then my second question is in relation to the debt balance. So, I understood your point that with lower sales there'll be -- and the timing of the inventory, you won't get to that 800 to 850 target. But when do you think you can get there? And do you have any target you can share as far as reducing debt in the next, you know, 12 to 18 months?\n\nScott Sekella -- Chief Financial Officer\n\nYes. So, we will provide more color on fiscal 2024 on our next call. But like I said, we do plan to end the year around the mid-900s. And with the cash generation that we are planning from the focus, simplify, grow, from the working capital initiatives, and the capital expenditures, just to name a few, we do expect to pay down debt in fiscal 2024.\n\nBut, you know, not ready to give more color on exactly how much, but I do expect it to come down in fiscal 2024.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nOK. Thank you. And one last one. What would it take to reinstate the dividend?\n\nWade Miquelon -- President and Chief Executive Officer\n\nI think part of what [Inaudible] little bit more visible on where the world is going, right? When you look at the pace of increases of rates about the fastest in 30 or 40 years, when you look at the inflation, which I believe is turning is the warmest turn for our inputs, it's also, I think, turning for the consumer. I just take a little bit of time to just make sure we understand where the world is going. I mean we didn't take it lightly. But on the other hand, you know, we absolutely want to be ahead of it and drive cash relentlessly just to make sure that we can weather any storm if, in fact, there is a storm.\n\nBut there is a lot of uncertainty out in the world. I actually have said this many times, I'll say it again, but worst thing for our business is stagflation, which I think relative to our business, that's where we've been stuck to last year. You know, I take a recession over stagflation because a consumer being squeezed and inflation from all angles is a much tougher picture than having inflation down and have some compression on growth. So, not that that recession is the fact of certainty either, but I think we just want to make sure that we are doing everything possible to strengthen the balance sheet, generate as much cash as we can, to also invest in the core initiatives.\n\nWe talked a little about the blue oceans. We've got an incredible opportunity there. You know, our omni business is actually very, very strong and getting the underpinning engine here running is going to open up a lot of opportunity. Our core customer proposition is pretty strong too, and we will be at the first quarter cycling what was a really tough two-year comp.\n\nSo, I think we'll start to gain some momentum there, too. But we just want to make sure we don't get put into a position where, again, with rising rates, inflation, consumer squeeze everything where we don't have room to invest in the things that are going to make us great longer term as well. So, I don't know I've answered your question, but I think it's just over the next year, let's just see where the macro environment unfolds. But we are going to [Technical difficulty] and hope for the best here.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nOK. Thank you, and good luck this holiday season.\n\nWade Miquelon -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] The next question will be from [Inaudible] with Beach Point Capital. Please go ahead.\n\nUnknown speaker\n\nHi. Thanks for taking my questions. First, do you guys have any sense of how your market share is trending versus your peers?\n\nWade Miquelon -- President and Chief Executive Officer\n\nWe have several ways we triangulate. As you know, these are very fragmented industry. There's no clear read. From everything we can gather, you know, we've held our own across the board kind of everywhere with a few core categories we think we've actually built up some meaningful share.\n\nI'm not going to comment on what those are, but we are pretty certain that we haven't given anything up.\n\nUnknown speaker\n\nOK. And in terms of inventory, do you have a sense for -- like how do you feel about your current inventory levels? Do you guys feel that there will be any need to sort of go deeper into promotions to reduce inventory? And do you have a sense of that -- if you're in the same situation as your competitor is there?\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nHi. It's Chris. So, from an inventory standpoint, we feel good about our quality. Some of the actions that we took in terms of moving up our Black Friday event to start a little bit earlier than it did last year, we are happy with those results and happy with the sell-throughs we are seeing in our holiday product, which is really -- that's what's maybe the risk opportunity for the quarter, but we feel good about our current position.\n\nAnd from a clearance and a basic standpoint, we are as clean as we were in Q3 and continue to see that being the case for the end of the [Inaudible]\n\nWade Miquelon -- President and Chief Executive Officer\n\nYeah. That level we quoted in Q3 was about 5% earmarked for that. It's about the same now. That is pretty much for this business as low as we've ever been.\n\nSo, we are in very good stead.\n\nUnknown speaker\n\nAnd do you feel like your main competitors are in a similar position, or might they push more on promotions?\n\nWade Miquelon -- President and Chief Executive Officer\n\nI'm sorry. My competitors push more on promotions? \n\nUnknown speaker\n\nLike are they seeing inventory position, or do you think that they might get more aggressive?\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nYeah. I think that we see competitors being aggressive in similar categories as us. And, you know, some competitors, it's a larger percentage of their business than it is of ours. So, I think for us, we feel good about the actions we've taken and the quality of the inventory.\n\nWade Miquelon -- President and Chief Executive Officer\n\nYeah.\n\nUnknown speaker\n\nOK.\n\nWade Miquelon -- President and Chief Executive Officer\n\nI think we are -- again, where we've seen maybe more of that aggressiveness is a rational place to be, whereas last year there was -- the last year [indiscernible] product this year, there's a lot more of that seasonal holiday products. So, everybody wants to move that. But again, the vast majority of our product, the basics to day and day out, we are not seeing that.\n\nUnknown speaker\n\nAnd lastly, any additional color you guys can cite on how like the Christmas season is progressing and how seasonal and 4Q have trended through Black Friday and through now?\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nSure. You know, the month, I think, started hard for a lot of folks in retail. As I looked across the spectrum, you saw a number of companies pull their Black Friday events forward starting earlier. We certainly had a competitor do that -- we did as well.\n\nAnd we've seen the customer respond to those promotions, whether it was Black Friday or Cyber Monday. And so far, the momentum has been similar in the month of December.\n\nOperator\n\nThank you. And our next question will be from David Lantz from Wells Fargo. Please go ahead.\n\nDavid Lantz -- Wells Fargo Securities -- Analyst\n\nHey, guys. Thanks for taking our questions. I was just curious if you could talk through some of the gross margin buckets in the quarter outside of the 145-basis-point excess freight headwind?\n\nScott Sekella -- Chief Financial Officer\n\nYes. So, if you -- hi, David, it's Scott. If you look at Q3 gross margin on an adjusted basis, we were down 80 bps year over year. If I break that down from a POS standpoint, we were up 10 bps because our AUR was slightly higher than our AUC.\n\nClearance reserves, though, were unfavorable, 40 bps. Then from the domestic freight side, we had increased carrier and fuel rates, which were about unfavorable 30 bps. And then increased split ships were unfavorable about 15 bps.\n\nDavid Lantz -- Wells Fargo Securities -- Analyst\n\nGot it. That's helpful. And then with the cost savings efforts, curious how you're thinking about SG&A in Q4 relative to prior expectations for being kind of flat in the second half?\n\nScott Sekella -- Chief Financial Officer\n\nYeah. I mean a lot of the focus, simplify, grow impacts SG&A will be more in fiscal '24 than Q4. I do -- I expect Q4 SG&A to be a little bit in line with how Q3 progressed. Q3 was up year over year, as we mentioned with the new distribution center.\n\nThe other piece is where we are lapping some favorable incentive comp, and then we had to change our stock-based compensation due to a change in retirement policy. I expect overall incentive comp to be slightly favorable in Q4 versus a year ago as we lap some of the items there.\n\nDavid Lantz -- Wells Fargo Securities -- Analyst\n\nGot it. Thanks.\n\nOperator\n\nAnd our next question is from John Nusbaum with 400 Capital. Please go ahead.\n\nJohn Nusbaum -- 400 Capital Management -- Analyst\n\nHi. Thanks for taking all the questions. With regard to the 200 million in cost savings, did you say already what the cost or the expense of achieving the 200 million will be over the 18-month period?\n\nScott Sekella -- Chief Financial Officer\n\nSo -- hi, John, it's Scott. So, at this point, we are not planning or anticipating restructuring charges or anything like that. There could be some as we get into it but nothing that we've identified at this point. But, you know, as Wade said, as we go through the program, we will keep you updated.\n\nAnd if we do incur some, we will obviously let you know.\n\nJohn Nusbaum -- 400 Capital Management -- Analyst\n\nThank you very much.\n\nOperator\n\nLadies and gentlemen, this concludes our question-and-answer session. I would like to turn the conference back over to management for any closing remarks.\n\nWade Miquelon -- President and Chief Executive Officer\n\nI would just like to thank all of you for your generous listening and dialing in today. We work hard every day in behalf of all of our constituents and we will keep doing it. I think we've got a great opportunity here. It's ours to go get, and we're after it.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAjay Jain -- Head of Investor Relations\n\nWade Miquelon -- President and Chief Executive Officer\n\nScott Sekella -- Chief Financial Officer\n\nWilliam Reuter -- Bank of America Merrill Lynch -- Analyst\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nPaul Kearney -- Barclays -- Analyst\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nUnknown speaker\n\nDavid Lantz -- Wells Fargo Securities -- Analyst\n\nJohn Nusbaum -- 400 Capital Management -- Analyst\n\nMore JOAN analysis\n\nAll earnings call transcripts"
}