{
  "companyName": "Evelo Biosciences, Inc.",
  "companyTicker": "EVLO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/evelo-biosciences-inc-evlo-q2-2022-earnings-call-t/",
  "content": "Evelo Biosciences, Inc. (EVLO 1.26%)\nQ2 2022 Earnings Call\nAug 11, 2022, 7:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Evelo Biosciences conference call to discuss its second quarter 2022 business highlights. [Operator instructions] Please be advised that this call is being recorded at the company's request. At this time, I'd like to turn the call over to Kendra Sweeney of Evelo. Please proceed.\n\nKendra Sweeney -- Head of Investor Relations\n\nThank you. This morning, we issued two press releases, one announcement that includes a summary of our recent business highlights and second quarter financial results and another regarding the succession plan for CEO Simba Gill. These releases and a recording of the call are available at www.evelobio.com under the Investors tab. Speaking on the call today will be Simba Gill, CEO; and Lord Ara Darzi, chair of the Evelo board of directors.\n\nBefore we begin, I would like to remind everyone that statements made during this conference call that do not relate to matters of historical fact, including statements about our objectives and anticipated clinical milestones, the impact of any of our product candidates and the timing and results of any clinical studies, should be considered forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements are intended to be subject to the safe harbor protection provided by the Reform Act. Actual results could differ materially from those indicated by the forward-looking statements due to the impact of many factors. Participants are directed to the risk factors set forth in Evelo's quarterly report on Form 10-Q for the period ended June 30, 2022, and the company's other filings with the Securities and Exchange Commission.\n\nAny forward-looking statements made today speak only to Evelo's operations as of today. Evelo disclaims any duty to provide updates to its forward-looking statements even if subsequent events cause the company's views to change. It is now my pleasure to pass the call over to Simba.\n\nSimba Gill -- Chief Executive Officer\n\n-- to review our progress during the second quarter. It's a very exciting time at Evelo, with a number of important clinical catalysts expected over the next 6 to 12 months. Based on positive Phase 2 data in psoriasis, we are in discussions with health authorities and are waiting on guidance for advancing EDP1815 into registration trials, which we anticipate hearing that guidance by year end. We're also expecting two Phase 2 readouts for EDP1815 in atopic dermatitis in the first and second quarters of next year.\n\nWe also anticipate Phase 2 psoriasis data for EDP2939, our first microbial extracellular vesicle product candidate, in the second half of next year. We know our platform has broad applicability based on positive preclinical and clinical data showing inflammation-resolving effects across the major types of inflammation, Th1, Th2 and Th17. This creates a significant potential opportunity for Evelo to expand beyond dermatological conditions to the arthritis, inflammatory bowel disease, asthma and many other inflammatory diseases. Given the integrated profile of EDP1815, which is not just effective, but also has placebo-like safety and tolerability, oral delivery and affordable pricing, we anticipate broad usage as a foundational therapy across all stages of psoriasis, atopic dermatitis and other inflammatory diseases.\n\nThis includes the treatment of the significant population of patients with mild and moderate disease and maintenance therapy for more severe patients. Safety and tolerability are critical parameters for both adults and children with diseases such as psoriasis and atopic dermatitis and for the clinicians and nurse practitioners who treat them. Our product candidates have been tested in hundreds of patients and have been shown to have safety and tolerability comparable to placebo. EDP1815 resolves inflammation without suppressing immunity.\n\nThis is a unique profile. Switching topics to people. In order to achieve our goals, we need to have the right team in place. I'm pleased that we continue to attract tremendous talent to Evelo.\n\nWe recently announced the appointment of Marella Thorell, as Evelo's chief financial officer effective September 1. Marella is an accomplished financial and operations leader. Her experience will be extremely valuable as we move toward late-stage clinical development and commercialization of our products and scale and build Evelo. Lastly, as you may have read, we announced my succession plan this morning.\n\nWe started Evelo seven years ago and I'm very proud of the remarkable discoveries, platform and clinical development progress that we have made. In that time, our team has done what most thought impossible. Firstly, we have uncovered the biology of the small intestinal axis and opened up a new field of medicine that we are confident will be at least as important as antibodies have become. Secondly, our team has discovered a new type of medicine orally delivered, single strains of microbes and microbial extracellular vesicles that are gut-restricted, yet resolve inflammation throughout the body.\n\nThe first of these product candidates, EDP1815, is moving toward registration trials in psoriasis and is in Phase 2 in atopic dermatitis. We expect that it will be used broadly to treat inflammation and has the potential to be one of the most important drugs in global healthcare. And third, our team is creating a completely disruptive, volume-driven business model focused on treating previously overlooked patient populations, those with mild or moderate disease, with an effective, safe, well-tolerated oral therapy that is also affordable. Evelo is in a strong position with a bright future and the time is right for me to step into the role of Chair and to find and support a great CEO for the next phase of our growth.\n\nAra and the rest of the board will work to find a successor, and I will work with them to ensure a seamless transition with the rest of our leadership team. Until my successor is announced, I will continue as CEO and president. Evelo is my baby, and I love this company and the team that has created it. I'm a strong believer in our science and look forward to continuing in the next chapter as I move into the Chair role.\n\nOnce we have found a new CEO, in addition to my chair role at Evelo, I will be returning to flagship pioneering to help launch, grow and guide several translational platform companies. It is exciting for me to be able to work with the next generation of biotech companies and to work closely with the next generation of biotech leaders. With that, I'm going to turn the call over to Ara to give some brief remarks about the CEO search.\n\nAra Darzi -- Board of Directors\n\nThank you, Simba. It is a pleasure to be here today. On behalf of the board of directors, I want to thank Simba for the exceptional leadership he has shown in building and growing Evelo since 2015. The company is well positioned due to his hard work and also his commitment.\n\nAs he mentioned, Simba will continue as CEO and president until we have found a successor and, thereafter, a chair. We have agreed -- we have engaged with the executive search firm, Spencer Stuart, to help with this search and will work closely with them to ensure the successor has all the leadership characteristics to be successful as a CEO of Evelo. I look forward to continuing to work with Simba, the board and the leadership team of Evelo. The company is at an exciting stage, and having completed a recent financing, is well positioned to execute on a series of critical clinical milestones.\n\nWith that, I will turn the call back over to Simba.\n\nSimba Gill -- Chief Executive Officer\n\nThank you, Ara. To wrap up, let me summarize the upcoming key catalysts and milestones. Including by year end where we expect feedback with health authorities with respect to moving EDP1815 in psoriasis into registration trials, we also anticipate initiation of dosing of EDP2939, our first clinical microbial extracellular vesicle candidate. In the first quarter of 2023, we expect data from the first three cohorts in the Phase 2 trial of EDP1815 in atopic dermatitis.\n\nIn the second quarter of 2023, we expect data from the fourth cohort with the capsule with the faster release profile in the Phase 2 trial of EDP1815 in atopic dermatitis. And in the second half of 2023, we expect Phase 1 and Phase 2 data for EDP2939 in psoriasis. Our data prove that we can harness Sintax to open up a new field and type of medicine that goes far beyond existing biotech and pharma products and opens up the treatment of all stages of inflammation with potential medicines that are orally delivered, convenient, effective, safe and well tolerated. This puts the future of EDP1815 and Sintax medicines into a strong position and, most importantly, brings us even closer to realizing our vision.\n\nNone of this would have been possible without the hard work and dedication of the Evelo team and our partners. Thanks to them, and thank you, and we will now open the call for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from Chris Howerton from Jefferies. Your line is open.\n\nChris Howerton -- Jefferies -- Analyst\n\nHey. Good morning. Thank you so much for taking the questions, and obviously, a pretty exciting time for the company. So I guess two questions for me.\n\nOne would be given the kind of stage of your company and the cash runway that you have, what types of activities might we expect in terms of capital preservation or certain kind of cost-saving measures moving forward, if any? And then the second question that I would ask would be with respect to the feedback that you're expecting from the health authorities toward the end of this year. Is there any kind of go, no-go decision moving into pivotal trials? Or is it simply just design features in terms of understanding what the appropriate path for them?\n\nSimba Gill -- Chief Executive Officer\n\nThanks for the questions, Chris. So on cost control, obviously, given the current financial environment is something we're very focused on. We always are and we always have been. We went through a very intense exercise in Q4 of last year in which we looked at critical areas of investment, defined our priorities.\n\nAnd right now, the company is very much focused on investing only in those core priorities. We already cut back in a number of areas in the spirit of making sure we have the cash to get us through the critical clinical milestones that I described while continuing to invest at a reasonable level in the platform. So we've already taken a very strong look at cost and have already taken a number of measures to bring cost under control in a very disciplined manner. With respect to feedback from health authorities, we -- essentially, the critical parameters we're looking for guidance and support from regulation health authorities on is confirmation of Phase 3 clinical design, making sure health authorities are comfortable with all of the tech ops and analytics around the manufacturing side.\n\nWe don't anticipate there'll be any substantive issues. So it should be relatively straightforward, Chris. And we expect, based on that feedback, we'll be moving toward registration some time -- registration trial sometime next year.\n\nOperator\n\nYour next question comes from Joseph Thome from Cowen. Your line is open.\n\nJoe Thome -- Cowen and Company -- Analyst\n\nHi there. Good morning, and thank you for taking my questions. Maybe in terms of the Phase 3 trial design for psoriasis, based on what you know about 1815 right now, maybe what formulation and what kind of dosing profile and frequency would you like to use in the Phase 3 that you think could optimize that? And then maybe looking forward to the atopic dermatitis data next year, is there a specific proportion of patients needing EASI50 that would give you the confidence to move into a pivotal program there as well?\n\nSimba Gill -- Chief Executive Officer\n\nSure. I didn't quite get the second question. Let me answer the first. And then if you don't mind repeating the second question, I'd appreciate that.\n\nBut with respect to dosing and formulation for EASI50 in psoriasis, as you know, Joe, the Phase 2 data we have was positive and we're excited about with that formulation and that dosing, which is once a day with what we call our original formulation moving into Phase 3 trials. That's our anticipation. Having said that, as you know, we recently announced data on a faster release capsule, which has the potential to show significant improvement above and beyond what we've seen already. We'll get data in atopic dermatitis on that faster-release formulation in the second quarter of next year.\n\nAnd if that shows, as it may well, significant improvement in activity in atopic dermatitis, we'll pretty definitely use that in psoriasis. The results should translate from AD into psoriasis in that context. And there's no meaningful risk that there'll be any loss of activity or any safety or tolerability issues. So that's basically how we're looking at it.\n\nThe base plan is to go forward with the original formulation and dosing. If we see a substantive improvement in the Phase 2 cohort four in atopic dermatitis, then we'll use that in the Phase 3 in psoriasis. And it doesn't impact time lines or planning or anything like that for the Phase 3 psoriasis trial. So hopefully, that's helpful on that question, Joe.\n\nAnd then -- sorry, if you don't mind repeating the second question, I didn't quite get it.\n\nJoe Thome -- Cowen and Company -- Analyst\n\nThe second one was just on the Phase 2 atopic dermatitis readout. Is there a certain bar for EASI50 that you're looking for to move forward into a pivotal program? I mean, safety has been so solid. So I assume that's going to be the same here. But if EASI50 is not the key efficacy endpoint that you're looking at, maybe what would you -- what else are you looking at?\n\nSimba Gill -- Chief Executive Officer\n\nYes. No, EASI50 is the key endpoint, absolutely. And as you know, atopic dermatitis has even more unmet need in the mild and moderate population than psoriasis does. There's very little available other than topicals, which patients don't like, as you know, in forced years because they don't have good alternatives.\n\nSo we are looking at EASI50 plus or minus if we saw a 20% separation in patients on drug with EASI50 versus placebo, that would be a clear win. Gray zone would be 15% to 20%. Anything at 20% or above would be a big and very clear win there. And the key is separation from placebo proportion response in EASI50.\n\nAs you know, the big issue with atopic dermatitis trials is placebo response. Patients do tend to respond on the placebo arms. And so you have to look within a study as separation between EASI50 patients on drug and patients on placebo. And as I said, a 20% or greater separation percentage of responders would be a very strong win.\n\n15% to 20% would be greater.\n\nOperator\n\nYour next question comes from Vikram Purohit from Morgan Stanley. Your line is open.\n\nVikram Purohit -- Morgan Stanley -- Analyst\n\nGood morning. Thanks for taking the question. So we had one on 2939. So for this extracellular vesicle product candidate in psoriasis, what sort of differential efficacy impact are you hoping to see here versus what you've been able to demonstrate with 1815? And do you eventually envision these two product candidates being used for different segments of the psoriasis patient population? Or could there be some overlap here?\n\nSimba Gill -- Chief Executive Officer\n\nVikram, so in preclinical models, what we see actually with both 1815 and 2939 is efficacy that is gold standard consistently across all preclinical in vivo models, meaning at least as good as best-in-class antibodies or equivalent small molecules, even steroids, without the side effect tolerability and safety issues. We have not seen that with 1815 in patients. We have seen attractive positive results to the previous questions that were asked that clearly support going into Phase 3 in the mild and moderate population. The scientific question we've got is why are we not seeing in human subjects patients the same level of very high potency consistently in human? So there's room to do even better than we've done right now.\n\nWe see the extracellular vesicles, because of their small size and all the science, both theoretical as well as practical support the thesis that they should get to the surface of the small intestinal wall where the immune sensing is occurring much more effectively than whole microbes. So we see the potential for significant improvement in both level of efficacy as well as proportion of responders. Obviously, the trial is set up to confirm that type of result. Best case, we could get antibody-like efficacy with the microbial extracellular vesicles in the majority of patients.\n\nObviously, that would be an enormous win, which would revolutionize the whole industry if we saw that. The preclinical data supports that as a possibility. If we were to get that level of efficacy, we've got a very nice problem on our hands, which goes to your second question, which is how do we think about segmenting the market? And there's lots of different ways to do that. Vikram, we haven't made that decision yet.\n\nYou could imagine a scenario where we have one product that goes head to head with antibodies, for example, the more severe patient. We keep 1815 for the mild to moderate. We have to look at the data to make that judgment call. So that's how we're looking at it.\n\nSo yes, equally waiting that data in the second half of next year.\n\nOperator\n\nYour next question comes from Kristen Kluska from Cantor Fitzgerald. Your line is open.\n\nKristen Kluska -- Cantor Fitzgerald -- Analyst\n\nHi. Good morning. Simba, best wishes to you during this transition. I know how much you believe in Sintax and know that you'll remain close to the story.\n\nSo the first question I had for you is what work are you integrating into your current and also upcoming studies to better understand some of the durable and deepening responses that you've observed in the past?\n\nSimba Gill -- Chief Executive Officer\n\nThanks, Kristen. Actually, let me just comment on your gracious words about me, Kristen, thank you for that, first of all. And I just wanted to underscore what you said, yes, as I said in my prepared remarks, Evelo is very much my baby. I care deeply about this company and its potential to revolutionize medicine.\n\nSo I'm going to stay very involved supporting the new CEO and the leadership team and the Board when that person comes in and do whatever I can to make sure the new CEO and the leadership team are brilliantly successful in that supporting Chair role. But thank you for your comment. On the question around durability and maintenance, just to recap, maybe for other listeners as well, one of the results that we're very intrigued with from the clinical studies is the fact that even after we stop dosing, we're seeing maintenance of effect for up to 24 weeks in the Phase 2 psoriasis study after we've stopped dosing. And in a significant proportion of patients, we're seeing a deepening of response.\n\nThat's very unusual compared to other therapies where often when patients come off therapy, not only did they return to their original disease state, they often get flare and rebound and can become worse. So very unique to have maintenance with our drug and to have the deepening of response to your question. I know you understand that, Kristen, but I just wanted to ground everybody else. There are few things we're doing.\n\nObviously, preclinically, we're continuing to look at mechanism of action and how this is working. We have very clear evidence at this stage that the effects are driven by conditioning specific T cell subpopulations which circulate throughout the body and are exerting an effect on a sustained basis. That's very exciting in that really what we're able to do with Sintax is to modulate inflammation-resolving T cells through a new area of biology in which we have got restricted drugs that drive that type of effect. You might remember, Kristen, that many decades ago, I led corporate development and strategy of the world's first stem cell and cell therapy company Systemix.\n\nAnd I will maintain my view that I had as a very young man when I was leading strategy there that cell therapy will always be limited because of the complexity of manufacturing administration and safety issues around all of that. So what we've always wanted is something that modulates essentially immune cells, but in an easy, safe, obviously largely reproducible manner. It looks like we've got that. It's really, really exciting.\n\nAnd we'll continue, to your question, to look at preclinically what is going on. But we already know we're modulating T cells that are circulating throughout the body and are exerting those inflammation-resolving effects, very exciting. On the clinical side, obviously, we can't do -- we can't essentially sacrifice humans the way we sacrifice the poor mice, which means that the studies that we can do is somewhat more limited. That said, all of our clinical studies will now have longer duration of treatment, open-label extensions.\n\nSo they're going to be part of all of our clinical studies and programs that will allow us to look at what happens with extended duration of effect. We will also be looking at follow-up. And we'll be doing what we can to understand whether or not that biology that I described is translating and how it's translating into humans. So your question is a really important one because it is very exciting that we are seeing that durability, maintenance and even deepening of response.\n\nAnd again, I think the call point is we already know that, that is likely caused by the modulation of the T cells, which have extended half-life and therefore able to exert that type of activity.\n\nKristen Kluska -- Cantor Fitzgerald -- Analyst\n\nOK. Appreciate that. And now that it's been about eight months since Otezla had the label expansion to include psoriasis patients across all severities. Curious if you guys are hearing anything about patients wanting to switch to an oral therapy across the different levels of severities.\n\nI know in the past, you've emphasized how this could potentially help pave the way for your program should it make it to the market.\n\nSimba Gill -- Chief Executive Officer\n\nYes. Yes, we have very clear feedback from patients, nurse practitioners as well as clinicians that everybody wants oral treatments. You see it absolutely with Otezla, which, as you know, is well on track to being a blockbuster drug despite the fact there are significant tolerability issues with Otezla. It causes, in a significant percentage of patients, meaningful tolerability issues, particularly on the GI side of things.\n\nSo -- but it's getting picked up despite that. Obviously, the other big issue with Otezla is it's price, still priced at a very high level. We've made it very clear, while we haven't given pricing guidance, we're going to have very reasonable pricing given the many millions of patients in the U.S. alone who suffer from mild to moderate psoriasis and atopic dermatitis.\n\nIt's the only way there's going to be large pickup in those patient populations. And so that is a core part of our business strategy. It always has been, as you know, Kristen, to move to a volume-driven model. Works extremely well given the fact there are so many patients who have inflammatory diseases, psoriasis and atopic dermatitis.\n\nAgain, huge numbers in the U.S. alone. Globally, enormous numbers. Hence, I often state that we have the potential to help over 1 billion people worldwide, that's a factual statement because there's that many people who have inflammatory disease.\n\nYou can only do that with reasonable pricing.So I think the Otezla experience strongly supports the demand from patients for oral treatment. And I think it's very encouraging as we think about future for our drugs.\n\nOperator\n\nThere are no further questions at this time, Mr. Simba Gill, CEO, I turn the call back over to you.\n\nSimba Gill -- Chief Executive Officer\n\nThank you. Thanks very much, everyone. Appreciate the questions and appreciate everybody dialing in, in the summer. I hope everybody enjoys what's left of it.\n\nAnd look forward to speaking to you again in the not-too-distant future. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKendra Sweeney -- Head of Investor Relations\n\nSimba Gill -- Chief Executive Officer\n\nAra Darzi -- Board of Directors\n\nChris Howerton -- Jefferies -- Analyst\n\nJoe Thome -- Cowen and Company -- Analyst\n\nVikram Purohit -- Morgan Stanley -- Analyst\n\nKristen Kluska -- Cantor Fitzgerald -- Analyst\n\nMore EVLO analysis\n\nAll earnings call transcripts"
}