{
  "companyName": "Domo, Inc.",
  "companyTicker": "DOMO",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/domo-inc-domo-q2-2023-earnings-call-transcript/",
  "content": "Domo, Inc. (DOMO -0.77%)\nQ2 2023 Earnings Call\nAug 25, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. And welcome to Domo's second quarter fiscal 2023 earnings call. [Operator instructions] Thank you. Peter Lowry, vice president of investor relations, you may begin your conference.\n\nPeter Lowry -- Vice President, Investor Relations\n\nGood afternoon and welcome. On the call today, we have John Mellor, our CEO; Bruce Felt, CFO; and Julie Kehoe, our chief communications officer. Julie will lead off with the safe harbor statement and then onto the call. Julie?\n\nJulie Kehoe -- Chief Communications Officer\n\nA press release was issued after the market close and is posted on the investor relations section of our website, where this call is also being webcast. Statements made on this call include forward-looking statements related to our business under federal security laws, including statements about financial projections, the plans and expectations for our go-to-market strategy, our expectations for our sales and new business initiatives, the impact of COVID-19 on our business and our financial condition. These statements are subject to a variety of risks, uncertainties and assumptions. For a discussion of these risks and uncertainties, please refer to documents we filed with the SEC, in particular, today's press release, our most recently filed annual report on Form 10-K and our most recently filed quarterly report on Form 10-Q.\n\nThese documents contain and identify important risk factors and other information that may cause our actual results to differ materially from those contained in our forward-looking statements. In addition, during today's call, we will discuss non-GAAP financial measures, which we believe are useful as supplemental measures of Domo's performance. Other than revenue, unless otherwise stated, we will be discussing our results of operations on a non-GAAP basis. These non-GAAP measures should be considered in addition to and not as a substitute for or in isolation from GAAP results.\n\nPlease refer to the tables in our earnings press release for a reconciliation of our non-GAAP financial measures to their most directly comparable GAAP measure. With that, I'll turn it over to John. John?\n\nJohn Mellor -- Chief Strategy Officer\n\nThank you very much, Julie. And thanks to everyone for joining us on today's call. In Q2, our billings growth was 21%, our total revenue growth was 20% and our subscription revenue growth was 23%. Our key leading indicator metrics such as ARR and CRPO were about 20% growth as well.\n\nHowever, when you parse these results there is a significant divergence between our two major sales groups that I'll highlight. In corporate, we had very good growth. We classify corporate as companies with up to $1 billion in revenue. And to be clear, corporate deals are not small, our average selling price is over $50,000 and deal sizes can range well into the six figures.\n\nIn corporate we experienced over 25% growth in new ACV, revenue growth of over 30% with this group and our growth with North American corporate customers was even higher. We have an incredibly differentiated offering that provides not only high impact business solutions for corporate businesses, but the power of the platform provides those customers with the technology stack that eliminates the need for large technical staff to support the data infrastructure needs of their businesses. This complete stack makes alternative technologies typically visualization tools pale in comparison to our rich value-added customer proposition and allows us to produce strong sales results. In the enterprise, we experienced revenue growth of only about 10% and ACV growth of 6%, well below our overall target growth rate.\n\nThe changes we made to our enterprise go to market earlier this year has not produced the results we were looking for. And in fact have led to recent rep turnover. So on the enterprise side we are entering Q3 with less ramped sales capacity than planned. Our value proposition for enterprises is extremely strong.\n\nWe provide unique and transformative data experiences, especially for the line of business that help solve the last mile challenge of data leverage. However, the costs and the time it takes to sell to these customers have been significantly more than for our corporate customers. Enterprise is still about half of our recurring revenue, but given the more efficient higher growth we are seeing in corporate we are realigning more of our new logos sales force in favor of corporate so we can generate higher long-term growth and do it more cost effectively. We think this reallocation of resources, particularly makes sense in an uncertain macroeconomic environment.\n\nTo be clear, this is not about the value we deliver in the enterprise or about our commitment to the success of our enterprise customers. It's about the cost to acquire new enterprise customers at this stage of Domo's growth. We remain committed to our enterprise customer success and expect these moves to set us up for higher more predictable, more efficient and sustained long-term growth. To drive up profitability and cash flow, which we believe will strengthen us for the long term we have also implemented a cost reduction plan for the second half of the year.\n\nThese changes for the sales realignment and overall cost reductions have already been implemented. The cost reductions are across the Board and do somewhat further reduce some of our sales capacity in the near term. And we believe this puts us in a very good position to march toward non-GAAP positive operating margin, meaningful cash flow and operating excellence. Domo is uniquely positioned to help organizations of all sizes drive digital transformation deeper into their businesses, which we believe will fuel our long-term growth.\n\nBruce will also share how the reduced capacity and cost reduction impact our financial outlook in a few minutes. We continue to add new logo customers at a good pace, including new marque enterprise customers. And internationally, our Japan region had a particularly strong quarter. Now let me talk about a few highlights that demonstrate the value we deliver to customers through the line of business.\n\nOne significant win in the quarter was an energy company with more than $15 billion in sales and more than 7,000 employees. This customer was looking to deliver a self-service analytics solution for the line of business to drive digital transformation deeper into its organization. After a one month POC, we delivered a self-service solution that one of our primary competitors couldn't deliver after two years. Another enterprise new logo win was with a Fortune 50 pharmaceutical company that needed to collect siloed data sources for their digital marketing department.\n\nThis company chose Domo based on our ability to connect to dozens of disparate data sources and provide real time insights on specific KPIs for marketers to quickly assess and react to digital channels and spend to maximize the return on marketing investments. Another new logo win this quarter was with HelloFresh, the world's leading integrated food solutions group which chose Domo to power its growing human resources operations. This win was driven by a short proof of concept that demonstrated that Domo was best able to efficiently integrate datasets and deliver actionable workforce insights to the line of business quickly and effectively. Domo Everywhere, which allows our customers to share data with customers and partners continues to be very differentiated and it resonates well in the market.\n\nOne significant up sell this quarter was with a leading private university that wanted to expand data access from a portion to all of its clients. This university initially chose Domo to analyze the effectiveness of its corporate learning offering for its corporate customers. Domo was chosen after providing a solution in two months that the combination of two legacy solutions was unable to deliver in two years. The common theme for these customer wins is speed-to-value for the line of business decision maker.\n\nBefore I hand this over to Bruce, I have a few more business highlights I want to touch on. First, I'm very pleased to announce that we have hired Wendy Steinle as almost chief marketing officer. Wendy joins us from Degreed where she was also CMO and she has extensive B2B software marketing experience, including six years at Adobe where she led new cross-functional go-to-market strategy and enablement initiatives that played a significant role in helping Adobe's Digital Experience business almost double in just three years. Second we continue to receive validation from industry analysts of the strength of our technology and our ability to deliver speed to value for our customers.\n\nMost recently Domo was named a leader in IDC's market scape for business intelligence and analytics platforms. This was based in part on our speed, the breadth of our capabilities and our ability to serve the business user, as well as the analyst. Domo was also named an overall leader in the 2022 Dresner Wisdom of Crowds BI market study for the sixth consecutive year. Third, culture is critically important to us as we look to build a workplace where the best talent thrives.\n\nDomo was named to Parity Org Best Companies for Women to Advance list for the third consecutive year. And we continued on our commitments toward a diverse, equitable and inclusive culture. In Q2, 35% of all new hires for open positions were diverse candidates. I believe the changes we are making now position Domo very well heading into next year.\n\nAnd I am optimistic as ever about our compelling value proposition for companies of all sizes, our position in the market and our long-term growth opportunity. Now, I'll hand it over to Bruce.\n\nBruce Felt -- Chief Financial Officer\n\nThank you, John. In Q2 we posted 21% billings growth and 23% subscription revenue growth, with a record subscription gross margin. As mentioned, sales to corporate customers remained a bright spot in Q2. Sales to our North American corporate customers, which is the major focal point of our realignment through new ACV more than 25% and sales to our corporate customers was less than $250 million of revenue through new ACV closer to 50%.\n\nWith that kind of growth and at a much lower customer acquisition costs than for enterprise customers we're confident we have made the right organizational changes to ensure we're taking full advantage of the opportunity, and at the same time had positioned ourselves to lower our companywide customer acquisition costs. We delivered Q2 billings of $72.3 million, a year-over-year increase of 21%. Gross retention was below 90% due to some one-time factors, such as changes in executive sponsorship and customer insolvency. We don't think Q2 gross retention is reflective of our long-term trend.\n\nNet retention on a contracted ARR basis was above 105%, lower than anticipated in part due to our lower gross retention. Our current RPO of $225.3 million grew 23% year over year, while our total RPO grew 22% to $349.1 million. On a dollar weighted measure we now have 64% of our customers under multiyear contracts at the end of Q2, up from 60% a year ago. Q2 total revenue was $75.5 million, a year-over-year increase of 20%.\n\nSubscription revenue grew 23% year-over-year, representing 89% of total revenue and was slightly down from 24% in Q1. International revenue in the quarter represented 22% of total revenue, up from 21% in Q1. Service revenue was flat year over year in Q2, driven mostly by lower average billing rates with several large customers. Our subscription gross margin was a record at 85.3%, up 2.6 percentage point from Q2 of last year and up 0.6 percentage points from Q1.\n\nWe're very pleased with this level of gross margin.In Q2, operating expenses increased 20% from last year, primarily from expenses in our sales group as we continue to increase sales head count. Our net loss was $8.7 million, down from $9.6 million a year ago. And our net loss per share was $0.26. This is based on $34 million weighted average sales outstanding, basic and diluted.\n\nIn Q2, cash used in operations was $2.4 million. Our cash balance declined from last quarter to approximately $80 million. Now let me discuss how our reduced sales capacity, cost reduction plan and sales realignment impacts our Q3 and full year fiscal '23 outlook. For Q3 we are guiding the billings of about $72 million.\n\nThis Q3 outlook is impacted by the lower ramp sales capacity from a spike in turnover in late Q2 that John had previously mentioned. Let me get more granular on where we stand with sales capacity. After the turnover, realignment and cost reduction our overall ramp rep capacity is up 10% year-over-year. Which is the core driver in the new business element of our guidance.\n\nHowever, we also have a record number of total reps on board as we sit here now with significant ramping capacity. Our job at this point is to reduce the turnover from the rates we experienced in late Q2. If we're able to do that we will rapidly rebuild the rep sales capacity to get back to our growth trajectory. With our sales organization now exhibiting the same operational rigor that was responsible for generating the string of 25% growth quarters, we're confident we can get ramped rep capacity where we want it.\n\nWe will also continue to hire new sales reps, just more weighted toward corporate customers. For the current fiscal year because of the above we're reducing our billings growth outlook to about 13% year over year from about 22%. On expenses, we're taking $18 million of expenses out of our second half spending plans. Because of costs related the realignment and other one-time costs we're expecting cash used in operations to be approximately $6 million for the quarter.\n\nHowever, we expect Q4 cash flow from operations be roughly breakeven. Going forward, we expect our expense run rate will be much lower than our expected billings level. In Q4 specifically, we expect a significant difference between the two, which should be a tailwind to cash flow heading into Q1 of next year. Our expense reduction is expected to expand our reported operating margins from Q2 levels by over 200 basis points by year-end.\n\nNow the guidance for our GAAP metrics. For the third quarter of fiscal year '23 we expect GAAP revenue to be in the range of $76 million to $77 million. We expect non-GAAP net loss per share basic and diluted of $0.23 to $0.27. This assumes $34.4 million weighted average shares outstanding basic and diluted.\n\nFor the full year of fiscal '23 we expect GAAP revenue to be in the range of $305 million to $310 million, representing year-over-year growth of 18% to 20%. We expect non-GAAP net loss per share basic and diluted of $0.88 to $0.96. This assumes $34.1 million weighted average shares outstanding basic and diluted. In closing, while in the short run we're below some of our longer-term growth drivers, most notably our growth in sales capacity, we believe the actions we have taken are the right and prudent actions to drive sustainable, efficient longer-term growth.\n\nWith that, we'll open the call for questions. Operator?\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Kamil Mielczarek with William Blair. Your line is open.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nHi, thanks for taking my question. Just want to make sure I understand the drivers of the full-year guidance. To what extent is the lower revenue related to the lower sales headcount versus maybe macro related productivity changes or other factors that are weighing on growth?\n\nJohn Mellor -- Chief Strategy Officer\n\nYeah. Hi Kamil. I would say, I mean, it's really driven by rep capacity. We fundamentally did not see an impact from the macro, other than potentially the large deal dynamics at the large enterprise.\n\nBut more -- I would say, the fundamental driver here is all internal and related to our own ramp sales capacity.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nGot it. So I think Bruce mentioned that, quota carrying head count growth was 10% in the quarter. So how should we think about the pace of hiring through the year? Is the goal still to get back to 20% growth? And I realize there is some uncertainty in that few months, but as we expect that to further reaccelerate or into kind of hard to tell right now when that will happen?\n\nJohn Mellor -- Chief Strategy Officer\n\nLet me clarify and just make sure you understand our terminology. When we speak about like firepower, we generally speak in terms of ramps, we call it rep sales capacity, like when we hire a rep they have -- they don't contribute anything. So they are considered just a fraction of our [inaudible] and after about nine months to a year there are full rep. So from a ramped capacity, which is the real production capability of the sales force, we were up 10%.\n\nThe point what I'd like to add to that, which I mentioned in my script, but let me just be clear. We have a very good percentage higher than that number in actual sales head count. And what we need to do is, let them -- manage them effectively so they stay with us, so we avoid the turnover and allow them to ramp. And that will automatically build capacity and we believe build growth.\n\nSo as we sit here right now we have a record number of sales head count [Technical difficulty] and very successful at doing that, and actually we continue to hire sales head count. And all that we need to do is continue to allow their progress in developing our as sales reps, let that continue to nurture it and we will have more capacity. We will actually have significantly more capacity, I would say, without hiring any reps, but we do plan to continue to hire reps.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nOK. That's really helpful. Thank you for the color.\n\nJohn Mellor -- Chief Strategy Officer\n\nYou're welcome.\n\nOperator\n\nYour next question comes from the line of Derrick Wood with Cowen. Your line is open.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nHey guys. Thanks for taking my questions. I missed the beginning of the call. So maybe just taking a step back.\n\nCould we just go through -- I mean, 18 plus months ago you guys had been building a lot of momentum in the enterprise. Obviously, more recently we've seen that slowdown and you're trying to make some tweaks to the kind of revive that motion. What do you think what went wrong? And again I did miss it, what is the new strategy for the enterprise part of the business as you look going forward?\n\nJohn Mellor -- Chief Strategy Officer\n\nYeah. Derrick, this is John. Thanks for the question. So I think when we look at the go-to-market channels and we see corporate and enterprise, the characteristics of the buying process are pretty different.\n\nAnd in corporate, we've got a value proposition that just matches in a pretty fulsome way with those customers need. We've got marketing motions that generate leads for those and sales enablement and sellers that can execute on that. I think in the enterprise, we've just -- we struggled with predictability and it really doesn't have anything to do with the value we deliver to these enterprise customer, because we have fantastic customers that are getting incredible value out of the Domo products. It's just the cost and the time to sell to those, given the stage of Domo most current growth we believe that investment is better aligned toward the corporate customers where we've got a more efficient model to generate new logos and new ACV.\n\nSo does that make sense?\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nYeah. That makes sense. And then just on the second part, just like what -- so what is the new stay of play for the enterprise strategy?\n\nJohn Mellor -- Chief Strategy Officer\n\nGot it, got it. So we continue to have a pretty significant enterprise go to market, because we do believe that there is a real opportunity for growth there. Just from a priority standpoint, we have shifted significant headcount to the corporate selling motion. So enterprise still alive and well, we believe that's a significant growth driver for us in the future.\n\nWe are going to disproportionately put new logos selling capacity into the corporate engine.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGot it. Yeah. And Bruce, I mean, obviously, productive sales capacity is the big part of the equation of growth. Just remind us the lot of these newer reps that have joined, what's the average time to ramp to productivity? And then are there other levers you can help with distribution leverage in terms of marketing, lead-gen, partners, things that could help you get even more growth leverage on the corporate side?\n\nBruce Felt -- Chief Financial Officer\n\nYeah. I mean, I'll start with the second part first. All the levers are there. Yield out of the marketing spend improved dramatically.\n\nThere is still room to grow. Partner contribution is still OK with lots of opportunity to grow. On building sales capacity on the gross hiring front, we're doing very well, so that will be a key driver, that's still intact. Our renewal rates are still in the 90% neighborhood, that's intact.\n\nThe fact that our platform is so unique, particularly at the corporate level -- it's unique for both for groups. But it's such a rich set of technologies that we find our corporate customers leverage significantly and it reduces the IT requirement on their side, because it's such a complete platform that's still in play. And then all the brand awareness and positionings absolutely improved and I think will continue to improve. On the ramping, the corporate reps ramp in three to six months.\n\nIn the enterprise, when you really look at the data, our model has it nine months to a year, but often it's longer than that. So the one thing that we're really doing here and that's extremely helpful to predictability and efficient growth is just putting even more resources than we did last quarter in favor of the corporate business, because when you have a business that's growing 30% and then the segment of that business that's growing 50% and you can hire reps, because in many ways we home grown these reps, you can hire them much more easily and train them and then they can produce so much quicker and ramp quicker and generate business quicker. I think that is just what we ought to be doing today. And in this macro environment and just based upon just our ability to execute so well in this space.\n\nSo that's where we're placing our focus and we think we're setting ourselves up for -- we'll work through this in Q3, we'll probably have a better Q4 and I think that really sets us up going into next year really, really well.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nAnd to be clear the, the churn that happened was more on the enterprise side, not the corporate?\n\nBruce Felt -- Chief Financial Officer\n\nYeah, the real -- the churn that really matter to us was on the enterprise side. They had -- they were the most, I would say, impacted by the organization changes. The ask of them was significant, they really did cause a spike in turnover. And what we're fundamentally doing is, just replacing the capacity that was there in placing it in the corporate side and we think that's just a really good bet.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nUnderstood. Thank you.\n\nBruce Felt -- Chief Financial Officer\n\nYou're welcome.\n\nJohn Mellor -- Chief Strategy Officer\n\nThanks, Derrick.\n\nOperator\n\nYour next question comes from the line of Pat Walravens with JMP Securities. Your line is open.\n\nPat Walravens -- JMP Securities -- Analyst\n\nOh great. Thanks. So Bruce, I'm just sort of eyeballing this in the model, but I mean, Q3 billings growth is 3%, right?\n\nBruce Felt -- Chief Financial Officer\n\nThat's right.\n\nPat Walravens -- JMP Securities -- Analyst\n\nYeah. OK. And then Q4, this is the part I'm eyeballing, looks like it's something like 9% or 10%, is that right?\n\nBruce Felt -- Chief Financial Officer\n\nThat's right.\n\nPat Walravens -- JMP Securities -- Analyst\n\nOK. So what -- I mean, John, it sounds like you were surprised by the turnover in the reps, what happened?\n\nJohn Mellor -- Chief Strategy Officer\n\nYes. So -- and thanks for the question, Pat. So I think if you kind of zoom out and look at some of the changes that were made at the beginning of the year. Domo made a pretty big investment in the enterprise go to market.\n\nWe brought in some sales leadership, made pretty significant investments in that enterprise go to market. And I think we went through the first couple of quarters and the data looked reasonable. And then we made a change in the senior leadership on the sales side where we really got back to the rigor and the hygiene that I'm most comfortable with in how to run pipeline and sales organizations. And we started to see that hygiene expos some of the pipeline issues in late Q2.\n\nAnd then we saw some of the reps turnover in late Q2 and that's when we said we've really got to look at some changes here. So that's kind of the process we went through. And we think that the enterprise business is still a really strong opportunity for us. So if we look at where we are in our growth stage and the need to be efficient in how we grow and predictable in how we grow, we feel like the corporate business, that corporate go to market is a better place for investment right now.\n\nPat Walravens -- JMP Securities -- Analyst\n\nOK, got it. I mean if you had $300 million in cash instead of $80 million, would you be making a different decision?\n\nJohn Mellor -- Chief Strategy Officer\n\nPerhaps. I mean, I think what we're looking for is how to get predictable growth into the business. Enterprises is fantastic and we've got -- it's roughly half of our ARR. So these customers that we're highly invested in their success.\n\nI'm just looking for where do we get the predictable consistent growth that we can bank on that gives us gives us potentially that $300 million to be able to invest in other growth vectors.\n\nBruce Felt -- Chief Financial Officer\n\nBut I would add, I was just going to add that, with our desire to be cash flow positive, now I'll even add to the equation margin expansion in this environment and given what we just saw [inaudible] just such a clean kill for us and we're still going to get enterprise, we're still going enterprise growth, because the platform really works. Just what we ran into was trying to go big on it and making a big bet, just given the state of just where we are as a business. Just in this environment, in particular, I was just going to pig off. And so we're playing it safe and playing it efficiently.\n\nAnd that's kind of the mode we're in right now. And by the way, it also should preserve cash as well. So I mean, it's just overall when you look at the whole calculus of just this decision, it just lines up pretty well with our strengths and not would be really helpful to us getting accelerated growth from this point on.\n\nPat Walravens -- JMP Securities -- Analyst\n\nOK and then just in the spirit of getting bad news out -- well, let's just get it over it. So the enterprise customers that we lost, are they sort of the lighthouse customers that we're familiar with Target or Nike or something like that. No, OK.\n\nBruce Felt -- Chief Financial Officer\n\nNo, we didn't -- I mean, we didn't have really anything. I mean basically the renewal rates are really in the same zip code they have been. We had some just very particular loss situation to me to go point or so lower that's extremely identifiable and does have to do anything to do with competitive environment or the power of the platform or their reliance on it, and it's not a -- no big customer.\n\nPat Walravens -- JMP Securities -- Analyst\n\nOK. Thank you.\n\nJohn Mellor -- Chief Strategy Officer\n\nThanks, Pat.\n\nOperator\n\nYour next question comes from the line of Sanjit Singh with Morgan Stanley. Your line is open.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThanks for taking the question. Bruce, if we look at the full year revenue guide, that's coming down by roughly $10 million. Any sense of how much it's coming from subscription versus services?\n\nBruce Felt -- Chief Financial Officer\n\nIn services we are basically running out the model, Q3 a little bit better than Q2, Q4 a little bit better than Q3 and the rest is subscription to give you the order of magnitude.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nYeah. So that's roughly flattish on services, a little bit of growth, but the balance coming from -- that's really helpful. And then going back to the sales capacity question. We got that a couple of different times.\n\nI think what we're on the sync is, why did we see the turnover now, typically we see that the start of the fiscal year. It's obviously been a really competitive environment for sales talent. It should have been -- I would have expected it actually to get a little bit easier, at least on the hiring front. So typically when sales people leave is because they don't see a path to the meeting quota or the quotas are too high.\n\nSo is that what's going on where you are having some ramped reps sort of -- I can't make my number this year. Is that what drove the Q2 or is there something more organizational going on following some of the recent leadership exit.\n\nJohn Mellor -- Chief Strategy Officer\n\nYes. Sanjit, this is John. Thanks for the question. I think we put in some pretty significant changes at the beginning of the year for quotas and territory assignments, etc., in the enterprise that as those -- that reactions and changes based on that don't happen immediately.\n\nI think what we saw is, I think, late in Q2 is where we really saw the impact of that. And these are things that we think are imminently in our control and we fix. So to your question is, yes. And we've fixed it.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nUnderstood. Great. OK. I just wanted to get some more clarity on that.\n\nThank you for taking the question.\n\nJohn Mellor -- Chief Strategy Officer\n\nYes, of course.\n\nDuration: 0 minutes\n\nPeter Lowry -- Vice President, Investor Relations\n\nJulie Kehoe -- Chief Communications Officer\n\nJohn Mellor -- Chief Strategy Officer\n\nBruce Felt -- Chief Financial Officer\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nPat Walravens -- JMP Securities -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nMore DOMO analysis\n\nAll earnings call transcripts"
}