{
  "companyName": "Viavi Solutions",
  "companyTicker": "VIAV",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/viavi-solutions-viav-q4-2022-earnings-call-transcr/",
  "content": "Viavi Solutions (VIAV -0.10%)\nQ4 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is David, and I'll be your conference operator today. At this time, I'd like to welcome everyone to the Viavi Solutions 4Q 2022 earnings call. Today's conference is being recorded.\n\n[Operator instructions] Sagar Hebbar, head of investor relations. You may begin your conference.\n\nSagar Hebbar -- Head of Investor Relations\n\nThank you, David. Welcome to Viavi Solutions fourth quarter and fiscal year 2022 earnings call. My name is Sagar Hebbar, head of investor relations and corporate FP&A. Joining me on today's call are Oleg Khaykin, president and CEO, and Henk Derksen, CFO.\n\nPlease note, this call will include forward-looking statements about the company's financial performance. These statements are subject to risks and uncertainties that could cause actual results to differ materially from our current expectations and estimations. We encourage you to review our most recent annual report and SEC filings, particularly the risk factors described in those filings. The forward-looking statements, including guidance we provide during this call are valid only as of today.\n\nViavi undertakes no obligation to update these statements. Please also note that unless we state otherwise, all results except revenue are non-GAAP. We reconcile these non-GAAP results into our GAAP preliminary financials and discuss their usefulness and limitations in today's earnings release. The release, plus our supplemental earnings slides, which include historical financial tables, are available on Viavi's website.\n\nFinally, we are recording today's call and will make the recording available by 4:30 p.m. Pacific Time this evening on our website. I would now like to turn the call over to Henk.\n\nHenk Derksen -- Chief Financial Officer\n\nThank you, Sagar. Fiscal Q4 2022 set an all-time record for Viavi revenue and a fourth quarter record for non-GAAP profitability. Fourth quarter revenue came in at $335.3 million, up 7.8% year over year, exceeding our guidance range of $315 million to $329 million. Growth was primarily driven by improved demand for our core OSP and 3D sensing products.\n\nViavi's operating profit margin at 21.3% was within our guidance range of 21% to 22%, improving 50 basis points year over year. EPS at $0.24 met the high end of our $0.22 to $0.24 guidance range and increased 9.1% from $0.22 in the prior year, a combination of strong operating performance and the impact of an improving capital structure. The fully dilutive shares outstanding at the end of fiscal Q4 2022 of 231.3 million shares decreased from 241.9 million shares in the year ago period, substantially a result of refinancing our convertible debt while continuing to execute on our share repurchase program during fiscal 2022. The outstanding dilution resulting from the remaining convertible notes was 1.6 million shares during the fourth quarter, compared to 10.4 million shares a year ago.\n\nMoving on to our reported Q4 results by business segment, starting with NSE. NSE quarterly revenue at $246.2 million, up 4.1% year over year was within our guided range of $240 million to $250 million, a new quarterly record in this business segment. Within NSE, NE increased 4.5% from a year ago to $222.2 million reflecting continued strong demand for our wireless and optical lab and production products. SE revenue at $24 million was flat year over year albeit at an improved product mix.\n\nNSE gross profit margin at 64.9% increased 150 basis points year over year. Within NSE, NE gross profit margin at 64.2% increased 110 basis points from last year, primarily a result of leverage on growth and favorable product mix. SE gross profit margin at 71.3% increased 580 basis points year over year. NSE's operating profit margin at 15.1% was slightly below our guidance range, albeit flat year over year.\n\nHigher variable sales commission costs on strong bookings performance during the quarter was offset by gross profit margin expansion. Now, turning to OSP. Fourth quarter revenue at $89.1 million was up 19.8% from a year ago, and improved sequentially by 5.2%. Revenue exceeded the guidance range of $75 million to $79 million due to better-than-expected demand for anti-counterfeiting products during the quarter.\n\nGross profit margin at 55.9% decreased 160 basis points year over year driven primarily by raw material costs and start-up costs in our new Arizona facility. Operating profit margin at 38.6% was within our guidance range of 38.5% to 39.5%, although down 20 basis points year over year, a result of the aforementioned gross margin factors offset by disciplined opex management. Moving to our fiscal 2022 full year performance. Despite the COVID-19 pandemic-related supply chain issues and inflationary pressures, Viavi was able to mitigate much of the impact, resulting in a strong finish to a record of $1.3 million, up 7.8% from fiscal 2021.\n\nNSE reached a record revenue of $949.1 million, up 13.3% year over year, well within the range of our long-term goal. OSP at $343.3 million saw a modest decline of 4.9% in revenue compared to record levels in 2021, but still exceeded the high end of our 2022 goal provided in 2019. Viavi's full year 2022 operating profit margin at 22.2%, expanded 110 basis points and exceeded the high end of our goal of 21% by 120 basis points. Within our NSE segment, operating profit margins expanded 460 basis points from 11% in 2021 to 15.6% in 2022 due to leverage on revenue growth, combined with disciplined opex management.\n\nWithin our OSP segment, operating profit margins reduced from a record level of 44.7% in 2021 to 40.5% in 2022, a result of lower revenues in combination with higher raw material costs. Full year 2022 EPS at $0.95 increased 14.5% or $0.12 from $0.83 in 2021 and is ahead of the high end of our goal of $0.90 for 2022, a result of operating performance and an improved tax rate. Now, turning to the balance sheet. At the end of fiscal Q4 2022, the ending balance of our total cash and short-term investments was $565 million, down $139 million compared to a year ago, mainly a result of refinancing 57% of our convertible debt with longer notes at a favorable rate.\n\nDuring 2022, we generated $178 million in operating cash flow and deployed $73 million or 5.6% of revenues toward capital expenditures, resulting into $106 million in free cash flow generation. We were able to buy back $45.5 million in common shares under the 2019 repurchase program and invested $8.3 million in M&A activity. Looking at just the fourth quarter, operating cash flow was strong at $73.6 million, an increase of $11 million compared to $62.6 million in the year ago period. The increase as a result of higher operating income, coupled with benefits from supply chain investments made earlier in the year.\n\nIn addition, we invested $19.1 million in capital expenditures during the quarter, compared to $25.4 million in the prior year as we progress toward completion of our Arizona production facility. As you may recall, we had targeted the reduction of our 2023 and 2024 outstanding convertible notes to continue to improve our capital structure. During the first three quarters of 2022, we redeemed approximately $370.6 million of these notes on the original $685 million in principal value. In the fourth quarter, we completed transactions to extinguish an additional $22.4 million in principal value of convertible loans at a total reacquisition cost of $27.2 million, bringing the principal value of our combined convertible notes outstanding to $292 million at the end of fiscal 2022, or 43% of the original principal value.\n\nDuring fiscal Q4, we repurchased 2.1 million shares of common stock for $28.9 million, under the 2019 repurchase plan. The remaining authorization under the 2019 repurchase plan is $67.3 million. Now, on to our guidance. We expect the fiscal first quarter 2023 revenue to be approximately $324 million, plus or minus $7 million.\n\nOperating profit margin is expected to be 21.4%, plus or minus 70 basis points and EPS to be in the range of $0.22 to $0.24. We expect NSE revenue to be approximately $236 million, plus or minus $5 million, with operating profit margin at 14.5% plus or minus 50 basis points. OSP revenue is expected to be approximately $88 million, plus or minus $2 million, with operating profit margin at 40%, plus or minus 100 basis points. Our tax rate is expected to be approximately 16% to 17%, and we expect other income and expenses to reflect a net expense of approximately $6 million.\n\nShare count is approximately 232 million shares based on current stock price levels and includes the dilutive impact of approximately $2.5 million of the remaining convertible notes. With that, I will turn the call over to Oleg.\n\nOleg Khaykin -- President and Chief Executive Officer\n\nThank you, Henk. I'm pleased with Viavi's performance during the fiscal Q4 2022, resulting in a record quarterly revenue and profitability. We have also delivered an all-time record revenue and non-GAAP profitability for the entire fiscal year 2022. In addition, we have also exceeded the high end of our 2022 profitability goal set during the 2019 analyst day despite significant headwinds from COVID and inflationary pressures.\n\nThe NE segment achieved the new revenue high in fiscal 2022 with both fiber and wireless growing double digits year over year, benefiting from strong investments in both service providers and hyperscalers looking to upgrade their networks. Despite the supply chain headwinds and inflationary pressures, we executed well on our strategy, growing revenue, profitability and gaining market share. In the fiscal Q4, fiber revenue growth was driven by fiber-to-the-home deployment, 400 GigE network and data center upgrades and accelerating market adoption of 800 GigE and PCI Express Gen 5 technologies. The 5G wireless demand also continued to be strong, driven by investments in ORAN and front-haul wireline network expansion.\n\nFiscal Q4 also saw very strong NE bookings resulting in a seasonally stronger Q1 backlog and demand visibility. The SE business revenue was flat year over year for fiscal Q4 2022. That said, the annual SC revenue grew 13% plus year on year, increasing our confidence in the revamped data center and assurance strategy and products. We expect continued strong growth in our SE business during fiscal 2023.\n\nNow, turning to OSP. The OSP business segment delivered better-than-expected revenue and profitability with revenues exceeding our guidance range. Our fiscal Q4 anti-counterfeiting product revenue was up 27% year on year, driven by a combination of global fiscal stimulus and inventory replenishment. Looking ahead, we expect Q1 2023 revenue to be roughly flat to Q4 with lower anti-counterfeiting demand being offset by stronger 3D sensing.\n\nTo recap, in fiscal year 2022, we successfully executed on the Viavi's growth strategy that we have outlined during the September 2019 analyst day and have exceeded our non-GAAP profitability and ESP targets. The major highlights include NSE business segment achieving 13% growth in revenue and 60% growth in non-GAAP operating margins for fiscal year 2022. We're proud to have successfully executed despite the global pandemic supply chain headwinds and inflationary pressures. The OSP business exceeded our three-year strategic goals for both revenue and profit.\n\nAnd lastly, we have successfully revamped our product portfolio to leverage secular trends and expand our TAM positioning Viavi for continued revenue growth, increased scale and profitability and market share gains. As we kick off our next three-year strategic plan, we invite you to join us at the analyst day event in Boston on September 13, where we will outline our strategy and goals for the next three-year cycle. We hope to see you there. We will also be -- there will also be a live webcast of our presentation.\n\nWe'll provide additional information regarding the event over the next 30 days. In conclusion, I would like to thank my Viavi team for another quarter and fiscal year of strong performance and express my appreciation to our supply chain partners, customers and shareholders for their support. I will now turn the call over to Sagar.\n\nSagar Hebbar -- Head of Investor Relations\n\nThank you, Oleg. David, let us begin the question-and-answer session. We ask everyone to limit the discussion to one question and one follow up. Thank you.\n\nOperator\n\n[Operator instructions] We'll take our first question from Alex Henderson with Needham & Company. Your line is open.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nOh, great. Thanks. Nice quarter, guys. I was hoping if you could talk a little bit about the split between 3D sensing and the counterfeiting products in the quarter.\n\nMy assumption is that 3D sensing is around $15 million or so in the quarter and that the upside was heavily skewed to that 20% kind of jump in the security products. I'm assuming when you look out to the '22 to '23 window that we revert back to that standardized $60 million a quarter baseline in OSPs. First of all, is that correct? And the second question is really around the currency exposure and the mix of business internationally, can you talk about what's going on in your EMEA business, which was down substantially. And obviously, you made that up with very strong domestic growth.\n\nOleg Khaykin -- President and Chief Executive Officer\n\nOK. You asked three questions in one. OK. So let's --\n\nHenk Derksen -- Chief Financial Officer\n\nSo your first question was the mix between 3D sensing and what we call core OSP. I think your numbers are pretty close, actually slightly better on 3D sensing than $15 million for the fourth quarter. So you're pretty close. And then, I think your follow-on question was on the outlook --\n\nOleg Khaykin -- President and Chief Executive Officer\n\nThe outlook, I think the -- I guess, first on OSP, I mean, we're going to see some pullback in the anticounterfeiting demand, but we also have a stronger demand on 3D sensing. So net-net, it kind of ends up being a wash and the remainder of the business, staying fairly steady quarter over quarter. And in terms of the Europe, the Europe business, I mean, was not that -- I mean, clearly, summer is a little bit seasonally weaker because of a lot of vacations. But we continue to see Europe being healthy, although the challenge in Europe has been more the European currency has devalued against the dollar.\n\nSo in the relative terms, our products have gotten more expensive, but we continue to see pretty strong demand from European NAMs and from service providers who are now in a multi-year -- many of whom are in a multiyear fiber deployment to the home, and that business continues to be pretty robust. I mean, clearly, we're all reading the same news and Europe is -- they are expecting some headwinds, and we are well prepared for that. But at this point in time, our European businesses continues to be fairly robust. And I guess it's really driven more by a multiyear investment cycles that are just ongoing.\n\nIt's not really a spot purchases or anything like that?\n\nAlex Henderson -- Needham and Company -- Analyst\n\nIf we're reading the numbers correctly on your slide deck, it was down 22%. Is that mostly currency related?\n\nOleg Khaykin -- President and Chief Executive Officer\n\nI guess, it comes down to where we ship the anti-counterfeiting pigments whether they go to Europe or some other geographies. So yes, I mean -- so I think on the NSE side, I don't think we have that much variability and --\n\nHenk Derksen -- Chief Financial Officer\n\nSo there's a little bit more project-related, Alex, on the NSE side, in our wireless and lab business, not so much an OSP issue, and there was a little bit of FX translation that drove the year over year down, the number was about $5 million for the quarter, purely FX translation on a weaker euro or stronger U.S. dollar.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nI'll cede the floor. Thank you for letting me ask the questions.\n\nHenk Derksen -- Chief Financial Officer\n\nSure. You're welcome.\n\nOperator\n\nOK. Next, we'll go to Tim Savageaux of Northland Capital. Your line is open.\n\nTim Savageaux -- Northland Capital Markets -- Analyst\n\nYes. Sorry about that, it came a little quicker than I might have thought. A question on the network enablement side. A couple of things.\n\nI'll ask them both at once versus a follow-up, which is you mentioned strong bookings and backlog and any maybe even unseasonably strong, which would be very much in line with everything we've been seeing across the -- certainly, the fiber ecosystem may be 5G as well, and yet you're guiding revenues down sequentially? Can you reconcile that? And looking at the year fiscal '22, you grew NE revenue 13%. And now had some very easy comps in the first half, grew at like mid-single digits, 6% or so in the second. What's a reasonable growth expectation for the NE segment for fiscal '23?\n\nOleg Khaykin -- President and Chief Executive Officer\n\nWell, we generally don't give annual guidance. I think all the worries around, the recession aside, it should be a pretty healthy year. I would say probably maybe even seeing, I'd say, mid-single digits. However, I think given that -- and I don't want to jump ahead.\n\nI mean, right now, we are not seeing it yet, but let's assume there is a recession and pull back. I'd say it may be slightly down or even up to flat year on year depending on product line. So I think at this point, it's probably too premature to talk about fiscal '23 or even more calendar '23 until we see how we exit this calendar year. And whether or not a lot of the momentum we are seeing in Europe, North America and Asia will hold up or the customers pull back on their -- both R&D budgets, as well as their deployment pace.\n\nTim Savageaux -- Northland Capital Markets -- Analyst\n\nAnd on the booking strength contrasted with the sequential revenue decline. Anything to talk about there?\n\nOleg Khaykin -- President and Chief Executive Officer\n\nWell, the bookings -- remember, a lot of our bookings is a book ship within a quarter. And the -- generally, our September quarter is a seasonally weaker quarter in NE. But because we had such very strong bookings, it's coming in to be pretty close I mean, to the June quarter. And if you really adjusted last year, we had one big order that was shipped to a North American customer.\n\nIf you adjust for that, it's actually coming in a strong quarter on the run rate business with that one-off order excluded. So we actually -- on seasonality wise, because it's really a rule of thumb, our June and December quarter is the strongest quarter for SE business. And September and March quarter are the seasonally weaker quarters.\n\nTim Savageaux -- Northland Capital Markets -- Analyst\n\nOK. Thanks.\n\nOperator\n\nNext, we'll go to Samik Chatterjee with J.P. Morgan. Your line is open.\n\nAngela Jin -- J.P. Morgan -- Analyst\n\nHi. This is Angela Jin on for Samik Chatterjee. I know you mentioned you haven't really seen any sort of demand weakness from the recession. But are you seeing any of your customers aside from service providers and hyperscalers including -- and aside from the delay any project or rethink some of their investments in other 5G technologies, such as industrial or automotive applications or enterprise spend in private 5G, and then I have a follow-up.\n\nOleg Khaykin -- President and Chief Executive Officer\n\nYes. So, I mean, we don't really do much with the automotive or anything like that. Most of the -- our customers, aside from service providers are in the wireless and fiber optic telecommunications space. So, I mean, to answer your question that we haven't seen the decline per se.\n\nIt continues to be pretty strong. But let's be realistic. I think the slowdown hasn't really trickled down from the -- to the engineering groups. Right now, they have a budget for the year and they're spending it happily.\n\nBut also what I've seen is even with a mild recession, companies that like get hit by slowdowns, you don't really see -- they may see some reduction in production testing orders, but they generally don't slow down the R&D orders because they -- if anything, they try to accelerate product development during the dial cycle. So I think I would say if there is really a pullback recession of couple of quarters, that business may just flatten out, maybe just go down slightly on the 11 production space. The service provider, I mean, there, the programs are pretty much locked and loaded. The question would be, are they going to take delivery in the quarter or they spread them out over a couple of quarters.\n\nSo they may defer some of the deliveries and things like that. But given a lot of the kind of pent-up demand and clearly, they have a lot of projects underway. I mean, we think the order momentum will continue to be a relatively stronger as compared to other recessions.\n\nAngela Jin -- J.P. Morgan -- Analyst\n\nGot it. And then, for my follow-up, on the opex line, generally, you've been very disciplined about opex. But there was a small bump up in this quarter. And so, I was wondering if that was a reflection of the current inflationary environment and if this could be sort of the new norm of opex level in the next few quarters, just given the current environment that we're in.\n\nOleg Khaykin -- President and Chief Executive Officer\n\nWell, I'll start and I'll let Henk. Well, I mean the -- our opex continues to be pretty disciplined. I think the bump up came in was really a function of commissions and bonuses paid out because we kind of work on a semiannual cycles. So that was for the first half, where I think the bookings and the performance have been above the annual operating plan.\n\nAnd the only -- we are making adjustment in the salaries, but nowhere near by the inflation level. I think we are probably targeting somewhere in the 4% pay adjustment, and that hits mainly North American opex, and then there's obviously adjustments in other regions, where in some cases, the higher salary adjustments we're making have been more than offset by the currency devaluations vis-à-vis dollars. So -- but I would say the biggest impact on opex increase would be in North America, where we are roughly doing about 4% increase this year.\n\nHenk Derksen -- Chief Financial Officer\n\nYes. There may be a little bit of additional T&E that sort of hold into opex.\n\nOleg Khaykin -- President and Chief Executive Officer\n\nYes. So it's coming back with travel --\n\nHenk Derksen -- Chief Financial Officer\n\nTravel is coming back a little bit, inflationary impacts, that I like spoke about, but think of opex going forward, not quite at the 41.2% that you saw in the fourth quarter, but below that 41%, between 40.5% and 41%. I think that's the way to think about it going forward.\n\nAngela Jin -- J.P. Morgan -- Analyst\n\nGreat. Thank you.\n\nHenk Derksen -- Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nNext, we'll go to Mehdi Hosseini with Susquehanna. Your line is open.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nYes. Thanks for taking my question. And I promise to limit my follow-ups to two. Oleg, it seems like based on your commentary on OSP, the 3D sensing should see a meaningful year-over-year growth, September '22 versus September '21.\n\nIs that a fair assumption?\n\nOleg Khaykin -- President and Chief Executive Officer\n\nWell, actually, not really because if I look at the last year, if you remember, we had a very strong 3D sensing demand and then our customer realized they didn't have enough chipsets to build the units because many of the other suppliers fell short. So as a result, there was a big inventory rebalancing in the December quarter, and we saw our orders flashed in December, and then they recovered in the March quarter. I think this year, it's a bit more linearized. So I think the demand year on year is roughly the same.\n\nI mean, if you -- in fact, I mean you may have a little bit better volume because of the deeper penetration of our 3D sensing into our multiple other platforms like handheld and the laptops and things like that, offsetting some of the ASP erosion. So overall, we think it's going to be a pretty robust kind of flattish year on year -- a little bit stronger than June quarter, but if you look at September and September fairly similar to a year ago. Where we are seeing decrease is the anti-counterfeiting pulling back from a year ago levels. Where we hit close to about $100 million last year, and it was really -- so I'd say probably you're seeing about $10 million pullback on anti-counterfeiting predominantly.\n\nAnd all else remaining roughly the same.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nAnd just to continue with 3D sensing, it seems like we're off to another smartphone cycle for the high-end application. Last year, your overall OSP revenues were down 5%. But given the strength of the high-end smartphone another upgrade cycle is coming, could you actually be able to have the OSP revenue in this fiscal year flat to up? Or should we assume that it's going to trend more like flat to down?\n\nOleg Khaykin -- President and Chief Executive Officer\n\nWell, remember, I think it's flat is more accurate because I mean I have different people asking me, it's like, well, R&D mobile phone sales is going to be down this year. So while we're not really seeing a reduction in volume, but we cannot comment on number of phones because you also now have greater level of penetration. So instead of just one filter, you may have two filters performed because you have more of these higher-end phones with the world-facing cameras and things like that. So I'm really just judging from the mix.\n\nWe think adjusted for ASP erosions roughly flat revenues this quarter. Now, the new product launch is very strong and there is a strong demand, we will most likely see that demand in the December quarter because remember, as I keep pointing out to people, our lead time is two weeks. So if customer really wants to increase the volume demand, they -- we can turn it on within a very short period of time.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nOK. And speaking of lead time, I'm under assumption that there's no more supply chain disruption, components are available for your NSE business unit. Is that a fair assumption?\n\nOleg Khaykin -- President and Chief Executive Officer\n\nI'd say it's a fair assumption for probably 98% of the devices. I think you still -- the area you still have some challenges, I would not say less of a supply, but if you wanted to get an additional spot market deliveries, it's really FPGA is still the only remaining thing that you need to watch carefully. Pretty much everything else as I've been telling you guys for a year, by summer, we're really not seeing anything and if anything now going into this quarter, we are seeing lead times coming -- pulling in much quicker. So what used to be, let's say, 18 months, it becomes 12 months, then six months and now you can even get it on a spot market all of a sudden.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nOK. And just if I may, just a quick follow-up to this. A few quarters ago, you actually left some millions of dollars of revenue on the table because of the component shortages. You have been able to have a pretty robust revenue so far, beating your own guide.\n\nShould we assume that you were able to recapture those revenues that you left on the table? Or is that coming in the second half of the year?\n\nOleg Khaykin -- President and Chief Executive Officer\n\nWell, no, no, we've pretty much recapture. But remember, when we said it, the revenue that flipped out, it didn't -- it slips out really by maybe a matter of weeks. So you recapture at the beginning of the first month. And it was always like sub-$10 million, up to $5 million.\n\nI think at this point, we're not really, I'd say, leaving anything on the table.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nOK. Thank you.\n\nOperator\n\nNext, we'll go to Meta Marshall with Morgan Stanley. Your line is open.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks. A couple of questions for me. Maybe just on the anti-counterfeiting strength.\n\nEven as it's kind of pulled back from last year, it's probably remained stronger than you guys were thinking. And I know that it's tough to get full visibility there, but do you -- like is that inventory building? Is that reprints driven? Is there still stimulus programs kind of internationally that we should be thinking of? Or I guess I'm just trying to get a sense of like what do you think is kind of a baseline run rate level of that business at this point? And then I have a follow-up.\n\nOleg Khaykin -- President and Chief Executive Officer\n\nYes. I think the baseline for that business is now, I would say, like $58 million to $60 million. And I think we're probably two to three quarters away from really everybody getting back to their reasonable levels of inventories that they carry. There's still -- some countries are further away from getting back to their normalized inventories.\n\nOthers are almost there. And I would say like if I compare year on year, we had a lopsided delivery for a major customer last year, more came in, in March, unless they pulled in from the June. This year, it's really been more back to the traditional demand, March and June. So we had a pretty good, I mean, just as we expected, seasonally, June quarter.\n\nSeptember quarter is usually a bit less, but it's not materially less but then increase in the 3D sensing more or less offsets that. But I continue to see the anti-counterfeiting, I think now entering more of a steady state. I mean, a lot of these perturbations that we saw with COVID and stimulus and all that. It's kind of been subsiding and now it's moving back toward traditional reprints, release of the new notes and things like that.\n\nIt's less of the stimulus driven. It's more kind of basically business driven. But the reason we're saying that now it's at the higher level, there are just fundamentally way more notes out there in the world. And to the extent recession is coming, we've seen different countries announcing plans to increase level of liquidity in their economy to do it.\n\nBut I think nobody is doing anything crazy like dropping trillions of dollars from helicopters. We don't see anything like that on the horizon. It's more of a traditional demand profile.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGot it. That's helpful. And then, maybe you spoke to the NSE strength this quarter kind of being more wireless driven. Just any commentary about cable or just what you're seeing from them, particularly after a pretty strong last couple of years?\n\nOleg Khaykin -- President and Chief Executive Officer\n\nWell, I would say really the two things that really driving is fiber and infrastructure wireless. We are seeing -- we have several major customers, and they kind of take their big deliveries in March quarter, June quarter, September quarter, kind of things like that. And then, there is all the service providers. What we are seeing aside from this kind of like our big three, four customers taking major deliveries annually is we're seeing what's even more encouraging to me is broadening of the customers and it's a combination of service providers establishing compliance labs as they try to drive more ORAN adoption, right, and doing more of the front-haul build-out.\n\nAnd a lot of these new entries in the open early access network, like the likes of Mavenir, Altiostar and some of these other players like Rakuten or DISH Network is getting into the space, cable companies getting into wireless, they're all buying these wireless equipment so they can emulate wireless network as they develop product. So we're seeing a significant broadening of the wireless customer base. So maybe they will not buy tens of millions of dollars of equipment, but they buy millions of dollars of equipment. So that's really driving the wireless.\n\nAnd on fiber, two big drivers are the -- building out a fiber to the home that is in really early stages. And we now have multiple countries launching a multiyear initiatives to connect most of their homes to fiber, with U.K. kind of leading the way. Now, there's Italy and Germany, and of course, a lot of activity in the U.S.\n\nAnd now we are seeing similar type things happening in other European countries and in Asia. And so, that's really -- the whole fiber to the home is really driving a lot of our fiber field instrumentation and the upgrade to the wireless networks and the telecom networks, the front-haul, the fiber, just deeper fiber penetration into the network is driving a lot of the modules customers and they're buying a lot of test equipment for production and development. And then, of course, there is this whole migration to 400 and 800 gig that is driving high-end fiber equipment. So I mean, between fiber and wireless, it truly has been a great momentum overall.\n\nOperator\n\nThat concludes today's question-and-answer session. I'll now turn the call back over to Sagar for any additional or closing remarks.\n\nSagar Hebbar -- Head of Investor Relations\n\nThank you, David. This concludes our earnings call for today. Thank you, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSagar Hebbar -- Head of Investor Relations\n\nHenk Derksen -- Chief Financial Officer\n\nOleg Khaykin -- President and Chief Executive Officer\n\nAlex Henderson -- Needham and Company -- Analyst\n\nTim Savageaux -- Northland Capital Markets -- Analyst\n\nAngela Jin -- J.P. Morgan -- Analyst\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nMore VIAV analysis\n\nAll earnings call transcripts"
}