{
  "companyName": "Westport Fuel Systems Inc.",
  "companyTicker": "WPRT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/westport-fuel-systems-inc-wprt-q3-2022-earnings-ca/",
  "content": "Westport Fuel Systems Inc. (WPRT 0.65%)\nQ3 2022 Earnings Call\nNov 08, 2022, 10:00 a.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to the Westport Fuel Systems third-quarter 2022 results conference call. As a reminder, all participants are in listen-only mode, and the conference is being recorded.\n\nAfter the presentation, there will be an opportunity to ask questions. [Operator instructions] I would now like to turn the conference over to Ashley Nuell, senior director of investor relations. Please go ahead.\n\nAshley Nuell -- Senior Director, Investor Relations\n\nYou are reminded that certain statements made in this conference call and our responses to various questions may constitute forward-looking statements within the meaning of the U.S. and applicable Canadian securities laws, and as such, forward-looking statements are made based on our current expectations and involve certain risks and uncertainties. With that, I'll turn the call over to you, David.\n\nDavid Johnson -- Chief Executive Officer\n\nThank you, Ashley, and good morning, everyone. I'm pleased to be with you today to discuss our third quarter. Once again, our team delivered solid results as we continue to execute our strategy and showcase our pioneering hydrogen HPDI technology to a wide audience amid the ongoing challenging macro environment. We continue to work through the industry-felt headwinds and feel both prepared and poised to grow into the future.\n\nWe believe that strong LPG price advantages, continued expansion in the new markets, supportive global emissions reduction requirements, and further OEM conversations about hydrogen HPDI will drive growth and profitability. We remain committed to our announced $1 billion of revenue and profitability goals but also recognize that, due to the headwinds we've faced so far this decade and which continuing to face for at least the near-term future, the time to achieve these goals will be later this decade. The environmental, economic, and regulatory requirements will not stop or wait, and Westport is well positioned to respond. Today, I'll be walking you through an update from our hydrogen HPDI roadshow, where we've been promoting our technology at important industry and government events.\n\nI'll also dive into our recently announced Scania test results to clarify the import of what we've achieved. I'll discuss the rise of liquid biomethane, highlighting its growth, particularly in Europe and its increasing usage in heavy-duty transport and why Westport stands to benefit. Finally, I'll walk you through our independent aftermarket business where we see recovery through this year, which is being bolstered by the continued price advantage of LPG in many markets. In Q3, we delivered revenues of $71 million, slightly lower than Q3 last year.\n\nAs indicated in prior quarters, the Russian market has been historically important for Westport through both our aftermarket and OEM channels. Now, with the war in Ukraine and sanctions on Russia and in combination with the weakening euro and high natural gas prices in Europe, we've been heavily impacted. If we're able to get the -- set these aside, our business would have grown by 15% in the third quarter. Absent changes in foreign exchange, our revenues grew by 10%.\n\nWe also continue to experience the impacts of rising inflation, supply chain constraints, higher utility costs, and fuel price volatility that have weighed heavily on our industry. As many of you know, we are the only company with a technology used diesel cycle combustion with LNG and biomethane, and there are thousands of trucks on the road today using our technology. Taking this a step further, our fuel system technology paves the path from natural gas and biomethane today to green hydrogen tomorrow. We were thrilled to continue to inform both industry participants and policymakers about our unique capabilities and the advantages of hydrogen HPDI with our Class 8 demonstrator vehicle at multiple industry events in Europe and North America.\n\nIt isn't a surprise that as populations grow and economic development continues, we'll need to move more freight. Both the industry participants and the policymakers agree, the numbers of trucks on the road will grow and the performance and cost effectiveness of lower carbon solutions will become increasingly critical. We truly believe that HPDI is the solution today and for the future. Speaking more broadly about our business, fundamentally, the outlook remains strong.\n\nThe demand trends for affordable mobility options that reduce emissions are encouraging. We're seeing regulatory and policy support for options that utilize zero-carbon fuels like hydrogen and biomethane. We're capitalizing on this now with the advancements we've made with hydrogen HPDI and the further recognition of what HPDI technology can achieve today with natural gas and liquid biomethane in addition to the work we're doing developing fuel systems to respond to future regulations, including the pending Euro 7 standard. I wanted to quickly take the time to reiterate our three-pronged go-forward strategy as a company and how we are positioning ourselves for the future.\n\nWe'll drive sustainable growth in our existing markets through a diversified portfolio of technologies, products, and services. This will be seen across all our business units. Second, we aim to unlock new and emerging markets through the delivery of cleaner, affordable transportation solutions. Third, we'll continue as we've done in the past to drive operational excellence and maintain our reputation as a tier 1 supplier with enhanced quality and reliability.\n\nHistorically, when the word hydrogen has been used in relation to on-road transportation, only fuel cells come to mind. We're challenging this narrative. The future requires many options, including solutions best fit for certain applications based on factors like distance, payload, durability, and affordability. Our technology is a solution for using zero-carbon hydrogen effectively in many applications with the required performance at an affordable price.\n\nWe're having these conversations now, including unveiling our hydrogen HPDI fuel system equipped Class 8 demonstrator vehicle at IAA Transportation 2022 in Hanover, Germany, one of the largest commercial vehicle conferences in the world. Further differentiating hydrogen HPDI from other technologies is the ability and opportunity to use existing manufacturing infrastructure, a key factor in the near-term adoption of sustainability solutions and a discussion point with all OEMs at the Hanover show. Minimizing investment, both public and private, on the path toward decarbonization is a key component of our ability to achieve real change quickly. OEMs are taking notice.\n\nWe've demonstrated that our technology achieves better performance of diesel engines with near-zero CO2 emissions, all while utilizing existing already paid for manufacturing infrastructure. The interest in our solution continues to grow, and IAA was a major stepping point in highlighting our technology to leading industry participants. The recognition and momentum around the product are growing. And so, like many others, our excitement is growing.\n\nIn our discussions with global OEMs at IAA, it was clear they are beginning to understand that Westport's hydrogen HPDI fuel system solution addresses the portion of the market not addressed by electrification and does so in a more affordable way than a fuel cell. OEMs recognize that full electrification of all applications is not possible, and utilizing internal combustion engines is a compelling option. The tide is turning, and the conversations are shifting. The cost realities and engineering limits for electric solutions for heavy-duty applications are syncing in with OEMs.\n\nWe remain committed to the idea that there will be a full suite of options in the future, but it's becoming strikingly clear that electric doesn't meet the needs of heavy-duty, long-haul transport, while hydrogen HPDI does. Following IAA, we spent time in Brussels and Washington, D.C., where we had policymakers and OEMs looking more seriously at internal combustion engines and alternative fuels and recognizing these will play a larger role in the solution for lower emissions future. In Brussels, we presented our hydrogen HPDI fuel system to key policymakers highlighting its ability to substantially reduce CO2 emissions and align it with E.U. decarbonization goals.\n\nBecoming part of the conversation now is important as work is being done to shift sentiment given that internal combustion engine technologies weren't being recognized as part of a fusion for our future. It's our hope that the E.U. Commission and the member states prioritize the availability of green hydrogen in the transport sector in the coming years and support engine technology advances that will be key for the development of the whole hydrogen transportation sector. Our message is clear.\n\nThe lowest-cost CO2 abatement is using internal combustion engines, fueled by HPDI technology, representing the most cost-effective pathway to deep decarbonization of long-haul road freight. In Washington, D.C., we participated in the Hydrogen Americas Summit, exploring the topic of hydrogen mobility applications. One of the focal points of the discussion was exploring opportunities for widespread mobility decarbonization through hydrogen combustion, an area in which hydrogen HPDI can take the lead for heavy-duty transport. Every time we get in front of industry participants and policymakers, it's a win, as we advance our story and highlight our lower cost solution for using advanced internal combustion engines with hydrogen to make a long-term contribution toward decarbonization.\n\nEngines equipped with our fuel system provides a superior combination of attributes as compared to fuel cell systems, diesel-fueled engines, and spark-ignited IC engines, including greater efficiency, higher power density, as well as lower total cost of operation, TCO. We think we have the solution for hydrogen utilization in heavy-duty transport and remain committed to spreading our message and educating potential OEM customers on the unique and significant potential our technology brings. As our analysis has made clear and as industry observers have noted, IC engines fueled with hydrogen or biomethane can achieve equal or greater CO2 reductions as compared to fuel cells, while preserving manufacturing and capital investments. Our hydrogen HPDI fuel system offers more power, more torque, and more efficient use of hydrogen, and therefore, the best opportunity for hydrogen IC engines in real-world usage.\n\nBiomethane and the growth we've seen this year in usage in heavy-duty transport is an area we're excited about as a 100% biomethane in HPDI achieves 100% well-to-wheel CO2 reductions. Let me say that again, HPDI with 100% biomethane achieves 100% well-to-wheel CO2 reductions. As the share of bio-LNG increases and the size of the deployed fleet increases, the total CO2 reductions, well to wheel, accumulate rapidly. Continuing this momentum is key to mitigating the full effects of climate change, and the speed of mitigation is paramount.\n\nWith the increasing substitution of renewable fuels like biomethane, our products can further decrease the greenhouse gas impact of transportation, and they do so much more affordably than battery electric vehicles, for example. HPDI with natural gas and renewable natural gas works, and it works well. It's available now and can help lower operating costs while helping fleets achieve their carbon reduction targets. Take note of what's happening in Europe right now, support for renewables and biomass continues to increase in the wake of the E.U.\n\nenergy crisis. In the third quarter, the European Parliament voted to increase the use of renewable energy from 40% to 45% and while bio-based joint undertaking is estimated to allocate $2.4 billion for private investment in biomass infrastructure by 2024. Why all this talk about biomethane, you might ask? Because biomethane is today's hydrogen. It's available.\n\nIt reduces greenhouse gases. It's affordable. It's scaling right now, and HPDI works today with biomethane and hydrogen tomorrow. Development and testing of our hydrogen HPDI fuel system solution is a key step to providing our customers with the pathway to significant emissions reductions, and we have projects undergoing now that I wanted to provide an update on.\n\nWe recently announced impressive test results from our joint demonstration program with Scania. As you know, we applied our hydrogen HPDI fuel system to Scania's 13-liter CBE1 platform, Scania's next-generation, best-in-class engine intended for Euro 7 on-highway emission standards. Test results using our hydrogen HPDI solution, which requires a limited redesign of the cylinder head and no redesign of the systems, external gas exchange system, or crank case ventilation system, show performance with peak brake thermal efficiency of 51.5%. This is complemented by a 48.7% brake thermal efficiency at road-load conditions.\n\nThis is a significant achievement given that the 50% brake thermal efficiency mark with diesel has been seen as the industry's loftiest goal, and we're able to eclipse this number by 1.5 percentage points, truly validating our technology. In addition, we demonstrated that hydrogen can be combusted at the same compression ratios as the diesel engine uses without knock limitation that all FI hydrogen engines are struggling with. The fact that we've achieved higher BTE over and above best-in-class engine, simply by chasing the fuel system while retaining the engine architecture and the on-engine HPDI fuel system component, demonstrates the tremendous value and best-in-class performance that HPDI offers. What further excites us is the strong potential for industrialization and a commercial product launch.\n\nThis isn't just a laboratory test. Hydrogen HPDI has all the ingredients to be turned into a product appreciated by truck drivers and fleet owners. The feedback from the announcement has been significant. OEMs have been reaching out to us.\n\nWe remain very optimistic that the compelling benefits of hydrogen HPDI will lead to commercial availability later this decade. We're proud to partner with Scania for this demonstration program and are looking forward to next steps. In addition to our work with Scania, we also have a program underway with TUPY and AVL aimed at combining advanced material and casting technologies with hydrogen HPDI. We anticipate being able to detail the results of this collaboration in late -- in the first quarter of next year.\n\nAnd just a reminder, hydrogen HPDI offers low TCO, nearly 20% lower than a fuel cell vehicle just within five years and 580,000 kilometers. For the truck customer, it's a lower upfront acquisition cost with a proven design and durability. For the OEM, it's a familiar product and the ability to reuse substantial investments that have already been made in powertrain manufacturing and supply chain. A nearly 20% reduction is a significant number and is steering conversations with more potential OEM partners, as is the opportunity to avoid new investments in fuel cells, batteries, and motors, and to reuse existing engine manufacturing assets.\n\nThe results from the work we continue to do in these projects are informing our current customers and other energy players and, importantly, are bringing us new potential OEM customers. Now switching focus to the [Inaudible] of the LPG market. Despite the headwinds, which I discussed earlier, we're seeing strong demand and higher sales in key markets like Poland, Algeria, and Peru. The large and increasing price advantage of LPG compared to petrol is driving our results also in the Netherlands, Italy, and Turkey.\n\nWe're implementing price increases to mitigate the effect of inflation. To date, we've achieved some success with margins rose slightly in the quarter. Surely, we have more work ahead of us, since there's no sign that inflation is going away. Fuel and geographic diversities are important core aspects of our overall offering.\n\nWe can pick up market share in areas where the spread between petrol and alternative fuels is favorable. This includes growth in new markets like Thailand, Peru, and Bolivia, all emerging markets with regulations emphasizing the need for cleaner transportation. In Peru, for example, we're seeing a growth trend emerge. The price of LPG compared to gasoline is nearly $0.70 a liter cheaper.\n\nThis is a significant spread in a cost-sensitive market. In India, despite the recent spread narrowing between CNG and petrol, the overall trend continues to be positive. Currently, in the Indian market, the average running cost of a CNG-fueled vehicle has jumped from 1.2 rupees per kilometer to now 2.6 per kilometer. But the running cost of gasoline-fueled vehicles is nearly double that at 5.1 rupees per kilometer.\n\nThis favorable operating cost advantage for CNG supports our positive outlook for our business in India. In fact, at IAA, we met with several Indian OEMs who expressed interest in many of our solutions, including HPDI with methane and hydrogen. The CNG filling network in India is expanding quickly with the government committed to have the number of filling stations increase by 10,000 by the end of the decade. Westport is poised to benefit from the impact of products we offer -- are used in all OEMs.\n\nIn summary, despite some macro headwinds that we faced, high fuel costs, and continued focus on carbon emissions create opportunities for our business as both industry operators and end customers look for lower cost options. What we're seeing in key markets with LPG is a clear example of that. With that, I'd like to turn it over to Richard to go through our financials.\n\nRichard Orazietti -- Chief Financial Officer\n\nGood morning, and thank you, David. Despite a challenging macroeconomic and geopolitical environment, I want to start by highlighting that, fundamentally, Westport delivered better performance year over year in the third quarter of 2022. However, this is not readily apparent due to the negative impact of foreign currency translation from the weakening of the euro against the U.S. dollar.\n\nTotal revenues for the third quarter 2022 decreased 4% to 71.2 million, compared to 74.3 million in the same prior-year period, primarily driven by the weakening euro. Excluding the impact of foreign currency translation, total revenues increased by 10%, mainly due to a rebound in the performance of our independent aftermarket business and the resilience and growth in the portfolio of OEM businesses like delayed OEM, electronics, and hydrogen. This is a remarkable achievement given the significant challenges presented by the impact on sales volumes on volatile LNG and CNG fuel prices, sanctions on Russian customers, inflationary pressures on production, and continued supply chain disruption. Loss from operations of 10.9 million and a net loss of $11.9 million for the third quarter of 2022, compared to a net operating loss of $8.6 million and a net loss of 5.8 million for the same prior-year period.\n\nThe increase in operating loss was driven mainly by a $2.6 million unrealized foreign exchange loss caused by the depreciation of the Canadian dollar and euro to the U.S. dollar. In our adjusted EBITDA calculation, we exclude unrealized foreign exchange gains and losses to better reflect the underlying performance of our business. For the quarter, adjusted EBITDA was negative $4.5 million, compared to negative 1.4 million in the same prior-year period.\n\nAdjusting for the unrealized FX loss in the prior-year period, the operating loss decreased by $1.2 million year over year due to higher gross margins generated in 2022, driven primarily through increased sales in multiple OEM businesses and a more normalized sales mix of heavy-duty OEM systems parts. However, this better performance was offset by the loss of equity income from the termination and sale of the Cummins Westport joint venture. The comparative result in 2021 included $3.8 million in equity income from -- from the joint venture. Turning to our business segments, OEM revenue for the third quarter of 2022 was $44.1 million, down 8% compared to the prior-year quarter.\n\nThe 16% decrease in the average euro rate versus the U.S. dollar for the third quarter was the main driver for the decrease in revenue. However, this was partially offset by higher sales in delayed OEM, fuel storage, hydrogen, and electronics. The impact of Russian sanctions was significant to our light-duty OEM business as we generated approximately $3 million less than the prior-year quarter.\n\nThe impact from the Russian-Ukraine war on CNG prices also negatively impacted our sales volumes to the European market. On a positive note, we saw an increase of light-duty OEM sales to our Indian OEM customers for the period. In our heavy-duty OEM business, our sales volume to our initial OEM launch partner decreased 16% as compared to the same prior-year period but remains comparable on a year-to-date basis. This is a direct result of the unfavorable pricing differential between LNG and diesel in Europe.\n\nHigher LNG prices continue to cause a significant challenge to the demand for LNG trucks, which is expected to temper our expected volume growth for our OEM launch partner until relative LNG prices return to a more favorable equilibrium. The operating loss of $7.3 million for the segment was comparable to the prior year due to better gross margin. Gross margin improved to $4.7 million, or 11% of revenues from the third quarter, compared to $3.1 million or 6% of revenues in the prior year. We saw a strong increase in gross margin driven by increased sales in multiple OEM businesses as discussed before and a more normal mix of HPDI systems components, along with higher engineering services revenue.\n\nIn the third quarter of 2021, we had a higher sales mix of spare parts in our heavy-duty OEM business for warranty purposes that had lower margins. Improvement in gross margin was partially offset by the annual contractual price reduction to our OEM launch partner and a decrease in margin in our light-duty OEM businesses due to a higher mix of sales to emerging markets that generate lower margins. Further, we continue to experience higher production input costs from supply chain challenges and in inflation in logistics, energy, and other costs, which we have only partially been able to pass through to our OEM customers. R&D expenses for the third quarter were 6.5 million, slightly higher year over year.\n\nOur heavy-duty OEM R&D continues to focus on the development and demonstrations with potential OEM customers of next-generation HPDI fuel systems, particularly with the use of hydrogen. Our light-duty OEM R&D is focused on the development of new LPG fuel systems to meet upcoming Euro 7 standards. Now, turning to independent aftermarket. Our business continues to be resilient in the face of macroeconomic challenges with some positive encouraging trends.\n\nRevenue for the quarter increased by 3% to $27.1 million compared to the prior-year period. Despite the significant impact of foreign exchange translation discussed previously, higher sales in Eastern Europe, as well in Algeria and Peru, generated higher revenues year over year. Our focus on entering new markets and better competing in the markets we are currently in has enabled us to offset some of the loss of revenue to the Russian market from sanctions as a result of the Russia-Ukraine conflict, an impact of approximately $4 million for the nine months to date in 2022. Gross margin was $6.6 million, or 24% of revenues for the quarter, down slightly compared with the same prior-year period.\n\nThe decrease in gross margin and gross margin percentage was mainly the result of higher production input costs occurring in material, transportation, and energy costs. Looking ahead, support of LPG pricing is creating a promising demand trend for our business as Westport continues to address and serve markets for customers looking to save money on fuel costs. Finally, I'd like to touch on liquidity. Our cash position decreased by $11.7 million during the quarter to $86.5 million.\n\nThe decrease was primarily from net cash used in operating activities, modest capital expenditures, and repayment of $3.6 million of debt. Our net cash flow used in operating activities was $8.6 million in the third quarter, a decrease of $5.8 million from net cash used of $14.4 million compared to the same prior-year period. The decrease in cash used was driven by net changes in working capital, specifically in inventory. Our -- our inventory levels have remained consistent since the second quarter of this year due to lower-than- expected sales volumes in Russia and the timing of delivery of some tenders in the independent aftermarket we anticipated in the third quarter that have been pushed to the fourth quarter, resulting in less of an inventory reduction than expected.\n\nOur net cash used from investing activities in the quarter was $2.5 million, primarily driven by our investments in capital expenditures for the expected growth in our portfolio of OEM businesses. Net cash flows used in financing activities were $3.6 million for the third quarter, as we continue to pay down our debt. We anticipate that we will pay down an additional 3.1 million in the fourth quarter of 2022. We remain focused and disciplined with our capital allocation and resources to execute our strategic and operating plans and, as such, improving profitability and liquidity.\n\nAlthough, we saw some improvements in gross margin this quarter, we continue to see pressure on gross margin from inflation, and this is an area we continue to work to improve. Work continues with our customers in both OEM and independent aftermarket to implement price increases and other actions to improve our cost structure. As David highlighted, we do see positive signals of growth in our business and a path to profitability as sales volumes grow in our heavy-duty and light-duty OEM businesses. We are also optimistic about a continued improvement in profitability of our independent aftermarket business from the current tailwind of favorable LPG prices.\n\nWith that, I would like to turn it back to David.\n\nDavid Johnson -- Chief Executive Officer\n\nThank you, Richard. Before my closing remarks, I'd like to welcome Bill Larkin to the Westport team. Bill joined us in early October, stepping at the role of chief financial officer following Richard's resignation. Having previously served as CFO of Westport Innovations and Fuel Systems Solutions, the deep industry expertise and capabilities he brings will be instrumental in realizing our growth and profitability goals.\n\nFinally, as this will be Richard's last earnings call with Westport, I wanted to take this opportunity to thank him. Since he joined Westport, Richard has led us through a critical period and has positioned us for long-term success by strengthening our financial position. Richard has been a valuable member of our management team, and we wish him all the success in the future. Before we close, let me touch on the written notice we received from NASDAQ last week, regarding the company not being compliant with the minimum bid price requirement.\n\nAs we highlighted in our press release yesterday afternoon, we have 180 calendar days to regain compliance or until May 2, 2023. Let me be clear, we fully intend to resolve the deficiency and regain compliance with NASDAQ's listing rule. Our operations are not affected by the receipt of the notification, nor is there any impact on the listing of our common shares as we continue to trade normally. Finally, let me close on these few final points.\n\nWestport delivers market-ready transportation solutions to OEMs, fleets, and individuals that deliver cleaner technology affordably right now. We remain encouraged by the long-term outlook for our business and are here with just three reasons why. Number one, low- and zero-emission transportation is our future, and HPDI is our story. Performance, efficiency, and even better with hydrogen provides an affordable solution to the market.\n\nSecond, the growth of our LPG business, which continues to address in served markets, which can't afford expensive electric and nonelectric vehicles but still looking for clean solutions. And third, the growth we're seeing, and we expect to see in our business in India. As a supplier of advanced fuel delivery components and systems for clean, low-carbon fuels, I'm confident in our ability to capture the additional market opportunities in front of us. All these factors give us optimism in our ability to meet the needs of our customers and advance toward our financial objectives.\n\nAnd with that, I'll turn it over to the operator to open the call for questions.\n\nOperator\n\nThank you. We'll now begin the question-and-answer session. [Operator instructions] Our first question is from Eric Stine with Craig-Hallum. Please go ahead.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nGood morning, everyone.\n\nDavid Johnson -- Chief Executive Officer\n\nGood morning, Eric.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nHey, so, you mentioned, obviously, some interaction coming out of a number of the demonstration --demonstrations you've done, conferences with some Indian OEMs on HPDI. I'm wondering if you can provide a little more detail outside of India, you know, I don't know whether it's by number of OEMs, you know, accelerated talks with OEMs, anything just providing more details and also, you know, how the greater brake thermal efficiency plays into those discussions?\n\nDavid Johnson -- Chief Executive Officer\n\nYeah. Gladly, Eric. I think, you know, we had the chance, as you know, to bring our truck to the Long Beach show back in May, ACT Expo, and then we had our truck at the Hanover show in September. And the combination of these events was really fantastic for us.\n\nAnd, frankly, what we've been doing with the truck, the roadshow we referenced just a moment ago, has been very effective in terms of getting the truck in the hands of -- of key individuals at OEMs around the world. So, as an example, Hanover, I spent time with nine different OEMs at the, you know, senior executive level, sometimes CEO, sometimes CTO, and sometimes head of purchasing. So, really, a great audience. Many times, a large contingent would come from an OEM and to our stand to talk to us and review our technology.\n\nAnd every time these were super useful conversations because I think, in the grand scheme of things, our technology is not as well-known as it needs to be. And having the truck and going to the shows is really changing things for us as -- as we sell and offer this important technology to the industry. So, those discussions we mentioned, Indian OEMs, but also Chinese OEMs, European OEMs, North American OEMs -- so, we really cover all the main -- main markets of the world. I also had the chance to spend a week in Japan recently meeting with OEMs there.\n\nSo, frankly, I think we're covering the base as well and really getting a fantastic response. And then we pile on, I would say, with our latest results with our project demonstration with the Scania engine. This is just a fantastic result. I can remember, in my career, many years, that the US Department of Energy had hundreds of millions of dollars of funding available for companies to try and show a pathway to get to 50% brake thermal efficiency.\n\nSo, just to kind of put things in perspective, most of the engines on the road today in all markets are on the range of 43% to 45% or 46%, maybe, brake thermal efficiency. And these are, you know, an improvement over where we were in prior decades. The goal that the DOE has held for a long time has been 50% brake thermal efficiency from a diesel engine. And now, companies like Scania are achieving that kind of really record performance for a diesel engine.\n\nSo, then for us to put their engine in the test cell, apply our HPDI -- hydrogen HPDI system, feed the engine with hydrogen and achieve 51.5% brake thermal efficiency is really a tremendous accomplishment and just sets the stage for what we'll achieve next in terms of the full map and the full capability of the engine as we continue those development projects with -- with customers. So, for us, this is a really, really important and exciting time. You know, we've been in production with HPDI using methane as our -- let's say, as our molecule for a long time. These trucks are really well received in the marketplace.\n\nBut then to show that pathway that goes from fossil natural gas to biomethane and then hydrogen in the future is really compelling for OEMs around the world.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nYeah. No, that's great. And good segue, I guess, my next question was just going to be how -- how the data points, which clearly -- I mean, other OEMs are watching closely -- I mean, how that gets others beyond your launch partner today to look at LNG as that interim solution, you know, people who maybe were saying, \"Look, I'm not going to move to HPDI utilizing LNG if I'm willing to have hydrogen, you know, five-plus years.\"\n\nDavid Johnson -- Chief Executive Officer\n\nRight.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nAre you seeing that movement, or is that something that you expect to see going forward?\n\nDavid Johnson -- Chief Executive Officer\n\nWe're seeing it, and we're expecting to see more of it is the short answer, but let me just expand a bit. You know, fundamentally, I'll tell you, in the marketplace, there has been so much pressure from various constituencies around the world getting basically every -- every segment, the media, investors, OEMs, fleets, all focused just on zero and this idea of electrification being the shiny object that we all should pursue and fuel cells, the technology that we all need to move to and this idea even that hydrogen equals fuel cells has pervaded the industry in every market around the world. And so, when we show up with hydrogen HPDI and hand people the keys to a truck, they can see that no, no, there's another path that's really quite attractive from an economic standpoint. You know, all of the OEMs that we're talking to around the world have billions of dollars invested in engines, in internal combustion engine manufacturing, in the supply chains for that manufacturing, in the delivery and how that engine fits in the vehicle and then meets their customers in the servicing of those engines around the world.\n\nSo, we have a massive installed base of capability and manufacturing capability to around the internal combustion engine. So, when we show you can keep that internal combustion engine and make it run on zero-carbon hydrogen and have all the power, actually more power, more torque, and more efficiency than you could have with a diesel engine or with a natural gas engine, that makes it very exciting. Kind of the second step in the thought process is, well, given that there isn't a massive installed base of hydrogen and this technology that Westport provides also works on methane and biomethane, why wouldn't we go there now? And just on that point with respect to methane, we -- we spent a fair amount of our discussion points with customers at Hanover, for example, helping them understand the public data that's out there regarding the efficiency and the capability of our product. You know, I think there's a significant number of constituents in the universe, in the public domain, again, media, investors, and customers, who think all natural gas engines are the same, that they all involve a spark plug, a reduced compression ratio, a three-way catalyst and, at the end of the day, deliver 15% lower torque and dramatically less efficiency.\n\nAnd so, we spent time at our events and continue to spend time even privately with OEMs, of course, helping them understand that the product that we have in the market today with our lead OEM customer, the HPDI product preserves all of the capability of diesel engines in terms of power, torque, and efficiency and, therefore, in real-world applications, in real-world testing and usage, is delivering a 30% lower consumption of natural gas. So, whether its natural gas or biomethane, reducing that fuel cost by 30% using HPDI as opposed to a spark plug is something that's not as well-known as it really needs to be. And so, we're helping customers understand that and pointing to the data in the marketplace. And I think -- so, now, that combination of dramatically better fuel consumption figures, all the power and all the torque with methane, with biomethane, and with a path to zero-carbon hydrogen is super compelling for OEMs around the world.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nOK. Thanks, David.\n\nDavid Johnson -- Chief Executive Officer\n\nMy pleasure. Look forward to seeing you soon.\n\nOperator\n\nThe next question is from Rob Brown with Lake Street Capital Markets. Please go ahead.\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nGood morning.\n\nDavid Johnson -- Chief Executive Officer\n\nGood morning, Rob.\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nI think you mentioned in your -- in your script some hydrogen revenue in the quarter or in the year. Could you kind of elaborate on the revenue you're getting from hydrogen at this point?\n\nDavid Johnson -- Chief Executive Officer\n\nYes. So, we have, let's see, two areas that I would call in the category of hydrogen. So, we've been talking a lot already this morning about hydrogen HPDI, and I would say our revenues right now with respect to that are really on the demonstration project. And I would say -- I would categorize them as low-single million-dollar figures with multiple OEMs and really in a cost recovery mode.\n\nWe're basically partnering with them to demonstrate, like we did with Scania, our technology on their engines. The other part of our hydrogen business is, I would say, growing business. As part of our growth opportunities for the company, we have been supplying hydrogen fuel system components to connect fuel storage, you know, 700 bar and 350 bar tanks, to fuel cells. And so, we've been doing that business through our GFI brand for more than a decade, and we're seeing really great growth.\n\nAnd we -- we are, in this day, a leader with that technology, with products available to companies like Plug Power and other fuel cell makers in both North America and China and increasingly in Europe as the European OEMs get their heads wrapped around how they're going to use fuel cells in their product mix. So, that's a really important part of our business, a growing part of our business, and keeps us very busy. \n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nOK, great. Thank you. And then -- and then, you sort of alluded to a path to profitability. I know you don't give guidance, but sort of, you know, what's your view on sort of that trajectory? Can you be profitable in '23 and what might that depend on?\n\nDavid Johnson -- Chief Executive Officer\n\nYes. So, we -- you know, with respect to our profitability trajectory and it's been, let's say, an evidence for quite some time that our JV with Cummins ended at the end of last year. And -- so, we took this kind of step function reduction in our profitability trajectory. But we see this profitability growth that will get us to profitability.\n\nAnd that's where I talked about our -- what we previously called our mid-decade goals being a little further out fundamentally. And so, that kind of billion-dollar revenue and 20% gross profit targets were fully committed to. But clearly, after COVID, supply chain, and our war in Russia, we had some setbacks from the timetable. But nonetheless, we see that coming.\n\nIt's fundamentally driven by growth, Rob. And so, we need to see our HPDI volume growing and the hydrogen story we're telling right now will help with that. But certainly, we're also seeing now natural gas prices in global markets coming back down from the extraordinary peaks that they've -- they've seen in the follow-on aftermath, if you will, of the initiation of the war in Ukraine by Russia. So, that whole dynamic and the change in landscape of flows of natural gas with, you know, increased exports from the U.S.\n\nand building new natural gas pipelines and LNG terminals and so forth, that takes time. And so, we are seeing a decrease in natural gas prices, and that will help our growth. And the growth is the key to our profitability.\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nGreat. Thank you. I'll turn it over\n\nDavid Johnson -- Chief Executive Officer\n\nThank you, Rob.\n\nOperator\n\nThe next question is from Amit Dayal with H.C. Wainwright. Please go ahead.\n\nAmit Dayal -- H.C. Wainwright and Company -- Analyst\n\nJust quickly on the margin strength for the quarter relative to last quarter, is there anything unique this quarter than last quarter? And then, going forward, should we continue to expect, you know, the 16% level gross margins?\n\nRichard Orazietti -- Chief Financial Officer\n\nWhy don't I handle that one, Amit? The biggest difference that we had, probably quarter over quarter, for sure, there was increased performance in the portfolio of our OEM businesses, which are electronics and hydrogen. Our fuel storage did very strong and delayed OEM. The biggest -- the biggest difference as well that -- which may carry forward as we were -- we had a large amount of a particular HPDI component that actually had a lower margin, and that was because of replacement of the component, and that has now gotten much better. And so, in terms of the performance with regards to margins and heavy duty, that is somewhat improved.\n\nAnd so, that should carry through somewhat. But in terms of modeling out a specific percentage, you know, it does move around a little bit, Amit. But, yes, we do expect a little bit of improvement, yeah.\n\nAmit Dayal -- H.C. Wainwright and Company -- Analyst\n\nUnderstood. Thank you for that, Richard. [Technical difficulty] and a lot of macro challenges you guys are facing. In that context, what are the driver [Technical difficulty]\n\nDavid Johnson -- Chief Executive Officer\n\nHey, Amit. Amit, I apologize. Amit I'm really struggling to -- to hear you. There seem to be a connectivity issue perhaps with your phone.\n\nIs there --\n\nAmit Dayal -- H.C. Wainwright and Company -- Analyst\n\nIs it better?\n\nDavid Johnson -- Chief Executive Officer\n\nSomething you can do on your end because I can't get your question. I heard macro environment.\n\nAmit Dayal -- H.C. Wainwright and Company -- Analyst\n\nI was just trying to say if, you know, there is any solution to this forex pressure?\n\nDavid Johnson -- Chief Executive Officer\n\nI think, you know, just talking about foreign exchange, I mean, basically, as a company, we are very strongly naturally hedged. The vast majority of our revenues are in euros. The vast majority of our expenses are in euros. And so, that does kind of cushion us against the bottom-line impacts of foreign exchange.\n\nUnfortunately, it doesn't do anything for the top line because we report in U.S. dollars, and so, we have all those conversions that we do make. And so, that translation of that business -- about 70% of our business is in Europe. That translation, you know, it will be what it will be.\n\nAnd so, that's why we call it out when we announced our earnings and our revenues because, fundamentally, our business is about 70% in Europe, and that's the currency, but it is naturally hedged. Richard, anything you want to add?\n\nRichard Orazietti -- Chief Financial Officer\n\nNo, I think you described it well. I mean, our functional currency, more likely than not, actually, is more the euro. The Canadian dollars is what we have as our functional -- main functional currency. And reporting in U.S.\n\ndollars is something we do because many -- many and most of our shareholders are U.S. based, but it does create this distortion here because -- and that was my comments in terms of the prepared comments. The performance of the, actually, underlying business was about -- was up 10%. And this is during a period of, you know, obviously, a lot of turbulence in both the macroeconomic and geopolitical environment.\n\nSo, the company actually did pretty good in this third quarter. It's something that we have not decided. If there's no foreign exchange derivatives or instruments that we would use to modify that, it's an unfortunate part of our reporting that we've taken for investor purposes.\n\nAmit Dayal -- H.C. Wainwright and Company -- Analyst\n\nUnderstood. That's [Technical difficulty]\n\nOperator\n\nI'm going to move on to the next caller, if that's all right. We seem to have difficulty hearing Mr. Dayal. The next question is from Colin Rusch from Oppenheimer.\n\nPlease go ahead.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThanks so much, guys. Could you talk a little bit about the progress that you're making on engineering subcomponents for the hydrogen system? You know, obviously, producing a vehicle is a big deal, but getting ready for mass production is another level of preparation. Just curious how that's coming along.\n\nDavid Johnson -- Chief Executive Officer\n\nYeah. Thanks for the question, Colin. So, you're right that, you know, demonstrating a vehicle is a big deal. We're very happy about that.\n\nAnd, fundamentally, to do that, we've used off-the-shelf components that are in production today for our natural gas production products. So, from our perspective, you know, those demonstrators work great. We fully recognize that there is some optimization and some development and validation cycle that we're proceeding with in this time so that we're ready for production hydrogen products. I do think those production hydrogen products are kind of in the '25 to '27 time frame.\n\nAnd so -- because the normal cycle for OEMs is going to be a full development and validation of the calibration and the hardware, including both the engine, our fuel system, the fuel storage, the whole integration on the vehicle. And so, that's kind of the cycle, but we continue to make progress and make investments, which are relatively modest because our hardware is largely the hardware that we already have in production. We expect some tweaks as you can imagine. So, for example, when we develop the injector, we do CFD work to analyze the combustion system with hydrogen and how it's different than natural gas, and then we make modifications to the nozzle.\n\nAnd so, we're already testing and developing different nozzle patterns that fit both with our customers' engines, as well as with hydrogen fuel. And so, that is, I would say, a normal part of our business, but now a little bit of uniqueness relative to hydrogen.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nOK. That's super helpful. And then, maybe I missed it, but just -- can you just give us an update on how the HPDI 2.0 ramp in China is coming along and any signals that you're getting around inflection points on that in any way?\n\nDavid Johnson -- Chief Executive Officer\n\nYeah. Thanks for asking. Fundamentally, we didn't talk much about it in the call so far. There is progress.\n\nWe do see that, but we're really a bit gun shy about calling any timing on when that product might hit the market. Fundamentally, a good thing that we see globally is what I referenced earlier about natural gas commodity prices coming back down that will help the equation because fundamentally, product in China is going to be sold based only on TCO for the most part. And so, we need that fuel price to come back down to make the -- any natural gas product in China commercially attractive. And so, that's happening.\n\nOur customer has continued to do work to be ready to launch the product. And so, we're -- we're anticipating that, but I don't have any timing that I can share with you other than to say, there's work going on. And so, they wouldn't be doing the work if there wasn't an intention to go to market at some future date.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nPerfect. Thanks, guys.\n\nDavid Johnson -- Chief Executive Officer\n\nAnd maybe I should just add, Colin, we actually are spending also a tremendous amount of our time and energy working with customers broadly in China with respect to the opportunity for hydrogen. You know, hydrogen in China today is already, I would say, like refueling infrastructure, more developed than the other markets that I can see. So, they have more than 1,000 hydrogen stations is the information that I've seen and heard about the Chinese market. And so, that push toward hydrogen in China is very, very real.\n\nYou've seen a number of announcements perhaps of spark-ignited hydrogen engines demonstrating and low volume and so forth. Of course, we see that with hydrogen HPDI, and this is what we're talking to the OEMs in China, as well as other markets, of course, about is the potential to have a much more superior product with hydrogen HPDI, more power, more torque, more efficiency than it's possible with the spark-ignited hydrogen product. And so, we think that's an important part of what we're doing right now that will pay benefits in the future.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThat's, actually, quite helpful. I appreciate the additional color there.\n\nOperator\n\nThe next question is from Jeff Rossetti with Cowen and Company. Please go ahead.\n\nJeff Rossetti -- Cowen and Company -- Analyst\n\nGood morning.\n\nDavid Johnson -- Chief Executive Officer\n\nGood morning.\n\nJeff Rossetti -- Cowen and Company -- Analyst\n\nDavid, you mentioned earlier you expect to release results from your AVL-TUPY demonstration at the end of Q1. And I was just wondering if you could provide any findings you might expect and how it might be differentiated from Scania and if there was any update with testing with Cummins.\n\nDavid Johnson -- Chief Executive Officer\n\nYes, sure. Glad to talk about those, Jeff. So, first of all, on AVL-TUPY, we have an engine and test cell with our hardware, their engine, our -- our -- their \"OEM\" engine with our hardware in it. And we're starting that development.\n\nNow, we expect to have some results. I would tell you in every case, you know, it's up to our partners, in this case, AVL and TUPY, to make the decisions on what kind of announcements we can make, when. But we're hopeful to have some color, at least, if not some data to offer the market in Q1 as we said. What we expect out of that testing, I would say, is very similar to what we found with other engines.\n\nAnd that is that, basically, the application of our HPDI technology, in combination with hydrogen, on an otherwise formerly diesel engine will offer about a 20% improvement in power, about a 15% improvement in torque, and about a 10% improvement in efficiency. And these are really important numbers. I mean, you don't typically get double-digit percentage increases in any of those parameters, let alone all three, but we've done this on a number of engines already. Some you can see on YouTube, some we talked about in our press release about our Scania work.\n\nAnd I would tell you, we expect the same kind of increment. And -- and, hopefully, we can demonstrate even more through the contributions that TUPY is making with respect to the engine structure. So, having greater engine structure, in terms of pressure capability, can improve the engine and then get more out of our fuel system as a result. So, we're very much looking forward to bringing that development through the cycle and then sharing results when we can.\n\nYou asked also about Cummins. And that work is basically completed from our side. We've done the necessary studies that Cummins asked us to perform, and they're now evaluating where does hydrogen HPDI sit in their portfolio. And we look forward to some opportunity to do some more work with them.\n\nJeff Rossetti -- Cowen and Company -- Analyst\n\nGreat. And I appreciate the detail you provided on your path to commercialization of hydrogen HPDI. Just wondering, I think you called out '25 through '27 as a potential time frame for commercialization. Are there any milestones that you are targeting for, say, 2023 to put you on that path?\n\nDavid Johnson -- Chief Executive Officer\n\nExpect in 2023, you'll hear more from us with respect to developments like the kind we've already done, you know, the AVL-TUPY news, for example. I expect there'll be more OEMs that will be testing our fuel systems on their engines. I expect with the OEMs that we already worked with for like the Scanias and others, there'll be next steps that we'll have a chance to announce. So, I think you'll hear that kind of news from us in the coming quarters.\n\nBut looking out further, I'm very keen on the opportunity to make some demonstration fleets. So, fundamentally, you've seen this in the fuel cell world, for example, Hyundai in Switzerland has been demonstrating fuel cells. There's quite a few fuel cell applications that have been announced. You know -- and so, I think that same kind of activity for us would be quite straightforward.\n\nAs you saw with our demonstration vehicle that we showed in Long Beach and also in Hanover, this is a driving prototype. It tows 40 tons. So, 80,000 pounds of freight, it drives very, very well and all on, you know, hydrogen, zero-carbon hydrogen. So, actually, making demonstrator vehicles, there are some, you know, certification and exemptions and things like that that we need to do.\n\nBut I think that's the activity that, maybe, we'll be announcing some of that also in 2023 for deployment in '24, '25, '26. So, this is basically the path that we're expecting.\n\nJeff Rossetti -- Cowen and Company -- Analyst\n\nThanks very much.\n\nDavid Johnson -- Chief Executive Officer\n\nMy pleasure.\n\nOperator\n\nThe next question is from Chris Dendrinos with RBC Capital Markets. Please go ahead.\n\nChris Dendrinos -- RBC Capital Markets -- Analyst\n\nHi, thank you. I just wanted to, I guess, hone in a little bit more on some of your comments around policy here. And I think, you know, one of the bigger investor concerns out there is that most of the policy and incentive programs right now are focused more on -- on the battery side of technology. So, as it relates to your discussions in Brussels and Washington, what's kind of the receptivity of policymakers to, you know, the technology that might not be exactly zero emissions.\n\nAnd, I guess, what's their understanding of the technology today?\n\nDavid Johnson -- Chief Executive Officer\n\nYes, it's a great question, Chris, and thank you for asking it. So, we feel it's very important for us to carve out the time with the truck and our team to go and speak with and inform and educate policymakers around the world because, fundamentally, even, you know, just two years ago, there was no idea, no concept, no discussion around internal combustion engines with hydrogen. Primarily, I would tell you because, you know, most people, 99.9% we're thinking about a spark-ignited product, which has tremendous challenges with respect to preignition knock and so forth because hydrogen is so combustible. And so, I would tell you that, you know, the basic mentality, policymakers and much of the public domain is around.\n\nIf it's hydrogen, it must be a fuel cell. And so, we're having to -- we need to, it's our task to do so, educate people about the opportunity that we've unveiled and demonstrated in our test cells and with our demo trucks. And so, that is what we're doing now. And I think that -- in all my experience in the industry, regulators like to write regulations like -- regulators write regulations, in most cases, for technologies that they know can be applied to achieve that regulation.\n\nKind of this was the work of the U.S. DOE over decades -- has been let's go demonstrate this possible so that the regulators can write a regulation forcing it to happen. And so, whether it's a 50% BTE goal they had for many, many years. And so -- that's kind of the -- I'll call it modus operandi of regulators is to write regulations for technologies that they know of and they know can be deployed.\n\nSo, therefore, as we go to D.C. and Brussels and help policymakers understand this is possible, \"No, here it is, here are the keys, drive it. Here's the data. Here's the development path.\n\nThis is going to be ready,\" that will inform future regulatory-making. That's our approach to the marketplace and approach to policy. And, fundamentally, I believe they're going to be really happy about this, and they're going to be willing to make those changes to regulations because the significant opportunity to decarbonize long-haul trucking, which is super, super hard to decarbonize -- you know, let's just call it out. Tesla has had access to tremendous amounts of capital, and yet their truck is still not out, announced four years ago.\n\nAnd why? Fundamentally, because it's got a lot of batteries on it. It will have less payload capability. It's going to be super expensive to acquire, and, you know, it's a super challenging application to electrify. It's not Tesla.\n\nIt's about the physics, the economics, and so forth. And so, for long-haul heavy-duty trucking -- and I'll go a step further. We talk -- you know, we're a Canadian company with a lot of mining in Canada. We talk about mine haul trucks.\n\nThese are super hard to decarbonize because they use so much energy, and they run so many hours. And so, they can't stop and recharge. And so, this is where we play. This is where we play, and helping regulators understand that will allow them to write regulations that then promote and encourage our technology to come to market.\n\nSo, we think it's a really important part of what needs to be done, what we are doing, and we expect it to be effective. It will take some time, but it will be effective.\n\nChris Dendrinos -- RBC Capital Markets -- Analyst\n\nGot it. Yeah, thank you. I guess, maybe just switching gears here really quick, focusing maybe on some of the inventory levels. I think you had previously mentioned that you were looking to monetize some of that or draw down and, I guess, have a maybe more efficient use of your working capital.\n\nCan you provide any, I guess, updates on that process, kind of what are you thinking right now and maybe the ease of the ability to monetize some of that?\n\nDavid Johnson -- Chief Executive Officer\n\nYeah. So, good question. Happy to talk about our inventory. For sure, it's too high.\n\nIt's not at the level that we wish to have and we expect to sustain. So, it is an active effort on our part to move that inventory and reduce our levels. I would tell you, there's two fundamental drivers in that. There's a lot of drivers, of course, but two big elements.\n\nOne element is on the electronics side. You all recall, I'm sure, how chips were in short supply and still aren't so easy to get. And we had a lot of our chip suppliers come to us and say, \"Listen, we need to know exactly what you need. And so, please place orders now for material 18 months out.\n\nAnd you can't cancel these orders. You can't change these orders. We need to know, and you need to commit to it.\" So, we're sitting on quite a bit of inventory of chips. And every day, we're working to get that last chip that's required to make that ECU or that controller that we need to make.\n\nAnd so, moving to a more, let's say, normalized supply chain dynamic with respect to electronics will allow us to unlock on the order of $6 million, $8 million of inventory that's on our books right now just in electronics. So, that's kind of, I'll say, a perturbation of the market that's happened right now, whether you call it from COVID or inflation or whatever the dynamics are that caused the supply chain to do that, we're just dealing with it. And we expect to unwind that and monetize that inventory in electronics as an example going forward. The other one is our HPDI inventory.\n\nOur HPDI inventory is higher than it should be, and that's because we haven't seen the growth volume in sales that we were forecasting. And so, we were building inventory to -- not inventory, but we have the pipeline full for a certain kind of volume expectations that was pre the war with Russia and Ukraine. And so, as LNG prices have gone up and the volumes have been flattening, we've built an inventory in HPDI that we do expect to monetize. And that includes, you know, expectations on our part that we will move product to China with Weichai.\n\nAnd so, those things, we still have on our list of things to do, and that will help us to unwind that inventory and turn it from inventory into cash.\n\nChris Dendrinos -- RBC Capital Markets -- Analyst\n\nGot it. Thank you.\n\nDavid Johnson -- Chief Executive Officer\n\nMy pleasure.\n\nOperator\n\nThe next question is from Bill Peterson with J.P. Morgan. Please go ahead.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nYeah. Hi, good morning, guys. And, Richard, just want to say, it is nice really working with you over the last, you know, couple of years, so good luck in your next endeavors. On conventional HDPI, HDPI --sorry, I can't even say it.\n\nLast year, you had some really nice growth in your lead customer in Europe. So, I think you said you have 1,000 trucks on the road or thousands of trucks on the road. I wanted to discuss what you're seeing in terms of reliability and uptime relative to diesel. You talked about some of the performance benefits.\n\nBut, I guess, was the warranty issue related to that at your lead customer? Trying to understand what the interest in these trucks could look like, should nat gas pricing start to normalize, if you can answer that. And then, I guess, to that second point about nat gas normalizing, the U.S. still actually is a relatively less expensive place compared to other places. And diesel's in short supply, particularly in the Northeast.\n\nSo, do you see additional interest, maybe, stemming from -- from that spread? Thank you.\n\nDavid Johnson -- Chief Executive Officer\n\nYes. Great questions, Bill. Thanks for joining us this morning. So, with respect to the durability, reliability of our product in Europe, we have been on, let's say, a journey from the launch in 2018 through now.\n\nAnd we have had a variety of challenges with the product along the way. But the team has done exceptional work to really stomp out those problems early and minimize the impact. And so, right now in the marketplace, I would tell you that people are thrilled with the durability, reliability. And the primary reason for that is because, fundamentally, we've developed the system, we've solved the early problems.\n\nAnd it's -- the basics of the system are based on a diesel engine. So, we're not asking the engine itself to do anything that it's not used to doing. And I guess, just to contrast that, you know, spark-ignited natural gas engines run hotter. They have challenges that diesel engines with our HPDI system don't have.\n\nAnd so, we feel we're in a very good place. The fleets love the product. And really, all that's tempering demand at this point in time is the high price of natural gas. And so, as we see that commodity price come down, we need to see that commodity price flow through all the way to the pumps so that fleets can say, you know, let me buy more HPDI-equipped trucks, so I can deliver freight and do it with a lower TCO.\n\nSo, that's really the story there. With respect to U.S. and natural gas prices and, frankly, your point on scarcity of diesel, fundamentally, in the marketplace for all of our products, the equation isn't so much about the price of natural gas or the price of LPG and the price of gas or the price of diesel. It's really about the delta between the two.\n\nCan I save money by using natural gas versus diesel? Can I save money by using LPG instead of petrol? It's the price differential between the two fuels. So, when diesel gets scarce and diesel prices go up, that will help our natural gas and our LPG business as people look for alternatives. And I'll say it even more broadly. Fundamentally, in every market around the world, when energy gets more expensive, all energy, electric, by the way, natural gas, petrol, diesel, when energy gets more expensive, people go looking for alternatives.\n\nAnd it's where there's that price differential that offers our customers a savings by using natural gas, biomethane, hydrogen or LPG, that's where we win because we're the gas and fuel specialists.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nOK. Thanks for that color. I think the next one is probably for Richard, and I asked this the last quarter, too. But when we think about the cost and use of cash, opex -- you should be getting advantages, I guess, in opex the same way, you know, with the USD relative to other currencies.\n\nBut offsetting that, you have inflation. So, trying to understand how we should think about opex trajectory looking out over the next few quarters. And then, I think, in terms of capex, you -- I think you talked about maybe around $15 million, it looks like you're going to be probably ending up a little short of that. But, I guess, is this push into next year or, I guess, any color on how we should think about capital intensity as we're looking ahead to 2023 in terms of the use of cash? Thanks.\n\nRichard Orazietti -- Chief Financial Officer\n\nThanks, Bill. And thank you very much. Much appreciated your comments before. It's been great working with you as well.\n\nThe -- with regards to per share on the foreign exchange because we do -- a lot of our engineering is done in Canada. And so, we did get the benefit of that. We're in a rationalization moment right now because, we're, you know, quite well aware, you know, of our liquidity and trying to be responsible, call it fiscally disciplined on that. So, next year, I mean, we're in the neighborhood between $15 million and $20 million.\n\nWe're trying -- we've got, obviously, a lot of investments in the future and hydrogen being one of it and we're doing some work on LPG for Euro 7 and then there's a natural increase of capacity for HPDI. We're trying to stay in that number. And the purchasing that we're doing is in euros predominantly. So, there's a little bit of an advantage there, but we are purchasing certain equipment from the U.S.\n\nWith regards to opex, we spent a little bit more money this year. Probably, we're trying to promote HPDI and build awareness, specifically with hydrogen. There is -- we'll call it the sort of the education process that David referred to, and that's gaining a lot of actual interest within the industry. It didn't just come from us.\n\nEverybody -- every major OEM is considering hydrogen ICE programs as well as part of their portfolio. And so, there was a little bit of extra money that we have to spend there. But, you know, generally, the -- our operating expenses will be more or less aligned, if anything, we're, you know, tightening the belt as well as the year progresses.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nThanks, Richard. Thanks for the color. Good luck.\n\nRichard Orazietti -- Chief Financial Officer\n\nThank you, Bill.\n\nOperator\n\nThis concludes the question-and-answer session. I'd like to turn the conference back over to Mr. David Johnson for any closing remarks.\n\nDavid Johnson -- Chief Executive Officer\n\nThank you very much. And thanks, everyone, for joining our call this morning. You know, I think at the top line for our company, we've been through a very challenging time and the challenges keep coming, but we keep making progress. Fundamentally, to think about our revenues being up 10% year over year on, you know, absent foreign exchange, which is just a translation error in the context of a place where we've got high natural gas prices, both CNG and LNG, a war in Russia, constrained supply of LNG.\n\nI think there's a lot of people out there that can understand in 2025, in 2030, in Europe specifically, we need to make really big improvements in CO2 of long-haul trucking, 15% by 2025, 30% by 2030. And everybody in Europe is thinking about how do we make those standards tougher. And when you think about a technology like hydrogen HPDI being able to offer a 98% reduction in carbon and do so very affordably, right, that will have a huge impact on the fleet average for those fleets. So, we really see a bright future ahead.\n\nI appreciate the chance to speak with all of you today and field your questions, and I look forward to the chance to meet with investors at the Craig-Hallum Conference next Thursday in New York City. And then, we have an upcoming Capital Markets Day that we'll do in Toronto [Inaudible] So, I look forward to continuing the discussion and helping understand better the future for Westport Fuel Systems. Thanks again for your time. Have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAshley Nuell -- Senior Director, Investor Relations\n\nDavid Johnson -- Chief Executive Officer\n\nRichard Orazietti -- Chief Financial Officer\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nAmit Dayal -- H.C. Wainwright and Company -- Analyst\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nJeff Rossetti -- Cowen and Company -- Analyst\n\nChris Dendrinos -- RBC Capital Markets -- Analyst\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nMore WPRT analysis\n\nAll earnings call transcripts"
}