{
  "companyName": "Splunk",
  "companyTicker": "SPLK",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/30/splunk-splk-q3-2023-earnings-call-transcript/",
  "content": "Splunk (SPLK -0.52%)\nQ3 2023 Earnings Call\nNov 30, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. And welcome to the Splunk Inc. third quarter 2023 financial results conference call. I would now like to turn the call over to Ken Tinsley, corporate treasurer and vice president of investor relations.\n\nPlease go ahead.\n\nKen Tinsley -- Vice President, Investor Relations\n\nGreat. Thank you, Monty, and good afternoon. With me on the call today is Gary Steele. After market closed today, we issued our earnings press release, which is also posted on our investor relations website, along with supplemental material.\n\nThis conference call is being webcast live. And following the call, an audio replay will be available on our website. On today's call, we will be making forward-looking statements, including financial guidance and expectations, including our long-term growth and profitability and expense reduction efforts; forecasts of our fourth quarter and full year fiscal 2023; and our future expectations of revenues, total ARR, cloud ARR, operating margin, and free cash flow; as well as trends in our markets and our business, our strategies, our expectations regarding our business, acquisitions, products, technology, customers, and demand. These statements are subject to risks and uncertainties and based on our assumptions as to the macroeconomic environment and reflect our best judgment based on factors currently known to us.\n\nActual events or results may differ materially. Please refer to documents we filed with the SEC, including our Form 10-K and 10-Qs, as well as the Form 8-K filed with today's press release. These documents contain risks and other factors that may cause our actual results to differ from those contained in our forward-looking statements. These forward-looking statements are being made as of today, and we disclaim any obligation to update or revise these statements.\n\nIf this call is reviewed after today, the information presented during the call may not contain current or accurate information. We will also discuss non-GAAP financial measures, which are not prepared in accordance with generally accepted accounting principles. A reconciliation of GAAP and non-GAAP results is provided in the press release and on our website. The format for today's call will be a little different.\n\nWith the CFO position open and the search underway, Gary will provide our prepared remarks, including an overview of results, highlights in the quarter, and the outlook for the remainder of the year. We'll then move to a brief question-and-answer session. Just a reminder that most of our financial and operating metrics are provided in the supplemental slides, which are available on our IR website. And unless otherwise noted, financial comparisons made on this call are all on a year-over-year basis.\n\nSo with that, let me turn it over to Gary.\n\nGary Steele -- President and Chief Executive Officer\n\nThanks, Ken. Good afternoon, everyone, and thank you for joining today's call. I am pleased to report that we delivered solid third quarter results, demonstrating progress in our disciplined approach to deliver long-term durable growth and profitability. We grew total revenues by 40% year over year to $930 million, and cloud revenues 54% to $374 million.\n\nOur top-line outperformance was driven by strong term license demand from existing customers, underscoring the value our customers continue to gain from Splunk's mission-critical security and observability solutions, powered by our one-of-a-kind data platform. That said, as noted last quarter, we continue to see caution from customers on the timing of their cloud migrations and expansions, citing ongoing macro concerns. In addition to our top-line results, we made good progress on our expense controls, which I'll detail in a moment. Our revenue outperformance and expense reductions were key contributors to delivering a nearly $350 million improvement in free cash flow on trailing 12-month -- over trailing 12-month basis.\n\nI'd like to thank the entire Splunk team for their commitment and execution throughout the quarter. Q3 results illustrate one of the core reasons I joined Splunk in the first place. Splunk is the leader within a massive and growing market opportunity. And in the current macro environment, we believe the prioritization of IT budgets is benefiting platforms like ours.\n\nSplunk helps the world's largest and most innovative organizations be more resilient so they can adapt to, respond to, and recover from threats, disruption, and attacks faster and more efficiently. Within today's economic environment, the evolving cybersecurity landscape, and the ongoing demand for digital transformation, Splunk provides unparalleled capabilities at scale and the partnership that organizations need to keep their systems secure, reliable, and performing. Our differentiated technology is deeply appreciated by our customers who are continuing to invest in the Splunk solutions they need to drive faster insights and actions across security IT, and DevOps. Only Splunk delivers the highly scalable and extensible platform organizations require to gain end-to-end visibility of all their data across on-prem, hybrid, and multi-cloud environments.\n\nConsider our leadership in security. In October, Gartner named Splunk a leader for the ninth consecutive year in its magic quadrant. We are again among the identified companies in terms of ability to execute and completeness of vision. And that's just one measure of our success.\n\nWe hear time and time again from CISOs that the breadth and depth of Splunk security solutions are critical for our security teams and underpin their security operation centers. Turning to IT operations and DevOps, our portfolio of enterprise-grade observability solutions provides customers with full fidelity monitoring and visibility across our IT infrastructures, applications, and customer-facing digital experiences. Splunk has been recognized for leading the market in AIOps and in cloud observability by GigaOm, research and action, and constellation research. Splunk was recently rated first in IDC's market share ratings for the IT operations analytics software market.\n\nWe were also the market share leader by revenue in Gartner's 2021 market share report for all software markets worldwide in the health and performance analysis software market subsegment. Today, our comprehensive product portfolio delivers incredible value to our customers across our core markets. As we look ahead, we're continuing to innovate. Early next year, we plan to roll out an enhanced unified security console, further helping organizations modernize their stock with a unified security operations experience to detect, investigate, and respond to threats from one common work surface.\n\nWe're also planning to enhance Splunk Observability Cloud with new features to help customers identify long-tail issues before they grow into -- they grow and impact multiple users and with new tools to collaborate more effectively to resolve those issues faster with deep insights into [Inaudible] and cloud-based networks. Our security and observability offerings will also be bolstered by continued innovation in our underlying platform. To that end, we're focused on increasing access to a wider range of data sources and providing greater control over the redaction, filtering, and routing of data and motion with Edge Processor and Ingest Actions technology. In addition, enhanced federated search capabilities will enable customers to access data stored in third-party data lakes, all from one Splunk search bar.\n\nOur performance in Q3 underscores the value customers place on Splunk, as well as the focus of our team, particularly given the uncertain macro environment. As we shared on last quarter's call, we continue to see a slower pace of cloud migrations and expansions as customers remain cautious with their budgets and reprioritize their investments. This caution was evident in our cloud DBNRR, which remained strong but ticked down slightly in Q3 to 127% as we expected. We remain committed to partnering with our customers to support moving their workloads to cloud on their timeline.\n\nWhile it's a cost- and resource-intensive undertaking, most of our customers continue to acknowledge long-term value in transitioning to the cloud. In the meantime, given the flexibility of our hybrid deployment model, many are continuing to support their complex architectures on prem. So, while we did not see any meaningful change in the pace of cloud expansions and migrations in Q3, customer engagement remained strong, and overall demand for Splunk was good. RPO bookings were $1.1 billion in the quarter, up 37% year over year.\n\nTotal ARR was 3.47 billion, up 23%, and cloud ARR was up 46% to $1.62 billion. Let's turn to our customers. Splunk partners with some of the world's largest and most innovative organizations, including more than 90 of the Fortune 100. I deal with customers every week, and I'm hearing over and over about their passion for Splunk and the mission-critical role we play in driving their overall business resilience.\n\nDuring the quarter, we are pleased to earn six distinct best-of awards from TrustRadius. The results of which were determined entirely by customer reviews. We had many compelling customer wins during the quarter that demonstrate the breadth of our offering, as well as our expertise. I'd like to share a few examples with you today.\n\nOne of the world's top investment banking and securities firms renewed its on-prem Splunk platform agreement and signed a new three-year agreement with both Splunk Cloud and Observability Cloud to drive innovation and continuously improve credit card operations. This customer processes billions of dollars in credit card transactions annually and requires fast-paced, resilient operational efficiencies. They turned to Splunk because alternatives would have been too risky and require years to implement with five or six IT staff. Our cloud-based approach and observability technology will help ensure this team can be up and running in a matter of days, which is two or three of their staff.\n\nA department of the U.S. federal government signed a three-year multimillion dollar agreement to expand their use of Splunk Enterprise Security with additional professional services and Splunk education. This department supports our nation's defenses, and we've collaborated with them for more than five years to help ensure they have access to data-driven insights to combat threats, avoid disruption, and mitigate risk across multiple locations. Splunk is deeply committed to supporting our nation's government agencies, and I'm looking forward to connecting with many of our public sector customers and partners at Splunk's annual GovSummit event on December 14 in Washington, D.C.\n\nWe also signed a multiyear multimillion-dollar renewal and expansion agreement with a major telecommunications company in Japan. With data volume growing at an exponential rate, this telco leader was struggling with the cost effectiveness of its existing on-prem data analytics model used in SIM, IT operations, analytics, and DevOps. We have continued to earn the customer's trust not only because of our unfailing support over the years, but also through the flexible, pragmatic cloud upgrade strategy we developed. We bundled Splunk Cloud and Splunk Observability into the solution to ensure smooth -- a smooth and stable transition to the cloud.\n\nWe also advised the customer to switch from an ingest-based to a workload-based license, enabling them to manage their environment without limiting the amount of data they send into Splunk. Finally, this quarter, we expanded our footprint with a top Fortune 100 retailer. We work as a trusted advisor with this company for several years. And last year, we took them from on-prem to the cloud with a three-year multimillion-dollar deployment of Splunk Cloud.\n\nFast forward this quarter when we displaced one of our SIM competitors with cloud-based Splunk Enterprise Security. Ultimately, the competitor lacked the required scale and couldn't keep pace in today's rapidly evolving security landscape. Only Splunk could provide the capabilities and partnership they need to keep their digital systems resilient. As we move forward in this uncertain economic environment, we are focused on managing the business with a balanced approach to growth and profitability.\n\nThe combination of our business transformations plus the operational efficiencies that we're continuing to unlock is leading to good results. On the gross margin side, we've made excellent progress managing direct costs over the past several years. During the quarter, we continued to deliver steady cloud gross margin expansion, driven by ongoing optimization actions, working with our cloud service provider partners, as well as engineering and cloud delivery improvements that allow us to better align infrastructure requirements to our customers' needs. As a result, I am pleased to share that cloud gross margin surpassed 72% in Q3, our highest ever, up 8 percentage points over Q3 last year and hitting the 70% milestone that we've previously targeted and sooner than expected.\n\nOur sharply higher cloud gross margin drove a stronger total gross margin of 82% in Q3, up five points over last year. Turning to our operating expense reduction efforts, we're also making good progress in the four areas we've identified on last quarter's call. Contingent labor, travel and expenses, hiring, and real estate. We've begun taking action to reduce our total labor costs by utilizing contingent labor for only the most business-critical projects.\n\nOver time, we think there is substantial cost savings here. For T&E, we continue to limit spend on customer-facing travel and support only. And our customers -- and our employees have adjusted to an ongoing culture of expense reduction and efficiency. Our measured and deliberate approach to hiring has allowed us to drive efficiencies across our entire business while still expanding overall sales capacity.\n\nFor example, we recently realigned the parts of our sales teams that are focused on security and observability product areas in favor of a single-seller model. This change aligns directly to feedback from our customers, who are increasingly asking for solutions across our unified security and observability platform and to deliver outcomes across security, IT, and DevOps use cases. As a result, we're continuing to hire more quota carriers while ensuring sellers have access to the right technical and industry expertise. We've also begun to focus more of our engineering hiring outside of the U.S., affording this greater access to diverse, cost-efficient talent.\n\nFinally, we continue to evaluate our global facilities footprint, identify opportunities to reduce or consolidate office space where possible. For example, in San Francisco, we recently consolidate operations from two buildings into one and will not renew the lease on one side. This actually will result in more than $15 million of cost savings. It typically takes time to realize cost efficiencies from real estate changes, but we expect to pursue several additional opportunities over the near term, which could result in meaningful savings as early as next year.\n\nBeyond these four areas of focus, there are many other opportunities to streamline operations and increase profitability. Just one example is a more expansive approach on transacting in multiple currencies globally. Historically, we denominated all customer contracts in U.S. dollars and have relied on partners to absorb foreign exchange risk in exchange for a discount.\n\nAs we continue to enhance our international execution capabilities by denominating contracts in local currency, we can assume the FX risk, hedging ourselves and capture higher growth value of the underlying contracts. Overall, through our discipline and prioritization, we're making significant progress on the cost initiatives, which contributed to a $30 million sequential decrease in total opex in the quarter and a year-over-year decrease of 2%. We are pleased with our progress on expense control and remain confident we can continue to drive operating leverage from high-impact cost efficiencies going forward. We are simultaneously investing in differentiated technology and leadership that are driving long-term growth opportunities.\n\nSince joining the CEO in April, I've been laser-focused on accelerating innovation from a product organization. In Q3, we welcomed Tom Casey, our new SVP and GM of platform, as well as Jason Lee, our new CISO. Both Tom and Jason are highly regarded in the industry and known for their ability to execute while staying very close to customer needs and feedback. We're already feeling the difference of having these leaders on board, engaging with customers, and leaning in with their organizations and our product roadmap.\n\nOn the M&A side, earlier this month, Splunk acquired TwinWave, a cybersecurity start-up with unique technology that automatically follows and analyzes complex attack chains that would otherwise require cumbersome manual workflows for security analyst. TwinWave founder and CEO, Mike Horn, is now serving as SVP and GM of Splunk's security team. Bringing in his key talent in technology is further bolstering our world-class technical team, and I am excited about what we'll deliver together in FY '24. In September, we welcomed a new partner leader, Gretchen O'Hara, as VP of worldwide channels and alliances.\n\nGretchen brings decades of experience, leading channel ecosystems, building alliances, and developing strong teams. Within weeks of joining, Gretchen and her team signed a five-year extension to our strategic collaboration agreement with Amazon Web Services. And just this week, AWS named Splunk the 2022 IFC Partner of the Year for North America. We also welcome the new chief people officer, Sharyl Givens.\n\nSharyl has a proven track record of successfully developing and leading people-centric strategies at public companies and technology start-ups. I worked with Sharyl for a long time, and I'm confident she brings not only the expertise we need to scale as a global business with a hybrid and geographically distributed workforce, but also that she is a great fit within Splunk's unique culture. And while on the topic of executive hiring, we're making good progress on our CFO search. As you'd expect, for a company with our profile and opportunity, interest in the role has been high, and we have a great slate of high-caliber candidates.\n\nWe're taking the time needed to choose the right CFO to help steer Splunk through our next chapter. Looking forward toward the end of the year, we're confident in our execution plan and are reaffirming our full year total ARR target of $3.65 billion. We remain cautious on the pace of cloud migrations and expansions, given the challenging macro environment. So, we're moving to a range for cloud ARR of between $1.775 billion and $1.8 billion versus our prior point estimate of 1.8 billion, primarily due to continued uncertainty of cloud mix.\n\nFor Q4, we expect total revenues of between $1.055 billion and $1.085 billion with a non-GAAP operating margin of between 23% and 26%, reflecting expense reduction efforts and continued profitability improvement. For the full year, we're increasing our outlook for total revenues to between 3.455 billion and 3.485 billion, reflecting our Q3 outperformance. We're also upping our total op margin expectation from 8% to between 12% and 13%. We expect higher free cash flow of $420 million from expense savings in the back half of this year.\n\nAs I wrap up, I want to reiterate my appreciation to our global Splunk team and for their disciplined execution during Q3. Since they joined in April, I've been constantly impressed not only by the caliber of our talent, but also the deep customer-first mindset across our business. I also want to thank the tens of thousands of global customers who trust us with their complex and mission-critical workloads. We will continue to deepen our relationships to support customer security and observability needs across on-prem, cloud, and hybrid architectures.\n\nFinally, as I mentioned, the demand environment is strong, and we are reaffirming our total ARR target for the full year. As a guiding principle, we are committed to maintaining a disciplined approach to optimizing costs and improving efficiency and profitability, while continuing to invest in future growth opportunities that we expect will drive long-term value. Thank you again, and I look forward to your questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Raimo Lenschow from Barclays. Please proceed.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Thanks for taking my question, and congrats. And, Gary, like, could you speak to the dynamic in terms of cloud versus the old -- not the old, but the, you know, people staying on premise and doing it themselves? And how do you see that dynamic play out, especially in this environment as well, where, you know, you kind of might kind of batten down the hatches and just kind of continue to do what you do versus kind of doing new projects and moving to the cloud. And how are you standing as a company toward that? Is that kind of something you want to push a little bit more? Are you happy with where customers are? Can you speak to that, please? Thank you.\n\nGary Steele -- President and Chief Executive Officer\n\nYeah, you bet. So, as we indicated last quarter, we did see -- because of macro conditions, we saw some cloud migrations and expansions move out. And it was very consistent through Q4, where we saw the same behavior on buying. We did not see, however, we didn't see any less loyalty to renewal.\n\nOur renewal rate stayed incredibly high. And so, I think what's happening is customers definitely see the value of cloud. They know they're going there, but they will pace their migration. And they will pace their migration when they are ready to make that move.\n\nAnd I think we've done a good job of clarifying with our customers as well that we are very supportive of a hybrid model, where customers embrace on-prem in addition to cloud. And we think that's a strategic differentiator for the company as well. So, while cloud migrations have slowed down, we don't necessarily see that as a big negative in our business.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you. Congrats.\n\nGary Steele -- President and Chief Executive Officer\n\nThanks, Raimo.\n\nOperator\n\nOur next question comes from the line of Kash Rangan from Goldman Sachs. Please proceed.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nThank you very much, Gary and team. One of the key investor issues with Splunk has been despite the great growth, will it make cash flows? And finally, I think you delivered unbelievable cash flows, and congratulations on that. And my question is not going to be about cash flows only. But I just want to understand, Gary, what are the chances that the growth in cash flows is a more sustainable thing? And what are the things -- I think you do a great job outlining the operating margin levers and free cash flow levers.\n\nI think some of us are positively surprised how quickly this came to fruition. Can you maybe help us understand how philosophically this gearing toward free cash flow is more of a longer-term thing? And what are the levers that we could expect from the company as you give us more cash flows in the future? Second, more of a technology- or product-related question. If the economic environment does clarify, do you think the cloud business can get back to better growth rates? Thank you so much. And it will have [Inaudible].\n\nThanks.\n\nGary Steele -- President and Chief Executive Officer\n\nGreat. Kash, I'll answer your second question first. So, the second question, if the economic environment improved, do we think cloud migrations accelerate? We do believe that. And because I think these are projects that customers absolutely want to do, I think there's tremendous demand that they're being thoughtful on their timing based on macro conditions.\n\nSo, should macro conditions change? I think we will see cloud migrations accelerate. Going to your first question on cash flow, there's two things going on here. One, I think there's sometimes some confusion with our model. One of the very powerful, very cool aspects of our model is cash flow mirrors ARR.\n\nCash flow mirrors our ARR simply because whether you're a term license customer or whether you're a cloud subscription customer, you're paying us annually. So, there's lots of vendors in the industry that bill upfront for multiple years. We stopped doing that several years ago. So, again, I want to reiterate that one of the strengths in our model is the fact that cash flow mirrors what happens with ARR.\n\nAnd so, that provides long-term durability on cash flow, which personally I am super excited about. And I think it can deliver incredible value to investors over the coming years as we've now gotten out of this transition from the upfront billing to the annual billing. And then, coupled with that, as we've talked about, we've had some very focused expense initiatives that we've outlined in the prepared remarks in four categories. We've been at this -- I've now been with the company about seven months, and we've made tremendous progress, and I'm really proud of what the team has accomplished.\n\nBut we have a lot more that we can do. There's more efficiency that can be gained. And I think at the end of the day, we will be better able to serve customers with that efficiency. So, I think it's very much aligned to what customers want to see as well.\n\nSo, I'm super encouraged about the opportunity with cash flow. And I think at the end of the day, the power of this business model will be proven out with our free cash flow results.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nGreat job. Thank you very much, Gary.\n\nGary Steele -- President and Chief Executive Officer\n\nSure. Thank you, Kash.\n\nKen Tinsley -- Vice President, Investor Relations\n\nThanks, Kash.\n\nOperator\n\nOur next question comes from the line of Matt Hedberg from RBC Capital Markets. Please proceed.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for taking my questions, Gary. Could you talk -- you mentioned, you know, some of the challenges from a macro perspective, a little bit more color on how the quarter played out. Was the demand environment fairly stable? Or did things get a little bit more challenging toward the end of the quarter? And then, secondarily, how was the U.S.\n\n[Inaudible] for you all this quarter?\n\nGary Steele -- President and Chief Executive Officer\n\nYeah. So, first on macro conditions, we first started seeing a macro change in July. And so, what we did see over the course of the quarter was pretty consistent behavior. So, we didn't see more intense macro issues as we got to the close of the quarter.\n\nIt was very consistent throughout. And I think because we had started in July, it felt very consistent to us through that entire period. And it was really focused again around cloud migrations, which is typically our big projects or associated cloud expansions. That's really where we felt it.\n\nNow, I'll reiterate, as I said before, we saw great consistency, though, on renewals. We saw no issue getting customers to renew. It was really much more around cloud, where the macro conditions played a role. And then to your question on the public sector business, we were very pleased with the results that our public sector team delivered.\n\nWe had very good execution in the quarter, really proud of what the team put up for us. We still think there's a tremendous opportunity there. We have new leadership in our public sector team that's really helping us drive execution, so super excited about that as well.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThanks, Gary. Congrats.\n\nGary Steele -- President and Chief Executive Officer\n\nThank you.\n\nKen Tinsley -- Vice President, Investor Relations\n\nThanks, Matt.\n\nOperator\n\nOur next question comes from the line of John DiFucci from Guggenheim. Please proceed.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nThank you. Gary. Margins were really strong, right? So, I'm just curious, though, is when we think of that sort of conflicts sometimes between growth and margins, is that something that we should think a little bit more about if margins continue to be strong? In other words, is the focus on margins in any way inhibiting growth? Or is there just simply room for efficiency gains here while still in investing for ample growth?\n\nGary Steele -- President and Chief Executive Officer\n\nYeah. I do not think at all that we're inhibiting our ability to grow with the cost initiatives that we put in place. And I actually believe what we're doing is creating a more efficient business that can scale more effectively, that can better deliver for our customers. So, I do not believe anything that we're doing is inhibiting our ability for the business to grow.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nAwesome. OK. Thank you.\n\nGary Steele -- President and Chief Executive Officer\n\nYou bet.\n\nKen Tinsley -- Vice President, Investor Relations\n\nThanks, John.\n\nOperator\n\nOur next question comes from the line of Brad Sills from BofA Securities. Please proceed.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nOh, great. Thanks so much, guys. I wanted to double click on the efforts to drive efficiencies in sales and marketing. It sounds like single seller approach is the direction you're heading.\n\nCould you just explain a little bit kind of where you're coming from, why this might be productivity enhancement in the sales and marketing area?\n\nGary Steele -- President and Chief Executive Officer\n\nYeah, no, great question. So, historically, what we had were distinct sellers for security and observability, working in conjunction with core sales reps. And it actually wasn't great from a customer experience because you'd have multiple reps needing to interact with customers. And so, the single-seller model, supported by the right level of expertise and knowledge, is a more efficient way to handle the customers use cases and help drive the opportunities.\n\nIt's just much, much simpler. It's more -- it's simpler for sponsors, and it's actually simpler for our customers. And it ultimately results in that cost efficiency as well. So, it has multiple benefits to it.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat to hear. Thanks, Gary.\n\nGary Steele -- President and Chief Executive Officer\n\nYou bet.\n\nKen Tinsley -- Vice President, Investor Relations\n\nThanks, Brad.\n\nOperator\n\nOur next question comes from the line of Brad Zelnick from Deutsche Bank. Please proceed.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGreat. Thanks so much, and congrats on the strong execution in the quarter. Gary, we're clearly in an environment where customers are wanting to do more with less. And, you know, with some of the changes that you're enacting as we think about, you know, the go-to-market and having this single sales point of contact, I'm just thinking in what ways can Splunk ensure that you're the platform of choice for customers to consolidate requirements? And is that part of what's inspiring the changes that you're making in the field as well? Thanks.\n\nGary Steele -- President and Chief Executive Officer\n\nNo, that's exactly right. Because one of the things that we do see, to your exact point, is we see customers wanting to find ways to consolidate suppliers. They want to find ways to simplify their environment because that ultimately will be more cost efficient to run. And so, we see that even today.\n\nAnd I would even go back to one of the examples that we provided in our prepared remarks, where existing customer took out a competitive solution that had been using someone else's SIM solution and moved to Splunk SIM solution. I do think that this creates an environment with this revised selling model to capture more of that consolidation.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nAwesome. Thanks again.\n\nKen Tinsley -- Vice President, Investor Relations\n\nThanks, Brad.\n\nOperator\n\nOur next question comes from the line of Steve Koenig from SMBC. Please proceed.\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nHey, great. Thanks. Hi, Gary. Thanks for getting me on here.\n\nI'll ask you a multi-part question that's pretty short. The first part is, can you give us a little color on the big revenue beat this quarter? Was it -- you know, to what extent was deal duration, you know, a factor here? And then, secondly, you know, you are doing an awful lot as one person here. And, you know, the ship seems to be stabilizing. How are you spending your time? And how have you been spending your time? And how do you expect that to change over the next 12 months? What things are you focused on? Thanks very much, and congratulations.\n\nGary Steele -- President and Chief Executive Officer\n\nYeah. Thanks, Steve. So, to answer the first part of the question on the beat, the beat came in two forms. So, one was we, obviously, saw less cloud mix, and that was -- that came in at 56%.\n\nAnd so, that was slightly down from our expectations. And so, you had more churn that obviously drives revenue up. And then, the contract term was slightly up as well. So, the combination of those two things that provided for that broader revenue beat.\n\nAnd then, going to the second part of your question, where am I spending time, obviously, I'm spending time on driving these cost efficiencies. That's a priority because I think at the end of the day, all of you will want to value the company and the amazing free cash flow that we will deliver. And so, clearly focused on that side of things. But I continue to spend a lot of time with customers and being in market with our sales team to really understand how people are thinking about buying and making sure that I'm understanding the role that Splunk is playing in their future plan.\n\nSo, that's another critical element. And then, obviously, the third big area for me is to continue to recruit a world-class team. And I'm super encouraged by what we're seeing on the CFO front and look forward to announcing someone soon.\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nThat's great. Thanks very much.\n\nKen Tinsley -- Vice President, Investor Relations\n\nThanks, Steve.\n\nOperator\n\nOur final question comes from the line of Mike Cikos from Needham and Company. Please proceed.\n\nMike Cikos -- Needham and Company -- Analyst\n\nHey, guys. Thanks for getting me on here. I do want to circle up very quickly on the cloud migrations and those expansions that we're talking about. And I just wanted to see -- I know that we're talking about the single-seller model and you guys supporting customers in this in this hybrid environment.\n\nBut is there anything that Splunk can do or is doing to get in front of customers and help them with these migration patterns, kind of to support those cloud ARR metrics that you guys are moving toward?\n\nGary Steele -- President and Chief Executive Officer\n\nYeah. Really good question. So, we continue to encourage customers to move to cloud. That's going to be a focus of our sellers.\n\nAnd while we were -- our mix wasn't exactly what we expected going into the quarter, we're so pleased with the results. There's still really good cloud momentum. And I think the place where we're seeing opportunity is where we can provide some level of incentive around professional services and things like that that help incent customers to move more quickly. Those are things we continue to explore with our sales team.\n\nMike Cikos -- Needham and Company -- Analyst\n\nThank you. And one other, if I could.\n\nGary Steele -- President and Chief Executive Officer\n\nSure.\n\nMike Cikos -- Needham and Company -- Analyst\n\nGreat to see the cloud gross margins come in, I guess, north of that 70% --\n\nGary Steele -- President and Chief Executive Officer\n\nYeah. It's a big milestone, frankly. That was a big milestone for us. I'm really proud of the team and the work that was done to get there ahead of time, frankly.\n\nMike Cikos -- Needham and Company -- Analyst\n\nSo, I guess my question is -- and I just want to stress test this, but was there anything one-time there? And then, the follow-up is, is the 70% thought of as being more of a milestone, there's more room to push that higher over time?\n\nGary Steele -- President and Chief Executive Officer\n\nYeah, no, great question. This is not a one-time thing. This is durable, and we can go farther. What you will see, though, it will take more work to move those numbers.\n\nSo, you'll see smaller incremental moves, but you'll continue to see gross margin move up. And as you would expect, we've taken down the low-hanging fruit, and that's what's really driven us at this point. And not that it wasn't a lot of work, but we've gotten through the low-hanging fruit. And now, getting that incremental improvement in gross margin will just take more effort.\n\nAnd so, you'll see it continue to improve, but you'll see the smaller increments.\n\nMike Cikos -- Needham and Company -- Analyst\n\nUnderstood. Thank you for that. Appreciate the time.\n\nGary Steele -- President and Chief Executive Officer\n\nYou bet.\n\nKen Tinsley -- Vice President, Investor Relations\n\nThanks, Mike.\n\nOperator\n\nI would now like to turn the call over to Gary Steele for closing remarks.\n\nGary Steele -- President and Chief Executive Officer\n\nI want to thank everyone for your time today and joining us. Our approach to balancing durable growth and profitability is delivering, as you can see in our cash flow, and our momentum is there as there is strong as we close the year and set up for a strong next year. I am especially appreciative of all Splunkers for their ongoing commitment and execution and for their close partnership with our customers around the world, particularly through this uncertain economic time. Thank you again, and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKen Tinsley -- Vice President, Investor Relations\n\nGary Steele -- President and Chief Executive Officer\n\nRaimo Lenschow -- Barclays -- Analyst\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nMike Cikos -- Needham and Company -- Analyst\n\nMore SPLK analysis\n\nAll earnings call transcripts"
}