{
  "companyName": "Lands' End, Inc.",
  "companyTicker": "LE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/lands-end-inc-le-q2-2022-earnings-call-transcript/",
  "content": "Lands' End, Inc. (LE 9.84%)\nQ2 2022 Earnings Call\nSep 01, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to the Lands' End 2Q '22 earnings call. [Operator instructions] I would now like to turn the call over to Bernie McCracken, CAO. You may begin.\n\nBernie McCracken -- Chief Accounting Officer\n\nGood morning, and thank you for joining the Lands' End earnings call for a discussion of our second quarter fiscal 2022 results, which we released this morning and can be found on our website, landsend.com. On the call today, you will hear from Jerome Griffith, our chief executive officer; and Jim Gooch, our president and chief financial officer. After the company's prepared remarks, we will conduct a question-and-answer session. Please also note that the information we're about to discuss includes forward-looking statements.\n\nSuch statements involve risks and uncertainties. The company's actual results could differ materially from those discussed on this call. Factors that could contribute to such differences include but are not limited to those items noted and included in the company's SEC filings, including our annual report on Form 10-K and quarterly reports on Form 10-Q. The forward-looking information that is provided by the company on this call represents the company's outlook as of today, and we do not undertake any obligation to update forward-looking statements made by us.\n\nSubsequent events and developments may cause the company's outlook to change. During this call, we'll be referring to non-GAAP measures. These non-GAAP measures are not prepared in accordance with generally accepted accounting principles. A reconciliation of non-GAAP financial measures to the most directly comparable GAAP measures can be found in our earnings release issued earlier today.\n\nA copy of which is posted in the investor relations section of our website at landsend.com. With that, I will turn the call over to Jerome Griffith.\n\nJerome Griffith -- Chief Executive Officer\n\nThank you, Bernie. Good morning, and thank you for joining us today for a discussion of our second quarter results. We're pleased to have exceeded our revenue and adjusted EBITDA expectations in the second quarter, given the increasingly challenging environment, including multi-decade high inflation, shifting customer spending, behaviors, and ongoing supply chain cost pressures. Our better-than-expected performance further demonstrates the agility and strength of our digitally driven business model.\n\nWhile the supply chain remains challenged with elevated costs and extended lead times, we are seeing a degree of stabilization. We continue to manage these challenges while simultaneously executing on our growth strategies. Turning to the quarter, revenue was down 9% versus 2021 and was up 18% compared to 2019. While macro pressure and consumer sentiment are impacting our global direct to consumer e-commerce business, based on our proven business model and highly loyal customer base, we remain confident in our long-term growth potential.\n\nAdditionally, we were pleased that our U.S. e-commerce business supported a 2% increase in AUR compared to last year and 16% compared to 2019, driven by lack of customer resistance to price increases taken to offset higher product costs. Our outfitters business continues to show strength, led by national accounts, where we are benefiting from the return-to-travel, as well as our school uniform business, where we are seeing earlier buying in the back-to-school season. Further, our third-party channel continues to produce strong growth.\n\nNext, I'll highlight our progress across our strategic growth pillars, including product, digital, unit channel distribution, and infrastructure. Beginning with product, we continue to capitalize on the return-to-office and social events. Our versatile assortment with made-to-move fabrics continues to resonate with our customers preference for comfortable yet polished looks which can be dressed up or down. In men's, our linen and no-iron dress shirts, no-iron men's chinos, and Supima cotton polos have all performed well.\n\nSimilarly, in women's, no-iron woven shirts, outerwear, and performance tops have been well-received. We're also pleased with the strong initial response for our women's versatile wear-to-work and fall outerwear assortment, which we highlighted in our latest catalog. Swimwear continues to be a leading category for us, driven this quarter by the pickup in vacation travel over the summer months. As we move forward, we will continue to emphasize more polished looks and comfortable fabrications that provide the versatility to suit our customers' lifestyle.\n\nWe're also looking forward to our highly anticipated collaboration with Blake Shelton launching next week. This new collection will feature a broad assortment across men's, women's, and kids' clothing. Blake's fit with our brand, and overlapping audience demographics will further expand our reach, introducing new customers to Lands' End. Additionally, this collaboration is part of a broader marketing investment, representing the first top-of-funnel initiative for our brand in several years, allowing us to showcase our product with a more aspirational and out-in-the-world message.\n\nOn our broader marketing efforts, we continue to focus our marketing investments on driving customer engagement. The flexibility of our ROI-focused marketing approach enables us to maximize marketing productivity in a challenging environment. We will also continue to leverage our data-driven promotional strategies to optimize margin and remain competitive. Turning to our unique channel distribution strategy, we continue to see healthy growth in several new areas.\n\nAt Kohl's, swimwear remains the top-selling category, fueled by a strong summer travel season. As we approach the partnership's two-year anniversary, we continue to be incredibly pleased with the success we have seen with Kohl's, both online and in stores. We're excited for the long-term opportunity and are on track to reach 500 doors by this fall. Our business on Amazon continues to grow and drive new customers to the brand.\n\nAdditionally, we're excited for the opportunity to sell Lands' End through Target's e-commerce marketplace, where we launch this quarter. Using our marketplace strategy, we continue to meet our customers and potential new customers where they shop. We plan to continue to develop and grow these existing partnerships and explore additional opportunities to expand our reach. Turning to our outfitters business, in our school uniforms business, we saw strong demand for the back-to-school season.\n\nDuring the quarter, we witnessed parents purchasing uniforms earlier than usual, most likely to avoid the supply chain-related delays they experienced last year. As a result, we experienced a shift in school uniform demand from the third quarter into the second quarter. As supply chain delays normalize, we believe that our customers will return to historical buying patterns. Our national accounts continue to deliver strong performance with the return-to-travel.\n\nAdditionally, the personalization investments we continue to make have put us in a solid position to service our small and midsized accounts when they recover to historical levels of activity. With regard to infrastructure, we continue to make investments to enhance our operational efficiency and improve the customer experience. We remain in the process of our multi-year warehouse management system implementation, which will also encompass transportation management. Overall, despite the macro challenges we continue to face, we were able to deliver results ahead of expectations, demonstrating the strength and agility of our business model, the resilience of our multi-pronged strategy, and our strong customer loyalty.\n\nOur teams continue to execute across product, marketing, and our strategic initiatives, while also driving growth in our outfitters and third-party businesses. With that, I'll turn it over to Jim.\n\nJim Gooch -- President and Chief Financial Officer\n\nThank you, and good morning. We delivered adjusted EBITDA ahead of our expectations, despite challenging macro headwinds that impacted our top line and created incremental cost pressures. While we expect these challenges to continue in the near term, we continue to leverage our operating model and execute against our initiatives. For the second quarter, as compared to last year, which I'll remind you was a record-setting quarter for sales, total revenue decreased 9% to 351 million, exceeding our guidance range of $335 million to $350 million.\n\nAs we said, last quarter, we expected sales to be challenged by our lower in-stock position, which is a direct result of the supply chain delays. However, this wasn't to the degree we anticipated as a result of the actions we've taken to mitigate these challenges. Our global e-commerce sales decreased 16% from 2021. Within that, our U.S.\n\ne-commerce business decreased 14% from 2021, and our international business decreased 24% in the quarter. While the Japan business is a relatively small part of international, it's unprofitable, and we've made the decision to close the Japan operations at the end of the year. We plan to refocus that investment into areas of the business that project a higher rate of return. Revenue for our third-party business continues to be very strong, increasing to 27 million or 43% compared to the second quarter last year.\n\nThis increase was driven by Kohl's, with women's apparel and swim categories at Kohl's. In our outfitters business, sales increased 8%, driven by school uniforms and national accounts. Within school uniforms, we saw parents purchased uniforms earlier in the season. We're also pleased with the performance in national accounts as companies continue to increase their staffing, specifically aided by the recovery in consumers' travel demand.\n\nMoving to our retail business, during the quarter, we delivered revenue of 14 million, essentially flat to last year. U.S. same-store sales decreased approximately 1% from the second quarter of 2021. Gross margin in the second quarter decreased to 41%, approximately a 530-basis-point decline from 2021.\n\nThe margin pressure was primarily driven by an incremental 12 million in shipping expense, in addition to increased promotional activity and margin mix from the growth in our third-party business. Although we're encouraged to see some stabilization in our transportation charges, we expect inbound freight costs to remain elevated through the remainder of the year. As a percentage of sales, SG&A was 36.6%, an increase of approximately 100 basis points to 2021. The basis-point increase was driven by deleverage on lower sales, partially offset by continued expense controls.\n\nOur performance led to a net loss for the quarter of 2.2 million or $0.07 per share compared to net income of 16.2 million or $0.48 per share in 2021. In addition to these GAAP measures, adjusted EBITDA is an important profitability measure that we use to manage our business internally. For the quarter, adjusted EBITDA was 15.8 million, exceeding our expectation of 10 million to 14 million and compared to 41.4 million in 2021. Looking at the balance sheet, inventories at the end of the quarter were 569 million compared to 464 million a year ago, primarily driven by early receipts in in-transit shipments for the upcoming fall and holiday selling seasons and increased transportation costs due to the global supply chain challenges.\n\nWe expect our inventory to remain elevated for the next couple of quarters as we've extended our seasonal product calendars to account for the longer supply chain lead times. Regarding their debt levels, at the end of the second quarter, our term loan balance was 251 million and our 275 million ABL at 135 million of borrowings outstanding. This fall, we'll hit the two-year anniversary of the term loan, which brings flexibility to prepay the debt. We've begun exploring refinancing options that could drive shareholder value, and we'll update you over the coming months.\n\nAs previously announced, during the second quarter, the board of directors authorized the repurchase of up to 50 million of the company's common stock through February 2, 2024, the conclusion of our fiscal year 2023. We believe the share repurchase authorization supports our balanced capital allocation strategy and, along with continued investments in our growth strategy, will drive long term value for our shareholders. During the quarter, we repurchased 2.4 million of stock under the program. Turning to our guidance.\n\nFor the third quarter, we expect net revenue to be between 375 million and 390 million. We expect net income of 1 million to 4 million and diluted earnings per share to be between $0.03 and $0.12. We expect adjusted EBITDA to be in the range of 20 million to 24 million. Our guidance for the third quarter assumes approximately 9 million in incremental transportation expenses as a result of elevated global supply chain challenges.\n\nWe're also updating our full year outlook. For the full year, we now expect net revenue of 1.6 billion to 1.64 billion. We expect net income of 16.5 million to 23.5 million and diluted earnings per share to be between $0.49 and $0.70. We expect adjusted EBITDA to be in the range of 95 million to 105 million.\n\nOur guidance for the full year includes approximately 35 million in incremental shipping expenses. This guidance also assumes gross margin pressure begins to abate in the second half as we lap higher global supply chain costs. With that, I'll turn the call back over to Jerome.\n\nJerome Griffith -- Chief Executive Officer\n\nWe are pleased with our second quarter results despite the highly challenging macro environment. As we continue through 2022, we will remain focused on our long-term strategies. We will leverage our digitally led business model to advance our four strategic pillars of growth, which include product, digital, unit channel distribution, and infrastructure across all of our businesses. With that, we'll now take your questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Dana Telsey with Telsey Advisory Group. Your line is open.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi. Good morning, everyone. And certainly, nice to see the progress of the EPS speed on better sales. As you mentioned in the release, I think you mentioned one area where the environment became a little bit more promotional.\n\nWhere did you see that and which areas? And how are you planning going forward? And then certainly, with your core categories and the ability, whether it's to pack-and-hold or the arrival of goods, how do you see inventory levels as we go through the balance of the year? And then lastly, as you think about Blake Shelton and some of the new collaborations that are coming up, when are they coming up? And what do you see as the marketing for those introductions? And just lastly, on the borrowings and the borrowings outstanding, how are you thinking about the balance sheet for year-end? Thank you.\n\nJerome Griffith -- Chief Executive Officer\n\nThanks, Dana. Good to hear your voice. I'll take some of those. Well, I'll take a couple of parts of it.\n\nAnd Jim will take a couple of it. On the promotional side, we didn't really want to carry anything over from spring, summer into fall holiday on anything that's going to be perishable goods, meaning anything that's really more fashionable or more fashion-oriented. When it gets to basics, actually, we have no problem just holding basics because as you know, about 38% of our business is just in basic items. And as long as we can maintain a decent stock level on those guys, we don't mind if things slow down.\n\nWe just carry it into the next quarter. When it comes to pack-and-hold, there a few things from spring and summer that we're going to carry over into next year. There's no real sense of marking them down. But when you got into the back part of June and July, you know, we want to take advantage of the promotional activity out there.\n\nWhen it comes to Blake Shelton, we're super excited about this. His fan base and his willingness to work with us on social media and get the word out as to what he calls being a fashion designer is pretty exciting for us. We're going to do some similar top-of-funnel marketing, work with him. You'll see us on CCTV starting next week.\n\nThat's going to launch on the 8th to be exact. And we're just super excited about it and think it's got some pretty good legs to run for a few seasons. Concerning borrowings, I'm going to let Jim talk about that one.\n\nJim Gooch -- President and Chief Financial Officer\n\nYeah. I'll take borrowings, and I'll add on a little bit to what Jerome said on the inventory side. As you see, our inventory year over year is a little bit over $100 million higher than last year. The vast majority of that is not anything from a carryover perspective.\n\nAs Jerome said, we did carryover some basics, but we have significantly increased our lead times with all the inconsistencies and the delays that we're seeing in the supply chain. And we've been operating the last couple of quarters at an extremely low in-stock level. So, we've done everything we can with increasing lead times to try to get product here on a more timely basis. So, we do feel like we're in a much better in-stock going into the back half, but the result of that is we are carrying a higher inventory level.\n\nThat's having a direct result on your other question, which is our borrowing level. Really, the entire amount on that ABL is a result of that increase in lead times and bringing inventory in earlier. We see that normalizing over the next few quarters. We've made appropriate reductions in our forward receipts to account for that.\n\nAnd over the next two or three quarters, you'll see not only the debt borrowings normalized, but also the year-over-year inventory balances normalize.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question comes from Alex Fuhrman with Craig-Hallum. Your line is open.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks very much for taking my question. Curious if you can talk a little bit more about your inventory and your preparations for outerwear coming off. That's always a big business for you guys.\n\nI know it's likely slower now, but have you seen any kind of trend in August as far as the really big ticket kind of outerwear items go that give you any kind of insight into what demand might start to look like as the weather gets cooler. And just an update on where your seasonal inventory stands going into the holidays would be helpful. Thank you.\n\nJerome Griffith -- Chief Executive Officer\n\nWell, concerning outerwear, Alex, so we're in a much better stock position already this year than we were last year, particularly when it comes to fleece and lighter weight outerwear. We've already seen that packable down is tracking, and it's quite desirable to the customer at this point in time. But we have moved a lot of the heavier outerwear into more buy-now-wear-now. What we've seen in the past is it doesn't sell early in the season.\n\nAnd, you know, we will start to show the squall jackets, the expedition jackets in September. And people just aren't buying at that point in time because of the weather. And what we've seen is that it moves later and lasts longer into January and February of the following year. What we -- you know, overall -- also in outerwear but also overall, we're starting to be in a much better stock position this year to fulfill than we were at this point in time last year.\n\nSo, it gives us some -- it makes us feel relatively good for the coming quarters.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nGreat. That's really helpful. Thank you. And then, you know, it looks like a lot of your competitors out there have been very promotional, you know, getting into the back-to-school season.\n\nYou know, can you talk a little bit more about your strategy to kind of optimize price and remain competitive?\n\nJerome Griffith -- Chief Executive Officer\n\nWell, you probably saw that our AURs over the last few years are up in high double digits. A lot of that has been due to some -- well, some of it's been due to price increases and some of it's been due to managing our basics and our newer product better. You know, when I started here a few years ago, if we were giving a -- having a promotion, we would take promotional discounts off of all the product. And then by implementing dynamic promo, we've been able to continue to lower what our promotional rates have been on basics and seasonal basics and on brand new products.\n\nWe'll continue to manage it this way going into the new season. But also, I would tell you, over the course of Labor Day weekend, we'll take advantage of Labor Day sales out there in order to keep our stocks clean. And it's interesting. I think we've done a pretty darn good job with the volatility in the marketplace of managing what our inventory and stock levels are.\n\nIf it weren't for the supply chain issues and having to add weeks of travel time onto the product to get it here, I think we'd be in pretty good shape.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nThat's terrific. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nBernie McCracken -- Chief Accounting Officer\n\nThank you, Michelle.\n\nDuration: 0 minutes\n\nBernie McCracken -- Chief Accounting Officer\n\nJerome Griffith -- Chief Executive Officer\n\nJim Gooch -- President and Chief Financial Officer\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nMore LE analysis\n\nAll earnings call transcripts"
}