{
  "companyName": "NeoGames S.A.",
  "companyTicker": "NGMS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/neogames-sa-ngms-q2-2022-earnings-call-transcript/",
  "content": "NeoGames S.A. (NGMS -0.08%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen. Thank you for standing by. Welcome to the NeoGames second quarter 2022 earnings conference call. [Operator instructions] Please note that this conference is being recorded today, August 11, 2022.\n\nI'd like to turn the call over to Mr. Jacques Cornet with ICR. Please go ahead, sir.\n\nJacques Cornet -- Investor Relations\n\nThank you, operator. By now, everyone should have access to our second quarter 2022 earnings release, which is available on the NeoGames website at www.neogames.com in the Investor Relations section. Before we begin the formal remarks, we need to remind everyone that the discussion today will include forward-looking statements. These forward-looking statements, which are usually identified by use of words such as will, expect, anticipate, should or other similar phrases are not guarantees of future performance.\n\nThese statements are subject to numerous risks and uncertainties that could cause actual results to differ materially from what we expect. Therefore, you should exercise caution when interpreting and relying on them. We refer all of you to our recent SEC filings for a more detailed discussion of the risks that could impact our future operating results and financial condition. We encourage investors to review our regulatory filings, including the Form 6-K for the quarter ended June 30, 2022, when it is filed with the SEC.\n\nDuring today's call, we will discuss non-IFRS financial measures, which we believe can be useful in evaluating the company's financial performance. These measures should not be considered in isolation or as a substitute for our financial results prepared in accordance with IFRS. A reconciliation of these measures to the most directly comparable IFRS measures is available in our earnings release on the neogames.com website. Hosting the call today, we have Moti Malul, NeoGames chief executive officer; and Raviv Adler, chief financial officer of the company.\n\nThey will provide some opening remarks, and then we will open the call to questions. With that, I'll turn the call over to Moti.\n\nMoti Malul -- Chief Executive Officer\n\nThank you, Jacques, and good morning, everyone. Last night, we released our second quarter 2022 results. This morning, I will highlight some key points about the second quarter and provide an update on our current business initiatives and the trends we are seeing in the market. Raviv will then run through our financial results, which we recognize are a bit more complex this quarter than in the past due to the Aspire transaction.\n\nOverall, we had a very exciting and productive quarter. Of course, the most significant development since we last spoke is that we completed the tender offer for the outstanding shares of Aspire Global on June 16. In total, over 99% of shares in Aspire were tendered. The less than 1% remaining outstanding are subject to squeeze-out proceedings, which we expect will be completed shortly.\n\nWith the tender behind us, the real work begins as we have positioned ourselves in such a prominent position that enables us to become a global leader in providing technology and content across iLottery and online sport betting and iGaming to our lottery customers and to leading online gaming operators in regulated markets. We are very excited about this transformational combination from a number of important perspectives. First, our technology and product offering for lotteries are now unmatched. Second, we have strategic and significant growth opportunities across iLottery, online sport betting and iGaming, which has a combined TAM of over $70 million.\n\nThat, together with our combined track record of profitable growth opens up even more opportunities ahead. We continue to be focused on market with attractive potential and significant barriers to entry. And with the addition of our talented co-colleagues from Aspire, we have a broad, experienced and innovative management team that we believe places us in a position to lead the industry. We are hard at work integrating the teams and our operations and we are realizing more growth potential synergies as we progress in the process.\n\nThere are lots of things to be done. However, even as we are in early phases of the integration, we are happy to report that the combination is already bearing fruit. When we announced the Aspire transaction earlier this year, one of the key reasons for putting our two companies together for some of the trends we were seeing with our lottery customers where more and more lotteries globally are expanding into additional verticals within their online offering, specifically online sports betting and iGaming operations. From our perspective, the ability to provide a full range of products, combined with our experience in operating across all verticals is becoming increasingly important.\n\nTo that end, we announced a multiyear turnkey project with the existing lottery operator in Brazil's second-largest state of Minas Gerais, expanding our reach to an additional 21 million people. With this agreement, we have added a new turnkey lottery customer and entered a very attractive new market. We are excited about this opportunity for several reasons. First, this will be our first launch of eInstant games and online sport betting in the regulated market in Brazil.\n\nAnd in fact, it is the first one in the entire Brazilian market. Second, this puts us in a great position for future opportunities as Brazil continues to regulate lotteries state-by-state and develop other forms of regulated gaming. And third, we have found this to be in an advanced market with access to innovative e-payment solutions and overall high e-commerce adaptations, which usually suggests a good foundation for iLottery and iGaming operations. In the end, we won the business because we were able to offer a comprehensive digital solution, a solution that provides our advanced use of the platform, market-proven instant content from our in-house iLottery game studio and a complete online sports betting solution with BtoBet.\n\nTogether, our offering was what our new partner needed to achieve its goal of building on the successful retail lottery and digital keynote program available in the state and expanding further with a wider online portfolio. This is precisely the type of a business we envisioned we could win, one we convey the key strategic benefits of the spar transaction earlier this year. We have started the project already with our talented teams, and we expect to go live in Brazil during the first half of next year. In addition to Brazil, we are seeing the benefits in other areas of the world.\n\nIn Canada, at the end of 2021, we added Pariplay content aggregation solution for play Alberta, and have launched a suite of content from its in-house studio wizard games, which have been quite popular with the players and growing its market share. Recently, Pariplay continued that success and expanded its presence in Canada, entering into an agreement with the Canadian Atlantic Lottery to offer its fusion content aggregation platform and gains from Wizard Studio throughout the region. Then last week, we entered into an agreement through BtoBet with SOJOGO, the lottery provider in Mozambique. SOJOGO is majority owned by Santa Casa Global, which is the global arm of our long-standing customer, the Portuguese lottery, a relationship we were excited to expand.\n\nIn this case, we are entering a new lottery market with our BtoBet offerings and providing our proprietary sportsbook solution for both online operations and the retail network. Looking forward, we feel really good about having all these various offerings at our disposal as we look to expand our global presence. Looking at our results for the quarter. The total revenues plus our NPI revenue interest increased to $31.3 million, including approximately $8.3 million of revenues from Aspire.\n\nEven when excluding Aspire, the quarter's results were up 7.6% year over year and up 2.6% compared to the first quarter of 2022. The revenues from Aspire nominated functional currency euro grew 17% year over year as well as 5.5% sequentially from the first quarter. These results highlight the strong trends we are seeing in both areas of the business. Moving to a few updates on our various business areas.\n\nWe are happy to report that all of our turnkey accounts in the U.S., Canada and Europe posted quarter-over-quarter revenue growth despite typical seasonality during the second quarter. Michigan continues to perform in line with our expectations, posting nice sequential growth compared to the prior quarter and continuing the positive trend in the account, resulting Canada through the AGLC continue to perform well and show sequential growth, as I touched upon earlier. Virginia too continues to impressively outperform in the current environment as the accounts innovate in many areas, launching advanced marketing programs and expand its product portfolio. Turning to the Aspire side of the business.\n\nWe are taking great strides in integrating the Aspire segments. For the Aspire core business, which provides full eGaming solutions, including our PAM technology and managed services through iGaming operators in regulated markets. We signed two new full product and managed services deals in European regulated markets with B-2-C operators. On the sport betting side, we are experiencing increased momentum in the development of this business area.\n\nIn line with the long-term plan to enter the U.S. market, we are pleased to announce that BtoBet sport betting platform is now certified with GLI-33 as an events wagering system, which practically means that our sports betting platform is certified to operate in the North American market. As such, we now have our PAM certified and live in 15 markets and our sport betting platform is ready for B2B sport deals. In addition, through BtoBet, we extended our presence in Africa, a market where we already have a dominant position with its sport betting technology, partnering with YouTube, the Ethiopian retail and online brand for which BtoBet will provide its proprietary sportsbook platform and risk management.\n\nWe expect to launch early next year, which will expand our market-dominant presence in Africa to 27 countries. Our content aggregation and iGaming arm, Pariplay continues to perform very well and continues its growth in all its business areas. Pariplay signed 12 new partnerships to provide content aggregation and games, including with industry leaders such as BetMGM, which went live with games from Weather Studio in Michigan and New Jersey as well as the deal with DraftKing in the U.S. Through Pariplay, we've also expanded our relationship with Caesars to provide our games and aggregation in the U.S.\n\nand Ontario in Canada. Turning to the macro environment outlook. While there seems to be possibility of a recession, I would like to remind everyone that lottery is typically an industry that has been less impacted during similar macro-related environments. With this in mind, we are currently not seeing any impact to any of our business lines as a result of the macro environment.\n\nHowever, we will continue to monitor as the economy develops. With that, I'll now turn the call over to Raviv.\n\nRaviv Adler -- Chief Financial Officer\n\nThanks, Moti. Before I get into the results, two comments. First, our usual reminder that when we discuss our results, I would point out that all of our iLottery business in North America operates through our 50-50 joint venture NeoPollard Interactive or NPI, except in Michigan, which is reflected in our top line revenues. Our contracts in Virginia, New Hampshire and North Carolina in the province of Alberta run through NPI.\n\nExcept for the NPI contracts, we conduct all of our business through NeoGames. As a result, from an accounting standpoint, as many of you know, we generate revenue and earnings through our only owned operation and through our equity interest in NPI. Now turning to the results. During the second quarter of 2022, our revenues as reported on the income statement, which excludes our share of NPI revenues, was $21.1 million, including an $8.3 million contribution from Aspire Global, up 63.4% from last year.\n\nIn addition, our share of NPI revenue grew to $10.3 million during the second quarter of 2022 compared with $8.5 million last year, up 20.6%. The sum total of these numbers were $31.3 million during the second quarter, representing an increase of about 46.4% year over year. On the expense side, it's worth noting that second-quarter earnings were impacted by some onetime items. The primary item was $14.2 million of nonrecurring transaction-related expenses related to the Aspire tender offer.\n\nFor the quarter, our adjusted EBITDA was $10.3 million, which includes $1.3 million contribution from Aspire Global from June 16 through the end of the quarter. Excluding the partial quarter contribution, the NeoGames adjusted EBITDA margin was 39.2%. As a reminder, when evaluating the combined adjusted EBITDA margins, it's important to consider that the results reflect that Aspire historically structured certain parts of the business in contracts such that revenues recognized on a gross basis. This results in higher revenue and lower margins when compared to the historical NeoGames business, where revenue is recognized on a net basis.\n\nGoing forward, as part of the integration with Aspire, we're considering options to orient the business in its respective contracts to move closer to net. If we're successful, over time, this may result in expansion of margins for the combined financials. Of course, we will keep investors updated of any decisions we make in these disclosures going forward. In addition, when evaluating the revenues we're adding from Aspire Global business, it's important to note that going forward, our results may be affected by currency exchange rate fluctuations given the majority of added Aspire revenues are euros on British pounds nominated.\n\nFor instance, if we look at Aspire Global revenues for the six months year to date in dollars, revenues were up approximately 9.5%. This change reflects the increase of -- an increase of $21.4 in revenues measured in euros, partially offset by the currency changes in the euro-dollar exchange rates. We will work to mitigate these impacts and provide transparency on how this affects our results. Turning to our balance sheet.\n\nWe ended this quarter with about $129 million worth of cash and cash equivalents. Our outstanding debt at the quarter end was approximately $266 million at a weighted average interest rate of 6.25%. We have approximately 33.3 million shares outstanding. In addition, current liability label deferred payment on business combination for $96.3 million represent cash consideration to be paid to shareholders as part of the tender offer.\n\nThus, when looking on our cash balance, it's appropriate to offset the amount due to shareholders for analytical purposes. With respect to guidance, we are updating our expectations to reflect successful completion of the Aspire Global tender on June 16. As a result, we are currently -- we currently expect revenue in our share of NPI interest for the full year of 2022 to be in the range of $194 million to $208 million. The range reflects our previously provided guidance range, which remains unchanged, together with the contribution of revenues from Aspire Global, beginning from when the tender offer was closed on June 16 to December 31.\n\nWith that, I will turn the call back to Moti.\n\nMoti Malul -- Chief Executive Officer\n\nThanks, Raviv. Overall, this was such an exciting quarter for us with true transformational change in our business that we were so pleased to show our investor base how fast we are leveraging into new business. We truly believe we are in a great position to continue executing on our growth strategy for both iLottery and iGaming opportunities and are excited by the momentum we are generating. Thank you all, as always, for your interest in our story.\n\nWith that, operator, please open the line for questions.\n\nOperator\n\n[Operator instructions] First question comes from Jeff Stantial of Stifel.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nCongrats on getting the Aspire deal across the finish line here.\n\nMoti Malul -- Chief Executive Officer\n\nThank you, Jeff.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nI wanted to start there on the acquired business. So we're going on just about two months now since you closed on the deal. Just curious if there's anything there that sort of caught you by surprise thus far or kind of any key incremental takeaways now that you've had 8 weeks or so to look behind the curtain a bit?\n\nMoti Malul -- Chief Executive Officer\n\nNo. Nothing caught us by surprise. As we said, we are very much encouraged by what we keep finding in terms of potential growth synergies even more so than we had before as we go deeper and deeper into different product areas, geographic strengths and existing customers that we could leverage between each other. But we can't say that we've learned anything that surprised us.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nPerfect. That's helpful. And then hanging on that theme of kind of top-line synergies between the two businesses. Congrats on the recent deal down in Brazil, a bit of a two-parter here.\n\nFirst, just how should we think about timing for launch and for ramp? And then second, how impactful did it end up proving having the BtoBet assets when you went to compete for that contract?\n\nMoti Malul -- Chief Executive Officer\n\nI'll start from the end, it was very impactful because it allowed us to price in a sensitive way and be aligned -- fully aligned with our interest unlike whether we would have worked with a potential partner on the B2B side for such a deal. Plus, what's even more exciting is that now we have the in-house operational knowledge to make this a success and not only provide a product and the synergies between the marketing team and the operations on the lottery side and the sport side are expected to bring very good growth potentials for the deal. When it comes to timeline, as we said, we were careful to say first half of next year, we will obviously do our best to try to do it on the earlier part of that than later, but the reason that we can't be accurate is because we are breaking new ground here. There is no regulated sport betting brand in the Brazilian market and not even an online instant game.\n\nSo we're happy to work very closely with the relevant regulators and with our customers to define what needs to be tested and checked and so on. But as you can understand, this may take a little bit longer, it's because we are basically writing the book -- and that's why we couldn't, at this point in time, be more specific. But when Q3 comes and we will report to the market, we will be smarter and maybe we'll provide a more accurate date for go-live.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nThat's helpful. And if I could just squeeze in a third and hang on the subject? Just on Brazil, obviously kind of a state-by-state rollout process there up to each one individually. Just are you hearing anything on any other state potentially opening up in the market, whether iLottery only, sports betting only or broader package?\n\nMoti Malul -- Chief Executive Officer\n\nDefinitely, there are quite a few processes that even gained public awareness. For example, a couple of states like Sao Paulo, which is the biggest one, had started a procurement process or an RFP to find a concession that will manage the lottery in that state and also sports betting licenses. It was paused from legal reasons and maybe expected to reinitiate like many things in Brazil post the election. This year, there's election also in Brazil, not only in the U.S.\n\nAnd many things are a bit paused up until then. And apart from that, which has been in the spotlight there has been other processes. Rio de Janeiro had a process and two or three other states. And I remind you that there are quite a few states in Brazil which are decent size in terms of population, 10 million people, give or take, some of them even bigger.\n\nAnd obviously, our state -- our customers, I think there's 21 million people. So we definitely think that in the next year '23, it could be that two or three other states will already be at the point that they are going to seek for vendors or concessions.\n\nOperator\n\nOur next question will be Barry Jonas of Truist Securities.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nLook, I know you haven't given any specific numbers, but maybe can you help us, as we try to quantify the synergies with the combination, I mean, really, what's the best way to think about upside from here versus how we were modeling the stand-alone Aspire and NeoGames businesses?\n\nRaviv Adler -- Chief Financial Officer\n\nThank you, Barry, for the question. We didn't provide any synergies on the revenue side, although as Moti pointed out, there are quite a few, and one of them is the most recent Brazil contract. We also do have some pretty significant cost synergies associated with the fact that we're no longer using the content provider of Pariplay, it's cost on our books as well as other consolidation of facilities and some other factors that are associated with the opex structures of both businesses that can be now removed from our P&L. That being said, we didn't provide to the market any particular guidance on numbers because we're busy in the integration process and bringing those forward.\n\nAnd once we have concrete figures, we will provide that to the market as part of our guidance.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nOK. That's definitely helpful. I mean, I guess, should we expect us to be more visible in '23 in terms of the cost side of the equation and everything, we should think about this year as sort of as is?\n\nRaviv Adler -- Chief Financial Officer\n\nCorrect. We will have some few buckets, but it's relatively minor. While we report -- when we report Q3 numbers and we will have -- we can be more specific on the cost synergies for 2023.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nThat's great. And then I think relating to Jeff's question about new jurisdictions, I'm just curious, any updates from a U.S. iLottery perspective? You didn't touch on whether that's Ohio, Massachusetts or any other states?\n\nMoti Malul -- Chief Executive Officer\n\nYes. Generally speaking, as you guys can imagine, the processes that have been active in some of the markets, some of those processes are kind of paused a bit until the elections, such could be the case in Ohio that passed a significant milestone in last quarter, but probably waits for post-election time to continue that process and so is the case in other states. I would say that in this last quarter, we did see, let's say, the most progress that has been achieved thus far in Massachusetts when it comes to moving iLottery forward. By the way, as always, pretty much in connection with moving sport betting or other forms of gaming, while it didn't get passed as a bill because it doesn't necessarily need to.\n\nIt has passed certain legislation milestones with different committees in the state. So I think that has been something that hasn't happened for years, and it shows that this is on legislators agenda. Apart from that, the other processes that has not yet passed full approval are probably paused a bit until the elections, and will relaunch after that.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nGreat. And if I could just sneak in one more. Within the Aspire business, can you maybe talk about what you're seeing across the key geographies, whether that's the U.K. or Germany or any other countries?\n\nMoti Malul -- Chief Executive Officer\n\nYes, definitely. Aspire performed well this quarter, as you could have seen from the reports. Our expectation that this will continue to be the case. I think the things that we are mostly anticipating for in the second half of the year and are still not fully clear is the point of time where the reentry to two key markets in Europe, which are moving into local regulation, which are Germany and Holland, what will be the exact point of time that, that is happening because that's in the hand of the regulators, that is probably also one factor that influences the range of guidance that we gave.\n\nBut obviously, it's just a matter of time. And if those markets will open up a little bit later in the year or so, they will be expected to impact our growth potential into next year.\n\nOperator\n\nNext question will be from Chad Beynon of Macquarie.\n\nChad Beynon -- Macquarie Group -- Analyst\n\nCongrats on the closing of the deal. I wanted to ask one more on the revenue guidance. You've hit on this a couple of times, but I just wanted to make sure we're thinking about it correctly. I believe the implied guide for Aspire in the back half of the year is around a $100 million just based on what you generated in the first half and your reiteration of the legacy business? So I believe that kind of assumes double-digit same-store constant currency growth, and you just talked about that that's what Aspire was able to generate in the second quarter.\n\nJust wanted to confirm that. And then also related, I believe, last year Aspire was slightly stronger in the third quarter, but this fourth quarter will obviously have the World Cup. So as we're thinking about seasonality in the back half, should we assume that it's closer to kind of even, in terms of the weighting?\n\nRaviv Adler -- Chief Financial Officer\n\nYes, Chad, thank you. So first to first question, that's correct. If you're moving Aspire contribution to the guidance, the range that we've quoted is the right one. Obviously, the World Cup would impact the expected revenues from Aspire during Q4.\n\nThis is the reason why we gave relatively high range from the lower side to the upper side of the guidance. One important note when we're talking about Aspire revenues is something that also touched on our commentary to the quarter is the fact that the currency fluctuation, especially this year and the fact that the Aspire business by the vast majority is nominated in euros or GBP, British pounds that would impact also the revenues expectations and this is, again, another reason for the relatively high range of the upper to the lower end of the bar.\n\nChad Beynon -- Macquarie Group -- Analyst\n\nOK. Perfect. Appreciate that. And then with respect to the consumer, it sounds like it's pretty stable, particularly with the North American contracts.\n\nDid you start to see any growing weakness sequentially throughout the quarter as inflation picked up and prices at the pump increased or was it relatively stable throughout the three months in the quarter?\n\nMoti Malul -- Chief Executive Officer\n\nChad, as we -- as I mentioned in the opening remarks, we haven't seen any impact at all, not only in the U.S. but also in Europe. We can't say that this will be the case going forward. We just reminded everyone that the lottery industry has proved to be a bit less impactful than other industries in times of financial macroeconomics environment, like in 2008 and in 2009.\n\nThe other lines of businesses, there's no such history to learn from. But for the moment, we haven't seen any downtrend as a result of macroeconomics in the online business.\n\nOperator\n\nThe next question will be from Cassandra Lee of Jefferies.\n\nCassandra Lee -- Jefferies -- Analyst\n\nCould you help us think about kind of the opportunity in Brazil? How does the traditional lottery in Brazil compare to U.S. in terms of spend per capita or players' behavior?\n\nMoti Malul -- Chief Executive Officer\n\nYes. First of all, Cassandra, it's -- we know it's tricky. We understand it's tricky because we have very little to grab on when we model that country since, as I have mentioned, we are pretty much breaking ground. There are no similar regulated online activities to learn from.\n\nEven the numbers that exist from the single lottery in Brazil that has been selling some sort of jackpot products on a federal scale is really little to learn from because it hasn't been a high yield or a per capital market for the decades that it exists for reasons that it would probably take long to explain, but it's definitely not a lottery, not our customer, I mean the federal lottery in Brazil, Caixa, has not been a high performing in the global industry to say the least or the little to learn from. What we are encouraged from is definitely, what we have been able to learn on the environmental aspects that makes us believe that this is something that could be quite interesting, the access and the usage of e-commerce, electronic payments and everything online has boosted to an unbelievable level, in the country during COVID, I have to say probably even more advanced than in other countries in Western Europe or even some aspects of U.S. So we feel that there is very solid grounds for adaptation of online channels, but we understand that it's difficult to model. I think that we have to go live.\n\nAnd when we will be like three months or so live, we will start to kind of feel of players spend in the first months of activity and then be able to compare and build the model out from there. But at this point of time, it's difficult for us to grab into anything that would provide us with a reasonable benchmark.\n\nCassandra Lee -- Jefferies -- Analyst\n\nThat was really helpful. And if I may ask another one, how should we think about your sport betting business margin compared to iLottery? I understand when you're the sole operators in the jurisdiction, you don't have the same kind of pressure in terms of promoting or free-play, but I still want to get your thoughts on that model?\n\nRaviv Adler -- Chief Financial Officer\n\nYes. Thank you, Cassandra. So the sportsbook business is the margin profile, given that it includes also certain trading services and other factors, of course, that we not necessarily see in that side of the lottery, the margin profile would be a little bit lower than the traditional iLottery programs. So if we were -- if we're assuming or hoping to see NeoGames as iLottery provider trades at around high 30s, low 40s, then the sportsbook should be expected somewhere between the 25% to 30% gross margin in terms of operation.\n\nCassandra Lee -- Jefferies -- Analyst\n\nGot it. Congrats on the deal and the new contract.\n\nRaviv Adler -- Chief Financial Officer\n\nThank you.\n\nMoti Malul -- Chief Executive Officer\n\nThank you, Cassandra.\n\nOperator\n\nThis concludes the question-and-answer session. We will now return to Mordechay Malool for closing remarks. Please go ahead.\n\nMoti Malul -- Chief Executive Officer\n\nThank you. Yes, nothing to hold everyone on the line. Thank you for the continued interest in our story and company as always, and we hope to continue to bring growth in the next quarters to come, and we're very excited with the opportunity. Thank you, everyone.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJacques Cornet -- Investor Relations\n\nMoti Malul -- Chief Executive Officer\n\nRaviv Adler -- Chief Financial Officer\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nBarry Jonas -- Truist Securities -- Analyst\n\nChad Beynon -- Macquarie Group -- Analyst\n\nCassandra Lee -- Jefferies -- Analyst\n\nMore NGMS analysis\n\nAll earnings call transcripts"
}