{
  "companyName": "Hydrofarm Holdings Group, Inc.",
  "companyTicker": "HYFM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/hydrofarm-holdings-group-inc-hyfm-q2-2022-earnings/",
  "content": "Hydrofarm Holdings Group, Inc. (HYFM -4.91%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and thank you for standing by. Welcome to the Hydrofarm Holdings Group's second quarter 2022 earnings conference call. [Operator instructions] Please note that this conference is being recorded today, August 9, 2022. I would now like to turn the call over to Mr.\n\nFitzhugh Taylor, managing director at ICR, to begin.\n\nFitzhugh Taylor -- Managing Director, ICR\n\nThank you, Anthony, and good afternoon. With me on the call today is Bill Toler, Hydrofarm's chairman, chief executive officer, John Lindeman, the company's chief financial officer. By now, everyone should have access to our second quarter 2022 earnings release and Form 8-K issued today after market close. These documents are available on the investors section of Hydrofarm's website at www.hydrofarm.com.\n\nBefore we begin our formal remarks, please note that our discussion today will include forward-looking statements. These forward-looking statements are not guarantees of future performance, and therefore, you should not put undue reliance on them. These statements are also subject to numerous risks and uncertainties that could cause actual results to differ materially from our current expectations. We refer all of you to our recent SEC filings for a more detailed discussion of the risks that can impact our future operating results and financial condition.\n\nLastly, during today's call, we will discuss non-GAAP measures, which we believe can be useful in evaluating our performance. The presentation of this additional information should not be considered in isolation or as a substitute for results prepared in accordance with GAAP, and reconciliations to comparable GAAP measures are available in our earnings release. With that, I'd like to turn the call over to Bill Toler. Bill?\n\nBill Toler -- Chairman and Chief Executive Officer\n\nThank you, Fitzhugh, and good afternoon, everyone. As we announced in our press release last week, our second quarter results continued to feel the impact of the hydroponics industry recession in the U.S. and Canada. Initially in the quarter, we were encouraged by our results early in Q2 as sales trends displayed signs of stabilizing.\n\nHowever, these trends weakened as the quarter progressed and our mix shift to less profitable products, impacting our results for Q2 and our expectations for the remainder of the year. More specifically, originally, our business plan for 2022 had always expected a seasonal improvement in the spring and summer months, with sales volume continuing to build from there. Once we did not get the expected improvement in Q2, we have now assumed the current trends will continue through the third quarter and that Q4 will have its normally lower volumes but off, again, a lower base, that we didn't get the build in Q2, so we took the volume out for the entire year. While the industry recession has lasted longer than expected, we remain confident in the long-term opportunities ahead of us.\n\nAccording to Headset data, which is the best measurement of volumes sold through dispensaries, units sold continues to grow, albeit at lower prices. Furthermore, with cannabis consumption growing in the U.S. and Canada, ultimately, supply and demand will balance and pricing should strengthen. They should invite many growers back to the category and give MSOs, the multistate operators, the expansion signals they are looking for.\n\nWhen that occurs, we are well positioned for the rebound. The strength of Hydrofarm is, of course, in our brands and people, in our unique customer relationships and in our manufacturing and distribution footprint. This has not changed. As a reminder, we drive over 50% of our sales in our own brands, and we also proudly represent many of the industry's top distributor brands.\n\nJust last month, we added Emerald Harvest, a leading nutrient to our preferred brand lineup. This new addition will further strengthen our consumables portfolio, which is currently about 66% of our sales, which we believe provides us even more insulation against weakness in the industry. Another important measure of Hydrofarm's competitive position is our relative market share. Our sales declines, while disappointing, are less than the decline seen by other public reporting entities, suggesting that we are building market share.\n\nDuring this difficult time, we have continued to focus our efforts on leveraging and strengthening our core assets while rightsizing when necessary in order to maintain the long-term health of our business. In fact, during the second quarter, through our team's net working capital management, we increased our cash position, lowered our net debt and maintained a solid liquidity position, which John will talk about in more detail. Aiding this effort were the positive steps we've taken to lower our cost structure. As we did in the first quarter, during the second quarter, we continued to take strategic price increases, further increased freight surcharges, reduced our employee base and took steps to capture cost synergies from our 2021 acquisitions.\n\nMore specifically, we enacted further expense-cutting measures, including continued headcount optimization. Since the end of last year, we've reduced headcount by about 25%. We've also reduced shifts at our plants to increase efficiency and protect inventory levels. And finally, we've cut select outside services and expenses to tighten our belts across the board.\n\nAll in all, we estimate we've reduced our cost by about $14 million to $15 million on an annualized basis, and we'll continue to find efficiencies and further streamline our business as the business conditions dictate. As we look ahead, we believe we have appropriately reset the full year expectations and can successfully build back from here. Additionally, we remain confident that the industry will eventually return to historical growth rates and the actions we're taking to refine and optimize our organization will leave us leaner and stronger, and as a result, better positioned to take advantage of future growth opportunities. With that, let me turn it over to John, who will further discuss the details of our second quarter financial results and provide comments on the updated full year 2022 outlook.\n\nJohn?\n\nJohn Lindeman -- Chief Financial Officer\n\nThanks, Bill, and good afternoon, everyone. Net sales for the second quarter were $97.5 million compared to $133.8 million in the prior year period. Our 2021 acquisitions added 13.5% to our top line in the second quarter of 2022 relative to the prior year period, but this M&A benefit was more than offset by a 43.4% decline in organic sales volume. We did realize a 3.1% price mix benefit in the quarter as we continued to pass through higher costs.\n\nWhile we saw encouraging results in March and April, sales trends in the second half of the quarter tailed off and continued through the remainder of Q2. Furthermore, these sluggish sales trends have continued into the third quarter to date period. We did experience year-over-year growth in select U.S. states, but the growing demand in these states was not yet sizable enough to offset the overall oversupply dynamic in many key U.S.\n\nmarkets. We also experienced a notable sales mix shift in the quarter. On a sequential basis, sales of our proprietary branded products in Q2 were outpaced by sales of distributed and preferred brands relative to Q1. We believe this was caused by the change in relative performance of select product categories, and primarily, the relative outperformance of grow media, which is largely composed of distributed preferred brands for us and the relative underperformance in lighting, which includes several of our proprietary brands.\n\nI should note that on a year-over-year basis, we experienced a sales mix benefit as our proprietary brands represented a much higher proportion of our total sales than they did in the prior year period. This positive year-over-year sales mix, largely related to the full quarter benefit we received from all of the acquired proprietary brands in Q2 '22 relative to only a partial benefit for select brands, namely HEAVY 16 and House & Garden in Q2 2021. Gross profit during the second quarter decreased to $7.3 million compared to $29.6 million in the year ago period. Similar to last quarter, we included in the press release a calculation of adjusted gross profit, which excludes certain items largely related to our acquisitions, which impact comparability.\n\nOn this basis, adjusted gross profit was $9.1 million or 9.3% of net sales in the second quarter, down from $30.2 million or 22.5% of net sales last year. The decrease in adjusted gross profit is mainly due to the negative impact of the $10.2 million increase in inventory reserves to be recorded at the end of Q2. Excluding the increase in inventory reserve, adjusted gross profit margin would have been much higher than disclosed, albeit lower than 22.5% last year. This margin difference was due to proportionately higher freight and labor costs, which were impacted by the lower total sales volume and the altered sales mix.\n\nSelling, general, and administrative expense decreased to $26 million in the second quarter of '22 compared to $27.3 million in the year ago period. The decrease in SG&A was primarily due to an $8.4 million decrease in acquisition-related expenses. Adjusted SG&A expenses, which adjusts to this acquisition-related expenses as well as certain other items impacting comparability, was $15.9 million or 16.3% of net sales in the quarter versus $14 million or 10.5% last year. This was primarily driven by an increase in facility costs, compensation costs and insurance expenses.\n\nAs a reminder, these added costs primarily emanate from our distribution center expansions and the five acquisitions we completed last year, which increased our headcount and the size and scope of our operations. And while this positions us well for future growth, we remain diligent in mitigating costs in the near term and rightsizing our overall cost structure for the sales demand that we see today. Along these lines, we estimate that we've reduced our cost by approximately $14 million on an annualized basis. This reduction has come mostly in the form of headcount reductions conducted primarily over the last two quarters, during which we reduced our headcount by nearly 25%.\n\nThe impact of these reductions is most visible in our adjusted SG&A expense, which has come down 17% from $19.2 million in our fiscal first quarter to approximately $15.9 million in Q2. And then we will diligently pursue additional cost savings and productivity initiatives on top of those already achieved. We are currently estimating $15 million to $16 million in adjusted SG&A for the next two quarters. As noted in our August 2 press release, declining valuation trends within the industry and its impact on the company's market valuation triggered a full evaluation of the goodwill arising from prior acquisitions.\n\nAs a result, our second quarter included an impairment of goodwill of approximately $189.6 million. Reported net loss for the quarter was heavily impacted by the impairment as well as the $10.2 million inventory write-down recorded in the quarter. As a result, reported net loss was $203.3 million or $4.53 per diluted share in the second quarter compared to net income of $2.3 million or $0.05 per diluted share last year. Adjusted net loss for the quarter was $8.4 million or $0.19 per diluted share compared to adjusted net income of $12.9 million or $0.31 per diluted share in the year ago period.\n\nLastly, adjusted EBITDA decreased to a loss of $6.8 million in the second quarter from a $16.2 million profit in the prior year period. The decrease in adjusted EBITDA was driven primarily by the decline in net sales and its impact on our current cost structure as well as the $10.2 million inventory reserve for which we did not adjust in our EBITDA calculation. Moving on to the balance sheet and overall liquidity position. As of June 30, '22, we had $27.4 million in cash, cash equivalents and restricted cash and an aggregate principal amount of debt outstanding of $126.7 million.\n\nAnd I should note that we had 0 drawn on the company's revolving credit facility. At the end of the quarter, we also had approximately $15.3 million in contingent payments composed of an earn-out on the 2021 Aurora acquisition, which was subsequently paid out last month using cash on hand. We estimate total liquidity of approximately $97 million as of June 30, composed of the $27.4 million in cash and cash equivalents at the end of the period plus approximately $70 million of available borrowing capacity under our revolving credit agreement. We made significant progress in the second quarter managing net working capital, and even more specifically, our inventory position.\n\nWe sold through and thereby reduced our inventory by approximately $22 million while also making necessary capital investments in the quarter. Together through these actions, we generated significant free cash flow, which in turn helped us increase our cash position. We believe that as of the end of the second quarter, we still have strong inventory levels, which gives us the opportunity to further manage down our investment in net working capital and further aid our liquidity position. However, in the context of our current forecast, which I will highlight in a moment, we feel it prudent to suggest that driving further free cash flow in the second half of 2022 will be a challenge.\n\nI know this is a question many will ask and so we figured best to cover now. But let me be clear and given all that we know now regarding our 2022 outlook, we feel that we can and will maintain a strong liquidity position for the duration of the year. With that, let me highlight our updated full year 2022 outlook. We expect total company net sales of approximately $330 million to $347 million, which assumes sales levels similar to those experienced from late second quarter through July continue over the remaining months of the year with some further reduction to account for holiday shortened months in the fourth quarter.\n\nWe also expect an adjusted EBITDA loss of between $25 million to $16 million. This range includes $13.4 million of inventory reserves taken year to date. In closing, we believe we put in place the necessary steps to weather the current industry headwinds. And while it's prudent to lower our expectation for the full year, we remain optimistic about our long-term business fundamentals and our ability to capitalize on the growth opportunities in the CEA industry.\n\nThis concludes our prepared remarks. We are now happy to answer any questions you might have. Operator, please open the lines for questions.\n\nOperator\n\n[Operator instructions] Our first question will come from Andrew Carter with Stifel.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nHey. Good afternoon. First question I want to ask is, I appreciate the kind of commentary around the liquidity for the remainder of the year, incremental cost savings. But can you remind us kind of what the parameters are of your term debt and kind of your ability to use kind of the incremental kind of capacity you have left?\n\nJohn Lindeman -- Chief Financial Officer\n\nCertainly. Thanks, Andrew. Let me start with the ABL facility. So I think, as you know, we have a $100 million credit facility with J.\n\nP. Morgan Chase. And as we noted in the quarter, we had availability of $70 million roughly on that facility, 0 drawn against it at the end of the quarter and $70 million available to us. We really only have one financial covenant of note in that particular facility, and it's a spring fixed-charge coverage ratio that only comes into play when our excess availability on the facility is less than $10 million.\n\nAnd as I noted, 0 drawn at the end of the quarter and $70 million available, so not near that at this time. On the term debt facility, we have $125 million using round number terms. A little bit less than that actually, borrowed currently. And it was a covenant-light structure that has no meaningful financial covenant ratio.\n\nWe did actually put in the 10-Q additional details on this matter, and so you could see that there.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nThank you. That's helpful. Yes. That's helpful to get that out of the way.\n\nI guess, second question I wanted to ask, in terms of the operating environment. You said 3% kind of pricing. And I believe the release stated that you had cost ahead of pricing for the quarter. I guess, one question I would ask is if you stripped out lighting from that where there's deflation, would you be pricing ahead of your cost? Just kind of looking for one -- any indicator out there that there's still some rationality left in this category.\n\nBill Toler -- Chairman and Chief Executive Officer\n\nYes. You're right. Lighting is the one that's kind of going the other way, right? But the other categories, we are taking all the price that has come through to us from either raw material increases or packaging increases on our direct brand or our own brands and anything that's come through our distributor brands. We are passing all of that on.\n\nAnd so far, the elasticities haven't been too exaggerated excited and the competition has been pretty rational. Again, lighting being the exception, which is kind of going the other way on high-pressure sodium and other things. But yes, it's still -- we're taking the pricing that's coming through to us. And it's working out OK.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nThanks. I'll pass it on.\n\nOperator\n\nOur next question will come from Andrea Teixeira with J. P. Morgan. You may now go ahead.\n\nWe will move on to the next question. Our next question will come from David Shakno with William Blair. You may now go ahead.\n\nDavid Shakno -- William Blair and Company -- Analyst\n\nThis is David Shakno stepping in for Jon Andersen. Two questions for you. The first, I just wanted to clarify from the prepared remarks. Did you say you expect $15 million to $16 million in adjusted SG&A for the next two quarters? $15 million, $16 million each?\n\nBill Toler -- Chairman and Chief Executive Officer\n\nCorrect.\n\nDavid Shakno -- William Blair and Company -- Analyst\n\nOK. Great. And then the second thing, what states do you think still require the most consolidation right now? Is it Oklahoma, Michigan, or somewhere else? And where do you feel they are in that process?\n\nBill Toler -- Chairman and Chief Executive Officer\n\nYes. I think Oklahoma kind of stands out. I think if there's rough numbers, 15,000 commercial licenses in the U.S., and Oklahoma literally has half of them, which is a bit overbuilt for a four million population state. So that one is the one that I think we're seeing the most consolidation and kind of roll-up strategy, if you will.\n\nMichigan had some issues although it's not, over the longer term, going to be as severe as what you're seeing in Oklahoma. California, yes, it's still going through some pain. But honestly, I think California will find its normalized sea level here, hopefully, in the next couple of quarters. But we hope to see it sooner than that, but we haven't yet so we're not going to call it.\n\nBut specifically to your question, Oklahoma is the one that's the most overbuilt, if you will, and needs the most work to get it back to kind of supplying demand on its consumption level.\n\nDavid Shakno -- William Blair and Company -- Analyst\n\nGot it. That helps. Great. Thank you very much.\n\nOperator\n\n[Operator instructions] Our next question will come from Bill Chappell with Truist Securities. You may now go ahead.\n\nStephen Lengel -- Truist Securities -- Analyst\n\nGood afternoon. This is Stephen Lengel on for Bill Chappell. How are the newer markets sort of progressing through the year? And where should we expect the meaningful step-up in growth as we move through -- or move to or through '23?\n\nBill Toler -- Chairman and Chief Executive Officer\n\nStephen, good to hear from you. We've got -- I think 18 out of 50 states showed growth, a lot of those kind of Midwest and East, as you would expect. Some of those smaller ones, places like Montana, obviously, not in the East. But Montana, Louisiana, Mississippi, Florida has actually been a pretty good market.\n\nNew Jersey has had a lot of dispensary growth and has had some growth at the hydroponic level as well. So you're finally starting to see a little bit of traction in these states that many of them passed in 2020 and even some of them, I remember before that. So you're starting to get a little momentum there. Virginia has shown a little bit as well.\n\nSo the wave is coming East, if you will. It's just simply that the California, Michigan, Oklahoma, Colorado, Oregon triumvirate or five-state area is just so large relative to these new ones. Any decline there can't be offset by these newer states. But you are seeing that traction.\n\nWe are seeing that traction, and we think it's going to continue to be fun to watch as we go forward.\n\nStephen Lengel -- Truist Securities -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Bill Toler for any closing remarks.\n\nBill Toler -- Chairman and Chief Executive Officer\n\nGreat. Thank you, operator, and I appreciate your interest in following Hydrofarm today. And we all look forward to speaking with you in greater detail soon. Take care.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nFitzhugh Taylor -- Managing Director, ICR\n\nBill Toler -- Chairman and Chief Executive Officer\n\nJohn Lindeman -- Chief Financial Officer\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nDavid Shakno -- William Blair and Company -- Analyst\n\nStephen Lengel -- Truist Securities -- Analyst\n\nMore HYFM analysis\n\nAll earnings call transcripts"
}