{
  "companyName": "RH",
  "companyTicker": "RH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/09/rh-rh-q2-2022-earnings-call-transcript/",
  "content": "RH (RH -0.43%)\nQ2 2022 Earnings Call\nSep 08, 2022, 5:00 p.m. ET\n\nOperator\n\nHello. My name is Lisa, and I will be your conference operator today. At this time, I would like to welcome everyone to the Restoration Hardware second quarter 2022 earnings call. [Operator instructions] I would now like to turn the call over to Ms.\n\nAllison Malkin of ICR. Please go ahead.\n\nAllison Malkin -- Investor Relations\n\nThank you. Good afternoon, everyone. Thank you for joining us for our second quarter 2022 earnings conference call. Joining me today are Gary Friedman, chairman and chief executive officer; and Jack Preston, chief financial officer.\n\nBefore we start, I would like to remind you of our reliable disclaimer that we will make certain statements that are forward looking within the meaning of the federal securities laws, including statements about the outlook of our business and other matters referenced in our press release issued today. These forward-looking statements involve a number of risks and uncertainties that could cause actual results to differ materially. Please refer to our SEC filings, as well as our press release issued today for a more detailed description of the risk factors that may affect our results. Please also note that these forward-looking statements reflect our opinions only as of the date of this call, and we undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements in light of new information or future events.\n\nAlso, during this call, we may discuss non-GAAP financial measures, which adjust our GAAP results to eliminate the impact of certain items. You will find additional information regarding these non-GAAP financial measures and a reconciliation of these non-GAAP to GAAP measures in today's financial results press release. A live broadcast of this call is also available on the Investor Relations section of our website at ir.rh.com. With that, I'll turn the call over to Gary.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nGreat. Hi, everyone. We are live from RH New York, the RH Guesthouse in New York. And for those of you in town, hopefully, you'll come by over the next few days and come to say hi.\n\nWe'll be -- I'll be here through next week, and it is a place you should come by and see. And we have the best breakfast by the way in New York City. So anybody looking for a good place for breakfast, lunch or dinner. But particularly, you usually can't find good breakfast in this town.\n\nAt least that's what I believe. I'm going to start with our letter, as I always do. To our people, partners and shareholders, we are pleased to report better-than-expected results as revenue increased to $992 million versus $989 million a year ago, up 40% on a two-year basis from revenues of $709 million. Results exceeded our revised guidance due to faster backlog relief despite a deteriorating macro environment.\n\nGross margin expanded 350 basis points in the second quarter, primarily due to increase in product margins as we continue to resist promoting the business as demand trends continue to slow. As we've mentioned, there continues to be widespread discounting across our industry. And while there may be short-term risk of market share loss as a result of our choice not to promote, we believe there are certain long-term risks of brand erosion and model destruction once you begin down that path. It's that discipline and long-term thinking that has enabled us to set new standards for financial performance in the home furnishings industry, and our results continue to reflect those of the leading luxury brands as we delivered 24.7% adjusted operating margin in the second quarter, also exceeding our outlook.\n\nOur results are inclusive of investments related to the launch of RH Contemporary, the openings of RH San Francisco and RH Guesthouse, the development of RH International and the rollout of RH In-Your-Home, which led to approximately 400 of the 530 basis points of SG&A deleverage in the quarter. Our business generated $23 million of free cash flow in Q2, ending the quarter with $2.1 billion of cash in our balance sheet, total net debt of $446 million and trailing 12 months adjusted EBITDA of $1.1 billion. We purchased 1 million shares of our common stock in the second quarter at an average price per share of approximately $255. We also spent $82 million in cash to repurchase $18 million and $39 million of the 2023 and 2024 outstanding convertible notes in privately negotiated transactions.\n\nFollowing these transactions, there remains $44 million of convertible notes outstanding as of July 30, 2022. Let me move to our fiscal 2022 outlook. As noted in our updated outlook provided on June 29, 2022, our expectation is for continued softening in our business trends during the remainder of fiscal 2022 as a result of ongoing weakness in the housing market over the next several quarters and possibly longer due to the Federal Reserve's anticipated interest rate increases and the cycling of record COVID-driven sales levels in 2021. Additionally, due to the construction and approval delays, we are pushing the opening of RH England to the spring of 2023.\n\nWhile disappointed to miss the peak summer/fall season in the English countryside, we believe waiting until we can open with a full expression of our brand is the right long-term decision. Additionally, RH Palo Alto, which we planned to open in the fourth quarter of 2022, is shifting to the first quarter of 2023. Based on our current trends, the uncertain macro environment and the shift of RH England to spring of 2023, we are providing the following outlook for the third quarter and fiscal 2022. Third quarter net revenue in the range of down 15% to down 18% with adjusted operating margin in the range of 18.5% to 19%; fiscal 2022 net revenue growth in the range of down 3.5% to down 5.5% with adjusted operating margin in the range of 21% to 21.5%.\n\nWhile we expect the next several quarters to pose a short-term challenge as we cycle the extraordinary growth from the COVID-driven spending shift and shed less valuable market share as we continue to raise our quality and navigate through the multiple macro headwinds, we believe our long-term investments will enable us to continue driving long-term industry-leading performance. 2022, the year of the new. As we've mentioned, while many of our plans have been delayed by the virus, they were not disrupted by it. We continue to believe the important investments and introductions we are making in 2022 will mark the beginning of the next chapter of long-term growth and innovation for the RH brand.\n\n2022, the year of the new, includes: the May opening of RH San Francisco, The Gallery at the Historic Bethlehem Steel Building, our most extraordinary new bespoke gallery to date. The launch of RH Contemporary, the most compelling and potentially disruptive product introduction in our history. RH Contemporary has been recently expanded to RH New York, and the initial results look promising. We plan to expand RH Contemporary into more galleries as our inventory levels improve in the first half of 2023; the elevation of RH Interiors and RH Modern inclusive of new collections and enhanced quality.\n\nThe September unveiling of our first RH Guesthouse in New York, a revolutionary new hospitality concept for travelers seeking privacy and luxury in the $200 billion North American hotel market. We believe -- we began accepting inquiries for a stay at RH -- at the RH Guesthouse yesterday as our website, rhguesthouse.com, went live and The Dining Room at RH Guesthouse New York, our new live-fire restaurant is now open for breakfast, lunch and dinner. We plan to unveil The Champagne & Caviar Bar at the RH Guesthouse New York next week. The introduction of an elevated new live-fire restaurant at RH San Francisco and the RH Guesthouse in New York.\n\nSince opening our new live-fire concept, RH San Francisco is significantly outperforming our original Gallery restaurants, and we are now planning to expand the concept to our new Bespoke Galleries in North America and Europe. With the September debut of our first Champagne and Caviar concept in the RH Guesthouse New York, we now plan to expand this offering to future galleries in Paris, London, Milan and Aspen. We will have more to report on the exciting new concept by next quarter. The premiere of The World of RH, our new digital portal, highlighting the connective power of our evolving ecosystem, which we believe will begin to properly shape and position the brand in the minds of our website visitors, especially as we launch the brand globally.\n\nThe lift-off of RH1 and RH2, our customized Gulfstream G650 and 550 jets that will be available for charter later this year. The christening of RH3, our luxury yacht that is available for charter in the Mediterranean and Caribbean where the wealthy and affluent visit and vacation. The rollout of RH In-Your-Home, a unique and memorable experience with Brand Ambassadors guiding every detail of the delivery and extending the selling experience into the home. Let me move to our RH business vision and ecosystem, kind of our long view.\n\nWe believe there are those with taste and no scale and those with scale and no taste. And the idea of scaling taste is large and far-reaching. Our goal to position RH as the arbiter of taste for the home has proven to be both disruptive and lucrative as we continue our quest to build the most admired brand in the world. Our brand attracts the leading designers, artisans and manufacturers, scaling and rendering their work more valuable across our integrated platform, enabling RH to curate the most compelling collection of luxury home products on the planet.\n\nOur efforts to elevate and expand our collection will continue with the introductions of RH Contemporary, RH Couture, RH Bespoke, RH Color, RH Antiques & Artifacts, RH Atelier and other new collections scheduled to launch over the next decade. Our plan to open immersive Design Galleries in every major market will unlock the value of our vast assortment, generating revenues of $5 billion to $6 billion in North America and $20 billion to $25 billion globally. Our strategy is to move the brand beyond curating and selling product to conceptualizing and selling spaces, by building an ecosystem of products, places, services and spaces that establishes the RH brand as a global thought leader, taste and place maker. Our products are elevated and rendered more valuable by our architecturally inspiring Galleries, which are further elevated and rendered more valuable by our interior design services and seamlessly integrated hospitality experience.\n\nOur hospitality efforts will continue to elevate the RH brand as we extend beyond the four walls of our Galleries into RH Guesthouses, where our goal is to create a new market for travelers seeking privacy and luxury in the $200 billion North American hotel industry. Additionally, we are creating bespoke experiences like RH Yountville, an integration of food, wine, art and design in the Napa Valley; RH1 and RH2, our private jets; and RH3, our luxury yacht that is available for charter in the Caribbean and Mediterranean, where the wealthy and affluent visit and vacation. These immersive experiences expose new and existing customers to our evolving authority in architecture, interior design and landscape architecture. This leads to our long-term strategy of building the world's first consumer-facing architecture, interior design and landscape architecture services platform inside our Galleries, elevating the RH brand and amplifying our core business while adding new revenue streams and disrupting and redefining multiple industries.\n\nOur strategy comes full circle as we begin to conceptualize and sell spaces, moving beyond the $170 billion home furnishings market into the $1.7 trillion North American housing market with the launch of RH Residences, fully furnished luxury homes, condominiums and apartments with integrated services that deliver taste and time value to discerning time-starved customers. The entirety of our strategy comes to life digitally with The World of RH, an online portal where customers can explore and be inspired by the depth and dimension of our brand. Our authority as an arbiter of taste will be further amplified when we introduce RH Media, a content platform that will celebrate the most innovative and influential leaders who are shaping the world of architecture and design. Our plan to expand the RH ecosystem globally multiplies the market opportunity to $7 trillion to $10 trillion, one of the largest and most valuable addressed by any brand in the world today.\n\nA 1% share of the global market represents a $70 billion to $100 billion opportunity. Our ecosystem of Products, Places, Services and Spaces inspires customers to dream, design, dine, travel and live in a world thoughtfully curated by RH, creating an emotional connection unlike any other brand in the world. Taste can be elusive, and we believe no one is better positioned than RH to create an ecosystem that makes taste inclusive, and by doing so, elevating and rendering our way of life more valuable. Climbing the luxury mountain and building a brand with no peer.\n\nEvery luxury brand, from Chanel to Cartier, Louis Vuitton to Loro Piana, Harry Winston to Hermes, was born at the top of the luxury mountain. Never before has a brand attempted to make the climb to the top nor do the other brands want you to. We are not from their neighborhood nor invited to their parties. We have a deep understanding that our work has to be so extraordinary that it creates a forced reconsideration of who we are and what we are capable of, requiring those at the top of the mountain to tip their hat in respect.\n\nWe also appreciate that this climb is not for the faint of heart. And as we continue our ascent, the air gets thin and the odds become slim. We believe the level of work we have introduced this year, inclusive of RH Contemporary, RH San Francisco, RH1, 2 and 3 plus the opening of the RH Guesthouse New York, begins to demonstrate the imagination, determination, creativity and courage of this team and our relentless pursuit of our dream. 20 years ago, we began this journey with a vision of transforming a nearly bankrupt business with a $20 million market cap and a box of Oxydol laundry detergent on the cover of the catalog into the leading luxury home brand in the world.\n\nThe lessons and learnings, the passion and persistence, the courage required and the scar tissue developed by getting knocked down 10 times and getting up 11 leads to the development of the mental and moral strength that builds character in individuals and forms cultures in organizations, lessons that can't be learned in a classroom or by managing a business, lessons that must be earned by building one or by reaching the top of the mountain. Onward, Team RH. Carpe Diem. So we'll now open the call to questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Steve Forbes with Guggenheim.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nI guess good evening, not afternoon, right? Hey, Gary, just wanted to start really with your high-level thoughts around the value, as you perceive it, of the real estate pipeline given the delays today. So really, can you talk through the anticipated 2023, 2024 opening cadence? I mean can you speak about any of the projects in a little more detail? And any sort of time frame on when we should expect you to get back to a more normalized opening cadence?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. Hey, I don't know what's going to be exactly normal based on the kind of projects and experiences that we're building. I mean we're -- I mean I know it's -- you want more normal, but we don't build normal, right? So we don't really roll out a 10,000 or 20,000 square foot store that you can open in a mall. We don't know open kind of windowless stores that have maybe a glass store front in a shopping center that you can stamp out.\n\nEvery one of our projects -- it's a development project. And it's complex, and it's hard to do. And it's hard to get approved, and they take longer and takes more human capital and more financial capital and more imagination and more determination. And that's why they're so much more valuable than other things and that others might build and they might be able to be more consistent.\n\nBut we rarely build many stores that are exactly alike. And it's funny we've used the word prototype here on and off for a little while in the last few years. And I finally said like just take that out of our vocabulary because honestly, every retailer I know that develops a prototype and starts to roll it out wakes up about five years later with a bunch of old stores. And in today's world, where things are evolving so much faster, information is slowing so much faster, the world is so much more visual based on social media platforms and just the immediate movement of images and photography across the world instantaneously.\n\nI just think that having a prototype and trying to be more predictable is a dangerous strategy because we're in a world that innovation is going to only speed up. And I think duplication is going to be something that puts brands at risk. So I just don't know if that's necessarily our goal, Steve. Our goal is to do really extraordinary and remarkable work.\n\nAnd what we've learned, it came to the center of innovation and walked through the portal. We've got a new sign above it. It says, RH, the home of the extraordinary. They're remarkable and they're amazing.\n\nAnd what we've learned in our journey is that when we do extraordinary and remarkable work, we've always figured out how to monetize it. And we found it hard to monetize ordinary and unremarkable. And I think that you can just look at our numbers, and the math would tell you that. If you look at our productivity per square foot versus anybody else's in our space, if you look at how much we do per store versus anybody else in our space, that's not -- it's reflective of the effort and the amount of work and the amount of imagination and determination and creativity and courage it takes to do work that nobody has seen before.\n\nIf you want to have results that have never been achieved before, you have to do things that have never been done before. So I appreciate your comment, but I just tell you we sat here and said, hey, can we rush and get England open? We could. And it would be -- it'd be probably extraordinary based on everybody else's standards. They can't imagine the kind of work we're doing.\n\nBut it would be less than we can see in our imagination. And I think what I would tell the team here is you just can't rush quality, and you just can't rush greatness. And I don't know, you tell me how many times has Elon Musk been on time with the product launch. I just think, God, I didn't put the $250,000 down in the Roadster, what, like five years ago, six years ago.\n\nYeah. But I just think that what we're trying to do and -- we're trying to be the most admired brand in the world. And we used to say one of the most. And now we believe we can be the most admired brand in the world.\n\nWe think we can do work that's so extraordinary. It really inspires people across all industries. And this just takes more time. It takes more effort.\n\nAnd so I don't know how you put invention and innovation on a time clock. It reminds me the quote from Thomas Edison. A journalist was asking, Mr. Edison, you've tried and failed 10,000 ways making a light bulb.\n\nHow do you feel? And he said, you're exactly wrong. I've learned 10,000 ways how not to make a light bulb. And that's -- the journey of invention and innovation is not a journey of duplication. But the results of the journey of invention and innovation is extraordinary and drives the kind of results that I think have -- that we've now been able to begin to show.\n\nAnd we have a massive strategic difference between RH and anybody else. And even though some of the businesses people ask me about this one or that one, how do you feel they are taking your market share? We started at such a lower level. I think if you look at anybody versus us from '19 to '22, take their estimates, take our estimates, yeah, they might have had a higher percentage increase. But did they capture more dollars than us? No.\n\nDo they expand their operating margins further than us? No. Did they maybe look like they got more sales because they're picking up our crumbs as we're shedding less valuable sales? Yeah. Yeah. And there's going to be people that pick up our crumbs.\n\nAnd they're going to feel really good for a while until they wake up and just realize they have an average business and an average brand. And it's just not what we're trying to do. We're really trying to build the most admired brand and business in the world. And it's -- and sometimes -- like we're going to open -- let me give you a little color in England.\n\nRH England is going to have six hospitality experiences, six. Three full restaurants, right? Three secondary hospitality experiences. But we have the [Inaudible] live-fire restaurant. We have the conservatory, more casual American bistro kind of restaurant.\n\nWe've got a loggia that we're going to -- we're going to call it the terrace, but it's a loggia. We're going back and forth. It's a beautiful kind of outdoor space, partially covered, incredible views with live-fire pizzas and beautiful charcuteries and other dishes that -- and wine. And they're all restaurants, quite frankly, that no one in retail has anything like.\n\nAnd every one of them has a view of beautiful landscape. And we've got on the property the largest herd of white deer in all of Europe. And so -- and then we've got secondary hospitality experiences like the wine room, the tea room. We're going to serve high tea service in a way that contemporary way that people haven't seen.\n\nThe wine room would be seen -- the wine kind of impact and experience we started to create in San Francisco, where just the wine selection and curation -- if you come to RH New York for dinner, I mean, you're just going to see a completely different wine list. And if you come next week when we open the Champagne and Caviar Bar, I think you're going to see the most unbelievable champagne and caviar bar in the world, right? Not just even in New York. Like in the world. And I think our restaurant we're opening in New York is -- I think it's one of the best restaurants in the world.\n\nI really do. And I think the food is that good and the room in the RH Guesthouse New York is maybe the most beautiful room in the world, dining room in the world. We have probably the most beautiful exterior terrace ever built in New York. It's the first elevated outdoor sidewalk terrace that New York's ever approved.\n\nAnd those things take longer. You've got to get knockdown 10 times. You get up 11. You got to keep going back and be nicer and smarter and nicer and smarter and practice the art of wearing them down to do really extraordinary work.\n\nSo the things that are coming like when you see the next iteration of our Design Galleries, with the first one -- where will it be? I don't know. It will be in Houston. It will be in Naples. It will be like -- the next version, like we've already destroyed.\n\nIf you've seen RH Marin, you've seen -- like that's why it's not even a prototype. It's already dead. Like we're building another one. I mean unfortunately, Palo Alto was too far in construction.\n\nWe didn't modify it. When you see like the next-generation Design Gallery, it's like a sculpture. I mean it's like maybe one of the most beautiful buildings you've ever seen. And again, it's going to just communicate what this brand is capable of and where we're going.\n\nAnd I think it will inspire others and create a movement around this brand, and that's what you have to do to try to make the climb we're trying to make. And so yeah, and we say, look, leaders have to make -- leaders have to be comfortable making others uncomfortable. So sometimes we're going to make you guys uncomfortable because it's just not going to fit into the spreadsheet very well. But what great invention and innovation has ever fit into a spreadsheet? Who's been able to forecast the greatest things that have happened in this world? Yeah.\n\nSo anyway, sorry for that, but I'm pretty inspired. You got to come see this Guesthouse because we -- I was worried that -- I've always been a fan of the Aman Resorts and I grew up -- not grew up. That was really young. But in the last 25 years, I've traveled to a lot of them.\n\nIt's where I learned a lot of architecture, studied countless Aman Resorts and especially the ones that [Inaudible] did that were one of the great architectures in the world. And I was really worried that, oh, my God, what timing, the Aman is opening in New York about the same time we're opening. I'd say I think we've built something way better. We stayed there a few weeks ago.\n\nThis is significantly better. And by the way, -- that's why we priced our starting room rates higher than the Aman in New York. And by the way, we've already got, what, 50 inquiries -- 76 inquiries to stay here, OK? And with -- I mean, it's picking the room, picking their dates, knowing how much it costs with guestrooms starting at $3,500 a night and guest suites starting at $7,500 a night. The Aman is starting at $3,400.\n\nWhat's that? By the way, that's right. Eri is saying, and we don't even have photos at the room on our website. We're the only ones that didn't put photos because this is about privacy and security. Yes, private entries, high security entrance.\n\nNo one is going to get in here but the people staying in here. And because we don't allow photos and we don't allow you to post in social media, I mean, we didn't print photos of the rooms. That's why The Wall Street Journal Magazine is doing this article. And when I told our team, they can't take a photo of the room, they say, like, that's -- well, we can't run the story.\n\nI said that's OK. It's about privacy. They really wanted to photo with me somewhere in the Guesthouse, and I said, OK, I'll give them a photo. So I sat in the bathtub.\n\nYou probably saw the picture. But I didn't show them the whole room. I gave them a little peek in like how magnificent the bathrooms garner. And if you zoom in on the photo, not only do you see this all vein-matched Italian travertine slabs, which you'll never find anywhere.\n\nYou may find them in a few of the best homes in the world. But tell me if you've ever seen a home or a commercial environment, if you zoom into the ceiling, that not only has done a full travertine slab ceiling but had the crown moldings carved out of travertine in Italy. Where we're going is just not comparable. Look, it's going to be -- I'll tell you it will be normalized.\n\nGreat. Extraordinary and remarkable work will be normal here.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nJust a quick follow-up. It's been 18 months since the JV investment. So just curious if you could give some high-level thoughts on how the partnership with Mark is going. And if it's evolved at all, whether in line or just how it's helping the process, right, through the whole real estate process.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYes. It's really been completely additive, and again, a whole another level of innovation because I think our partner is incredibly creative and intelligent and resourceful. And the ability to source real estate that we probably would have never found has been massively incremental. We just got one of the last like palaces in Madrid.\n\nThat's going to be if -- and when you see what we're doing in Indianapolis, I mean, it's nuts. We have a 178-acre estate in Indianapolis next to Butler University with this incredible home on a lake behind this wall. Like you think like what is back there in the wall. And it goes from miles, right? Like you drive one.\n\nAnd it's -- I mean I think we're just seeing so many more creative things. We just closed on -- I guess we haven't even announced that yet now. I guess I could talk about that, right? Yes. Yes, we own it.\n\nWe own it. We closed on 856 acres in the Napa Valley, probably the most beautiful piece of property in all of Napa. It was the site of the historic Soda Springs Resort from the 1800s, still has the ruins, where we'll build a guesthouse and residences and a winery. We have some of the best in all of the Napa Valley, organic farms.\n\nWe're building experience that the world has never seen. Yes, we're close to closing -- are we -- I don't know if we can talk about it. I'm wishing. I can't talk about that yet.\n\nNo. OK. There's like an incredible property somewhere in Europe that you'll hear about, and I can't talk about that one yet. But a lot of these things that we're doing with the JV, we're just seeing things that we've never seen before, I mean, different guest house opportunities.\n\nAnd now I would just tell you like being here in this guesthouse, there's no way this time. It's just incredible. I mean there is nothing like it in the world. And the world needs this, I think.\n\nThey're just -- all the great hotel brands have just marginalized themselves because they all have this -- nobody has control. You've got a developer controlling the development. You get a hotel flag who's trying to design it. You've got conflicts in what they're going to design, how much it's going to cost to build, so on and so forth.\n\nAnd so nobody is really doing extraordinary work. And I think -- I actually think that like this thing is -- I mean it could define an entirely new market that doesn't exist. So yes, there's just a lot of stuff. I mean we've got a lot of -- a lot more optionality, a lot more opportunity.\n\nAnd we continue to strengthen our internal team on more -- what I'd call more typical deals. But the joint venture platform is going to continue to allow us to do extraordinary things in a capital-light way and give us -- control our desks anymore and actually extract value for the value we've created to the developer. So in a low capital way. So we'll have real estate value that we'll monetize now and then.\n\nWe may refinance properties, pull capital out. And I think because we're building such unique things -- and we're not building like strip center retail stuff. These are really bespoke properties. And I think our brand continues to do well.\n\nAnd at our level of performance, it makes the real estate even more valuable. So it's just a lot of optionality that we're going to have long term, a lot of flexibility. But the most important thing is just the creativity in deal sourcing. I mean I really think Mark's organization, they're incredibly creative and resourceful.\n\nAnd they're just fun to work with because they're also highly creative. And so lots of good stuff.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Max Rakhlenko with Cowen and Company.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGreat. Thanks a lot, guys. So first, can you provide just any more color on Contemporary demand in New York and San Francisco? Any early reads or anything to call out? And then with the supply chain pressure easing, is there an opportunity to get it into maybe some more of your galleries faster? Because I think the time line has actually been pushed out a little bit from what you noted last quarter. And then I guess given all this, is 1Q '23 or maybe even 2Q of '23 the first few quarters where Contemporary is going to have a meaningful impact to your top line?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. Sure. Well, one, we're really happy with how Contemporary is performing, I mean, both in San Francisco and in New York. And I mean it's -- San Francisco, we've been really, really pleased.\n\nIn New York, it actually meaningfully has changed the direction of the business. And so that one was a little bit easier to measure, right, because San Francisco went from this little, tiny store to a big store with a restaurant. New York, you've got kind of an apples-to-apples comparison. And New York is not completely done, set up, one would be all done, right, probably another month or so, a few weeks.\n\nWe're redoing every floor of New York. And by the way, probably at the end of the year in January, we might redo the restaurant to just freshen it up and tie it into kind of the whole new aesthetic and color pallet to keep that restaurant really relevant and exciting. And then as it relates to supply chain ramping, because these are all new goods, you just can't ramp too fast. But the big headline, as you know, when our goods in our -- when our product is in our retail stores, it sells significantly higher than it does when it's only online or in a Source Book.\n\nSo that's the big opportunity. I mean the great thing is right now, we're getting some early reads, what are the best sellers, what things are -- what categories, what aesthetics and finishes and things like that is our clients responding to. What are our design teams excited about? What are they expecting? What are external interior designers excited about and expecting? And then how are we adjusting on orders to present those things in our galleries and expand and dimensionalize those ideas further throughout the collection? So lots of exciting things happening. If you've been into RH New York, I mean, we kind of got it in here a few weeks ago.\n\nI mean the team has been in here though this past week, really kind of polishing it up and making it look great. I was just in a couple of days ago. And I think it -- the gallery looks significantly different. We repainted the walls on -- to kind of a buff white kind of like RH San Francisco.\n\nIt's just a better canvas, this new collection, versus the gray paint. So we're going to redo every floor. And so that will take us over the course of probably a couple of months, close off sections, repaint, remerchandise. And then we'll plan a complete transformation across all the galleries.\n\nAnd the great news is -- about not rushing this is when we make the changes across all the galleries, they'll be really intelligent decisions based on real data. So when you have a launch this big and this much newness all at one time, I mean, every plan we have is going to be some degree wrong, right? And the question is are we directionally right and strategically right. And we are. And now it's just fine-tuning, getting the data, adjusting the manufacturing and the on orders, dimensionalizing the big ideas and directions and then optimizing the opportunity sometime, let's take, first half next year, depending on how big we decide to go on the transformation of the galleries.\n\nWe're just painting the insides. Are we doing more than that? So we'll keep you posted, but we're really excited. I mean, yes, I've never been more excited. I mean it's so funny because we're -- I don't know, people keep saying, are we going to be in a recession? We're in a recession.\n\nAnybody who thinks we're not in a recession is crazy. The housing market is in a recession, and it's just getting started. So it's probably going to be a difficult 12 to 18 months in our industry. But these are the times where you can really capitalize.\n\nAnd what I love is the big moves we've made are all directionally right, are strategically right, whether it's Contemporary, whether what we have in the pipeline, that we're working on, whether it's the investments of RH In-Your-Home, whether it's the -- what we're doing in Europe, which I think, again, is going to be extraordinary. We were just done with the Guesthouse. All these things that are like big kind of vector movers that really put us on a different long-term trajectory. And there'll be more opportunities over the next, I think, 12 to 18 months as we ride out what is going to be -- I think it's going to be a more difficult time than a less difficult time.\n\nAnd that's versus how I felt a quarter or two ago. I think things in the world and just -- I think the Fed finally really understands what they have to do. And it's not going to be pretty when interest rates go up the way they are. Again, we can all look at history.\n\nAnd the key is are you prepared for times like this. Are you prepared to capitalize on times like this? And I think we've put ourselves in a position, play offense when possibly everybody is playing defense. And what's funny with -- and we -- during COVID, we didn't really play offense from a small rock point of view. I think our competitors ran around and tried to collect all the little rocks or what I call the apple captures, right? Like the apples are falling from the tree, and they're picking them up from the ground.\n\nWhile everybody is like running around, trying to pick up the apples on the ground, we figured out how to build an apple-harvesting company, if you will. And so yeah, it's just a different game we're playing. And yes, so I think we just feel really good right now. I mean we feel really clear, really passionate, but there's a level of kind of calmness.\n\nLike we've been through storms before. We've been through recessions before. We've been through the Great Recession before. Yes.\n\nWe know what to do. We know how to play this game. And we think there's -- a lot of other people are going to stumble and fall. They're not going to know what to do.\n\nThere's a lot of newly public companies that are -- they're going to have pressure, feel the Wall Street pressure to grow. And they're going to do so right at the wrong time with the wrong balance sheet. And I like where we are. I mean if you look at what happened, I mean what happened to Wayfair like this morning, right? Like doing a convertible notes in the $40 a share.\n\nLike their stock was $300 a share for almost a year, but they are playing a small game. So they couldn't even pay attention. Like if there's any time you're going to do a convertible note raise is when you could have done it at $300 and hedged it up 100% to $600 and pay zero coupon. There's no zero coupons today.\n\nAnd doing convertible notes at $40-something a share, I mean, if they make it through the next big -- this difficult time, I mean, the amount of massive dilution if the company does well, this is going to be incredible from that. So there's -- I just look at the -- like how people are playing the game, what people are doing, what's like -- I just go like I like where we're at. I like the path we're on. I like the strategy we're pursuing.\n\nAnd yes, I think we're going to have a lot of fun. And look, it's -- as Powell said, we're going to have some pain. It only hurts if you're not prepared.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGot it. That's very helpful. And then just going back to 2Q quickly, how much of that top line was supported by working through the backlog? And then just where does it stand today? And how long do you think it will take you to get back to a more normalized level? Thanks a lot.\n\nJack Preston -- Chief Financial Officer\n\nHey, Max, it's Jack. Obviously, when we relieve a backlog, we're generally also building it at the same time. But I'd say if you think about even just the revenue beat versus our expectations, as Gary noted, that was backlog relief. I think through the first half of the year, we'll call it probably $50 million to $75 million through it.\n\nSo relative to that $200 million we originally noted at the beginning of the year, we still have that work left ahead of us. And while supply chain constraints and other things are easing, they're still not back to -- if there's a level of normal, if we all believe 2019 pre-pandemic is normal, they're still not there, and there's still a number of factors that are continuing to have that backlog persist. So we'll see. I think there's a chance to get through it by the end of the year.\n\nBut if not, we'll just continue to chip at it. At some point, it will normalize, especially with the macroeconomic environment and the shape that it's in.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGot it. Thanks a lot, guys.\n\nOperator\n\nYour next question comes from the line of Adrienne Yih with Barclays.\n\nAdrienne Yih -- Barclays -- Analyst\n\nGood afternoon, everybody. Gary, I kind of want to stay on the topic of how the brand is shifting. It seems like the DNA of the brand is actually -- the piece of it is shifting. I'm just wondering if that's the right way to think about it.\n\nIs the company still rooted and founded, the foundation being home furnishings? It seems like future capex are hotels and real estate property and the physical assets. And while, yes, you're still opening the stores, they're more experiential. So I'm just wondering how you think about sort of the root DNA of the company. And then, Jack, just really quickly, next year as we think about 1H '23 SG&A dollar growth because a couple of the Palo Alto and England are opening then, how should we think about that dollar growth? Thank you.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nSure. Well, let me take the first part, Adrienne. So I'd just tell you, if you have our shareholder letter in front of you and if you just go to the RH business vision and ecosystem, the long view, and if you read it carefully, what you will communicate is that everything that we're doing is designed to elevate and render the core business more valuable, everything, right? Everything we're doing. And if you just read it really carefully, you'll pick up everything here.\n\nOur products are elevated and rendered more valuable by our architecturally inspiring galleries, which are further elevated and rendered more valuable by our interior design services and seamlessly integrated hospitality experience, right? Our hospitality efforts will continue to elevate the RH brand as we extend beyond the four walls of our Galleries at RH Guesthouses. We're going to a new market. It's all designed to elevate and render the core business more valuable. If you go to architecture, interior design and landscape architecture, all designed to elevate and render the RH brand more valuable, right? Doing homes that are fully furnished, all designed to elevate and render the core brand more valuable.\n\nSo it's just a different way to communicate and build the brand than anybody else has done. That's OK. I mean Elon Musk has taken a completely different approach. He uses Twitter.\n\nNever does an ad. Yeah, we just believe what we're doing is going to position our brand correctly, elevate it and render it more valuable and that it all -- that's why we call it an ecosystem. Yeah. So there's nothing here that is dilutive to the brand, right? It's just a different way to communicate than a free shipping or Labor Day sale or financing sale or paying now -- buy now pay later, all the different ways that people are communicating with their customers.\n\nWe're just communicating differently.\n\nAdrienne Yih -- Barclays -- Analyst\n\nYeah, that's helpful.\n\nJack Preston -- Chief Financial Officer\n\nAnd then, Adrienne, on the SG&A dollar growth, look, there's variable components in there, there's six components. I think maybe you're asking sort of like what's the fixed investment that we're making because clearly, it will flex on the variable side as it has as our business has grown. But we're making investments in international. We're talking about that.\n\nSome of those are in the base this year. We've got preopening of something that we called out, San Francisco and Guesthouse this year. Those will repeat. Obviously, there will be other elements of preopening next year.\n\nIt's different every year, whether it's a new level or higher or lower. So we don't -- we haven't really guided but just kind of given you some perspective into some moving pieces there. And again, there's going to be pieces that are variable, pieces that are fixed. But from an investment cycle, you kind of know what we're doing.\n\nAnd Gary called out in his letter the pieces that we're investing into this year. And some of those, again, that are in the base, we'll cycle those. And if there's more investments we made, we'll be talking about that.\n\nAdrienne Yih -- Barclays -- Analyst\n\nOK. Thank you very much. Best of luck.\n\nJack Preston -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Curtis Nagle with Bank of America.\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nGood afternoon. Thanks so much for taking the question. So I guess the first one I wanted to go to was just going back to Contemporary. Great to hear after a really promising start.\n\nBut yes, just kind of thinking about this brand kind of further outlook, I think, Gary, you said this is potentially the next billion-dollar brand, right, presuming that still stands. What do you think the time line is in terms of like how that ramps, what that does to other brands? Is it additive? Is it cannibalistic? And what level do you think you get which, I guess, gets to a mature level? Does it take two, three years? Yeah, how do we think about the ramp of that brand?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. I mean it'll take about three years to ramp or so. And we'll keep expanding it and dimensionalizing the brand, that part of the business. And everything you do is somewhat cannibalistic.\n\nHard to tell at this early stage what that looks like but -- because some customers will just trade up. But for the most part, I think it's going to be more incremental than not. And it will open up more of a new market, especially at the high end of the -- at the high end where people have bigger homes, more homes, spend more on the home. It will open up the market to high-end interior designers, as will even more so RH Bespoke Furniture and RH Couture Upholstery.\n\nSo yeah, I mean, I think -- I mean we -- look, the way we kind of encapsulate ideas allows those ideas to break through the market, right, and penetrate and would be seen and known for things. I mean in a lot of ways, it's just an expansion and evolution of the brand. It's just we choose to do it our own way and tend to -- and let us -- instead of like letting things kind of dribble out there and get a lot of impact or get noticed, we tend to kind of pull back, build an idea, build a big idea and then try to break through the clutter. And then it can really move the needle, like RH Modern did.\n\nThe biggest debate inside our company in 2014, '15 was do we integrate RH Modern. Is it just integrate into the RH brand, the core book? Or do we isolate it and we try to break through? And we went back and forth, back and forth, back and forth. Last minute, we said we're going to isolate it because we're just not known for Modern, and it will have a better chance to break through the clutter. And so that's -- so that's what we do sometimes and just how we approach it.\n\nIt's not really -- I don't know if it's the right if we call it a brand. It's a collection. It's an evolution of our business that will be -- we believe, will be really incremental and will move this up and open up the market for us at a higher end. So it will attract more valuable customers.\n\nBut at the same time, there's some cannibalistic nature to it. And at the same time, we're shedding business at the bottom, right? Like we're letting go of things that hold the brand back that might have once been important to the brand but now actually render the brand less valuable. So we're constantly having that discussion inside our company. Is this additive? Or is it dilutive? Is it helpful? Is it hurtful? Does it render us more valuable? Does it render us less valuable? And as you're trying to craft a brand and a business model like we are, all these discussions are really, really important, and these decisions are really, really important and -- yeah.\n\nSo it's not like we go, oh, contemporary, let's just do this and start throwing goods out there. We try to think really deeply about these ideas, and we say we have to think until it hurts, until we can see what other people can't see so we can do what others can't do. And our ideas generally -- our big ideas generally are strategically and directionally right. And then we get going, and we get real data, and then we can evolve from there.\n\nAnd so --\n\nJack Preston -- Chief Financial Officer\n\nI think that's Adrienne -- Curtis, I'm sorry, that's --\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nOK. Anyway, yeah, that answers your question, hopefully.\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nIt does holistic, for sure, and all that makes total sense. And I just got to ask a question on the buyback. I think it was the first time you've been in the market, I think, in like 12 quarters, right? Kind of why now? You've had cash on the books -- a lot of cash in the books for a while. So yes, I guess what triggered that? I mean what do you see in the business? Is it the valuation and the certainty in the long-term growth? Should we expect it to remain in the market? Yeah, just very curious about that.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah, yeah. Well, first, we only have very small windows when we can be in the market, right? And I think sometimes not everybody is aware of that. We have generally how many weeks in the market?\n\nJack Preston -- Chief Financial Officer\n\nIt would be -- it's the second week of the final month of the quarter. So by the time we announce, five or six weeks.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. We generally -- once we announce, we have a five- or six-week open window. And so most of the quarter, we can't buy our stock, right? So I think there's a lot of people who read different reports, and people think like we're out there buying. Well, we can't buy.\n\nBut just generally -- but we're looking at multiple things. We're looking at valuation. We're looking at what the environment looks like, where we think things are going to be. I mean it's not -- like we have a lot of capital on our balance sheet right now that we've raised.\n\nAnd there's a lot of optionality we have. There's -- in a market like we're going into, there may be businesses we want to acquire. There's real estate we may want to acquire. There's other things we may want to do.\n\nOur stock, we may want to buy. I don't know, maybe we want to buy stock of someone that we want to buy, like Bernard Arnault does. So there's a lot of things you can do when you're in the position we're in and you've got optionality and I've got a really good business model that you can capitalize in any kind of a market, especially if we're heading into a recession. So we're just constantly looking at all of our options and saying, OK, based on what we know right now, what is our best use of capital.\n\nSometimes it's just -- yes, we want more data. So we don't just mindlessly buy. I mean look what happened at Bed, Bath & Beyond for God's sake, spent $12 billion buying their own stock back. And look where they are at today.\n\nI'm sure some of the people here thought it was a good time. Probably we had $12 billion. But --\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nThat's my next question. Because you guys have been so thoughtful and just disciplined, right? So it's just first time in a while, so I just -- I thought that was worth highlighting because you are -- restrained disciplines, right, have the balance sheet, so just how did you come to the decision point.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. I mean like especially right now, I don't know exactly how this is going to play out. Just like all the investors you interact with, right, how are they deploying capital, who are they buying based on what information is in the market and what's the right time to buy what. And look, this is kind of like the optionality capital in times like this.\n\nWe're not -- it's not the most important thing we do, right? It's -- the most important thing we do is really all the big efforts here to build one -- build the most admired brand in the world. So that's where most of our time is. And then we spend some time thinking about -- we're looking at data. If we have capital, is it a good time to buy our stock based on the data and where we think things are going? Or is it better to hold off and be -- get more clarity on what the market is going to look like and how our -- what our business is going to look like in that market? And is there other opportunities? Is there businesses that look like things that we want to strategically do that we may be able to acquire at a fraction of the price and maybe get a five-year head start on something that -- if we were to try to do it internally, might go faster.\n\nI mean nothing -- I'll just say this. I want to talk about things like that. Some press will say, oh, Gary Friedman talked about like buying businesses, and that becomes like our big strategy. That's not our big strategy.\n\nBut there are things that we're working on and doing and then things that we've articulated that we want to do that there are things that other people are doing, and if you do it in a long time, maybe they just don't have the scale we have or the platform we have or the infrastructure we have, and they're too small of the business to be a good public business or even a good private business. And yeah, maybe take businesses like that, put it in our platform, and it could do much better. I mean -- in long term, it becomes a big opportunity for us. So it's just -- yes, we're just always looking at a lot of things, and we get people that bring us a lot of options and look at things.\n\nAnd there's things we've been looking at for a long time. Like we knew we wanted to have Waterworks as part of the portfolio the whole 22 years I've been here. It was finally the right time we bought Waterworks, and it was a little bit of a rocky start in the beginning, but now Waterworks is performing really well. Record EBITDA, really good model.\n\nThere's going to be a bigger opportunity to synergize what Waterworks is doing with RH on our platform. I think our brand is now starting to catch up with their brand, and the brands would come in to harmony, and it will be the right time to have a much bigger play. And so you go -- with all those kind of things, you're really taking a long-term view. It's not -- I mean there may be a short -- a really good time to buy.\n\nBut you tend to make more mistakes when you just buy things on price, right? That's why I kind of say the thing like on Bed, Bath & Beyond or something. Some of these didn't think deeply enough or know the business deeply enough because I'm sure in retrospect, they look back and go that was the worst allocation of $12 billion, maybe one of the worst in history in retail, companies that size. But somebody thought that was a good idea. I would say they probably just didn't think deeply enough.\n\nThey didn't think about the risk. They didn't think about other opportunities and know their business well enough. And so we spent a lot of time thinking here, a lot of time debating. We try to get all the brains in the game and the egos out of the room, and we say none of us are smarter than all of us, and that usually gets us to better decisions than most people are making.\n\nBut yes, so we're in no rush. I mean I don't know, like -- I mean if we go into a really bad recession, where will they price our stock? You tell me. Probably lower than it is today.\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nThanks very much for that.\n\nOperator\n\nYour next question comes from the line of Simeon Gutman with Morgan Stanley.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood afternoon, guys. A little bit of a near-term question, so pardon these. First, when you lowered the guidance, it was June, and it sounds like that might have been the low point for a lot of retail. I realized you're catering to different clientele and customers in a different end market, but curious if anything picked up.\n\nAnd then the more -- the bigger question is, I guess, how much are you willing to sacrifice in terms of market share? The down 15 to 18, I don't know if that's a representative run rate beyond. But I guess when do you step in with price? And is that a '23 decision or it could be an end of '22 decision?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. Like I think I said last time, there's not really a plan B as it relates to that. I don't think we're going to need to do that. And it doesn't mean that we're not -- we're always going to be cycling through inventory, right? There's always going to be, I think, a level of inventory that we're cycling through.\n\nIf the market gets really bad, we might cycle through the bottom part of our inventory more quickly. And so we may burn a couple of hundred basis points of margin to not lose market share, but we're not going to promote across the brand. I don't see that as needing to take place. And I don't think that other people are going to take that market share because they don't have our product, and they don't have our positioning and our experience and our brand, right? So like a lot of people say, oh, this is your competitor.\n\nThat's your competitor. I go, really? Go to their store. You really think it's our competitor? Like we do three times per square foot than they do. They're not really our competitor.\n\nAnd we're doing three times per square foot like versus some of the next best players. So I don't mean to sound arrogant at all or dismissive, but like the world would just have to really fall apart for us to deviate at all. So could that happen? Maybe. But there's -- I can't see anything in the future that would say, oh, my God, this happened and that's going to force us to screw up the model.\n\nI just really don't. We don't sell any seasonal goods. We don't even sell Christmas stuff. We have no seasonal inventory.\n\nWe have no summer inventory. We find no winter goods. Nothing like that. So we're very different than everybody else.\n\nLike who else do you know in retail that didn't have a Labor Day sale? Only the luxury brands. Did you see us mail at Labor Day sale, email? Do you think if I would have mailed at Labor Day sale an email, we might have done more business? Sure we would. Like somebody asked me the other day, somebody said, Our House was on the call, and they said they're taking market share from RH. When's the last time everybody checked Our House's website? The whole business is on sale.\n\nThe whole business is 25% to 35% off, every item on the website. Do you think that's sustainable? Ask me about Our House in two to three years. Yeah. I was like, OK, Our House is up 50% in revenue, but their operating margin is not going up.\n\nI don't want to play that game. If we hit the promotional button here, our sales will go up to 50 times easily. Just not the game we're playing. So just -- I don't ask Hermes or ask Chanel or ask Ferrari or ask everybody else, ask the luxury brands what they're going to do.\n\nWe're going to do what they're going to do. Yeah, that's -- it's just the path we're on.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nYup. As a quick follow-up for international, I forget, was there anything embedded in sales guidance for contribution? And how much, I guess, gets pushed if there was?\n\nJack Preston -- Chief Financial Officer\n\nIn fiscal '22? Yeah, yeah. You'll notice we took a bit out of revenue, about a point. So you can view that as a combination of international and Palo Alto coming out of the forecast essentially.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nAnd we took the high end of the operating margin by 50 basis points, right?\n\nJack Preston -- Chief Financial Officer\n\nThat's right.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. Thanks very much. Good luck.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nThank you, Simeon.\n\nOperator\n\nYour next question comes from the line of Anthony Chukumba with Loop Capital Markets.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nThank you so much for taking my question, and thanks for all the helpful information. I guess my question was on RH Guesthouse, which, I mean, just sounds spectacular. I mean how do you think about the potential financial implications? Just like how do you -- how does that kind of work through the model? I mean I know it's mainly about advertising for the RH brand, which makes perfect sense to me, but I was just wondering if -- how we should be thinking through the financial implications, particularly given those room rates. Thank you.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. Check with us next quarter. Let's see what the demand is like, what the restaurant does. I mean the San Francisco restaurant is just -- it's feeling incredible.\n\nAnd this is the same -- I think we decided to put it in San Francisco at the last minute and perhaps we fine-tuned it. But I think our restaurant -- I mean the restaurant of the Guesthouse, if you combine it with the Champagne and Caviar Bar, which is 32 seats, kind of in a cellar underground, I mean, between those two things, I think it's going to definitely be by far the highest volume, just food and beverage kind of restaurant experience we've ever done. We think it's going to be significantly higher volume. And that's a different model, right? Most of the hotels, they're really good at rooms, and they stuck at F&B.\n\nAnd so their whole model is just a room model. Our model is a slightly different model. We're a street front F&B business. We have 100 -- I think we have 115 feet street front here for a restaurant.\n\nAnd we have a very discrete entrance, private entrance for the Guesthouse. And so it's like a restaurant with sleeping rooms on top, right? So if you're a good restaurant operator and you've got a good model, you're already starting way ahead. And then you've got the rooms, which everybody told me for so long, you can't make money in a hotel without under 100 rooms. So yeah, we always say, well, I'm not opening a hotel.\n\nAnd they say, what are you doing? It's guesthouse. And they say, what's that? And we're trying to get a new market for privacy and luxury. And then they say, oh, I get it. It's going to be a showroom for your furniture.\n\nAnd I say, no. Why would we do that? We have a 90,000 square foot showroom, I think, 47 steps away. And they say the things that usually twists our head and say, well, it's not going to have any of our furniture. And then they get the trout look.\n\nAnd it's not about the furniture. It's about elevating. It's about elevating RH as a thought leader, place maker and taste maker in the world. And so it doesn't have any of our furniture here.\n\nAnd so -- but I think because it's so unique and so extraordinary that, I don't know, let's say, a difficult person is getting -- I mean the higher-end hotels like the Marcus and the Carlisle and other people are starting room rate at probably $1,300 to $1,600. The rooms are 350 to 450 square feet. And it's taking the team through it and say, like, what are the rooms? Like what do you see? We looked at pictures of their rooms and say, well, we see painted sheet rock walls, funny little piece of crown molding maybe if they have it. And I say like, did you see any down lights in the ceiling? No, not a down light in one of the ceilings.\n\nAny uplight anywhere? No, no uplights. Where do you sit if you want to have breakfast? Where do you sit? Let's look at that. What -- let's look at the vastness. Let's look at -- I think if you find -- if you just go look at the best hotels in New York City and even the new Aman, if you go in there and ask for a tour of the room, they'll probably give it to you because I don't think -- they opened, and it's not the quality level I would expected.\n\nAnd I think we just have a level of design and quality of the world has never seen. I think it will demand a price that maybe no one has seen in New York and great level of exclusivity and scarcity that -- kind of like the luxury brand, kind of like a Birkin bag, so to speak. And so I think in a quarter, we're going to probably have a good sense of, OK, what do the restaurant revenues look like? What do the room rates look like? I mean the great thing in this business -- like most hoteliers would tell you that they have 80% margin in the rooms. Fully have 80% margin, the rooms are $400 a night.\n\nRooms $1,200 a night is a lot different. Rooms that are $1,800 a night is different. If the rooms are starting at $3,500 a night, you can imagine what the margin might be like in the rooms. It might be 97% margin, 98% margin because you're not particularly spending that much more for housekeeping and other things.\n\nWe are making investments into security and safety, and we've got some of the best security and safety experts that protect the wealthiest people in the world, that have designed our systems and security here. So this is going to be a very safe place for wealthy and affluent people to stay. Very private place and a very luxurious place. So I think that we're just going to be able to -- we have something nobody else has with the room that we think we'll get.\n\nAnd we do hospitality model works the way we think it's going to work. This thing is going to make a lot of money. And then if it does, then we have another kind of profitable kind of communication device about who we are. Call it marketing if you want, but we don't have a marketing department.\n\nWe have a truth group. So we don't use the word marketing that much. We like to say it's not what we say. It's what we do that defines us.\n\nSo we do great work like this, and it makes money. No different than our restaurants, right? We -- again, most people in retail have a restaurant. They don't make any money to lose money or our restaurants make money to do close to $10 million, an average restaurant today. And so this becomes another way to speak to our customer that's an accretive customer acquisition vehicle.\n\nAnd it's not just going to sit there and go, Gary, we only have nine rooms in the residence. That's true, but we have a restaurant that's going to probably seat 5,000 to 6,000 people a week. And people, even if you haven't stayed here, you're going to hear about it. And you're going to understand the aesthetic and the attention to the detail and just the thought leadership when you're in the restaurant or you'll be blown away by the Champagne and Caviar Bar.\n\nAnd yeah, the conversation is going to be great. But then you got to think about the 40 million unique visitors who go to our website that might read about and look at the Guesthouse. And then that becomes maybe 100 million people globally if you count Europe and no different than -- it's not about the six to 12 people that are going to charter RH3 a year. It's got 50 million to 100 million people three to four years from now that are you can see it on the website.\n\nSame thing with RH1 and 2, the handful of people they're going to reach out to us about designing their plane or designing their yacht, which we have now. They've decided just how many of those we want to do. But one other great thing that I think people may not realize about a project like this Guesthouse is what we learned by doing work like this, how much better we are by solving the problems we solve here, how much higher our case level is, how much more we understand the high end of design because we've just done work nobody else has done. I mean we're so much better at our core business because of projects like this.\n\nWe're so much better at our core business by designing the galleries that we design, just doing the design work and putting ourselves in a position to really understand how you win at the highest end of the market. I mean it's an investment in the education of the leadership and the team that you might not get anywhere else or ever in your life.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGot it. That's very helpful. Keep up the good work.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nThank you, Anthony.\n\nOperator\n\nYour next question comes from the line of Steven Zaccone with Citi.\n\nAvanti Cheruvallath -- Citi -- Analyst\n\nGood evening. This is Avanti Cheruvallath on for Steve. Thanks so much for taking our question. How do we think about pricing in the back half and into 2023? And do you still see opportunity to take price increases even though demand has weakened?\n\nJack Preston -- Chief Financial Officer\n\nWhat was the first question? Sorry, you cut out there for a second. Apologies.\n\nAvanti Cheruvallath -- Citi -- Analyst\n\nSorry about that. How do we think about pricing in the back half and into 2023?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nI think we're always thinking about prices, what are the inputs and outputs. And yes, I mean, you've got freight rates kind of coming down. And raw materials are stabilizing, although everything is still high, right? So freight rates are down, but they're still higher than they were historically. Inputs are still high.\n\nI mean they started coming down, but most things are higher than they were historically. So we're constantly thinking about it. And as we make decisions, we'll let you know, or we won't say anything, and you might notice it in the pricing. I think we've got way more flexibility than other people just because we have a higher average price point.\n\nAnd people don't shop for home furnishings and furniture every day. So it's not like you're constantly looking at it, and you noticed like, oh, they went up 3% or 5%. So I think we've been able to demonstrate that we could continue to do what we need to do to have the kind of model that we have. So yes, there will be more.\n\nI don't know, Jack, anything else to add or --\n\nJack Preston -- Chief Financial Officer\n\nLike we continue to have pricing power given the brand, and so we'll continue to approach our thoughts that way. And then we're going to watch the supply chain costs, like Gary said. I mean good news is they're coming down. But if they stay elevated or if they go back up or there's other cost pressures, then clearly, we'll -- we have price as a lever to maintain our margin or enhance it, yeah.\n\nAvanti Cheruvallath -- Citi -- Analyst\n\nAbsolutely. I also wanted to ask on operating margin. In the past, you've cited a 20% as the floor for the business. Do you still see that as the floor if the macro picture continues on the current path? And are there certain macro factors you're monitoring that put that at risk?\n\nJack Preston -- Chief Financial Officer\n\nYeah. Look, I think what we talked about is if revenues were down 20%, we believe that margin -- operating margin will be above 20%. That -- yeah, at or above. That's the gist of it.\n\nIn the way a year plays out, how we get to 20% -- like if you think about it, you make that decision at the point you know the revenue would be down 20%. But you're going to have things like we have preopening costs. You have other things that could impact that. But the earnings power of the business, let's say, revenues are down 20%, are absolutely at 20% or above.\n\nI think that's the take-away. Again, is it plus or minus a little bit because of some one-time?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYou're doing different things.\n\nJack Preston -- Chief Financial Officer\n\nYeah. That's not critical. That's not the critical message.\n\nAvanti Cheruvallath -- Citi -- Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nYour next question comes from the line of Michael Lasser with UBS.\n\nMichael Lasser -- UBS -- Analyst\n\nGood evening. Thanks a lot for taking my question. Given the third quarter guidance, should we think about demand comps trending down in the 20% range? And you ended last year with around 450,000 members. That should provide a good leading indicator on the trajectory of the business and the movement to higher price points, which may give up a little bit -- result in a little bit of market share loss but being able to capture more share per customer.\n\nSo what is the recent trend of membership? Thank you.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nI think I'd start with there's -- you've got a couple of things going on. I think you have to really separate people that are in the home business or selling furniture from what else is happening. Sometimes people say, oh, a luxury people or Hermes or Chanel are doing this to that. COVID hit different businesses very differently.\n\nOur business went way up in COVID. A lot of other people's business went down in COVID. And now then some people are looking at but coming up against lower numbers, and they're catching back up. And there's businesses like ours that are going to give business back because COVID was really a big pull forward.\n\nAnd so like trending down 20% -- what exactly could -- go back with we're up against -- I mean if we look at the Redfin data from -- I think it came out, right?\n\nJack Preston -- Chief Financial Officer\n\nJune or July, June.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. The entire housing market, I think, was down 5% and the luxury home market was down 18%. Why was the luxury home market down 18%? And I'd argue we're really the only one in the luxury home market. Some people, again, are trying to put other people in there because they're not selling really low-end goods, but they're not at our level.\n\nAnd the luxury home market was down 18%. And why was it down 18%? Why was it down so much more? Because it was up against up 80%, up 80%, right? And why was the luxury home market up 80%? Because all the people that had their money to move during COVID moved. And a lot of the other people didn't have the money to move. So just take New York.\n\nPeople moved to the Hamptons. They moved to Miami. They moved to Palm Beach. They moved to Aspen.\n\nThey moved to Naples. They moved almost everywhere but New York. At one point, New York was the hot bed for COVID, and all the people with the money and wherewithal and the ability to move to second homes or buy second homes moved. And it drove second home prices in the Hamptons and Aspen, all these other places, through the roof.\n\nWell, a lot of those markets are coming down, right? And when something goes up 80%, it doesn't grow from there, and it doesn't stabilize there. It goes down. And so our customer is the one that moved. That was where all the activity was, right? And so -- and it drove a significant amount of business.\n\nAnd so the high end is going to come down. So say like -- when did the Redfin data come out again? I think weeks or sometime behind the data. We all know that the housing market that was down five or six in the first quarter was down 20. I mean existing homes, which is 90% of the market, right? So existing homes were down 20.\n\nWell, they were only down five. So existing homes went down 20. And luxury homes, which is defined by the top 5% of the homes in every market, top 5% of every market. If that was already down 18, do you think it got better? Or do you think it got worse? My bet is it got worse.\n\nAnd again, I think it's -- you got to kind of understand the market and each of us is playing it. They're very, very different. And we know our market really well. And a lot of times, we disagree with what markets other people try to bucket us in.\n\nIt can be lazy analysis honestly. So that's why we feel relatively calmly with the numbers that we're giving you because we kind of -- when you don't feel calm is when you can't see the board and you can't see the game and you can't see the next several moves, you can't anticipate. So there's nothing in our business that's happening right now that's surprising to us, that we didn't see a long time ago. And I think -- I don't know when it was.\n\nLike in February and March, when I spoke about what I thought was going to happen in that, four out of five times the Federal Reserve raises interest rates, we have a recession. That's just the math. It's not my opinion. Four out of five times the Federal Reserve raises interest rates, the U.S.\n\ngoes into a recession. And then everybody called me Doomsday forecaster. And I became a meme for a while there. And so -- but everybody thought like I was Mr.\n\nNegative. I'm like Mr. Positive. Anybody who knows me well knows I'm probably -- I'm just like wildly optimistic.\n\nBut I'm also wildly realistic about things that you can know. And there's just data and trends. And we sat there and said -- I said to myself, OK, let me look at all the data. One -- I don't know, one Sunday, I pulled up the last 62 years of the Federal Funds rate.\n\nIf you can pull it up there, it actually comes up. If you want, I'll send you the thing I pulled up. Yeah, I think I sent it to the team January 29, right?\n\nJack Preston -- Chief Financial Officer\n\nJanuary 29.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nJanuary 29. It doesn't look good. When I circled the last the last 20 years, the average Federal Funds rate was 2%. And if you look at it over the last 30 years, I think it's 3%, average 3%.\n\nAnd if you look at the last time we had real inflation, most of the people that are managing a lot of money on Wall Street or foreign positions were kids. And I thought like nobody's seen what's happening right now. Nobody's seen inflation like this in their lifetimes. The only people that did, if you did the math, you'll see like if you were in 1980, if you were 40 or 50 years old -- and I'd say, usually 50 years old, you start to gain wisdom.\n\nIf you're 50 years old in 1980, you're 90 years old in 2020. So we're in 2022 and Warren Buffet is, what, 92, 93. Something like that or close to that. You got like a Warren Buffet who had wisdom in 1980, and you've got a handful of other people, George Soros, a few people that are still active.\n\nSo most of the people managing big funds right now, they might have been five years old in 1980 or anywhere around the '80s. Never seen anything like this. Never seen interest rates -- never seen the inflation like this. Never seen interest rates like this.\n\nThat's why Powell was so wrong in the beginning. That's why Janet Yellen was like massively blind and wrong. I mean -- and Fed moved too slow, quite frankly. And now because they move too slow, we're going to see higher interest rates than we would have if they would have moved faster.\n\nAnd I'd say we're going to have -- the interest rate is going to go higher. It's going to hit the housing market first. And the housing market is the biggest part of the U.S. economy.\n\nAnd it's going to drag down everything. And if I'm wrong, that's OK. But the data is there. Now like nobody should be surprised about what's going to happen here.\n\nAnd so I mean, yes, do we look at our numbers and stuff like that? It's all kind of irrelevant, right? What's really relevant is we're unseen before inflation. We're an unseen before for most of the people in business today that are not 80 years old plus interest rate. Yes, interest rates rise. I mean like -- and where it's going to go.\n\nI think that's why Powell said like, OK, now we got it. We have to move because otherwise, I'm going to sit here and have a mess like Volker. Yeah. So I mean I think that we just don't want to get lost in the weeds.\n\nSo you get lost in the weeds at these times, just make a lot of dumb decisions. So that's why we're not aggressively buying back our stock. That's why we have raised $2 billion when we did -- $2.5 billion when we did. Why did we raise it? Because that's what we saw.\n\nSo we'd be in a good position. And we have flexibility and optionality. Am I really focused on membership declines right now? No. Of course, they're going to decline right now.\n\nLuxury housing was down 18% last quarter. Housing got worse, not got -- didn't get better. I'd be shocked if luxury housing is better than down 18%. It's got to be worse than down 18%.\n\nAnd am I surprised that our business is going to be down 20% or whatever? No. It went up 40-something for no reason, except the fact that we had a pandemic and our customer and the other people -- you couldn't shop in stores. People couldn't go anywhere. You can't travel.\n\nAnd so people sat at home. They bought about furniture. Was it a pull forward? Yes, most of it is pull forward. I mean I don't think anybody should be surprised about what's going on.\n\nMichael Lasser -- UBS -- Analyst\n\nUnderstood.\n\nJack Preston -- Chief Financial Officer\n\nMichael, just to clarify. Michael, just to clarify. Obviously, we're not -- we don't guide demand. We didn't -- the 20% comment was yours.\n\nThe guidance is that we're down 12% to 16% at the midpoint, but just to clarify.\n\nMichael Lasser -- UBS -- Analyst\n\nYeah. I mean understood. You go.\n\nJack Preston -- Chief Financial Officer\n\nGo ahead.\n\nMichael Lasser -- UBS -- Analyst\n\nMy quick follow-up question is, was the gross margin expansion in this past quarter and what presumably you expect for the next few driven by you exercising your pricing power? And is there a point at which you might have to start to restrict supply of your products in order to further exercise pricing power much in the way that luxury goods are able to command the margins that they're able to command by the scarcity associated with the value of their products?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nI'd say it's more implied scarcity. Yeah. Somehow they figure out how to grow. So you say, well, how scarce is it? I mean there's a level of scarcity, meaning you just can't be everywhere.\n\nAnd you've got to -- having fewer, more extraordinary galleries or stores, like really positioning yourself well, being where you should be and not where you shouldn't be, all those things, making more scarce and just being smart about it, right, like not -- I mean there's also a level of scarcity because a lot of them threw away or burned their product instead of selling markdowns, right? And so it's just all kinds of things that drive that. So we'll figure out all that stuff as we go. But I just -- I mean good question. I just don't know.\n\nWe know all the answers because we're going somewhere we've never gone before. But we've been more right than wrong. We've been directionally right on our path and our strategy. And we keep getting smarter, and we keep learning more.\n\nAnd we keep doing better and better work. And all that should lead to more trust in our brand, more admiration of our brand and a higher premium people will pay for our product and be part of this brand. And it's just a different model. And a lot of times -- as you said like -- I mean there's really no one has done to do what we're doing in home, right? There's like leave little -- there's a whole bunch of little guys selling either sofas or lighting or this thing or that thing.\n\nAnd there's a bunch of custom people. But no one kind of like become the luxury brand of home. Like there is Chanel, Hermes and Louis Vuitton and Ferrari or Aston Martin or Peugeot, all these other kind of categories. And so it's going to be hard for people to figure us out for a while.\n\nAnd like most new things, like think how long, I mean, like all of a sudden -- remember that guy. Who was the guy that was always --\n\nJack Preston -- Chief Financial Officer\n\nBob Lutz?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah, the guy who was on CNBC all the time saying like Tesla will never make money. They're just terrible.\n\nJack Preston -- Chief Financial Officer\n\nThey'll go bankrupt.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah, go bankrupt. Incredible guy. I mean he was on CNBC like every two weeks, like taking Tesla down. And all of a sudden, boom, Tesla hit the inflection point and people realized, oh, my God, they've just changed the industry.\n\nAnd I think ours could be a little different because it's not as broad reaching. We're not going to have a Model 3 and stuff like that. But I think people are starting to get where we're going. I think in three to five years, it's going to be undeniable.\n\nAnd then people are going to go, whoa, this is a whole different -- I never thought this could happen. This is -- I mean where they've gone to, what their model looks like, where the brand is, I couldn't even see it. And that's OK. You shouldn't be able to see it.\n\nIf you could see it, it means our imagination isn't good enough. Our creativity isn't good enough. Just like people didn't see Apple. All of a sudden, yes, completely turning the cellphone industry upside down.\n\nI mean who didn't have a Motorola or Nokia? What happened to Motorola and Nokia? They're gone. What happened -- like all of a sudden, Tesla became the most valuable car company in the world. So when you are on a different path, it always makes you harder to be understood because nobody has seen it before. And I think we're on one of those paths, and I think people are going to wake up three to five years from now.\n\nAnd they're going to see what we've done in Europe, and they're going to see where we're going next, and they're going to see the path ahead. And they're going to see the strength of the model. And they're going to go, oh, my God. Like, I mean, how many people actually thought on this five years ago, RH would have a 20% operating margin.\n\nI don't think anybody ever thought that. But here we are. And we think that's kind of the baseline. Like even if we have a recession, could it be 18, one year because we're investing in that, yes, like that's not the relevant point unless -- I got it.\n\nA lot of you guys, like your customer or hedge funds that are like renters, not buyers, they're traders, not investors. And so you've got to kind of make your customer happy and look at kind of the small moves, in the quarter-to-quarter, year-to-year moves. Like that's just not how we are. We just have a long-term view.\n\nAnd if you have customers that are long-term oriented, talk to them about us. But if you have short-term oriented people, tell them not to bug us. We're just -- we're probably not going to make them happy, and they're not going to make us happy.\n\nMichael Lasser -- UBS -- Analyst\n\nYup. Understood. Thank you so much.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nThank you, Michael.\n\nOperator\n\nYour next question comes from the line of Brad Thomas with KeyBanc Capital Markets.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nHi. Thanks for taking my question as well. Follow-up on the Guesthouse. Gary, can you just remind us, at this point in time, how many locations you think might be candidates in the United States and globally for Guesthouses? I know you're going to know a lot more in another quarter, but just wondering initially what your thoughts might be and then maybe what metrics you're looking at most closely to figure out what could be maybe more bullish end of the range.\n\nAnd then just a quick one for Jack. Wondering if you could give us a little more flavor for 2023 and with some of these openings shifting and you're seeing how this year's Source Books are performing. Any insights that we should think about in terms of what margins may look like for next year? Is that an investment year? Or do you start to get some back next year? Thanks.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nI think you've got to really give us until the next quarter or so. And the data is going to tell us what happens. I'm just so happy though that we had the courage to do the first one in New York because guys -- some people tell me, oh, you have to do the first one in Nashville or Birmingham, Alabama or somewhere where there's not going to be all the critics and you can learn it. Yeah, like we liked it.\n\nWe like to go in the main stage because we believe it brings out our best work, not our average work. And I'm just so happy that we came to New York and we've done something so extraordinary because this -- every time we do, we've figured out how to monetize the idea. Look, we already have a second one teed up in Aspen. And I mean the first one is -- it's always like creating the first iPhone, right? It's like the R&D that it takes and the investment it takes to create something like this, both human capital and financial capital.\n\nIt's always greater than the next one because we've learned so much here, and we can dimensionalize and use those learnings to go much faster and be really efficient as we go forward. But if it works -- one, like people go, is it can only be nine rooms? This one is only -- yeah, six rooms, three suites and a residence. And I think we've got -- we call those rooms. Like those are pretty big rooms, which is like 1,200 square feet with two full fireplaces and all that stuff.\n\nAnd one from Aspen are pretty nuts. I mean these are nuts, too, but the size and scale of the Aspen one is -- there's rooftop pool suites. They have an 800 square foot room with two fireplaces and sleeping area, living area, two bathrooms. And then you've got an 800 square foot rooftop terrace with your own fire pit, four chairs, two-day beds, two trees and your own pool.\n\nSo like how do you price that in Aspen? I don't know. But I know Aspen used to have 70 billionaires, and now it's 100 billionaires. And they like to have their own home there, but it's the people who go to Aspen. I think it's about as affluent of a small town target market in the world.\n\nSo we're going to learn a lot in Aspen. But my sense is -- the good thing about New York is if it works in New York, it means it will probably work in other cities. And if it works in Aspen, it will work in other vacation destinations like state parks or [Inaudible] or the Hamptons or Miami. And then New York will give us a sense for what cities it might work in, whether it's Paris or London, places like that.\n\nAnd if it works here, and it works with like nine rooms, like it will really work with 20 rooms or 30 rooms. The question is at what point is it not as private. Is there something really special about this? I mean you -- there's only three keys per floor. Like you may never see anybody walking -- you'll never -- if you have the suite there, no one will -- nobody will walk by the room.\n\nIf you have the standard room, only one person, the person that has a suite will walk by a room. And if you have the first room often right when you got the elevators, like you're the only one that walks in the room. And so there's just a level of privacy that you never see. We see the rooftop, and we watched a little video.\n\nClick on rhguesthouse.com. You can take a screen shot of that rooftop, and you can see part of it. And there's -- I think there's a journal published [Inaudible]. There's only -- we have nine rooms and a residence, and there's eight day beds that are like eight to 10 feet apart with hedges, trees and private dining terrace with four tables.\n\nYeah, how many people in New York will actually be on that roof terrace. You might be the only one. There might be -- but how much would you pay per day to have that roof terrace? And that would help us price the rooms. But it's like you think we're building some different.\n\nIf it works here, I think it will work in other places. And it may not be the same room rates. It will be different room rates. But if you have 20 rooms or 40 rooms, if this one makes money, the other ones will only make more money.\n\nSo maybe if it works, there's 20 to 50. Yeah. So it could be $600 million to over 30, something like that.\n\nJack Preston -- Chief Financial Officer\n\nBrad, we don't guide 2023, at least not at this time. I think if you're building a model, I mean, just don't forget everything we've been talking about in terms of not promoting in terms of climbing the luxury mountain. So if you're looking at components of margin and product margin in that model, that's something that -- as we look at it, it's not something that we have plans to break. Other components, we'll see where revenue shakes out, and we'll guide revenue that's appropriate.\n\nBut clearly, you have other fixed components in COGS and also in SG&A. So look, I think the outlook is uncertain as you've heard us talk about. And so we'll provide more guidance later. But I think just don't forget that as far as you build up the product margin piece of our gross margin that you know how we're looking at that.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nThank you very much.\n\nOperator\n\nYour next question comes from the line of Jonathan Matuszewski with Jefferies.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nHey, great. Thanks for squeezing me in. I'll leave it to one in the interest of time. Gary, a lot of investor questions on this concept of shedding lower-value customers.\n\nIs there a way to help us understand the spending pattern of maybe the top 10% or 20% of your member base versus the bottom 10% or 20%? Presumably something like that could help us better understand the opportunity ahead in terms of serving more households in that top 10 of 1% of the population versus, say, the top 3%, 4%, 5%. Any perspective would be helpful. Thank you.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nI think it's going to be like other luxury brands. You're going to have fewer number of customers spending a lot of money, and then you're going to have very aspirational customers. They're reaching up to your brand now and then. I mean Eri tells a story.\n\nEri Chaya, our president and chief creative and merchandising officer, tells a story of when she saved up her money when she's younger in her career to buy a B&B Italia sofa because it's such an iconic thing, saving up to buy her first Hermes bag, a Birkin bag, right? And it was such kind of milestone in her life. And now she is one of the customers. She's got a home. She's redoing the home.\n\nShe's going to do an incredible house, and she's going to be one of those customers. Hopefully, she buys from us. She has a very high-end interior designer working on her whole redo perhaps, the interior architecture and everything she's doing. And I would say the best thing about it, she's learning a lot, and she's going to go through that process.\n\nShe's going to be even better at what she does here because she's actually going through an exercise that our best customers go through, building an incredible home. It could be incredibly designed, furnished. And she can be a lot smarter and have an even better perspective than she has today.\n\nJack Preston -- Chief Financial Officer\n\nJonathan, I might just add on your question. Look, you're familiar with the 80-20 rule, Pareto principle that applies in many, many things in life. And again, we're not -- just directionally, if you think about the top 20% of our customers driving 80% of our volume, that kind of relationship intends to hold in business. So again, you do it with one, right? Like if you're cutting the bottom, they're not spending as much.\n\nIt's just -- by definition, that's just whether it's SKUs, whether it's merchandise or it's customers that --\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah, yeah. The most important thing for everyone to realize is we've been doing this for 22 years. This is nothing new. We've shed way more customers than lower-value customers than we're willing to shed in the future.\n\nWay more. So we're going to shed less, but it's still going to have to do that if we're going to get to the top of the mountain. Yeah, we're really going to become one of the -- yeah, one of the great luxury brands. So we'll see.\n\nI mean the good news is if we don't make it, nobody is going to lose a lot of money for it. And like this is -- if I look here and think about this as an investor, oh, God, they didn't make it. You're not falling to the bottom. A really good model.\n\nWe're in a really good place to take a shot at making the next third of the plan, the final third, I kind of call it. So kind of go, OK, what's the downside? So we're kind of where we are today, and we become global. And it's still a very big company with a really good model, and everybody is going to make a lot of money, yeah, if I just look at it financially.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nThat's helpful. Thank you.\n\nOperator\n\nAt this time, there are no further questions. I would like to turn the call back over to Gary Friedman for closing remarks.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nGreat. Well, thank you, everyone. Thanks for your time and your interest, and especially in these kind of uncertain times, I just want to thank our team who continues to drive us up this mountain, make the climb. And to everyone out there, our team internally, external partners and shareholders, if you get a chance to be in New York, come take a peek.\n\nPing us, and we'll get your seat in the restaurant. Come quickly because the place is filling up. So I might not be able to give you a tour of the property because it is about privacy. And so we have clients here.\n\nWe're not going to be walking people through the hallways or through the building right now for kind of this week and maybe part of next week -- I mean, next week, we may have. I guess we've inquiries as soon as next week. Maybe a few guests here. But if you are in New York, we're here through next week.\n\nAt least I'm here through next week. Not everybody is here through next week. And you want to try to get a quick look, see. We'll kind of take you through and show you a room, show you a suite and show you the rooftop.\n\nYou can't take any photos here. If you do, we'll have to take your phone. And so -- but it is -- it's safe for our team and our partners and our shareholders. I think this is really an example of the kind of work that we're capable of and the kind of work that will demonstrate and prove that we can make it to the top of the mountain and build one of the most admired brands in the world.\n\nSo thank you for your time and thank you, everyone, and our team for your hard work and support and your persistence and determination. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAllison Malkin -- Investor Relations\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nJack Preston -- Chief Financial Officer\n\nAdrienne Yih -- Barclays -- Analyst\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nAvanti Cheruvallath -- Citi -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nMore RH analysis\n\nAll earnings call transcripts"
}