{
  "companyName": "Coherent Corp.",
  "companyTicker": "COHR",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/coherent-corp-cohr-q1-2023-earnings-call-transcrip/",
  "content": "Coherent Corp. (COHR 1.50%)\nQ1 2023 Earnings Call\nNov 09, 2022, 9:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. And welcome to the Coherent Corp. FY '23 first quarter earnings call. [Operator instructions] I would now like to turn the call over to your host, Mary Jane Raymond, chief financial officer.\n\nYou may begin.\n\nMary Jane Raymond -- Chief Financial Officer\n\nThank you, Kevin, and good morning. I'm Mary Jane Raymond, the chief financial officer here at Coherent Corp. Welcome to our earnings call today for the first quarter of fiscal year 2023. This is our first earnings call as Coherent Corp.\n\nAnd the call is being recorded on Wednesday, November 9, 2022. With me today on the call is Dr. Chuck Mattera, our chair and chief executive officer. After our prepared remarks, both Dr.\n\nMark Sobey, president of the laser segment; and Dr. Giovanni Barbarossa, our chief strategy officer and the president of the materials segment, will join us during the Q&A to better explain the unique benefits of our strategy, the results we are reporting today, as well as the exciting prospects we have to expand our footprint in our broad markets as we go forward. For today's call, the press release and investor presentation are available in the investor relations section of our website, coherent.com. Our fiscal year '22 ESG report for legacy II-VI is also on the website.\n\nIt highlights key points of our board and employee diversity, namely the 46% of our board are women and are persons of color, and that 49% of our workforce are women, as well as our investments to support STEM and educational advancement. The report also details our products that are critical to improvements in global energy efficiency and the increasing sustainability of our locations that produce them. In fiscal year '22, 29% of our legacy II-VI energy consumption came from renewable resources, 100% of our European legacy sites are on renewable energy sources, and we exited this year purchasing approximately 38% of our electricity from renewable sources in our legacy facilities. I think you'll like this report when you get a moment to read it.\n\nToday's results discussion includes certain non-GAAP measures. Non-GAAP financials are not a substitute for nor superior to financials prepared in accordance with GAAP. A detailed reconciliation of these non-GAAP measures to our GAAP results is included in today's documents. I remind you that during this call, we'll be making certain forward-looking statements, including, but not limited to, statements regarding macroeconomic trends, expectations for our products and technology, trends in our markets and our expected financial performance, including our guidance.\n\nIn addition, we will discuss expectations regarding the recent acquisition of Coherent Inc., including market opportunities and expected synergies. All forward-looking statements are based on current expectations, forecasts, and assumptions, and involve risks and uncertainty that could cause actual results to differ materially from the statements made today. Our comments should be viewed in the context of the risk factors detailed in our most recent Form 10-K filing for the fiscal year ended June 30, 2022. Coherent assumes no obligation to update the information discussed during this call, except as required by law.\n\nWith that, let me turn it over to Dr. Chuck Mattera. Chuck?\n\nChuck Mattera -- Chief Executive Officer\n\nThank you all for joining us today. Nearly 18 months ago, when we were selected as the winner of an intense three-way competition to acquire the company that was long seen as the industry's gold standard of laser technology, we embarked on a new chapter of our bold strategy to diversify and expand our exposure and participation in growth markets that are inflecting due to irreversible mega trends. These include Industry 4.0 in the technology and scale transitions that are underway in mobile and intelligent networks out to the edge; the Internet of Things to support AR and AI services; and also those consistent with our vision of a world transformed through innovations vital to a better life today and the sustainability of future generations, including our silicon carbide and battery materials that enable the electrification of transportation, an important long-term contributor to the reduction of global CO2 emissions. So, with the acquisition of Coherent finally having closed on July 1st, when we enthusiastically got underway, it is from this new base of unique technology endowments, a deep penetration into multiple ecosystems, strong customer intimacy, new business models that include products and service, and the addition of a huge influx of extraordinary and diverse talent to the broad base we had before that we endeavor to deliver sustainable long-term shareholder value.\n\nOn September 8, 2022, we transitioned to our new name, Coherent Corp., launched our new brand, and began trading with a new ticker symbol COHR. We adopted the name Coherent because it has the universal meaning of bringing things together. And I believe that a great excitement that stems from some of our really cool stuff will emerge as we bring our extraordinary talent closer together. We hit the ground running together, and we haven't skipped a beat since.\n\nThe first 90 days together were super exciting as we follow our well-honed integration game plan that we laid out together for over a year prior to the close. We moved quickly into the first phase of our organizational integrations within the quarter with a focus on the worldwide sales and service organization so we could deepen our understanding of our position and prospects at our largest strategic accounts. Many of these accounts became even larger and have even greater opportunities than either company understood before the acquisition closed. I'll next share some highlights of our performance by our four major markets.\n\nIn addition to the numbers Mary Jane will report briefly on the substantial progress we made on the start of the integration activities, I encourage the analysts who participate in the Q&A to direct your questions about the segments to Giovanni for materials and networking and to Mark about lasers. Before we get into the details, though, I'd like to first acknowledge the extraordinary Coherent team that overcame many dynamic challenges and delivered a steady stream of industry-leading and award-winning products and services to our valued customers. We work tirelessly to do what we said we would do. And as always in our company, our commitment is evident in our aspirations, in our actions, and especially in our results.\n\nTurning to Q1. We delivered for the first time over $1 billion in revenue in a single quarter. Regarding the lingering effects of the supply chain, we have seen improvements in lead times for some strategic components and moderation of shortages for others, but we are still affected by pockets of supply chain constraints that have yet to show any signs of moderation. Without these constraints, which totaled $64 million in the quarter, we would have shipped over $1.4 billion, the top end of our guidance.\n\nHowever, with the strong winds of demand at our backs, we carried on with determination and delivered 1.34 billion in revenue. We grew 69% year over year and 52% sequentially. And consistent with our recent strong growth projections, legacy II-VI's organic revenue grew 20% compared to Q1 FY '22. On a pro forma basis, the company grew 13% over Q1 FY '22.\n\nTurning now to the segments. In Q1 FY '23, the revenue contributions by segment was 44% from networking, 29% from lasers and 27% from materials. As increased market diversification was one of the major elements of our strategy to acquire Coherent, that rationale is perhaps most evident when looking at the size of our communications businesses. In Q1, we derived 44% of our revenue from the communications market, down from the previous 66% in FY '21 and '22 when we were a company only a little more than half the size we are today.\n\nWith the increased scale and greater market and product breadth, we believe that we now have a much better balanced and sustainable portfolio to drive us into an exciting future. Regarding our revenues from the other three markets, we derived 34% from industrial, 13% from electronics, and 9% from instrumentation. Our earnings delivery was ahead of plan in large measure due to a relentless focus on solid market share gains, appropriate pricing discipline, driving procurement costs down, and increased productivity. These factors combined enabled us to deliver solid performance with non-GAAP diluted EPS of $1.04 per share.\n\nThis was considerably higher than the midpoint of our guidance, and favorable FX contributed only about $0.07 in the quarter. Turning now to the communications markets. We continue to benefit from those customers continuing to make investments in telecom and cable TV infrastructure, and we are gaining share in those markets. Our revenue growth from telecom and datacom were both strong double digits year over year and are both forecasted to show additional gains from that base again in FY '23 compared to FY '22 with telecom forecasted to grow even faster than datacom.\n\nWe continue to drive design wins with our industry-leading Coherent transceivers that are increasingly fully integrated into the equipment makers' routers, and we have strong growth projections for our Coherent pluggable products in FY '23 and beyond. Regarding our data center customers, we continue to forecast hyperscale growth in the second half of this year. We are optimistic about the future as we believe these telecom and datacom markets will be long-term resilient as the insatiable demand for products that consume and generate information move to the edge of the network as part of the digital transformation. In anticipation of sustained demand and evolving customer requirements driving our differentiated product road map, we continue to accelerate our investments in our semiconductor laser fabs in the U.S.\n\nand Europe, and our assembly and testing facilities throughout Southeast Asia. As a result of these strong communications drivers, we had record revenues in communications with strong performance in both datacom and telecom, where the split was 57% datacom, 43% telecom. Moreover, we had record revenues from our datacom business as we continue to gain share with the large hyperscalers while enabling them to realize the benefits of their shifts to higher data rate products. In the quarter, 43% of our high-speed transceiver shipments were at speeds of 200G and above, while our shipments of transceivers for 400G ramped up and our 800G deployments accelerated strongly.\n\nEven with the current macroeconomic backdrop, our ethernet transceiver revenue for cloud applications grew at twice the market growth rate. Given our backlog, our current visibility into our customers' projections and our supply contracts that give us confidence in being able to lead the high-speed upgrade cycle, we expect continued strong growth through FY '23. Finally, during the quarter, we received a number of customer and industry accolades. In but one example, we demonstrated our new 200G EML at the European Conference on Optical Communications in September.\n\nThe 200G EML will enable next-generation, high-speed transceivers at 1.6 terabits per second. And to the best of our knowledge, we were the first to demonstrate error-free live traffic in public. The excitement for such an enabling product has been tremendous from both our customers and their customers alike. Turning next to industrial.\n\nOur year-over-year revenues for the pro forma company were down just slightly, though we did experience strong growth in some sectors, including semiconductor capital equipment, which was particularly robust, driven by strong demand for our products that underpin EUV and what we believe are strong prospects going forward. In the display market, display capital equipment had another solid quarter with strong and recurring service revenue derived from a substantial fleet of our excimer laser systems deployed worldwide, combined with the highest level of new system shipments in more than a year. Also, we continue to win the vast majority of laser lift-off opportunities and see continued very strong demand for ultrafast lasers for back-end cutting of OLED displays. We remain bullish on the opportunity for larger-sized laser-annealed OLED panels in the IT segment led by laptops and tablets, and believe this aligns with reported new Generation 8 fab investments and will underpin our display business through the next five years.\n\nA recent industry report on the IT OLED panel opportunity forecasts a 5x increase in unit volumes over those next five years, which is also consistent with what we hear from customers. As another example of our enthusiasm about the long-term prospects of the display business, after nearly five years of investment in revolutionary technology, our prospects for laser-based tools for micro-LED manufacturing are beginning to emerge. We now have more than 25 active customer engagements with a constant flow in and out of our applications' laps. Customers are super excited about the results of trials on our 3-in-1 micro-LED demo tools both in Germany and China, and for which we just began installing this week our first tool for revenue at a well-known customer in Asia.\n\nRevenue from our differentiated products for EV battery manufacturing grew 30% sequentially. Market excitement for our portfolio continues to build as we further integrate our comprehensive product lines of both legacy companies to offer more complete and efficient welding product and service solutions. We also broadened our successful cutting head portfolio, including our recently released high-performance 30-kilowatt cutting head and expect this capability to drive a renewal of growth opportunities. Turning to the electronics market.\n\nOur strong performance in Q1 was driven by a surge in demand and record revenue quarter for our sensing business. Multiple factors have contributed to this exceptional result. We were first to market with a new sensor technology platform that enables novel functionalities in consumer electronics products. Second, we grew total share by outperforming our competition in time to market.\n\nAs in the past, we expect shipments to this market to moderate in the first half of calendar year 2023, while we continue to develop new products for adjacent markets. Moving to automotive electronics and our silicon carbide business. The electric vehicle industry has been shifting to 800-volt architectures, driven by demand for lower-cost, fast-charging, and compact solutions. Silicon carbide power devices are a must-have for these applications.\n\nAnalysts project that demand will outstrip supply for many years ahead, leading to sustained bottlenecks that few suppliers will be able to break. We believe that those who have control of the substrate manufacturing, like Coherent does, will be among those who will be able to grow faster than the market over the cycle. Our substrate customers have long recognized our competitive advantage and are now securing their supply through long-term agreements. So, we are a leader in this industry, and we believe we are building a competitive capability in devices and modules as well and have tremendous growth prospects for this business, too.\n\nFinally, turning to the instrumentation market. Our instrumentation business delivered a solid quarter with revenues at sustained peak levels. Our portfolio of diversified products continue to see very strong demand, including for life science applications as revenue from these products hit a record last quarter. Customers are clearly excited about our combined portfolio, as well as the opportunity to provide additional value and expand even further into the life sciences market at the subsystem level.\n\nNow, I won't take time to come back on after the Q&A, so please allow me to make closing comments before I hand it over to Mary Jane. For over half a century, we remain committed to creating breakthrough solutions to solve our customers' most demanding problems while building an exciting, resilient, sustainable, and valuable growth company. We have the opportunity of a lifetime in front of us. And despite the uncertainty about the future and the dynamic challenges we face every day, we are still aiming to achieve double-digit growth again this year in organic Coherent and the new Coherent, too, as you saw from our revenue guidance for the full year, which includes all of our foregoing comments.\n\nAll of our employees are squarely focused on building long-term value for all stakeholders. From that, in a solid financial position, we will continue to do our very best to continue to earn your confidence and trust. With that, let me turn it over to Mary Jane. Mary Jane?\n\nMary Jane Raymond -- Chief Financial Officer\n\nThank you, Chuck. The Q1 FY '23 quarterly market and geographic breakdown of our 1.34 billion of revenue can be found on Page 8 of the investor presentation. It is worth pointing out the new geographic breakdown of the company. Q1 FY '23 revenue are now distributed by 53% in Americas, 18% in Europe, 14% in Korea and Japan combined, and 11% in China.\n\nOur Q1 non-GAAP gross margin was 40.3%, and the non-GAAP operating margin was 21.3%. Supply chain costs were $7 million and are not excluded to arrive at non-GAAP results. At the segment level, the non-GAAP operating margins were 19.7% for networking, 27.2% for materials, and 18.3% for lasers. GAAP operating expenses, SG&A plus R&D, were $401 million in Q1.\n\nExcluding $35 million of amortization, $48 million of stock compensation, and $61 million of transaction and integration costs, non-GAAP opex was $256 million or 19% of revenue. Total stock comp is expected to be $35 million per quarter in each of Q2, Q3, and Q4. The Q1 amount is affected by the vesting stock compensation of $18 million for change of control. Synergies were off to a good start in the quarter with $3 million in the quarter and $12 million on an annualized basis due to the retirement of several senior executives and the planned elimination of positions.\n\nQuarterly GAAP EPS was a loss of $0.56, and non-GAAP EPS was $1.04, with after-tax non-GAAP adjustments of $222 million in total. Currency accounted positively for $0.07 in the non-GAAP EPS primarily from the weaker euro and R&D. The diluted share count for the GAAP results was 133 million shares. And for the non-GAAP results, the share count was 149 million shares.\n\nThe GAAP and non-GAAP EPS calculations are on Tables 6 and 7 of the press release. Cash flow from operations in the quarter was $80 million, and free cash flow was a loss of $59 million, including capex of $139 million. One-time effects on the cash flow from operations included $60 million in payments for the acquisition, including $35 million in ticking fees, those paid at close, and $25 million in legal and consulting fees incurred by the laser segment pre-close and paid on the closing date. Pretax interest expense was $62 million.\n\nOur outlook of $274 million for the year included the one-month LIBOR reaching 4.2%. It is now forecasted on the yield curve to reach 5.3%. Should that happen on the schedule expected, our goal, along with our debt pays down -- with our debt payments, will be to limit the change in our initial estimate to $5 million to $7 million for a total of $279 million to $281 million. Our net cash at June 30th just prior to the close was $255 million.\n\nOur September 30 balance of cash and cash equivalents was $904 million. Our total debt position is $4.7 billion. We did successfully settle the $345 million of convertible debt in stock as we planned. Using the estimated trailing 12 months on a pro forma basis for the combined company at September 30, the gross leverage was 3.8 times and the net leverage was 3.1 times without the synergy credit.\n\nUsing our credit facility definition, which allows synergy credit of $250 million, the net leverage is 2.6 times. The effective tax rate in the quarter was 24%, and we expect the tax rate in fiscal year '23 to be between 22% and 24%, assuming no adoption of new or additional tax rulings. The increase in the tax rate is largely driven by a larger presence in Europe, as well as M&A costs that are not deductible. Turning to our outlook for Q2 fiscal year '23.\n\nOur outlook for revenue for the second fiscal quarter ended December 31, 2022, is expected to be $1.34 billion to $1.4 billion, and earnings per share on a non-GAAP basis to be $0.88 to $1 per share. With respect to our expectations on the full year revenue, we expect revenue to range from $5.25 billion to $5.55 billion. Our non-GAAP EPS estimate assumes that the effects of purchase accounting, which are all still preliminary, are added back to GAAP EPS. Other than depreciation, that is about $5 million in Q2.\n\nThe share count is 151 million shares for the entire guidance range. The EPS calculation, including the dividend treatment, is detailed on Table 8 of the press release for the guidance and also shows when the Series B preferred stock is dilutive. All of the foregoing is at today's exchange rate and an estimated tax rate of 23%. For the non-GAAP earnings per share, we add back to the GAAP earnings pre-tax amounts of $183 million to $193 million, consisting of $83 million in amortization; $34 million in stock comp; $20 million to $30 million for transaction, integration, and restructuring; and $46 million for the inventory step-up.\n\nThe actual dollar amount of non-GAAP items, the tax rate, the exchange rates, the purchase price accounting, and the share counts are all subject to change. As a reminder, our answers today may contain forecasts from which our actual results may differ due to a variety of factors, including, but not limited to, changes in mix; customer changes; supply chain shortages, both upstream and downstream; competition; changes in regulations; COVID-19 protocols; and global economic conditions. With that, Kevin, you may open the line for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Ananda Baruah with Loop Capital. Your line is open.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nHey. Good morning, guys. Thank you for taking the question. Yeah, congrats on a nice start here and on what appears to be really solid execution and focus.\n\nTwo quick ones, if I could. You know, Chuck, just to start, what are your thoughts on macro and your thinking as we head into 2023? Does the backlog, which is super substantive right now, does that isolate you? Or I guess, sort of backstop you to an extent? And then, also, what businesses, you know, would you believe could be the most sensitive to macro should companies begin to feel greater pressure in '23? Thanks. And I have a quick follow-up.\n\nChuck Mattera -- Chief Executive Officer\n\nOK. Thanks, Ananda. Thanks for your question and your comments. Well, we have a strong backlog.\n\nThe sales force is busy working to secure an even greater backlog to the extent we can. The macro environment, however it is, is the same for everybody. Our job is to step it up into -- out to what anybody else can do in this market. And as far as the markets go, well, we're diversified.\n\nIt's part of our strategy. We'll never get it to a spot where all markets are all firing at the same level. And so, our job is to work to secure as much as we can while we can and to position ourselves for the future. Because even those markets that are maybe only growing a little slower today, we have great prospects for their future as well, and our portfolio is aiming for it.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nExcellent. And then a follow-up is gross margin was very nicely stronger than at least we had anticipated, and opex dollars were actually nicely lower than we had anticipated. And just so -- and would love context around contributors to the gross margin strength. Do you think it's sustainable? And then, Mary Jane, I guess, the same on the opex dollars.\n\nDid they come in sort of more efficient than you had anticipated? And do you think that's sustainable as well? Thanks, guys.\n\nMary Jane Raymond -- Chief Financial Officer\n\nSo I would say that, first of all, the gross margin, as we talk about every single quarter, is a fight every day. So, not necessarily predictable, but I would say that the company continues to work on that very, very hard. Notwithstanding having $1.34 billion, I'd say, overall, currency probably helped the margin by about $5 million. And I would say, beyond that, we probably had about $8 million help from an expense point of view from currency.\n\nBut having said that, we do get rather busy on the synergies early. And the first thing we do to be sure that we can capture all the synergies is to stop hiring. So, that is one thing that paused as we got to know all of our new colleagues on the -- in the laser segment, and they got to know us. And I will tell you that we will continue to fight on that opex for a long, long time.\n\nBecause at the end of the day, the company's goal under any circumstances, is to be sure that we are able to invest that money well, particularly on the R&D line.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nThanks. Thanks so much, guys.\n\nChuck Mattera -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Paul Silverstein with Cowen. Your line is open.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nThanks. Mary Jane, given the investment clearly is focused on your leverage relative to macro, any thoughts you can share as to how quickly you expect or hope to deleverage and how you get there in terms of capex plans for the year alongside of the interest expense?\n\nMary Jane Raymond -- Chief Financial Officer\n\nSure. Well, obviously, the first thing that we did was the success we had in taking out the convert in stock. So, that took out 345 million of it. You know, historically, what we've said about the pay down of the debt, just let's deal with the pay down for a minute, was that actually we didn't expect that much in the first quarter because the goal in the first quarter was to launch all the synergies first, which sometimes come with cost.\n\nHaving said that, given that the Fed has not necessarily led off on what they think they may do this year and what we thought would be ongoing stability in the interest rates in 2024 actually also may change, that has caused us to give new thought to what we would do potentially this year in bringing down the leverage through paydown as well this year. We're not moving away from what we originally said, which was that was in 24 months, we expect it to be at 2.5 times growth. And I think that plus the EBITDA -- the continued work on the EBITDA, I think, will help us from a deleveraging calculation point of view. But the real issue is trying to moderate and stay within our range, if not lower, on our interest expense.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nOK. And a quick follow-up, if I may. And my apologies, I heard -- Chuck, I heard your response to the previous question. I heard your comments on the call, and I can see the numbers.\n\nSo, it sure doesn't look like there's an issue. But you just had VIAVI last week and Lumentum this week, both referenced some beginning of macro pressure. In VIAVI's case, it was field test units. And what they said was that opex, like, carriers was coming down, and that's always a precursor to capex declines.\n\nAnd then, you had Lumentum reference some pockets of weakness among web scalers. Again, from your numbers and comments, it doesn't seem to be a problem. But I want to ask you the direct question. Are you seeing any signs of concern from a customer market, product market perspective at a macro level?\n\nChuck Mattera -- Chief Executive Officer\n\nYeah. Thanks, Paul. Paul, I'm going to ask Giovanni to take it.\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nPaul, thanks for the question. No, we don't see at all any weakness from that perspective. In fact, we think that we can say at least we have visibility, let's say, until the first half of the calendar year, calendar 2023, very strong demand. And -- but I also want to underline that it is the result of the combination of the strength of the investments of the customers that we have, as well as significant share gains, particularly on the high-speed side of the demand from 200, 400, 800G, where, thanks to the differentiation that we have, we can really take advantage of the need of such type of products.\n\nAnd so, we continue to gain share versus the competition. So, the two are very strong, and they -- we are not seeing any weakness as maybe others have reported.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nI appreciate the response. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Dave Kang with B. Riley. Your line is open.\n\nDave Kang -- B. Riley Financial -- Analyst\n\nThank you. Good morning. My first question is regarding your fiscal 2Q outlook. Just wondering if you can give us a bit more color on your three different segments, how we should think about it.\n\nAnd my follow-up question is regarding your excimer laser. What's the typical lead times for that product?\n\nMary Jane Raymond -- Chief Financial Officer\n\nWe would expect -- on the first question, we would expect good contributions from all three of the segments.\n\nChuck Mattera -- Chief Executive Officer\n\nThanks, Dave, for your question. Mark, would you like to comment on the excimer question?\n\nMark Sobey -- Executive Vice President, Chief Operating Officer\n\nI didn't hear the excimer question. Could you ask one more time, please?\n\nDave Kang -- B. Riley Financial -- Analyst\n\nYeah. Sure. What's the typical lead times?\n\nMark Sobey -- Executive Vice President, Chief Operating Officer\n\nTypical lead times for our annealing systems are around six months.\n\nDave Kang -- B. Riley Financial -- Analyst\n\nYeah. Excimer, yeah, for annealing -- flat panel and annealing.\n\nMark Sobey -- Executive Vice President, Chief Operating Officer\n\nYes. For excimer flat panel annealing, the lead times are typically about six months.\n\nDave Kang -- B. Riley Financial -- Analyst\n\nGot it. Thank you.\n\nChuck Mattera -- Chief Executive Officer\n\nDid you hear that, Dave? OK.\n\nDave Kang -- B. Riley Financial -- Analyst\n\nYes. Yes, I did. Yeah. Thank you.\n\nChuck Mattera -- Chief Executive Officer\n\nGreat. Yeah. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Mark Miller with Benchmark. Your line is open.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nCongratulations on the record sales. You're probably aware of the new U.S. restrictions on equipment shipments into China. I'm just wondering, is there any impact to you on Coherent, especially for [Inaudible] tools that are going into China?\n\nChuck Mattera -- Chief Executive Officer\n\nOK. Good morning, Mark. Giovanni, would you like to take that?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nHey, Mark. Thanks for the question. Absolutely. First of all, as you probably know, there are no UV equipment sales into China.\n\nSo, you know, since that's the vast majority of the market that we address with our parts, we have zero impact from that perspective. Now, if you go on to deep UV and other parts of the semicap equipment world, we have seen less than 5% impact on the short-term demand from our customers. And again, it's mostly because we address the segment of the market for which the restriction has been applied, which is on the high end. And so, the demand continues strong.\n\nAnd in any case, China wasn't in the loop to begin with. So, we haven't really experienced -- short term, at least, we don't see any weakness.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nYou mentioned moderating 3D shipments after a strong quarter in the first half of fiscal '23. How much of that is due to macro? And also, you know, if you could talk about any of your opportunities outside of the consumer electronics market for 3D sensing.\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nYeah. Thanks, Mark. So, first of all, I wanted to make sure it's clear that our numbers were about sensing, which includes 3D sensing. And so, you know, we'll follow the typical seasonal trends and as we said in the prepared remarks.\n\nAnd we have really not seen any effect from a customer demand standpoint from, let's say, weaknesses in some of the geographical areas that -- where products have been assembled and completed. So, demand has been unaffected for us. So, it's very strong. And, you know, so, we haven't really seen any weakness from that standpoint.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nSo, it's mainly just seasonal effects that you're talking about?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nCorrect.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nThank you.\n\nChuck Mattera -- Chief Executive Officer\n\nThank you, Mark.\n\nOperator\n\nOur next question comes from Simon Leopold with Raymond James. Your line is open.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThanks for taking the question. One on the hyperscale trends that you called out, Chuck, in the prepared remarks, you said you expect hyperscale to grow in the second half of fiscal '23. And I guess, to me, I'm wondering whether or not that implies that you saw any softness from hyperscale in your September quarter or what your expectation is implied for your December forecast, whether you're seeing some inventory absorption or slowing from that group of customers near term. And that's what you were trying to point out was you expect that growth to resume in the first half of calendar '23.\n\nAnd then, I've got a quick follow-up for Mary Jane.\n\nChuck Mattera -- Chief Executive Officer\n\nOK. Hey. Good morning, Simon. Thanks.\n\nSimon, what I said was regarding our data center customers, we continue to forecast hyperscale growth in the second half of this year. To answer your question and maybe put a finer point on it, we expect our datacom business to grow sequentially and steadily in the year. Does that help you?\n\nSimon Leopold -- Raymond James -- Analyst\n\nYeah. I guess what I'm sort of wondering, and I'm not trying to split hairs, but whether or not you saw a little bit of softness. Clearly, your numbers were fine this quarter, the guidance is good, but whether or not that particular group of customers was softer than you expected in your September quarter?\n\nChuck Mattera -- Chief Executive Officer\n\nIt was not. But, Giovanni, do you want to add to that?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nSo, while some hyperscalers may have redistributed the demand over time and maybe some has shown some weakness or at least decide to slow down, the mix of customers that we have actually is not affected by that at all. So, we don't really see that weakness. And as I said earlier, the fact that we continue to gain share of the high-speed side of the market helps our growth in general, right? So, it's a combination of factors. The mix of customers, none of those that again -- have redistributed the demand over a longer period of time and then the fact that we're getting share.\n\nSo, the combination of the two ultimately is pretty good outlook for us.\n\nSimon Leopold -- Raymond James -- Analyst\n\nGreat. No, I appreciate that. And then just a quick follow-up for Mary Jane was you called out the $0.07 benefit from foreign exchange rates. And I want to make sure I understand that that's basically internationally located employees being paid in local currency, and therefore, it translates back to a fewer dollars.\n\nAnd if that's correct, if we assume currency stayed stable in the December quarter, you'll see a similar benefit, and that's what's implied in your December guidance. Is that correct?\n\nMary Jane Raymond -- Chief Financial Officer\n\nIt depends how you -- what you're comparing it to. If you compare it to Q1, it's because it's like Q1, if you compare it to last year, or something else, yes. But we are assuming that the currencies stay in the relative relationship that they have at this time and were prevailing in Q1.\n\nSimon Leopold -- Raymond James -- Analyst\n\nOK. Great. Thanks for taking my questions.\n\nChuck Mattera -- Chief Executive Officer\n\nThanks, Simon.\n\nOperator\n\nOur next question comes from James Ricchiuti with Needham. Your line is open.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nOK. Thank you. So, thanks for the color, by the way, on the export -- U.S. export restrictions.\n\nI wanted to ask a question also about the laser business. If we think about some of the forecasts for the WFE market and the expectations that the market could be down anywhere from -- in excess of 20% next year, in calendar '23, I'm wondering how you're viewing that part of the laser business. Or do you just see more of an offset in the display-related portion of the laser business that's capital equipment?\n\nChuck Mattera -- Chief Executive Officer\n\nThank you, Jim. Mark?\n\nMark Sobey -- Executive Vice President, Chief Operating Officer\n\nJim, thanks for the question. So, two parts to the answer, perhaps, Jim. Certainly, to quote one of our customers, the impact on China is non-zero. But as Giovanni indicated, it's probably, you know, less than 5% of our semi business; and the laser segment, less than 2% of our overall business in the laser segment.\n\nWe're buffered by a large installed base, which really helps. We've thousands of ultraviolet lasers that have -- need to be refurbished every two to three years. Some have been in service for more than 20 years with our customers asking us to commit to support for another 10. And that service revenue underpins our strong baseline business kind of irrespective of just, you know, annual WFE spend.\n\nSo, certainly, you know, the outlook for next year is tempered relative to what we've seen this year. But clearly, I think we all believe the long-term trend is very positive.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nAnd then, if I could, just a follow-up question. I certainly -- I could appreciate, given the diversity of the portfolio, you have some insulation here. But I'm just wondering what you're seeing in -- across the industrial business by geography in terms of China, Europe, North America, and just given in light of the macro concerns that people have expressed.\n\nMark Sobey -- Executive Vice President, Chief Operating Officer\n\nThat's another good question, Jim. I think we have, you know, a diversity of products and services that we sell into the industrial markets. We certainly have, you know, the benefit of a very strong backlog. We've -- we're -- in some markets, for example, medical device manufacturing, we're No.\n\n1. In other markets, we're maybe No. 2 and 3. We think we've got lots of share upside in industrial.\n\nSo, we're beginning to see maybe the first softening in some of the European customer base. But again, we've got the benefit of a very healthy backlog. And again, our diversity of markets in the industrial sector, I think really -- you know, I think gives us confidence that we're looking at a pretty strong outlook for the year.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nGot it. Thanks. Congratulations on a nice start, by the way.\n\nMark Sobey -- Executive Vice President, Chief Operating Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Samik Chatterjee with J.P. Morgan. Your line is open.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nYup. Thank you. Thanks for taking my questions. I guess for the first one, if I could sort of get some help on understanding the revenue guide for the full year here.\n\nAll your comments have indicated that demand is remaining robust, maybe some pockets of weakness here and there, but largely sort of a strong backlog, strong demand. And I'm trying to think about the sort of guidance for revenue to remain sort of flat half over half at the midpoint and particularly any insights on sort of what you're seeing in book-to-bill, etc., to give us some sense of what's driving the revenue guide. Because I believe -- I mean we've been more used to seeing the company ramp through the year in terms of revenue. And I have a follow-up.\n\nThank you.\n\nMary Jane Raymond -- Chief Financial Officer\n\nThanks, Samik. Compared to the combined pro forma revenue, I think we will see growth. But at the end of the day, the main thing that we're also trying to keep in mind is the effects of currency on that revenue, right? So, just in the first quarter, we had 16% currency effects on the revenue. So, that's part of it.\n\nIf you just multiply that by four, not that that may be exactly how it goes, but it's $60 million or $70 million. But generally speaking, I'd say that when we look at the combined number for the company compared to where the pro forma was, we're expecting to see some decent growth as the year goes on, as Chuck already said.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nOK. So, let me move to the second question. In terms of the operating margins, your networking margins improved significantly sequentially with sort of limited change in the revenue profile, whereas it was interesting with your compound semi margins sort of remained similar sequentially even despite a significant move-up in revenue. So, I'm just wondering if you can help me understand that.\n\nWhy not more of a volume leverage sort of in compound semi versus networking, which seem to have a much more material improvement in margins? Thank you.\n\nMary Jane Raymond -- Chief Financial Officer\n\nSo, I would have said -- well, first of all, a couple of things. In the networking business, they had a very, very strong mix in the transceiver business this quarter. They have also continued to work hard on moderating what their supply chain challenges have been, both in terms of physical product and the costs that are involved in that. And more importantly, on their operating efficiency.\n\nI mean it continues to be a goal for us to moderate the cost of operations. I would say probably the other thing that helped them in fairness is that because the RMB was weak. It probably translated there. It's not probably.\n\nIt did translate their cost to a lower level. So, there's probably a currency effect on that to some extent, which is a lesser of an extent in materials. Materials generally has around the world, almost all of its sales and dollars in a significant part of their cost in dollars. So, that's one aspect of that.\n\nBut second of all, materials also had a very, very good quarter in the fourth quarter as well. And generally speaking, I would say that overall, you know, my original range on materials was that it would be 23 to 25 in terms of its resting margin. So, we're happy to see it at 26 and 27. But I don't know given their mix at this particular time that it actually grows by, you know, say, 100 or 150 basis points every quarter.\n\nAnd they had significantly less on currency.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Vivek Arya with Bank of America. Your line is open.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my question. For my first one, I'm curious, what is the implied range of gross margins, Mary Jane, for Q2 and for the fiscal year? And what about Coherent products makes it tougher to, you know, get a tighter gross margin range? Is it just the mix? Is it the variability between products? Is it just, you know, pricing competition? So just any views on gross margins would be very helpful.\n\nMary Jane Raymond -- Chief Financial Officer\n\nThe company doesn't guide on gross margins. But I would say that, you know, as we've said consistently, our goal is to try and keep that margin over 40. And we will continue to do that. And, Vivek, just tell me again, what was your question on the laser's margin?\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nSorry, just overall gross margins for Q2 and for the full year. So, let's say if the mix you think -- if the mix you're planning for Q2 comes through and the mix you're planning for the full year comes through, what is the range of gross margins that -- so, for example, if we take the midpoint of your full year range, can gross margins, you know, be over 40%?\n\nMary Jane Raymond -- Chief Financial Officer\n\nWell, the company hasn't changed its range from 38 to 42, just for a whole number of reasons, not to mention the COVID issues that we're still seeing, particularly in Fuzhou. But I would say, if you took the midpoint of that, it would be 40%. But I -- we do not guide on gross margin. So, that's the answer to the first part of the question.\n\nWhat is the laser question you were asking?\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nNo. Not the laser question. I was just saying that what about the company's mix makes it tougher to get a tighter range of gross margins?\n\nMary Jane Raymond -- Chief Financial Officer\n\nWell, I think at this point, we are still really learning, first of all, the laser products, which nonetheless are very good margins. There's no question about that. And given that the company saw some pretty nice margin improvement just between Q4 on a pro forma basis 2Q, one, together, I think we will continue to work with the laser segment to ensure we understand that and potentially take that margin up. That's the first thing.\n\nThe second thing is there was an awful lot of changes in the macro factors with respect to networking that our team worked very, very well through this quarter. But at least, when we think about it, we know that that could still recur. And then, finally, on the material side, the materials team also continuing to see some of the effects of supply chain shortages. And on the industrial part of their business, the first quarter during this quarter is normally their lowest seasonal quarter in the year.\n\nSo, over time, I think we will work on tightening or raising that gross margin range. But at the end of the day, the company does not guide on gross margin.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nAnd for my follow-up on silicon carbide, how should we think about the contribution to sales and the required capex requirements for this fiscal year? And in general, the strategy around silicon carbide, you know, you have just one large player who is spending billions in capex to stay as a leader on the substrate side. And then you have a number of customers who plan to in-source capacity. So, just kind of a near-term question on the sales and the capex for silicon carbide in fiscal '23. And then the longer term, question on the strategy as to how you differentiate between these two extremes, right, from a competitive perspective in the market.\n\nThank you.\n\nMary Jane Raymond -- Chief Financial Officer\n\nRight. So, first of all, we said that with respect to the investments that we're making, we would expect in the sort of '25, '26 period that the company would probably have start to see as a percentage of silicon carbide as a percentage of revenue moving into the 8% or 10% place from where it is today as we continue to make progress on the devices. With respect to the capital investment that we're making, you know, during the entire last 10 years, we've probably doubled the capex -- excuse me, doubled the capacity of silicon carbide every 18 months as opposed to some other competitors who actually had a pause in the middle of that period of time. But nonetheless, we do expect to spend roughly over $1 billion over the next 10 years, the majority of which will be in the first five and the majority of which will be capex.\n\nHaving said that, the company continues to look at as it gets larger how it thinks about manufacturing things, including, not speaking about just silicon carbide specifically, but in general, whether or not it could be advantageous to the company's growth, to have partners in certain areas of the manufacturing. And silicon carbide would be an area where we do think about that, but we think about it for everything at this point. As the company gets larger, it may not make sense to have absolutely everything fully vertically integrated. Chuck, what would you like to add?\n\nChuck Mattera -- Chief Executive Officer\n\nWell, let's ask Vivek. Do you have any follow-up question, Vivek?\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nNo, just that one, Chuck. Just the overall strategy as to is there room in the market for Coherent just given, you know, the one really large substrate player and then the desire of many of your customers to in-source that capacity over time. So, what -- where is that window for Coherent to become sustainably profitable in this business?\n\nChuck Mattera -- Chief Executive Officer\n\nWell, OK. Vivek, let's come back to the capital, too. I would say about a third of our capital this year is going to go into this business. We're going to compete on the basis of the competencies that we have, including the quality, the technology, and the scale that we have and we're putting in place.\n\nWe're introducing new platforms on the basis of market opportunities that we clearly have in front of us. And we believe that we can have a strong, profitable, growing, differentiated business just in materials. But in addition to that, we continue to invest and making very, very good progress, both on devices and on modules. The game is going to inflect and unfold here in this decade in the next few years.\n\nAnd I believe that we're already well positioned, and we're going to continue to establish the front that we need to and the base that we need to, to grow from that. I have very much confidence in our ability to do that, and we're well underway. Let me just make one other comment. This market is going to be so big.\n\nI simply -- you know, we can't see that we'll -- there's not enough capacity in the market today. And there's going to be no one player that can serve this entire market. No one's going to build a whole industry on one player. And we intend to be one of the leaders that not only have already emerged but are sustainably in the pack, OK?\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Sidney Ho with Deutsche Bank. Your line is open.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nThanks for taking my question. My first question is on the -- your semicap exposure. I think, organically, from the old II-VI, the extrusion was only 5%. But I think the Coherent, the legacy Coherent, is more like 45%.\n\nNow, it's all part of this industrial market that you guys disclosed. But if you look at that in totality, we used to think your organic II-VI is mostly tied to UV system produced. But how should we think about the drivers of this segment for the entire company? How much is tied to -- what is the type equipment spending or certain segments of that? And how much is tied to back-end packaging and maybe on the display side?\n\nChuck Mattera -- Chief Executive Officer\n\nOK. Thanks, Sidney. Sidney, I think what we'll do is -- let's let Mark and Giovanni both give some color on the semicap businesses in their segments.\n\nMark Sobey -- Executive Vice President, Chief Operating Officer\n\nHey, Sidney. Thanks for the question. So, specific to the laser segment, semicap revenue for us accounts for between 15% to 20% of our overall lasers revenue. The areas that we predominantly play in, as you know, are ultraviolet laser-based inspection for reticles and bare wafer and patterned wafer, as well as infrared lasers for junction annealing.\n\nSo, those are our main markets specific to the semicap industry. And as I reaffirm, it's between 15% and 20%. I would say it's growing probably at the higher end of that range. But I think an earlier number you quoted was substantially higher.\n\nI'm not completely clear if that was addressed at the laser segment or your prior experience with Coherent, Inc. before. But it's definitely less than 20%.\n\nChuck Mattera -- Chief Executive Officer\n\nThanks, Mark. Giovanni, would you like to add --\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nHey, Sidney. Thanks for the question. As I said earlier, again, we have the benefit of -- on the materials segment to address the high end of the market in terms of the note, if you like. And so, we're really seeing no slowdown.\n\nIn fact, if anything, we continue to invest to support the capacity needed to address the demand that we see. So, it's been really exciting for us to address these high-end applications because there are high margins. We are differentiated. We mentioned many times in the past that we have several sort store parts in some of these tools.\n\nAnd so, we really see, you know, the benefit of years as years of investment having gained this kind of leading position in supplying, you know, our immersion tables, wafer trucks, mirrors, all kind of components that go with these -- for both front-end and back-end tools for the semicap customers.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nOK. That's helpful. Thanks. My follow-up question and maybe one for Mary Jane, can you help us to think how we should look at quarterly expenses -- operating expenses over the next few quarters, including the impact of all the synergies that you're getting from the deal? Maybe just using the baseline of, I think, $256 million in Q1, how do you think it will end up by the end of the fiscal year? Thank you.\n\nMary Jane Raymond -- Chief Financial Officer\n\nFirst of all, I would say that generally speaking, we are likely to see about $65 million achieved on an annualized basis during the first year on synergies. That does not mean that you take 256 and drop it by 65. On an annualized basis, I would say we would probably be able to maintain this year. You know, It may go down slightly from a round of 19.\n\nBut given that our target had been 20 to 23, even being at 19, we're down a little bit. Though, as I said, currency helped us a bit. But I would expect that, you know, the goal, for example, in SG&A is to moderate the absolute dollar amount as we go forward from the combined company, moderate any growth. So, that's one element of synergy.\n\nOn the engineering side, I do think the company will still strive to look at having its engineering at about the 9% of sales level. From the pro forma company, if we just look at fiscal year '22, it was about 10.4%. So, if that stays at about 9% or 9.5%, you would see that coming down. Whether or not all that's achieved during fiscal year '23, I can't really say.\n\nBut generally, the delivery of the synergies across the 250 was expected to be something like 65, 90, and then the balance in the third year. The reason there's more in the third year is because to the extent that we look at, say, two leases in the same area where one comes off the lease is moving things to maybe to a common space, say, one company has a larger site in the same city, that just takes longer. So, those are the types of things that we tend to have, as well as the renegotiation of long-term contracts.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Richard Shannon with Craig-Hallum. Your line is open.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nThanks, guys, for taking my question. I think my first one is on the fiscal '23 sales guidance with the ranges there. Chuck, maybe if you can talk about what would lead you to get to either the low end or the high end and, specifically, if you can address any specific dynamics by segment or any timing issues. Or is it just a matter of kind of macro dynamics here as you get to the edge of that guidance?\n\nChuck Mattera -- Chief Executive Officer\n\nWe started that this year in this quarter. We haven't stepped out into this maybe in six or seven years, given this kind of long-range guidance even on the revenue. And we've done it because we have this diversified business, and we have really good visibility, we believe. The biggest single uncertainty that's in -- that we're looking down into is the supply chain.\n\nAnd, you know, after that, COVID is right behind it in China. And nobody knows how that's going to play out. It's still a long time to go to the fourth quarter. I think it's a very, very solid view that we have today about what we're going to go and aspire to do.\n\nOf course, we need to have orders and order coverage all the way till the end. We're working on that. And the supply chain and COVID, those will be -- is a little bit out of our control. COVID, for sure.\n\nIn supply chain, we're doing everything we can to mitigate it. Those would be the two, OK?\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nOK. That's helpful, Chuck. And my follow-on question is just on backlog here. It kind of relates to some of the dynamics you just mentioned here.\n\nBut how are you expecting kind of corporatewide lead times to trend over the next couple of quarters? Obviously, lead times pretty much everyone in hardware technology have expanded here. Supply chain is a little bit of an issue. But do you see the lead times coming down? And what, if any, impact do you see that having on backlog?\n\nChuck Mattera -- Chief Executive Officer\n\nWell, we're not expecting or forecasting a substantial change in the lead times. And we -- our plans are based on what we have in front of us as far as that goes. We're constantly working to improve our own lead times and our overall ability to manage carefully any changes in the inventory for a good part of that. That's the best I can say.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nOK. Great. Thank you.\n\nChuck Mattera -- Chief Executive Officer\n\nSure. Thank you.\n\nOperator\n\nOur next question comes from Tim Savageaux with Northland Capital Markets. Your line is open.\n\nTim Savageaux -- Northland Securities -- Analyst\n\nHey. Thanks for squeezing me in here. And congratulations on the results. On the telecom side, I thought you heard -- I heard you call out some strength or activity in cable TV networking infrastructure early in the call, Chuck, in your prepared comments.\n\nI'd just like to get a little more color on that. And just as a follow-up, you talked about a record quarter in sensing. It seems like that you had a pretty big one a little while ago or a couple of years ago. So, it seems like that may have, you know, as much as doubled sequentially for you.\n\nWhat is the outlook given the seasonality into the December quarter for 3D sensing? And that's it for me.\n\nChuck Mattera -- Chief Executive Officer\n\nOK. Thank you, Tim. Tim, I'm going to ask Giovanni to take both. But as it relates to telecom and MSO or cable TV infrastructure, we think about them in the same -- kind of in the same bucket, different from datacom.\n\nSo, telecom and cable TV infrastructure are related. And with that in mind, let me just add, we are extremely well-positioned in the largest of these cable TV infrastructure customers that we have. And our business is growing, growing very well. And I expect that will continue to do so throughout this year.\n\nGiovanni, would you like to add to that?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nNo. This is good. Maybe I'll talk about the sensing outlook. We said that we're going to experience the typical seasonality that we have experienced in the past.\n\nIt's just delivered by customer buying and ordering patterns. And so, we just follow that. As we've seen, we had strong growth driven by some new applications and new products that we were able to launch together with our customers. And we expect the typical trend that we've seen in the past to slow down in the second half of the fiscal year and then eventually come back again in the first half of the next fiscal year.\n\nIn relative terms, we expect that demand to continue. But these are long-term investments that we have made to enable functionalities that not many companies can enable, many suppliers can enable. So, we feel good about the prospects of this, as I call it, you know, the general sensing market, which does include 3D sensing.\n\nChuck Mattera -- Chief Executive Officer\n\nOK? Please --\n\nOperator\n\nThank you. Our next question comes from Meta Marshall with Morgan Stanley. Your line is open.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks. A couple of just quick questions. Mary Jane, I guess, is it always the policy and integration to kind of stop hiring upfront just as you kind of assess kind of assets in-house? Or is there kind of something different about the environment that may do, you know, want to put in kind of a near-term hiring freeze? And then, on the second piece, you know, you mentioned kind of looking at alternatives on the leverage piece.\n\nJust wondering, is there a minimum cash threshold, or just anything that we should be mindful of as you kind of assess the leverage position?\n\nMary Jane Raymond -- Chief Financial Officer\n\nFirst of all, I would just encourage everyone on the phone not to use phrases like hiring freeze. First of all, it is always our policy to get to know our new colleagues first. As the two companies come together, it changes, what some of our global functions are. It changes what some of our leadership positions are.\n\nWe do have people in a normal course in either company deciding, you know, that they're reaching their retirement age. That's one of the things you get to know just in the normal course, they're reaching retirement age. And we want to make sure that we have opportunities across the board for people to come into roles especially if they might be larger roles. So, we do that every single time.\n\nAgain, no one should be overreacting on anything about a hiring freeze. And frankly, most of my comments are probably more focused on SG&A than they are on R&D as a real important matter. But generally speaking, I think we do spend quite a lot of time in the beginning of our game plan just getting to know both companies. And given the public interaction that was done in the closing of the Coherent -- or the bidding on the Coherent in transaction, I would say both sides, advisors cautioned us to be, perhaps, less engaged, pre-close than we were on previous large acquisitions.\n\nSo, there is a long tail here of getting to know each other. And I think both companies want to make sure they're doing things in concert. So, that also naturally allows us a little bit of a pause as we think about expenses overall. You had a second part, Meta, I think.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nThe leverage piece and just, you know, how we should consider either minimum cash or just kind of considerations on that front.\n\nMary Jane Raymond -- Chief Financial Officer\n\nWell, I think probably it's fair to say that the company probably thinks in terms of just maybe, call it, $500 million of cash to minimum. But generally speaking, we do have the revolver there that is largely undrawn. So, if someone were to -- I don't know, one quarter, it went to 475. I also wouldn't recommend anybody to jump out of window over that.\n\nBut generally speaking, I think, we do want to make sure that we can fund the company. We are looking at the capital budget. And while the paydown of the debt is a very, very important priority for this company, the creation of profitable earnings is the most important priority, is the No. 1 priority because that's advantageous to the cash flow as well.\n\nSo, therefore, the actual first priority is capex. I don't know, to someone else's question earlier, that we would necessarily dramatically moderate capex unless the market, you know, went in a certain direction, and, you know, we felt that was the prudent investment things to do.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Tom O'Malley with Barclays. Your line is open.\n\nTom O'Malley -- Barclays -- Analyst\n\nHey, guys. Thanks for taking my question. Giovanni, the first one is for you. You're mentioning normal seasonality into the December quarter in the sensing business.\n\nCould you just remind us what normal seasonality is?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nWell, normal seasonality means that we'll be higher than the previous quarter, and then it will, you know, come down in the third and fourth fiscal quarter.\n\nTom O'Malley -- Barclays -- Analyst\n\nOK. And then just on the quarter, on the acquired asset, it looked like Coherent came in a bit higher than expectations. Legacy Coherent came in a bit higher than expectations. I was just curious, did you see any change in order patterns from Chinese customers in the quarter? I know it's a very small percentage of your sales that you're saying are impacted by potential bans.\n\nBut did you see any change in ordering patterns there just for this quarter? Thank you.\n\nMark Sobey -- Executive Vice President, Chief Operating Officer\n\nSo, this is Mark. Tom, thanks for the question. So, China represents a pretty small part of our overall, you know, lasers revenue. And we really didn't see any significant change in order patterns at all.\n\nMary Jane Raymond -- Chief Financial Officer\n\nAnd I think we explained to investors on the, say, 6/30 quarter, at times, we got questions that the supply chain was a challenge before Shanghai was shut down or whatever. And I think the team's worked well to kind of get to the revenue that they expected to.\n\nTom O'Malley -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nAnd I'm not showing any further questions at this time. I'd like to turn the call back over to Mary Jane Raymond for closing comments.\n\nMary Jane Raymond -- Chief Financial Officer\n\nThank you very much for joining us today. We look forward to speaking with you as time goes on here through the rest of the quarter, and we'll talk to you again in February. So, thank you so much for joining us, and we hope you have a good day. Bye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMary Jane Raymond -- Chief Financial Officer\n\nChuck Mattera -- Chief Executive Officer\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nDave Kang -- B. Riley Financial -- Analyst\n\nMark Sobey -- Executive Vice President, Chief Operating Officer\n\nMark Miller -- The Benchmark Company -- Analyst\n\nSimon Leopold -- Raymond James -- Analyst\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nTim Savageaux -- Northland Securities -- Analyst\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nTom O'Malley -- Barclays -- Analyst\n\nMore COHR analysis\n\nAll earnings call transcripts"
}