{
  "companyName": "Agenus",
  "companyTicker": "AGEN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/agenus-agen-q2-2022-earnings-call-transcript/",
  "content": "Agenus (AGEN 3.90%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. My name is Abbie, and I will be your conference operator today. At this time, I would like to welcome everyone to the Agenus second quarter 2021 financial results conference call. [Operator instructions] Thank you.\n\nMr. Ethan Lovell, chief of external affairs and communications officer, you may begin your conference.\n\nEthan Lovell -- Chief of External Affairs and Communications Officer\n\nThank you. Good morning, everyone, and welcome to our second quarter earnings results conference call. I'm Ethan Lovell, Agenus' chief external affairs and communications officer, and I have with me today on the call Agenus' chairman and CEO, Garo Armen; and the company's vice president of finance, Christine Klaskin. Also, joining us today is the Agenus' chief medical officer, Dr.\n\nSteven O'Day, who will be available during the Q&A portion of this call. Before I turn the call over to Garo for his prepared remarks, I would like to read our forward-looking statement disclosure. This call will include forward-looking statements, including statements regarding our clinical development, regulatory and commercial plans, and time lines, including time lines for data relief and partnership opportunities. Such statements are subject to risks and uncertainties and speak only as of the date they are made.\n\nAgenus is under no obligation to update any of these forward-looking statements, and we refer you to our SEC filings for more details on these risks. With that, I'd like to turn the call over to Garo Armen. Garo?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nThank you very much, Ethan, and thank you for joining us today. We will concentrate to start on our priority clinical programs which have demonstrated highly exciting activity. We will also provide updates on our earlier-stage programs which we expect to deliver successful outcomes in the cutoff based on the robust research and preclinical data that's been generated so far. Agenus had a successful second quarter capped by groundbreaking presentation at the World Congress on gastrointestinal cancer in Barcelona.\n\nOur late-breaking submission was offered primo place at the conference's opening session. And Dr. El-Khoueiry presented on heavily pretreated MSS colorectal patients who were treated with our novel adaptive/innate immune activator called botensilimab, in combination with our anti-PD-1 antibody, balstilimab. We will call these bot/bal for sure, but this combination delivered 24% overall response rates and 73% disease control rate with a substantial number of these patients showing responses at data cutoff.\n\nNo grade 4 or 5 events were reported, and the combination was generally well tolerated. What makes these responses unique is the fact that these patients had cold tumors, and cold tumors are historically not responsive to immunotherapy. In addition, these patients had tumors which were PD-L1 negative with low tumor mutational burden. Responsive patients included those who had failed prior I-O therapies.\n\nAll of these make the patients treated in our trial highly unlikely to respond to immunotherapy or conventional immunotherapy and certainly not other treatments either. While this trial was not randomized, experts in the field were satisfied with our criteria for selected patients who are heavily pretreated and that were not confounding factors which would subjectively favor outcomes achieved in the study. We observed 24% objective response rates when compared to 1% to 2% responses in similar patients are achieved with current standards of care. This is a clear demonstration of a potentially groundbreaking therapy by the account of the experts in the field.\n\nFor those of you who were unable to attend the conference, we provide the video link to the full presentation on our website. We're also pleased with the enthusiastic response of the ESMO GI leadership and in our subsequent meetings with I-O leaders in the field who regard the outcomes as potentially paradigm changing. This data has translated into significant interest in our upcoming clinical trials with botensilimab, and we have received a substantial number of unsolicited inquiries from leaders in the field to participate in our upcoming CRC melanoma and pancreatic cancer trials. The unique attributes of botensilimab and the unprecedented responses that they achieved in patients with cold tumors has also generated significant interest in future trials of other cold tumor cancers, such as gynecological cancers, gliomas, breast cancer, and pediatric cancers.\n\nWe're currently working with the FDA and other global regulatory agencies to start randomized Phase 2 clinical trials which we hope will begin very shortly. Our strategy is to pursue the expeditious development of approval of our promising pipeline in as many markets geographically as practical. This includes botensilimab as a monotherapy and in combination with balstilimab, zalifrelimab; in combination with balstilimab and others in clinical development. All of our pipeline products have been designed, and this is a very important point to note, to perform in unique ways as combination or monotherapies and all of our programs are designed to address the limitations of current I-O treatments to deliver improved and differentiated patient benefit.\n\nWe do not take a me-too approach in any of our development strategies. With botensilimab, we're very encouraged to see the design performance of this molecule play out in what clinicians described to be the unprecedented clinical benefit in heavily pretreated cold tumor cancers. And this, of course, is beyond the next three cancers that we have defined as our Phase 2 clinical protocols to commence shortly. Botensilimab was designed to deliver multiple functions in a single antibody, T-cell timing, T-cell activation, suppression of regulatory T cells, and avoidance of complement-related toxicities, among others.\n\nAmong the attributes of botensilimab is consistent activity we're seeing across nine solid tumors, including, as we've talked about earlier, gynecological cancer, sarcomas, which have not responded to available I-O treatments. We have several other pipeline candidates that I'd like to enter now for which we employed a similar report. Powered by our sophisticated discovery, antibody engineering, and VISION platforms, we've designed, for example, our CD137 agonist, AGEN2373, to retain or enhance the efficacy first-generation CD37 agonists while avoiding liver toxicity that derail the development of other such collagens. Thus far, we've seen early signals of activity with no liver toxicity in the clinic and are moving to complete our enrollment in a combination study of AGEN2373 and botensilimab in relapsed/refractory melanoma to start.\n\nWe also recently announced that we've begun dosing patients in our Phase 1 study of novel -- our own novel anti-ILT2 antibody. This is 571. AGEN1571 is a potent inhibitor of ILT2, a broadly expressed receptor that suppresses myeloid and lymphoid response and which is believed to contribute to PD-1 and CTLA-4 resistance, that is suppression of myeloid and lymphoid responses. We believe are responsible partly for PD-1 and CTLA-4 resistance.\n\nWe're very optimistic about our AGEN1531 given our competitive positioning is and the encouraging activity over a similar antibody we discovered and licensed to Merck. The Merck antibody contained MK-4830 targets among members of the LIL RB family shown as ILT4. Merck has published data demonstrating strong activity in heavily pretreated patients with solid tumors when combined with anti-PD-1 data, including a 45% response rate in patients who progressed on prior PD-1 therapy alone. Naturally, the question of access to ample resources to make these programs -- to take these programs to the finish line has come up from time to time in both internal and strategic planning and external discussions.\n\nThroughout our company history, we have managed and balanced our ambitions and our ability to tap resources. Tactics we've used included prioritization of key near-term value drivers, building internal capabilities to reduce dependence on outside vendors, including [inaudible] commercial manufacturing of our products, clinical trial management, and execution through our own CROs, and of course, our own internal discovery engine and development. We have balanced the need to properly resource our priorities with prudent efficiency measures and cost cutting. You have seen this in our spending trends from the first quarter of this year to the second quarter of this year.\n\nWe expect these trends to continue. We have also been resourceful with inputs of cash resources. Our largest cash resources over the past half a dozen years have been corporate transactions, which have netted us over $800 million. We've also selectively utilized ATM sales designed to keep dilution through a minimum.\n\nWe expect corporate transactions to continue to be the dominant source of our cash until we have a sustainable cash flow from our products and our revenues from products to finance our operations going forward sustainably. Regarding our partnered antibodies in active development, in addition to the earlier-mentioned Merck-licensed antibody, MK-4830, the list includes our anti-TIGIT bispecific AGEN1777 licensed to Bristol-Myers, along with our four immunotherapies licensed to Incyte. These are all advancing in the clinic. And as these programs successfully progress, they have the potential to trigger milestone payments to Agenus, totaling close to $3 billion, in addition to sales-based royalties for those molecules that reach commercial launch.\n\nIn the past half a dozen years, Agenus has delivered exceptional productivity by advancing 15 antibodies and cell therapies. Biopharmaceutical discovery and development is a high-risk, high-reward endeavor, and we believe we have a powerful set of capabilities when it comes to choosing targets, combinations and design elements for I-O innovation and success. All the molecules in our pipeline were chosen based on their potential for unique advantages in clinical setting. And elements of their design have been carefully tailored with the intention of creating differentiated best or first-in-class molecules and cell therapies.\n\nWe are confident that our current and future partnerships will position the company to fund a substantial portion of our development activities over the coming years and that our discovery, antibody engineering, and VISION platforms will fuel continued innovation and growth of our pipeline. We're excited to enter the third quarter from a place of strength and innovation as we have seen with the remarkable results that have been achieved with botensilimab and balstilimab combination in MSS CRC patients and more to come on hand. The future holds great things for the field of immunotherapy, and Agenus looks forward to contributing to the investment of these life-changing medical development. With all of that, I'll turn the call over to Christine to cover our financials.\n\nChristine?\n\nChristine Klaskin -- Vice President, Finance\n\nThank you, Garo. We ended our second quarter 2022 with a cash and short-term investment balance of $238 million. This compares to $253 million at the end of the first quarter and $307 million at year end. We recognized revenue of $21 million for the second quarter ended June 2022, which represents an increase of $10 million from the $11 million reported for the same period in 2021.\n\nRevenue for the six months ended June 2022 was $47 million, an increase of $25 million from the same period in 2021. Amounts include revenue under our collaboration agreement, in 2022 milestones earned, and revenue related to noncash royalties earned. For the second quarter ended June 2022, our cash used in operations was $43 million compared to $56 million for the same period in 2021. Our net loss for the quarter ended June 2022 was $49 million or $0.17 per share compared to a net loss of $84 million or $0.37 per share for the quarter ended June 2021.\n\nNoncash operating expenses for the second quarter ended June '22 were $19 million compared to $30 million for the second quarter ended of 2021. Our cash used in operations for the six months ended June 2022 was $96 million with a net loss of $100 million or $0.35 per share compared to cash used in operations of $98 million and a net loss for the same period in 2021 of $138 million or $0.65 per share. I'll now turn the call back to Garo to handle our Q&A. Garo?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nThank you very much, Christine, and I think we're ready for any questions that you may have from the field.\n\nOperator\n\n[Operator instructions] Your first question comes from Mayank Mamtani with B. Riley Securities. Your line is now open.\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nGood morning, team. Thanks for taking our questions. So maybe first on the ILT2 program that just ended clinic. Could you just review with us the rationale for combining with both PD-1, as well as your next-gen CDLA-4? And also would love to hear what we already know and should look out for the -- who are in the field with these ILD drugs in the clinic and how those might be evolving going forward for validation of use in a combination setting?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nSure, Mayank. I think if your question is the rationale for combining ILT2 with balstilimab and botensilimab. Is that the question?\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nYes, the first part --\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nOK. So I'm going to ask Dr. O'Day and perhaps even Dhan Chand, who has joined us today for why we have query this in preclinical models and the research rationale and perhaps, Dr. O'Day can elaborate on that one.\n\nDhan Chand -- Scientific Director and Head of Drug Discovery\n\nThank you, Garo. And thank you, Mayank, for the question. So there are a couple of evidence that support the combination of AGEN1571 with both botensilimab and balstilimab. The first is that you will recall from our SITC -- our AACR poster actually earlier this year, demonstrating the high expression of ILT2 and ILT2-positive myeloid cells in patients that did not respond to checkpoint therapy and a checkpoint therapy I'm referring to PD-1 or PD-1 and CTLA-4 combination.\n\nThe second is that we've demonstrated in preclinical disease-relevant models that the combination of PD-1 on AGEN1571 enhances T-cell activation, NK cell activation and NKT activation, and the combination of both botensilimab and AGEN1571 potentiates immune activation. One of the reasons for this is that ILT2 is known to inhibit FcgammaR signaling, which is critical for therapies like botensilimab and AGEN1571 release. And then lastly, when you look at patient samples, particularly tumor-infiltrating lymphocytes, and tumor cells, as shown in our AACR poster, you'll notice that PD-L1 and HLAG the ligand for ILT2 are expressed on different subsets of tumor cells and in cells. Same goes for ILT2 and PD-1.\n\nThis suggests that a combination of balstilimab, botensilimab with AGEN1571 will leverage different arm of the immune system to potentially anti-human unity. I'll turn it over to Steven to add a bit more color on our clinical rationale\n\nSteven O'Day -- Chief Medical Officer\n\nYeah. Thank you, Mayank. And yes, we're very excited about this ILT2 program as potentially best first-in-class. Based on -- Dan said, the preclinical data suggests that we have both a myeloid and lymphoid checkpoint that could be quite synergistic and really build into some of the mechanism of resistance of PD-1 and CTLA-4.\n\nAnd obviously, the ILT4 program that we -- our antibody that Merck is using is obviously advancing in the clinic with objective responses. So there's improving concept in this myeloid class. But we think we have a more broad myeloid lymphoid checkpoint that may answer some of the resistance issues to first-generation checkpoints. So -- and as you know, we dosed the first human patient with our ILT2 several weeks ago.\n\nAnd what's exciting about this program is we will be looking for monotherapy, single-agent activity. But obviously, the program is designed to fold in both anti-ILT2 combinations and botensilimab combination. So we have the flexibility to move forward quickly with combinations, as well as monotherapy. So more to come, but a very exciting program that's now in the clinic after some tremendous preclinical work and drug design.\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nThank you so much for that comprehensive overview. And then just maybe a follow-up, more focused on botensilimab. Could you just give us an update on how far along you are with the melanoma cohort? And how might your progress to date is in forming your thinking for the future development plan, which is looking like you are working toward some sort of a Phase 2 trial starting later this year or next year?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nSo the question is to be answered at an upcoming major conference, that's going to release data not just for the additional patients that have been enrolled and studied in the CRC cohort, but some of the major cohorts as well. So unfortunately, we cannot publicly disclose the specifics, but it will be during the course of this year.\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nGot it. And my final question on financials. Could you just remind us what outstanding nondilutive milestones remain for the remainder of the year? Can you just comment on that or even into early next year?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nYes. So once again, given the sensitivity of this very subject, we will not comment on any specific deal structures or I should say, the numerical relevance of anything such as that. Now as far as any particular milestones, as we've said publicly, and I think we've alluded to this during the course of our press release that we expect this year to receive a total of approximately $25 million from the payment that's due to us as part of the transaction that we consummated with HCR for QH '21. So that will happen during the course of this year, and that's, of course, an undilutive component, but additional partnership discussions and consummation of these discussions to take them to conclusion, we'll wait for more specific deal announcements for that.\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nThank you, Garo, for that helpful overview.\n\nOperator\n\nAnd your next question comes from the line of Matt Phipps with William Blair. Your line is now open.\n\nMatt Phipps -- William Blair -- Analyst\n\nGood morning. Thanks for taking the questions. Just curious when we might get some more details on the design of these impending Phase 2 studies for botensilimab. Can you comment on if the MSS CRC arm will require a monotherapy or arm and maybe any thoughts on comparators for that trial?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nSure. So I think in terms of the specific design of the trials, I mean, as you know, Matt, we have said specifically that we expect to start three randomized Phase 2 trials. Those will commence soon. I think the first cohort of details will be disclosed during the week of ESMO coming up.\n\nMatt Phipps -- William Blair -- Analyst\n\nInteresting. OK, and I guess as far as the expansion cohort coming up later this year, is there any details you can give on maybe how many patients you expect total and advance cohorts that are [inaudible] that update?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nSo the plan is for us to present the -- a number of cohorts of this study at another major conference coming up, which we have not announced yet.\n\nMatt Phipps -- William Blair -- Analyst\n\nOK, great. We look forward to the updates. Thank you.\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nThank you very much, Matt.\n\nOperator\n\n[Operator instructions] Your next question -- my apologies, the question has -- OK. Here we go. Kelly Shi with Jefferies. Your line is now open.\n\nDave Windley -- Jefferies -- Analyst\n\nThank you for taking our questions. This is Dave on for Kelly Shi. And my question is, could you talk about potential impact of ipilimumab plus nivo approval in melanoma on your Phase 2 trial design in melanoma?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nSo I think that O'Day will tackle that question. The question is what is the impact of ipilimumab in the melanoma space with our trial design. Is that the question?\n\nDave Windley -- Jefferies -- Analyst\n\nYeah. So the approval of ipilimumab and nivo, how does it impact your design for melanoma?\n\nSteven O'Day -- Chief Medical Officer\n\nYes. Well, I think that the exhaustion checkpoints like LAG-3 and TIM-3 and obviously PD-1, are obviously very different targets than CTLA-4. So obviously, with first-line melanoma, now there's three frontline options, CTLA-4 with PD-1, PD-1 monotherapy and then PD-1 LAG-3. So we'll be addressing all those cohorts with our design of our botensilimab, which we think is obviously a very unique different checkpoint than the exhaustion checkpoints.\n\nBut we will address it and we look forward to getting data around all those subgroups.\n\nDave Windley -- Jefferies -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nAnd there are no further questions at this time. Mr. Armen, I will turn the call back over to you.\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nThank you very much for your attention and interest in our company. In closing, I'd like to just reiterate the point that with the data disclosure of botensilimab plus balstilimab, we have received many accolades about the robustness of the responses that we've seen. In fact, many of the long-term experts in the field, including certainly CRC experts, have commented on the fact that they have not seen such responses with conventional immunotherapy. So clearly, this is a very exciting period for the next steps of immunotherapy, and we're delighted to have botensilimab lead that effort for the future of these patients and there will be.\n\nSo with that, please stay tuned for additional information that we will be disclosing between now and the end of the year, and that will set the stage for us to be able to do our next set of trials, randomized trials with the hope that we will get to the finish line with the collaboration of many of the experts in the field, as well as regulatory agencies around the world. So I'll end my comments. And if you have any additional questions and queries, please don't hesitate to get in touch with us. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEthan Lovell -- Chief of External Affairs and Communications Officer\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nChristine Klaskin -- Vice President, Finance\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nDhan Chand -- Scientific Director and Head of Drug Discovery\n\nSteven O'Day -- Chief Medical Officer\n\nMatt Phipps -- William Blair -- Analyst\n\nDave Windley -- Jefferies -- Analyst\n\nMore AGEN analysis\n\nAll earnings call transcripts"
}