{
  "companyName": "Toast, Inc.",
  "companyTicker": "TOST",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/toast-inc-tost-q2-2022-earnings-call-transcript/",
  "content": "Toast, Inc. (TOST 0.45%)\nQ2 2022 Earnings Call\nAug 11, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Hannah, and I will be your conference operator today. At this time, I would like to welcome everyone to the Toast's second quarter 2022 earnings call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speakers' remarks, there will be a question-and-answer session. [Operator instructions]. Thank you. I will now turn the call over to Michael Senno, vice resident of investor relations and treasury.\n\nYou may begin your conference.\n\nMichael Senno -- Vice President, Investor Relations and Treasury\n\nThank you, Hannah. Welcome to Toast's earnings conference call for the second quarter ended June 30, 2022. On today's call are CEO, Chris Comparato; and CFO, Elena Gomez, will open with prepared remarks. They will then be joined by our COO, Aman Narang, for our Q&A session.\n\nBefore we start, I'd like to draw your attention to the safe harbor statement included in today's press release. During this call, we'll make statements related to our business that may be considered forward-looking within the meaning of the Securities and the Exchange Act. All statements other than statements of historical facts are forward-looking statements, including those regarding management's expectations of future financial and operational performance and operational expenditures, expected growth and business outlook, including our financial guidance for the third quarter and full year 2022. Forward-looking statements reflect our views only as of today.\n\nAnd except as required by law, we undertake no obligation to update or revise these forward-looking statements. Please refer to the cautionary language in today's press release and our SEC filings for a discussion of the risks and uncertainties that could cause actual results to differ materially from our expectations. During this call, we will discuss certain non-GAAP financial measures. These non-GAAP financial measures are not intended to be a substitute for our GAAP results.\n\nPlease refer to our earnings release and SEC filings for detailed reconciliations of these non-GAAP measures to the most comparable GAAP measures. Unless otherwise stated, all references on this call through cost of revenue, gross profit and gross margin, selling and marketing expense, research and development expense, and general and administrative expense are on a non-GAAP basis. Finally, both the press releases and a replay of this call, including the accompanying investor presentation, will be available on our investor relations website at www.investors.toasttab.com. With that, let me turn the call over to Chris.\n\nChris Comparato -- Chief Executive Officer\n\nThank you, Michael, and good afternoon, everyone. Toast continues to build on our operational momentum in Q2, posting strong efficient growth, exceeding both our revenue and profit expectations, and delivering another record quarter of new location additions. This momentum stems from the consistent execution of our core growth strategy, driving location growth, deepening our ability to serve all segments of the restaurant industry and delivering product innovation for restaurants. On that front, last month, we announced the acquisition of Sling to further expand our team management suite and help restaurants deepen their relationship with employees.\n\nWe're excited to welcome the Sling team to the Toast family. While we have tremendous momentum across our business, we're also cognizant of the current macroeconomic backdrop and what it means for our customers. Restaurants are operating in a challenging environment, facing heightened food cost inflation, labor constraints, higher wages, and uncertainty in this broader economy. But the restaurant industry has faced challenges many times before and proven incredibly resilient over time.\n\nRestaurants adapted and bounced back from unprecedented conditions during COVID and have successfully navigated prior economic downturns. It's a testament to how much people enjoy the restaurant experience. Even in the most challenging times, people love eating out, and restaurants are often at the center of our communities. Turning to our results for the quarter.\n\nRevenue increased 58% year-over-year to $675 million in the second quarter, and ARR was up 59% to $787 million. GPV remains strong, growing 62% year-over-year to $23 billion in Q2. We also continue  to drive on location growth. After adding over 5,000 net new restaurant locations in a quarter for the first time in Q1, we now exceeded 6,000 net new restaurant locations in Q2, just incredible growth that is being driven by our strong bookings pipeline as well as continued low churn.\n\nAs a result of our consistent execution and first half performance, we are raising our full year revenue guidance by 5% at the midpoint of the range, which implies 55% year-over-year growth. Driving toward profitability is a key priority for our team, and the progress is clear in the significant adjusted EBITDA margin improvement in Q2. With the increased focus on efficiency and rigorous prioritization of our investment opportunities, we expect to sustain these improvements, and we're raising our adjusted EBITDA outlook for 2022 by $35 million at the midpoint to reflect that. Elena will provide more detail on our outlook shortly.\n\nWith the restaurant industry in the midst of a generational shift to cloud-based digital solutions, we continue to seamlessly execute our proven go-to-market strategy to capitalize on that opportunity. As we increase density in more established territories, we benefit from the flywheel effect that drives referrals and inbound leads, driving higher and more efficient productivity. At the same time, we're gaining traction in less developed markets and are on a path to replicate that flywheel effect as we gain share. In addition to the strong growth in new locations, customer churn remains low.\n\nOur industry-leading platform adds tremendous value to our customers, helping them grow and creating a passionate and loyal customer base. The success of the Toast restaurants we support lie at the heart of our business model. We grow as our customers grow. In Q2, we continue to see success with all formats and types of restaurants.\n\nI'll highlight a few examples. In enterprise, we expanded our relationship with Jamba Juice by 40 locations, bringing our partnership to more than 700 total locations. As part of the expanded relationship, Jamba is piloting the addition of the Toast kiosk product to streamline checkout and help combat heightened labor costs. Jamba Juice showcases how Toast is designed to increase throughput in high-volume environments like QSR and fast casual and how some of our largest customers continue to adopt more of our platform to increase efficiency and drive growth.\n\nChip Cookies selected Toast in Q2 to support its growing 13-location business. From making it back-of-house more efficient with our payroll, xtraCHEF, and multi-location management products to using our point-of-sale and delivery services to more efficiently serve customers, Chip Cookies saw the value of Toast as an all-in-one solution that could help them grow while managing their business more efficiently. By leveraging more than 10 of our modules, Chip Cookies is a great example of how the benefits to customers increase as they leverage more of our integrated platform. While Chip highlights how new customers are using more of our platform, we also have a significant opportunity to help customers find more ways to leverage the full expense of our platform to create value for their businesses.\n\nOur e-commerce offering, Toast Shop, provides customers an efficient self-service options to seamlessly add products and has been a consistent source of incremental SaaS ARPU. Last year, we also started a growth sales team, solely focused on selling to our existing customers to complement Toast Shop. We continue to invest in and evolve that team, and the second quarter marked the first time the entire growth team with selling our full product set. This enables each of our reps to efficiently partner with customers on ways to utilize the full breadth of our platform.\n\nA good example of the benefit of our growth team that -- a good example of the benefit our growth teams can bring customers is Maize Mexican Grill, a fast casual restaurant group. Maize initially inquired about adding our loyalty product across its locations. Our growth team worked with the customer to highlight the benefits of our full platform, which led to them adopting several of our guest products as well as payroll and xtraCHEF. This showcases the power of having a team focused on upsell and reps equipped to help customers take advantage of the full power of our integrated platform.\n\nWhile we are pleased with the initial results, we're still early on in this area. We see a big opportunity to drive broader adoption of our platform among existing customers. One of Toast's key differentiators is our focus on restaurants and our ability to deeply serve different customer segments regardless of size or format. Earlier this year, we announced Toast for hotel restaurants, a powerful new solution designed to meet the needs of hotel restaurant operators by seamlessly integrating leading hotel property management system with the Toast platform.\n\nAs a result of that new capability, in Q2, we signed a regional hotel chain for its full-service restaurant concept across over 10 locations. This hotel chain will use our handheld point-of-sale for table-side order and pay, our kitchen display systems to expedite orders and our multi-location management to efficiently manage menus. This is evidence of the opportunity we have to go much deeper in the hotel restaurant segment with our new offering.  Shifting to products. As we continue to enable our customers to deeply connect with all of their stakeholders, I want to focus on the critical employee touch point.\n\nIn the midst of an extremely challenging labor market, winning the hearts and minds of employees is more important than ever. Last month, we announced the acquisition of Sling, a leading employee scheduling and communications solution. Innovated scheduling and communications into our platform alongside our other team management products, including payroll, tips manager, and PayCard, will help restaurants deepen their relationship with employees, more efficiently manage labor and create a differentiated employee experience. Employee communications and scheduling is a high-engagement product, and it's also an important new touch point for Toast, with more than 11 million restaurant workers in the U.S.\n\nSimilar to our prior acquisitions, our relationship with Sling started as a partnership, which launched early last year. The strong customer signal informed our view on how the product can enhance our entire team management suite. After incorporating Sling into our sales motion, our win rate was higher when customers evaluated Sling and payroll together compared to when only quoting payroll. This offers early proof of how Sling complements our existing team management suite and can enhance overall value proposition to our customers.\n\nWith Sling as part of the Toast family, we plan to fully integrate the offering into our platform to provide customers a seamless experience. The acquisition also allows us to accelerate product development in alignment with the road map for our team management suite and continue to build features specifically targeted for our restaurant customers and their employees. Sling makes our team management suite more robust and is another example of how, with our cloud-based platform, purpose built to meet the specific needs of restaurants, no partner is better positioned to help the industry adapt and thrive than Toast. While restaurant industry sales have fully bounced back from COVID and are above 2019 levels, as I noted earlier, restaurants are facing challenges.\n\nLabor and food are two -- are the two biggest expenses for restaurants, and the current environment has amplified the pressure on both. Inflation is at a multi-decade high, and the restaurant workforce is still about 6% below pre-pandemic levels, creating staff and constraints. But our platform is built to help restaurants navigate these challenges. We provide restaurants with an array of products to automate processes and increase efficiency across their workflows so they can focus on what matters the most, the food, their guests, and their employees.\n\nxtraCHEF not only automates manual invoice processing and inventory management, it also provides restaurant managers with real-time data on food cost trends to inform decisions on menu pricing and sourcing to help preserve profitability. With the help of xtraCHEF, [Inaudible] Valley Hospitality Group in Texas was able to reduce costs by 3% on average across their locations, saving over $330,000 per year. This is an invaluable tool with food costs rising at historic levels, and we are seeing adoption of xtraCHEF increase as restaurants seek to optimize margins. Products like our Toast Go handheld, kiosks, and mobile order and pay allows savvy operators to better manage labor expenses and employees to handle more orders per hour, leading to higher tests  while also providing a better guest experience.\n\nMore QSR and fast casual restaurants are rolling out these digital touch points for guests to overcome staffing shortages while meeting evolving customer preferences. And Toast is well positioned to lead that transition. For example, New England Lobster Market & Eatery, a fast casual restaurant, is using our mobile order and pay solution for the majority of its on-premise transactions. In addition to requiring less staff, tips have more than doubled and are automatically split among employees, helping the restaurant significantly reduce turnover without incremental wage pressure.\n\nIn summary, the Toast platform is more relevant and valuable than ever to our customers as they navigate these changing conditions. As customers use more of our platform, they can drive efficiency across their business to mitigate costs while continuing to offer a great guest experience. Simply put, our goal is to get restaurants all the tools they need to adapt and thrive. Restaurants deserve a trusted partner who shares their vision for a future where the restaurant in the entire industry thrives, and their businesses flourish, a partner who helps restaurants spend more time delighting customers and less time confused by technology, a partner who will advocate for the industry, and Toast is that partner.\n\nIn closing, I want to thank our employees for a great first half of the year. I'm proud of how we're executing and our team's tireless effort to add value for our customers. Now I'll turn the call over to Elena.\n\nElena Gomez -- Chief Financial Officer\n\nThanks, Chris, and thank you, everyone, for joining. And a big thank you to the Toast team. All your hard work and dedication to serving our customers led to another quarter of great results. Both revenue and adjusted EBITDA came in ahead of expectations in Q2.\n\nThe power of our integrated software and payments model, together with our industry-leading platform, continue to drive strong top line growth. And our commitment to cost discipline was evident in our significant adjusted EBITDA margin improvement. Not only are we proud of the strong results this quarter, we're also excited to welcome the Sling team to Toast. As Chris mentioned, Sling strengthens our team management product suite and will serve to further differentiate our platform as we focus on being the technology backbone for the restaurant industry.\n\nOur proven go-to-market strategy investments to scale the sales team continues to pay off. Net new location adds further accelerated in Q2 to over 6,000, increasing the number of total live locations on our platform to approximately 68,000. The continued market share gains highlight the tremendous value our platform provides restaurants, which also contributes to our consistently low churn rate. It's worth noting that Q2 is seasonally our strongest quarter for net location adds.\n\nSummer is the peak season for restaurants. And with some less likely to switch platforms during their busiest period, we typically add fewer new locations in Q3 than in Q2. We've seen the seasonal pattern in our business over several years and expect the same this year. That said, our pipeline remains strong.\n\nThe value proposition is clearly resonating, and we are well positioned to sustain our momentum. Turning to our quarterly results. Total revenue grew 58% year-over-year to $675 million. ARR, which is our core operational metric, ended at -- ended Q2 at $787 million, up 59% year-over-year and 24% compared to Q1.\n\nTotal ARPU eclipsed 11,000 for the first time driven by strong growth in both our recurring revenue stream, SaaS, and payments. Subscription services revenue increased 100% year-over-year in the second quarter, benefiting from our location growth and increased product adoption as both new and existing customers leverage more of our platform. As of the end of Q2, 61% of our Toast locations use four or more products on top of our integrated POS and payment solution, but even a higher percentage of new live customers join the platform with four or more products. As a result, SaaS ARPU continues to increase for each new quarterly cohort of live customers and is above the average for our platform.\n\nAs we think about our long-term ARPU potential, we also believe upsell will be a big contributor. As Chris mentioned, our Toast shop e-commerce store has been an efficient channel for existing customers to add products. With our gross sales team now complementing the e-commerce solution and all those reps selling our full array of products, we have an opportunity to drive deeper adoption of our products like xtraCHEF and payroll and help customers leverage more of our integrated platform to create value for their business. Total upsell across Toast shop and our growth sales team contributed over 20% of the incremental SaaS ARR in Q2, and we see a big opportunity to unlock incremental ARPU growth over time.\n\nOn the fintech solutions side, revenue grew 59% to $562 million, and gross profit was up 54% year-over-year to $114 million in the quarter. As a reminder, SaaS revenue and fintech gross profit comprise what we operationally view as recurring revenue. Fintech gross profit benefited from sustained strength in GPV, which increased 62% to $23 billion in Q2. Average annualized GPV per processing location was up 16% year-over-year to $1.4 million.\n\nThe growth in GPV per processing location is a result of both higher average ticket and the continued rebound in customer transaction, which was slightly below 2019 levels in Q2. The net take rate of 49 basis points was within the range we expect in the near term. Debit mix declined quarter-over-quarter, in line with typical seasonal patterns, partly offset by the benefit of our continued cost optimization efforts. Total gross profit grew 33% year-over-year and 24% quarter-over-quarter to $125 million, resulting in gross margin of 18.5%.\n\nLooking at our recurring stream, subscription and fintech gross profit totaled $169 million, up 67% year-over-year, driven by our continued location growth and strong ARPU increases across both SaaS and fintech solutions. Looking at customer acquisition costs. We continue to tightly manage unit economics to maintain healthy payback periods even as we navigate headwinds on the hardware side and invest to scale the business. As we noted last quarter,  hardware margin declined quarter-over-quarter.\n\nWe expect hardware margins to improve in the second half of the year as we benefit from the shift to lower cost shipping methods. Our decision to strategically increase inventory not only drives cost savings on shipping, but also insulates us from short-term supply chain disruptions, allowing us to continue to seamlessly serve our customers. Before discussing our other cost lines, I want to provide context on the pace of our overall operating expense growth. Over the past year, we accelerated hiring across the business to rebuild our teams following the staff reductions in early 2020 to sustain our momentum as the business rapidly scales and to position Toast to capitalize on this large opportunity ahead.\n\nWe're now largely past that ramp in hiring. With what's reflected in our updated outlook for the rest of 2022, we believe our cost structure will align with the scale and growth trajectory of the business. That positions us to continue to invest in key growth areas to sustain top line momentum while further improving profitability going forward. Sales and marketing expense declined as a percentage of recurring revenue in Q2.\n\nThe initial benefit from scaling our sales team is already evident in the strong location and ARPU growth. Last quarter, we discussed how our go-to-market strategy creates a flywheel effect. As we increased market share in a territory, inbound traffic and referrals grow and our sales reps deliver higher productivity. We expect that to be a tailwind going forward, particularly as we gain traction in the less penetrated territories that we're investing into.\n\nIn addition, our sales reps naturally become more productive as they gain experience. By ramping hiring over the past year, the average tenure of our sales force has naturally declined. With our sales rep base closer to our target level, we plan to increase the team at a more steady state and expect our average tenure to increase, which historically led to increased productivity. We expect both of these dynamics to contribute to increased efficiency in sales and marketing expenses over time.\n\nResearch and development is another area where we accelerated investment over the past year. This includes continuing to develop and broaden our platform and scaling the team to support the incredible growth we've experienced over the past two years. We now have more than doubled the number of locations on our platform than the onset of COVID, and our ambitions have grown significantly. We're investing to build platform scalability and stability in order to support hundreds of thousands of restaurants over the coming years.\n\nProduct innovation also remains core to our growth strategy. Our strong ARPU growth gives us conviction on the ROI of our product investments. And we still have a huge opportunity to add more products that restaurants want and provide features and functionality that will enable us to both broaden and more deeply penetrate our TAM. In the first half of 2022, approximately 20% of our R&D spend went toward products and initiatives that represent less than 5% of our ARR today.\n\nWe expect these areas to become important drivers over the next few years. That investment is skewed toward products where we've already seen initial traction like our team management suite, notably payroll. A smaller portion is allocated to initiatives that we expect to be meaningful drivers in the medium term. We're committed to maintaining a balanced R&D profile, investing to drive continued innovation in our core products and to scale our platform while allocating capital to emerging areas that we have high conviction can increase our ARPU potential and expand our market opportunity.\n\nMoving down the P&L. The year-over-year growth in general and administrative expenses continue to be primarily related to public company-related expenses. The growth in G&A should decline to a more steady-state level in Q4 as we fully lap the initial step-up from late last year. We intend to remain disciplined in managing overhead and expect to deliver operating leverage in G&A starting in 2023.\n\nTotal Q2 adjusted EBITDA was negative $33 million, well ahead of our guidance, and margins improved 350 basis points quarter-over-quarter to negative 4.9%. Our increased focus on efficiency and cost discipline contributed to the beat. Additionally, with GPV seasonally higher, we typically see greater quarter-over-quarter margin improvement in Q2, and that was amplified with GPV exceeding expectations. Now turning to guidance.\n\nFor the third quarter, we expect revenue to be in the range of $700 million to $730 million, which represents 47% year-over-year growth at the midpoint, with adjusted EBITDA expected to be in the range of negative $40 million to negative $30 million. Following our strong first half of the year, we are increasing our revenue expectations for the full year by 5% at the midpoint. We now expect full year revenue to be in the range of $2.62 billion to $2.66 billion, a 55% year-over-year increase at the midpoint. We are also raising our adjusted EBITDA guidance range to negative $160 million to negative $140 million for 2022.\n\nThis includes the integration of Sling, which is a modest drag on EBITDA. The midpoint of our updated range is a $70 million and 360 basis point margin improvement compared to the initial '22 guidance we gave in February. In addition to our strong execution and continued top line momentum, the improvement reflects our increased cost discipline and current pace of hiring as we focus on delivering durable efficient growth. Our current outlook puts us on track for a 130 basis point margin improvement in the second half of the year compared to the first while continuing to make targeted investments in key growth areas to position Toast for a sustained location and ARPU growth for years to come.\n\nImproving profitability is a top priority across the company. Our results and our improved outlook are indicative of our focus on efficiency and cost discipline. These efforts will enable us to drive toward profitability faster. As we look ahead, while our business remains healthy into Q3, we recognize the economic outlook in the U.S.\n\nis mixed. Given that, we have been measured in our guidance for the rest of the year to factor in that uncertainty and the potential for slower consumer trends. Overall, we've made great progress on positioning our cost structure for the scale and growth profile of our business, which will enable us to deliver operating leverage and move even faster on growth opportunities to sustain top line momentum. It also gives us the flexibility to adapt quickly to any change in the business or macro environment.\n\nLooking back at the first half. While we are very pleased with our performance, we're still early -- in the early innings, with only 1% penetration of this massive $55 billion market opportunity. We remain focused on our goal to serve as the technology backbone for the restaurant industry, continually bolstering our platform with more products and features to add value for our customers and to help them outperform their competitors. And we're confident that continuing to execute on our mission will drive sustained location and ARPU growth and create significant long-term shareholder value.\n\nNow I'll turn the call back over to the operator to start our Q&A session.\n\nOperator\n\n[Operator instructions]. The first question is from the line of Will Nance with Goldman Sachs. Please proceed.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nHey, guys. Good afternoon. Nice results today. I wanted to ask on some of the comments that you made around operating leverage starting in next year as well as a lot of the progress that you've made year-to-date in controlling costs and, obviously, raising the EBITDA margin expectations for the year.\n\nI don't think you guys have given a long-term profitability target, but I think last quarter, you guys talked about kind of getting the cash flow breakeven over the near term. I'm wondering if you can kind of update us on your latest thoughts on when you guys would expect to get there over the next couple of quarters, particularly as we look out to 2023 and you're kind of signaling more operating leverage to come.\n\nElena Gomez -- Chief Financial Officer\n\nYes. Thanks for the question. So hopefully, you can tell that improving profitability is one of our biggest priorities. And we've made great progress in the first half of the year on EBITDA, and you can see that reflected in our guidance.\n\nAnd we believe we'll exit this year in a position to balance the investments of growth and margin improvement. And I just want to be mindful of the macro. So I mentioned in my prepared remarks that our guidance reflected some of that, which is also part of the reason we didn't want to give guidance beyond 2022 because we want to be incredibly balanced in that. And we also, frankly, want to take advantage of this market opportunity that's presented to us.\n\nWe still believe and have a ton of conviction that there's a lot of growth to come, and we're in the early innings. So we're trying to balance that growth with also cost discipline, as you guys can see in our results.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nGot it. That's helpful. And then maybe just a follow-up on some of the take rate dynamics in the quarter. I know you mentioned mix and then some of the optimization things going on.\n\nAny color on the recent kind of small business interchange changes that the networks announced? And how much -- how meaningful that was to you guys net take rate?\n\nElena Gomez -- Chief Financial Officer\n\nYes. The biggest impact really was the mix shift from credit -- from debit to credit. So that's really the primary driver, offset by some of our own cost optimization efforts. So I would say that's the primary story.\n\nThere is nothing different to report on that.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nGot it. Appreciate taking the questions.\n\nOperator\n\nThank you. The next question is from the line of Josh Baer with Morgan Stanley. Please proceed.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nThanks for the question, and great quarter. Wanted to ask about the 6,000-plus location additions. Any more commentary on regions of strength or market segments that were driving the location additions or any big restaurant groups, restaurant chains? Just looking for more context on that success on the location number.\n\nChris Comparato -- Chief Executive Officer\n\nYes, Josh. Good question. On the whole, the bookings trends remain really solid, and we're pleased with how the sales team is executing across the board. And we're pretty encouraged with the incremental demand from some of our recent  product announcements.\n\nThe team continues to do quite well in FSR as well as QSR. And I'd say it's broad growth across the board. And there's no segment specific breakout. It's really just been across the board.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nOK. Got it. And then one on Sling. Any financial impact to the model to call out?\n\nElena Gomez -- Chief Financial Officer\n\nThe impact of Sling is just not material to the numbers today. So we're not going to call it out.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThank you. The next question comes from the line of Stephen Sheldon with William Blair. Please proceed.\n\nStephen Sheldon -- William Blair -- Analyst\n\nHey, good afternoon. Congrats on the really strong performance here. Wanted to ask about consumer behavior. I think you said you're being a little cautious with your assumptions there in the guidance.\n\nBut just based on the visibility you have, have there been any shifts in the way consumers are engaging with your restaurant clients as the macro environment has gotten tougher, as consumer sentiment has weakened here? Any general changes to call out there during the quarter and into July?\n\nChris Comparato -- Chief Executive Officer\n\nSure. Thanks, Stephen. First, we're not seeing any signs of a drop in consumer demand or pull back in spending in our business. Restaurants are seeing healthy demand.\n\nConsumers continue to spend on services like dining, and the GPV trends are strong. That said, we're pretty mindful of the mixed macroeconomic signals, and we're monitoring closely. We still have -- and even through July, we haven't seen any pullback on consumer demand. And while we're not immune, consumer spend at restaurants has held up relatively well during past recessions, and we've been looking at past recessions.\n\nAnd we feel pretty confident in what consumers will spend within the restaurant market. And then the last point I'd make is for restaurants, our platform becomes even more valuable in a tough market. So if we did see signal, you could rest assured that we've got scenarios planned, and we feel like our platform is in a good spot to help restaurants adapt and navigate uncertainty. So we feel pretty good on that consumer dimension.\n\nStephen Sheldon -- William Blair -- Analyst\n\nVery helpful. And then just as a follow-up. As you talk about a bigger focus on profit and margins, just want to make sure I understand how you plan to manage things there. Is that more -- the margins will continue to stabilize? Or are you also expecting absolute losses to moderate as we think about 2023 and beyond?\n\nElena Gomez -- Chief Financial Officer\n\nYes. I mean I think the way to think about it is what you guys probably don't see is we're metering our hiring and really focusing on investments in high ROI areas. We're taking a deep inspection in areas that don't drive revenue today and being incredibly ruthless in our prioritization there. And so as we think about margins, you should see a steady improvement over time and a commitment from this management team to get to breakeven and profitability over the near term.\n\nOperator\n\nThank you. The next question is from the line of DJ Hynes with Canaccord. Please proceed.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, guys. Thanks for taking the questions, and congrats on the results. Chris, just thinking strategically in context of the industry challenges you mentioned, right, you guys have tons of data. You have areas of regional concentration.\n\nYou talked about heightened food cost. Is there an opportunity to create a group purchasing solution? Like would that make sense as part of the finance suite? I know there are others that do this, but I just think that you guys would be really well positioned to participate in that opportunity.\n\nChris Comparato -- Chief Executive Officer\n\nYes, DJ. It's a good question. I'm not going to comment specifically on that opportunity. But as Elena had mentioned in her script, about 20% of our R&D investment goes toward medium- and longer-term growth initiatives.\n\nThis includes opportunities that sit within our existing product portfolios. For example, xtraCHEF and what we could be doing with xtraCHEF over the long term. You look at team management and what we could be doing with payroll, now with Sling and with Pay Card in the future. So each of our product lines of business within the platform have substantial innovation ahead of them.\n\nAnd then on top of that, we continue to experiment and invest in new ventures. And these are things that I'm not going to talk about today, but we're planting the seeds for how restaurants will thrive in the future. And we're talking five to 10 years down the road, basically the next acts for how we think restaurants will operate. So this 20% of our R&D is super important because you'll continue to see us experiment, listen to our customers and then adapt to their needs.\n\nBut I'm not going to speak specifically to group purchasing as an idea.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYes. Yes. Understood. We'll stay tuned there.\n\nElena, just on the 68,000 locations, can you remind us the ballpark mix of quick serve versus full service and how that feeds into the distribution curve of GPV per location?\n\nAman Narang -- Chief Operating Officer\n\nOK. DJ, so this is Aman, by the way. We had -- look, if you look at our quick serve segment of the market, we have had customers in quick serve for a long time. That's been core to how we've grown.\n\nAnd over time, we have added capability within our platform to help serve this segment better. And so a couple of things. One, in Q2, we saw that as a percentage of our overall bookings, QSR increase, and we're confident that, that can continue going forward as well. As Chris mentioned, you saw Jamba, right, piloting in the enterprise space, Jamba [Inaudible] our kiosk solutions.\n\nAnd really, if you look at our core capabilities that we offer, that QSR we depend on, some of the things that I'll highlight, one, are [Inaudible] display, right, our self-ordering kiosk, our kitchen display screens, online ordering and loyalty. And then some of the capabilities that I think are unique to the Toast platform that QSRs really benefit from are things like -- a little bit specific, but [Inaudible] of a buzzer for example, the ability for a [Inaudible] to text someone when their food is ready. Mobile order and pick, the ability to add to order to see you go through the line and then add -- want to add a coffee or dessert later, right? Toast delivery services, the ability to have integrated delivery is partly online ordering or single-use promo codes. And so there's a lot within that platform that's easily accessible for QSR, and that's what gives us confidence in our opportunity ahead in the segment.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nOK. Thanks for the color, guys. I appreciate it.\n\nOperator\n\nThank you. The next question is from the line of Timothy Chiodo with Credit Suisse. Please proceed.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nI want to talk -- given your comments about the restaurant operating environment, I want to see if you could give us some more context around when we look at your gross adds, so not the net adds, but the gross adds, and we think about what portion of those are coming from either a brand-new restaurant that was just started, just a brand-new company versus an existing restaurant that either is using another system or no system, what is the mix of that within your gross adds? And then the follow-up is, has the trend in that mix been pretty stable? Or has it changed over time?\n\nChris Comparato -- Chief Executive Officer\n\nYes. So, Tim, it's a good question. It's really a balanced growth across our bookings and our net adds. We certainly see restaurants that are already operating move to Toast, and they believe in a digital platform.\n\nAnd these are existing restaurants that are hyper local go-to-market team, knows how to tap into, and we see those restaurants move to Toast. Secondly, we're seeing restaurants already on Toast expand, and those are net adds as well. So we're seeing quite a bit of expansion within our portfolio from existing customers. And then thirdly, we certainly see net new locations in the form of new constructions.\n\nAnd it's always been a sort of a balanced attack across those three. I think as a reminder, I want to remind you that we're still [Inaudible] of the U.S. total addressable market. So our reps in these markets have a lot of surface area to go after, and we're in the early innings of them penetrating these markets to create, call it, flywheel market.\n\nSo it's a little bit of a balancing attack in these markets across those three dimensions. The other thing that I'll mention is beyond net adds -- just remember that net adds on locations is only one lever that we play with. The second lever is ARPU. So as we win a customer and build trust, we're growing more of the platform that the average restaurant is using.\n\nAnd that's a really important lever for us because restaurants are adopting more and more of our modules. So it's a little bit of a balanced attack across those growth levers.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nExcellent. Thank you for the context.\n\nOperator\n\nThank you. Our next question is from the line of Josh Beck with KeyBanc. Please proceed.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nThank you for taking the question. I wanted to ask a little bit about some of the secondary effects of what you're seeing in the industry. Obviously, restaurants, like you said, have record inflation in a lot of their input costs. So I'm just curious if that is effectively pressing the case for automation and if, in any way, it's helping either improve the top of the funnel activity or the sales cycle in any way.\n\nChris Comparato -- Chief Executive Officer\n\nYes. So I'll start with macro. And so we've been at this for 10 years. And at the macro, we fundamentally believe that the restaurant industry is going to shift.\n\nThat's a secular shift to a unified digital platform that powers all of the stakeholders across the landscape. And it's been in existence for 10 years, and it's going to continue for many years to come. So we're seeing restaurants transition to digital, both to drive same-store sales, to drive operational efficiency, to drive staff productivity and then to drive automation in the back office. So it's really across the spectrum, Josh.\n\nAnd I think in the back office, there's a unique opportunity for restaurants to really understand food cost optimization. It starts with xtraCHEF, and that's why we're seeing momentum with xtraCHEF, but it's going to go beyond xtraCHEF with innovations in the back office that help restaurants understand their menu profitability, understand where they're wasting money, understand where they can drive better pricing and better food costs, as I mentioned. So I think we're just in the early stages of the opportunity in and around xtraCHEF. And it's exciting for us because we're helping restaurants really adapt and adapt quickly in the back office.\n\nAman, I don't know if you want to add anything else to that.\n\nAman Narang -- Chief Operating Officer\n\nI think, look, the xtraCHEF launch has been strong for Toast. We only started selling this in Q1. And I think what's exciting about what we're doing with xtraCHEF is how easy it is for restaurateurs to be able to process invoices just by taking a picture on their phones, right? And that allows our accountants and restaurateurs to actually get a sense of food cost really efficiently. And one example is one of our customers out of Cincinnati, they -- with all the inflation that we're all seeing, notice just through the reporting with the xtraCHEF [Inaudible] scanning invoices, they saw the cost of beef and potatoes were up 20% less.\n\nAnd just getting that visibility allows them to pay attention to it, and they're able to find a different provider for beef. They looked at ways to increase -- to purchase in bulk and profit increase on the burgers by 20%, which is the top  item they sell. And it's really meaningful, right, for -- given just as Chris mentioned, how much of a restaurant spend is on food.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nVery helpful. Maybe just a follow-up on the subscription ARPU. It certainly seems to have had another nice sequential jump this quarter. My thought was that maybe that would slow down a bit as we went from, say, more front office-oriented adoption maybe during -- and coming out of the pandemic to maybe more back-office types of functionality.\n\nSo just would be curious to unpack that within the quarter. And then, really, how we should think about the pace of expansion moving forward?\n\nElena Gomez -- Chief Financial Officer\n\nYes. No, I think it's a good call out. So as you can tell from our prepared remarks, increasing ARPU is such an important part of our growth strategy. And we continue to see the sales team execute.\n\nWe talked about Toast shop. We talked about our growth team and our sell team. And then really, our go-to-market team, our reps are very good at positioning the entirety of the platform. They've been trained to do that and to really position that upfront.\n\nSo all of that, combined with the innovation that you're seeing in team management and xtraCHEF, is really coming together to drive that outcome that you're seeing. So we feel confident that we'll continue to see progress on ARPU. I won't guide to it specifically, but you continue to see -- as we add new customers, our newer customers are actually having higher ARPU as well, which I mentioned in my prepared remarks. So really encouraging.\n\nAnd if I look at what's really driving that, it's a combination of our core products -- our core commerce products, but also xtraCHEF and payroll, which are very early for us. So really encouraging to see that growth.\n\nOperator\n\nThank you. Our next question is from the line of David Koning with Baird. Please proceed.\n\nDavid Koning -- Baird -- Analyst\n\nYes. Hey, guys. Thanks so much. Nice job.\n\nAnd maybe if I could ask just the ARPU has been going up so consistently, I think five quarters in a row of 7% to 12% yield growth, I guess, you could say ARPU growth in that subscription line. Do you have insight into how fast that grows in the future? Or are we at a point now -- I can't imagine it continuing to grow quite that rapidly on a sequential basis. But is there a way for you to almost see -- give some insight, like could that grow 3% sequentially for a while still? Or how should we think about that?\n\nElena Gomez -- Chief Financial Officer\n\nYes. I just answered that. But at the highest level, obviously, that's something that we're completely used on. I'm not going to guide, obviously, to the future.\n\nBut what I can tell you is, as we're bringing on more locations, the newer customers that are coming on are coming on with more products. So that should give you a sign that as we're growing, and we're growing fast, we'll start to see that improve over time.\n\nDavid Koning -- Baird -- Analyst\n\nOK. And then secondly, just on the hardware revenue. That's been pretty stable, 29 to 31 or so per quarter for a long time. But inventory has grown significantly, I think up 40% sequentially, up 100% year-over-year, give or take.\n\nWhy isn't hardware revenue growing faster? And maybe how should we see that in the future?\n\nElena Gomez -- Chief Financial Officer\n\nYes. So there's a couple of things. So we did -- there's a couple of things going on there. One is we had lower year-over-year growth in our new customers.\n\nSo Q2 was our strongest quarter ever for net location adds. But keep in mind, Q1 last year was still depressed by COVID. So the year-over-year growth rate in Q1 was meaningfully higher. And then even while our realized price for hardware sales improved, GAAP accounting requires us to proportionately allocate revenue across bundled products.\n\nSo this meant we shifted some revenue out of hardware in Q2. But on the whole, when you take out the noise, I look at the revenue and say it's been relatively consistent.\n\nOperator\n\nThank you. And our next question --\n\nElena Gomez -- Chief Financial Officer\n\nI would -- I'll also add that -- and I mentioned this in my prepared remarks. We have been strategically adding inventory to insulate us from supply chain -- near-term supply chain issues. So I feel confident that our guide reflects all of that.\n\nOperator\n\nThank you. Our next question is from the line of Andrew Bauch with SMBC Nikko. Please proceed.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nThanks for taking the questions. Nice set of results here. I wanted to hone in on the gross margin side, and specifically, trying to understand kind of pricing flexibility you have be it in SaaS or on FinTech Solutions. And then on the cost of revenue side, can you give us a little bit more color on where you can drive efficiency in fintech and in SaaS?\n\nElena Gomez -- Chief Financial Officer\n\nYes. So I love the question because you're reinforcing something that we think is really important to our business model, which is the opportunity to monetize both on the fintech side and on the SaaS. So that's an important part of our model over time. On the fintech side, we have opportunities to continue to drive more volume to our platform, which obviously would drive more GPV on our platform and higher take rates.\n\nBut then at the same time, and we've mentioned this a few times, we have a team really focused on cost optimization. And these are operational things that they're doing behind the scenes, including some R&D efforts, etc. So the combination of those two is sort of how we think about the monetization and the pricing impacts over time on fintech. And then on the SaaS side, obviously, we're going to continue to innovate.\n\nAnd the combination of those two really drive over time our ability to continue to grow.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nGot it. And then I know it's still early days, but a lot of questions have been asked here. So any update on the investments you've made in international and what you learned thus far that's working or may be scaling back?\n\nElena Gomez -- Chief Financial Officer\n\nYes. No, we're still very committed to international. Our investment, as you guys know, wasn't a significant investment, but it's perceiving as planned. We have some early customers.\n\nThe REIT is really good with those initial customers. And just as [Inaudible], their 2022 is really a year of building the foundation. So this is a multiyear journey for us. And like you said, very early innings, but we're encouraged by what we see with the initial customers we have.\n\nOperator\n\nThank you. Our last question will come from the line of Jeff Cantwell with Wells Fargo. Please proceed.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nThank you for squeezing me in. I wanted to ask you a quick one on efficiency. And your Slide 11 talks about two-thirds of your new locations are coming from inbound channels, and one-fifth are coming from restaurant partner referrals. So can you just remind us what that might have looked like a year ago, two years ago? I just want to get a sense of how the trend is about over time because I think that has implications for your ability to continue to scale and grow more efficient over time.\n\nSo I was just hoping for any additional color you might provide on that. Thank you.\n\nAman Narang -- Chief Operating Officer\n\nSure. Thanks for the question. Look, I think we're seeing consistency in our funnel, whether across segments, as Chris mentioned earlier. The percentage of inbound, percentage of referrals has remained consistent.\n\nAnd I think the thing that we're most focused on is continue to invest in our go-to-market team and our customer-facing teams because we know that as we increase tenure on the sales reps and we increase market density, that's the No. 1 driver of efficiency and growth in our business.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nOK. Great. And then on your ARR, can you talk just a little bit more about that? Because we noticed that the growth come from last year was pretty impressive growth this quarter off of a growth come from last year. So can you just remind us about typical seasonality, 1Q, 2Q, 3Q, just so we can be aware of what expectations should be for ARR as we look at it up? Thanks again.\n\nElena Gomez -- Chief Financial Officer\n\nYes. I think the way to think about it is two things. One is both from a location standpoint, typically, Q2 is our highest -- or seasonally higher than Q3, and then it comes back in Q4. So that's the location side.\n\nGPV per location also tends to be higher in the summer months. So just keep that in mind. So that's probably the two things I'd say about seasonality.\n\nOperator\n\nThank you. I would now like to turn the call back over to the presenters.\n\nChris Comparato -- Chief Executive Officer\n\nOK. Thank you, everyone. We appreciate your time. We appreciate the good questions, and we'll be in touch.\n\nSo have a great night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Senno -- Vice President, Investor Relations and Treasury\n\nChris Comparato -- Chief Executive Officer\n\nElena Gomez -- Chief Financial Officer\n\nWill Nance -- Goldman Sachs -- Analyst\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nStephen Sheldon -- William Blair -- Analyst\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nAman Narang -- Chief Operating Officer\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nDavid Koning -- Baird -- Analyst\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nMore TOST analysis\n\nAll earnings call transcripts"
}