{
  "companyName": "Jack Henry & Associates",
  "companyTicker": "JKHY",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/jack-henry-associates-jkhy-q4-2022-earnings-call-t/",
  "content": "Jack Henry & Associates (JKHY -1.09%)\nQ4 2022 Earnings Call\nAug 17, 2022, 8:45 a.m. ET\n\nOperator\n\nGood morning, everyone, and welcome to the Jack Henry & Associates fourth quarter and fiscal year-end 2022 earnings conference call. [Operator instructions] Please also note, today's event is being recorded. And at this time, I'd like to turn the floor over to Mr. Kevin Williams, chief financial officer and treasurer.\n\nSir, please go ahead.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nThanks, Jamie. Good morning. Thank you for joining us today for the Jack & Henry Associates fourth quarter and fiscal year-end 2022 earnings call. I'm Kevin Williams, CFO and treasurer.\n\nAnd on the call with me today is David Foss, board chair and CEO. In a minute, I'll turn the call over to Dave to provide some of his thoughts about the state of our business, financial and sales performance for the quarter and year, comments regarding the industry in general and some key initiatives that we have in place. Then after Dave concludes his comments, I will provide some additional thoughts and comments regarding the press release we put out yesterday after market close and provide comments regarding our guidance for fiscal year 2023, which was also provided in the press release. We will then open the lines up for Q&A.\n\nFirst, I need to remind you that this call includes certain forward-looking statements, including remarks or responses to questions concerning future expectations, events, objectives, strategies, trends or results. Like any statement about the future, these are subject to a number of factors that could cause actual results or events to differ materially from those which we anticipate due to a number of risks and uncertainties. The company undertakes no obligation to update or revise these statements. For a summary of these risk factors and additional information, please refer to yesterday's press release and the sections in our Form 10-K entitled risk factors and forward-Looking statements.\n\nOn this call, we will also discuss certain non-GAAP financial measures, including non-GAAP revenue and non-GAAP operating income. The reconciliations for historical non-GAAP financial measures can be found in yesterday's press release. With that, I'll now turn the call over to Dave.\n\nDave Foss -- President and Chief Executive Officer\n\nThank you, Kevin, and good morning, everyone. Today, we're very pleased to share details with you for a quarter that produced record revenue and operating income as well as record sales bookings. As always, I'd like to begin today by thanking our associates for all the hard work and commitment that went into producing those results for our fourth quarter and for the entire fiscal year. For the fourth quarter of fiscal 2022, total revenue increased 7% for the quarter and increased 8% on a non-GAAP basis.\n\nDeconversion fees were down about 37% as compared to the prior-year quarter. As a reminder, although a reduction in deconversion fees impacts the quarter negatively, it is a long-term positive for our business. Turning to the segments. We had a solid quarter in the core segment of our business.\n\nRevenue increased by 8% for the quarter and increased by 9% on a non-GAAP basis. Our payments segment performed well, posting a 5% increase in revenue this quarter and a 5% increase on a non-GAAP basis. We also had a very robust quarter in our complementary solutions businesses, with a 9% increase in revenue this quarter and a 10% increase on a non-GAAP basis. As I highlighted in our press release, the fourth quarter was the strongest sales quarter in the history of the company.\n\nThose of you who follow us closely will know that in the fourth quarter of 2021, we set an all time sales record. We broke that record in the second quarter of fiscal '22, and now we've broken that new record in the fourth quarter. Additionally, in the third quarter of this year, we exceeded our highest ever Q3 sales payment by around 40%. All in all, this has been a remarkable year for the sales teams.\n\nTo provide a little detail regarding sales successes in the quarter, we booked 17 competitive core takeaways, with five of those being multibillion-dollar institutions. Additionally, we signed 18 deals to move existing on-premise customers to our private cloud environment. Several of our complementary offerings also saw a very strong demand in the quarter with, as you might guess, our digital suite leading the pack. We signed 48 new clients to our Banno Digital Platform in the quarter and 21 new clients to our card processing solution.\n\nFor the full year, we signed 52 competitive core takeaways, with 10 of them greater than $1 billion in assets. Additionally, we signed 54 contracts to move on-premise core clients to our private cloud, 165 new Banno Digital customers and 58 new clients for our core processing -- for our card processing solution. Of course, we signed a variety of other contracts for many of our other solutions as well, but it's important to note that almost all of these contracts represent long-term recurring revenue equipments to Jack Henry for a wide variety of our solutions. Our annual client conference is scheduled for the end of this month, and I'm very happy to say we already have 56 core prospects signed up to attend and hopefully finalize their decision to move to Jack Henry.\n\nIn case you missed that, I'm going to repeat that. At our annual client conference at the end of this month, we have 56 core prospects signed up to attend and work with our sales organization. At our analyst conference in May, I shared with the attendees that we had just surpassed 7.2 million registered users on our Banno Digital Banking Platform. As of the end of the fiscal year, we were at roughly 7.7 million registered users.\n\nAs a point of reference, on July 1, 2020, we had about 3.2 million registered users. So in two years, we've seen an increase of almost 150% in our user count. This is significant because, as I've stressed in the past, most of the revenue for a business like this is tied to the number of users on the platform. On August 9, we announced the definitive agreement for Jack Henry to acquire Payrailz with an expected closing of August 31.\n\nPayrailz accelerates Jack Henry's technology modernization strategy by immediately adding next-generation digital payment capabilities to Jack Henry's technology stack and payments ecosystem. Payrailz also enhances Jack Henry's payments-as-a-service strategy, enabling clients to simplify the complexity of payments, modernize their existing payment channels and remain at the center of their account holders' payment experiences. Today, Jack Henry supports the growing demand for payments-as-a-service with a virtual payments hub that consolidates money-moving solutions and supports numerous payment channels and types. Payrailz strategically complements this hub with its extensive capabilities for consumer and commercial bill pay, real-time person-to-person payments, account-to-account transfers, business-to-customer payments account and more.\n\nAcquiring Payrailz will strengthen Jack Henry's position in the payments space by providing our collective clients with additional functionality, optionality and flexibility that enhances their diverse digital and payment strategies. Hopefully, you've all seen the August 1 announcement about our corporate rebranding. As we move forward, rather than using Symitar, ProfitStars and Jack Henry Banking as unique brands, you will see us go to market as simply Jack Henry. We believe that uniting the brands reflects Jack Henry's role as a well-rounded financial technology provider and an advocate for community and regional financial institutions.\n\nOur new brand is the outcome of the work we are doing to modernize our technology, streamline operations and operate as one company, which we believe will result in a better client experience. We now have a platform to speak from a single, consistent voice as we continue to help community and regional financial institutions, strengthen connections with account holders by offering a full array of solutions and access to a wide network of fintech partners. As many of you know, Jack Henry is regularly named as the Best Place to Work in various publications around the country. Recently, we were thrilled to be named by LinkedIn as a Top 10 Best Place to Work in financial services.\n\nOur consistent placement on Best Place to Work lists is a testament to the workplace culture we have at Jack Henry, and our employee engagement scores reflect that strong culture. Additionally, we began a continuous listening strategy this year to gather feedback from our associates and I'm pleased to share that overall, our participation rate was greater than 65%. We achieved an engagement capital score of 79%, and 87% of our employees say that they believe in Jack Henry's values, all well above industry benchmarks. As we shared at the beginning of August, we have now completed a comprehensive search and have named a new CFO effective on September 1.\n\nMimi Carsley joined our finance team on July 1 and has been busy coming up to speed on the Jack Henry story and financials for the past several weeks. As we stated in the press release, she comes to us with more than 30 years of financial industry experience, but also has a strong technology background. Mimi will be traveling with our director of investor relations, Vance Sherard, in September to meet with a number of investors and analysts, and I expect that she will lead this call in November. Of course, with the addition of Mimi, we are now prepared to wish Kevin a happy retirement.\n\nKevin has been very accommodating through the search process by delaying his intended retirement date until he was confident that we had found a replacement who could help us build the company for the future. As many of you know, Kevin has been with Jack Henry for almost 25 years, but his association with our company goes back well over 30 years. During that time, he has had a tremendous impact on our execution and our success. I'd like to take this opportunity on behalf of all Jack Henry associates, customers and shareholders to thank Kevin for everything he's done to make us so successful for these many years.\n\nYou will be missed, Kevin. As I reflect back on fiscal 2022, I can confidently say it was a very good year for our company. Our employee engagement scores remain high, and our levels of customer engagement and customer satisfaction scores are also very high. We have successfully completed several leadership and board-level retirements and replacement and expect these new members of our leadership teams to continue our track record of success.\n\nOur sales teams are performing extremely well and have positioned us for another successful year. And overall demand for Jack Henry technology solutions remains high in all segments of our business. We have a commitment to doing the right thing for our constituents that we believe will continue to serve us well. We will continue with our disciplined approach to running the company and expect that approach to help provide stability for our employees, customers and shareholders.\n\nAs we begin the new fiscal year, I continue to be very optimistic about our future. With that, I'll turn it over to Kevin for some detail on the numbers.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nThanks, Dave. Our service support revenue increased 7% in the fourth quarter of fiscal 2022 compared to the same quarter a year ago, with fee conversion revenue being down $3 million in the quarter compared to last year's quarter. It was slightly higher than what we thought it would be, but still down 37% from a year ago. License, hardware and implementation revenue combined were actually up $5 million or 12% compared to the prior-year quarter.\n\nOur data processing hosting fees in our private and public cloud offerings, which continue to show strong growth in the quarter compared to the previous year, growing by 11% for the quarter. On a non-GAAP basis, total support and service revenue grew 8% for the quarter compared to the prior year. Our processing revenue increased 8% in the fourth quarter of fiscal 2022 compared to the same quarter last year on both a GAAP and non-GAAP basis. The increase is primarily driven by slightly higher card volumes.\n\nAnd digital revenue continues to show strong growth as demand for our Banno Digital Platform continues to be very strong. Total revenue was up 7% for the quarter on a GAAP basis and increased 8% on a non-GAAP basis. Our cost of revenue was up 4% compared to last year's third quarter. This increased primarily due to higher costs associated with customer maintenance and license costs, card processing and higher personnel costs compared to a year ago.\n\nOur research development expense increased 18% for the fourth quarter of fiscal 2022 compared to the same prior-year quarter. The increase is primarily due to personnel and consulting costs. And SG&A expense increased 16% in the fourth quarter. And this increase is primarily again due to increased personnel costs, which includes commissions and travel-related costs compared to last year.\n\nOur reported consolidated operating margins were essentially flat at 21 and a half percent on a non-GAAP basis. Our operating margins expanded from 20.1% last year to 20.9% this year for a nice margin expansion on a non-GAAP basis. The effective tax rate for the fourth quarter of fiscal 2022 increase to 21.8% compared to 19.7% in the same quarter a year ago, primarily due to timing effects of deductions. Our net income grew 5% to $80.4 million for the fourth fiscal quarter compared to $76.9 million last year, with earnings per share of $1.10 for the current quarter compared to $1.04 last year.\n\nFor cash flow, our total amortization increased 2.9% for the year to date compared to last year, primarily due to capitalized software projects being placed into service in the prior year. Included in the total amortization is the amortization of intangibles related to acquisitions, which decreased to $16.3 million this year compared to $17.7 million last year. Depreciation actually decreased 3.2% compared to the prior fiscal year. Our operating cash flow was $504.6 million for the fiscal year, which was up from $462 million last year, was primarily due to increased net income of $51.4 million compared to the previous year.\n\nWe invested $191.4 million back into our company through capex, purchase and capitalized software. Our free cash flow, which is operating cash flow less capex and cap software and adding back net proceeds from disposal of assets, was actually $313.3 million. This represents 86% conversion in net income. There were two primary working capital items that were responsible for this.\n\nOur receivables were up $35 million compared to the year ago. However, a little over a third of this is an increase is due to increased average monthly billings for recurring revenue, which are average monthly billings, continues to grow. And then the balance is due primarily to the timing of collections, especially our annual maintenance. I will say that our annual maintenance as of last Friday is right in line with where it was a year ago, so we did catch up ground in July and August.\n\nThe other item is working capital item was prepaid expense and other, which increased $26 million, which $20 million of this increase is due to prepaid commissions related to the strong contracting that we had in the previous year or in this year, I'm sorry. And the other, the balance was primarily due to prepaid cost of products. Without the impact of these two working capital items, our free cash flow conversion from net income would have been greater than 100%. During the year, we spent $193.9 million to purchase 1.25 million shares for the treasury.\n\nWe paid dividends of $139.1 million for a total return to shareholders of $333 million in fiscal FY '22. A couple of comments on our balance sheet as of June 30. Cash position of $48.8 million compared to $51 million a year ago, pretty much in line. Our revolver balance was up a little to $115 million compared to $100 million a year ago.\n\nOur return on average assets for the trailing 12 months is 15.1%. Our return on average equity for the trailing 12 months is 26.9%, and return on invested capital for the trailing 12 months is 24.9%, which we are very proud of those key metrics. For FY '23 guidance, we provided both GAAP and non-GAAP revenue guidance in the press release yesterday for fiscal 2023. We also provided a reconciliation of GAAP to non-GAAP revenue in the release following the segment information.\n\nHowever, just to be clear, this guidance is based on today's environment. And if things were to change significantly, then this guidance will also be revised. Also, just to be clear, this guidance does not include the impact of the recently announced acquisition of Payrailz that is scheduled to close later this month. So there is no financial impact in this guidance from that future potential acquisition.\n\nFor GAAP revenue growth for fiscal '23, based on the announcement we released yesterday, our revenue guidance reflects revenue growth of approximately 7.2% over fiscal '22, which this anticipates deconversion revenue will decrease by approximately $18 million from $53 million, down to $35 million compared to FY '22. And this is based on what we're seeing on the current activity on the M&A front. For non-GAAP revenue growth, our initial guide for FY '23 is approximately 8.4% and 8.5%, which is down slightly from the non-GAAP revenue growth we saw in FY '22 of 8.8%. But obviously, for many parts of our business, implementation, convert/merge and even payments, we had a little easier comp in FY '22 compared to FY '21 than we will have in FY '23.\n\nSo we are very happy to report that we are guiding to close to eight and a half percent non-GAAP revenue growth. Initial guide for GAAP operating margin for FY '23, it will decrease from 24.4% to approximately 23.7% in '23. And this is primarily due to the anticipated decrease in deconversion revenue because, obviously, deconversion revenue has extremely high margins. Our initial guide for non-GAAP operating margin is projected to be essentially flat at approximately 22.7% for FY '23.\n\nSome reasons for this projected flat operating margins because there's been some things that changed since the first week of May when we talked about guidance. Continued headwinds on license revenue is now 67% of our core customers are in our private cloud. Our annual education conference, which Dave mentioned later this month, is going to be in person, so there will be some significant expense there that we have not seen in the last two years. Continued increased cost of third-party processors and other vendors.\n\nContinued increase in insurance, especially cyber, E&O and health, which I'm sure most of your customers are seeing. Increased compensation expense to attract and retain talent in this tough environment. Increased facility costs as we now have a return-to-office date of 9/6/22, cost of cybersecurity continues to increase to protect our customers' employees and then just travel costs have increased significantly. Just for our employees, our last month travel airline tickets on average have increased 58% from February.\n\nHotel rooms, on average, last month increased 32% since February. And then, obviously, as we all have noticed, increase in both costs of meals and rental cars has gone up. Therefore, even though this guidance is less than the 50 bps of expansion we talked about the first week of May, the environment has changed, and it continues to change significantly. Obviously, we try to be conservative in our guidance.\n\nAs you all know, I have always lived under the philosophy to underpromise and overdeliver. And hopefully, that's what this guidance is going to provide. Our effective tax rate for FY '23 is projected to increase to approximately 23.8%. But some states have gotten a little more aggressive, and the benefits from the Tax Cuts and Jobs Act, other than the decreased federal tax rate, have now been fully utilized over the last four years.\n\nOur FY '23 GAAP EPS guidance is a range of $5.05 to $5.09. This now concludes our opening comments. We are now ready to take questions. Jamie, will you please open the call lines up for questions.\n\nOperator\n\n[Operator instructions] Our first question today comes from Vasu Govil from KBW. Please go ahead with your question.\n\nVasu Govil -- Keefe, Bruyette and Woods -- Analyst\n\nHi. Thanks for taking my question. I guess, first, congratulations on another really strong sales quarter. And David, I was sort of interested in learning is, to what extent your tech modernization strategy is sort of contributing to the discussions as you go in to meet with new clients now?\n\nDave Foss -- President and Chief Executive Officer\n\nYeah. Good morning, Vasu. So it's a good point. It certainly is a topic.\n\nBut as I've stressed on prior calls, we're not talking with customers about delivering the tech modernization technology in the next year or so. But I think this has given a lot of prospects, the comfort in knowing that Jack Henry is leading the way as far as a true public cloud-native technology strategy for the future. And so that has definitely created opportunities for us to be engaged with customers, whether or not that's directly contributing to closed deals. I don't know that I can say that with any comfort, but that just absolutely opened the doors with a lot of prospective customers because they see the future with Jack Henry.\n\nVasu Govil -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. Thanks for the color. And then, Kevin, for you, I mean, thanks for all the color on the sort of change in the margin guide. You sort of said at the end that you're still sort of looking to be conservative.\n\nSo what are the areas where you think your guide might be conservative in, in terms of margins? And then for revenue growth, any change in trend by a segment that we should expect relative to what we saw last year?\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nYeah. So I think if there's concern in anywhere, it's probably in our payments area and then, obviously, in our private cloud. As Dave mentioned, we signed a whole bunch of customers in Q4 to move over from our on-prem to our private cloud. And if we continue to move those over, obviously, that is a nice margin lift when we move those customers over.\n\nSo those would be the two areas. And then, obviously, the continued growth in Banno Digital because that's also a nice margin. So those are probably the three areas that, if we're conservative, it's probably in one of those three areas. As far as segments, core should continue to be strong because of the continued, not only movement from on-prem to private cloud, but also just the new customers that we signed in Q4, the backlog that we have to install.\n\nSo I'm pretty sure that our install backlog is out at least 12 months now for all of our core -- for our flagship core solutions. And as far as complementary, I mean, that's going to continue to be driven by Banno Digital, and also the new fraud solution that we're rolling out in treasury and other things. So there's just a huge demand for a lot of our products out there. And then payments will just continue to grow.\n\nAs we close the deal in August, that should help move our bill pay solution a little bit. But our EPS and CPS are mostly still showing strong signs of growth.\n\nVasu Govil -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. Thank you for the color.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nYou bet.\n\nOperator\n\nOur next question comes from Rayna Kumar from Evercore. Please go ahead with your question.\n\nRayna Kumar -- Evercore ISI -- Analyst\n\nGood morning. It's actually UBS. Thanks for taking my question. You mentioned 56 prospects are attending your conference later this month.\n\nI'm just curious to know how that number compares to previous conferences that you ran? And if the prospects are using in-house or outsourced core solutions right now? And then finally, just a potential time line of conversion. Thank you.\n\nDave Foss -- President and Chief Executive Officer\n\nSure. Thanks, Rayna. So it is up -- I don't have an exact number for what would be the most we've ever had, but we are all confident this is a record to have 56 show up. And you know what that -- I guess, the thing that you can intuit from that is not all prospects come to our client conference.\n\nSo that means we have a whole much more core prospects that we're talking to that are not coming to the client conference. So the reason I stress that is these are people who are investing the time to come and spend with us. They're looking at a move to Jack Henry. The other thing that I would correlate there is that, normally, what I say on these calls is if you can do 50 to 55 new core customers in a year, that's a really good year.\n\nWe have 56 that are signed up to come to the client conference to join us there. So a great sign as far as we're concerned. When they sign -- I mean some of them are at the beginning of the process, some are at the end of their process. But this is kind of the final step in their due diligence to come and spend a little time with us.\n\nSo it all depends on when they sign. But as far as core conversions are concerned, still a good measure for a core conversion is to think in terms of nine to 12 months for a core conversion. And that's not because we can't slot them in, we don't have the staff or anything like that. It's because when you do a core conversion, you use that phrase a lot of times, you're doing heart and lung surgery all at the same time on a bank or credit union, and they need time to get ready for that.\n\nThey have a lot of prep work to do, a lot of training to do. And so just a normal core conversion, regardless of who the provider is, you normally talk in terms of nine to 12 months after they sign. So there's not a good way to try and apply this 56 number into what are the projections for the next fiscal year. But my point in bringing it up was more to tell you, there is a tremendous amount of interest in Jack Henry as a technology provider right now, and that's a really good objective indicator of the level of interest.\n\nRayna Kumar -- Evercore ISI -- Analyst\n\nThat's very helpful. And then as a follow-up, David, are you starting to see financial institutions more open to switching to a public cloud infrastructure? And are there any regulatory changes in the FI space that we should be aware of, where FIs would be more open to going on to Amazon Web Services or a Microsoft Azure?\n\nDave Foss -- President and Chief Executive Officer\n\nYeah, that's a great follow-up, Rayna. So the answer is no. There's no great demand today, and I've said this on other calls, no demand right now for a full-stack public cloud solution. There's nobody out there clamoring for that today, and there are no providers today that are doing everything in the public cloud.\n\nOur whole point with this strategy announcement was to make sure that prospective customers and our existing customers know where we're going and when we expect to get there. We believe, and I've done lots of meetings in the last few months with CEOs, both bank and credit union, and there's almost no demand today but there will be in the future. And we believe that the regulatory environment is going to shift along with that. So as the regulators become kind of comfortable with the idea of the full stack being processed on the public cloud, you'll see more and more banks and credit unions starting to talk about -- they're ready to make that move.\n\nSo -- but it's an evolution and it's something that the regulators need to evolve forward and then, of course, customer demand will evolve in that same direction.\n\nRayna Kumar -- Evercore ISI -- Analyst\n\nThank you.\n\nDave Foss -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nOur next question comes from John Davis from Raymond James. Please go ahead with your question.\n\nJohn Davis -- Raymond James -- Analyst\n\nHey. Good morning, guys. Kevin, just on free cash flow conversion for 2023, is there a chance we're above 100%, given some of the timing items you called out in the fourth quarter? Just any kind of color on free cash flow conversion expected this year.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nYeah, I would say, JD, I mean, obviously, the things that we had this year with the huge increase in commissions in the prepaids because of the strong contract we had especially in the fourth quarter, but some of that's actually built up from the strong contract we had in Q2 and Q3. So obviously, that should level out next year as we continue to move forward. However, I will tell you, obviously, we have to grow every year, so our quotas are going up. So it just depends on the timing and what actually gets sold.\n\nBut -- so I would say that we'll get -- we should be right back at 100% conversion next year, given those working capital things work out. Just a change in receivables should be a positive for next year because we collected more of our annual maintenance billings now in FY '23 than we did in FY '22. So all those things being said, we should be back to 100%. Are we going to be above 100%? I mean, it's too early for me to make that prediction, JD.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. No, fair enough. And then just on payments, obviously, 5% deceleration a little bit, but you had a really tough comp on a year-over-year basis. So have you seen kind of any impact from debit and credit mix normalization? Is this, on a two-year stack basis, you're still kind of low double digits.\n\nIs that the right way to think about '23 in the payments segment specifically?\n\nDave Foss -- President and Chief Executive Officer\n\nAre you asking about revenue growth, JD? Or are you talking about payment volumes?\n\nJohn Davis -- Raymond James -- Analyst\n\nYeah, sorry. Yeah, yeah, sorry, revenue growth and payments.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nWell, I think our revenue growth is going to be in the high single digits for FY '23 compared to FY '22. Obviously, the big drivers of that are EPS and CPS. Our online bill pay is going to grow a little. It's the slowest grower of the three buckets in our payments.\n\nBut what we're seeing with EPS and CPS and the demand we're seeing, we should still be able to see very high single digit, maybe even low double digit. If everything goes, if all the moons align, we could get there, JD.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. And then last one for me, just on capital allocation. Obviously, you announced the Payrailz acquisition, which closes later this month or slated to. Can you help us at all -- size-wise, revenue earnings impact is immaterial.\n\nI know you didn't disclose the price when you announced it, but then you also didn't buy back any stock in the quarter. So should we expect kind of more deals in the pipe? Any color there on capital allocation would be helpful.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nWell, so JD, I mean, per the definitive agreement we have in place, we are not allowed to disclose any financial impacts until after we actually close the end of this month. So it will be after that before we can give any guidance or the magnitude of the acquisition. I mean, really, the reason we didn't buy any stock back this quarter is because our stock performed so extremely well in the quarter. I mean if you think about how much our stock went up from July 1 to now and the fact that we are blacked out from buying our stock back, just like Dave and I are blacked out until we announce earnings from the end of the quarter until we actually announce earnings.\n\nSo during that time, our stock jumped up 10%, up above $200. So would it be a smart buy for us to jump in with both feet right then when we already have a draw on our revolver, when we've got an acquisition out there? And we, obviously, want to keep some dry powder as we continue to look at other potential targets out there.\n\nDave Foss -- President and Chief Executive Officer\n\nAnd that's -- let me jump in on the second part of your question, JD, about other deals in the pipeline. So obviously, we wouldn't go on an earnings call and talk specifically about anything, but I've stressed over and over and over again, we always have deals in the pipeline. We are -- we've historically been known as a serial acquirer. These past couple of three years have been the anomaly for us.\n\nBut now that things are getting a little more, we'll say, normal when it comes to valuation expectations, we are absolutely looking at deals today, and we'll continue to look for deals that make sense with our strategy. But you know well enough, we are a disciplined acquirer. We don't chase the shiny object, but we're always looking.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK, appreciate all the color. Thanks, guys.\n\nDave Foss -- President and Chief Executive Officer\n\nYup.\n\nOperator\n\nOur next question comes from Peter Heckmann from D.A. Davidson. Please go ahead with your question.\n\nPete Heckmann -- D.A. Davidson -- Analyst\n\nThanks for taking my question. So is it possible, on Payrailz, I know you can't disclose any specifics, but is it possible to talk about whether you assume it would be dilutive to your current net income guidance or accretive or neutral?\n\nDave Foss -- President and Chief Executive Officer\n\nFor FY '23, Pete, it will probably be slightly dilutive. We haven't totally finalized that yet because, obviously, we haven't closed yet. But it will be slightly dilutive to FY '23, but it should be accretive in FY '24 and grow nicely from that point on.\n\nPete Heckmann -- D.A. Davidson -- Analyst\n\nOK. That's helpful. And then when you think about your guidance, any material level of buyback incorporated in your '23 guidance?\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nThere is no buyback incorporated into my guidance, Pete.\n\nPete Heckmann -- D.A. Davidson -- Analyst\n\nGot it. And I assume not. And then...\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nTwo things, just to be clear on it. So I mean, any time I've given guidance in the past, it has never assumed buybacks, and it's never assumed an acquisition.\n\nPete Heckmann -- D.A. Davidson -- Analyst\n\nCorrect, correct. And then as you're thinking about M&A, what would be the ceiling for net leverage that the management would be comfortable with? Would you go to three times on pro forma EBITDA for the right deal?\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nYeah. For the right deal, Pete, I mean, I think we would go three times. And we've actually -- I would tell you, I mean, over the years, and obviously, as Dave said, I mean, moving kind of out of the market the last three years because valuations have been so ridiculous. But I will tell you, in the past, I mean, I've had approved financing for deals that would have been three times leverage.\n\nSo the board would be very comfortable with that if it's the right deal for the company to move us forward. I mean, as Dave said, we aren't going to and chase the shiny objects. But if it's something that will help us with our laser focus on the FI industry, and it is something that our customers need and will drive the company further, then absolutely, we'd go three times.\n\nPete Heckmann -- D.A. Davidson -- Analyst\n\nOK. That's helpful. Well, Kevin have a great time in your retirement, and I appreciate all your help over the years.\n\nDave Foss -- President and Chief Executive Officer\n\nYou bet, Pete.\n\nOperator\n\nOur next question comes from Dave Koning from Baird. Please go ahead with your question.\n\nDave Koning -- Robert W. Baird and Company -- Analyst\n\nYeah. Hey, guys and thanks, Kevin, for all the detail on the margins kind of for the guidance. Is there anything to think about in this year, in this base, that would change kind of the long-term outlook? Like basically, can we kind of take the little bit of downdraft in 2023 margin and then just kind of grow it more normally off of that base going forward? Like there's nothing new and incremental that would change kind of the longer-term progression, right?\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nNo, there's nothing there, Pete. I mean, as everybody on this call knows, I mean, we have seen some ridiculous inflation in the last four or five months. I mean if you don't think I'm serious, just drive to McDonald's and buy your kid a quarter pounder with cheese and fries and see what you pay for that, I mean, just that. So I mean once inflation gets under control and we can grow over that, then absolutely, FY '24, we should go right back to our typical margin expansion once we can get over these hurdles.\n\nDave Koning -- Robert W. Baird and Company -- Analyst\n\nYeah, that makes sense. I bought a biscuit at McDonald's yesterday and had that same experience. So thank you for that.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nThis earnings call has gone a totally different direction.\n\nDave Koning -- Robert W. Baird and Company -- Analyst\n\nAnd then, I guess, the second question I just had. I know you're paid on number of transactions. And I just went back and looked at the Visa debit transactions, and they had a really tough comp in the year ago, too, but they had like pretty stable growth in the last two quarters. I think they were at like 5% both quarters.\n\nBut I know you decelerated this quarter, and I know there's all sorts of different things. You have them and then stuff. But I guess, why else did growth decelerate in the payments business?\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nI don't know of anything specific to call out, Dave.\n\nDave Foss -- President and Chief Executive Officer\n\nWell, I will tell you that, if you remember last year in '21, we had a huge growth. And so we had a tough comp in our payments segment this year compared to last year.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nYes.\n\nDave Koning -- Robert W. Baird and Company -- Analyst\n\nSo OK. So it really just is that. Yes, that makes sense.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nYeah.\n\nDave Koning -- Robert W. Baird and Company -- Analyst\n\nAll right. Thank you.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nYou bet. Thanks, Dave.\n\nOperator\n\nOur next question comes from Charles Nabhan from Stephens. Please go ahead with your question.\n\nCharles Nabhan -- Stephens, Inc. -- Analyst\n\nHey. Good morning, guys. I wanted to get a little color around the timing of margins over the course of '23. I know some of -- I know there's a lot of variables right now, but some of the factors you mentioned, Kevin, like the conference and the license headwind are weighted toward the front end of the year.\n\nSo that being the case, is it fair to assume that the bulk of the headwind would be in the front half of the year for '23 and that we could potentially see something above a flattish margin in the back end, all things equal?\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nWell, yeah, Charles, you're absolutely right. I mean the user group meeting is -- education conferences is in Q1. So that is going to have a big impact on margins in Q1. So you're right, I mean, the comps should be a little easier once we get past that.\n\nThe license revenue, I mean, that's spread out over the year because that's based on delivery of the license. So that's lumpy, as it always has been. So you don't -- really don't know which quarters that's really going to hit on a year-over-year basis. I'm absolutely sure that license revenue is going to be down.\n\nAnd then the other things that are in there is just comps to retain talent is a challenge. And just -- that's not going to get any easier in the short term. So that's going to be a challenge for the entire year the way we're seeing it right now. So I think you're right.\n\nI think the biggest headwind will be in Q1. But I think there's other challenges that I think we're going to have to deal with and get over the balance of the year. But you're right, the margin should be a little better after we get through Q1.\n\nCharles Nabhan -- Stephens, Inc. -- Analyst\n\nGreat. I appreciate that. And as a follow-up, I wanted to drill in the Banno a little bit. Specifically, if you could give us some color around how much of the new customer wins are coming from the existing base versus outside the base? And then secondly, Banno business was a topic at the Analyst Day, and I was wondering if we could get an update on that in terms of your ability to cross-sell and just sort of how that's positioned you for new wins?\n\nDave Foss -- President and Chief Executive Officer\n\nThanks, Chuck. So first off, 100% of the Banno wins are happening inside the Jack Henry core base. And we've talked about this in the past, the fact that the great resignation did have an impact on the Banno business, as far as developers. It's been commonly reported in the news that high tech developers have been moving around a lot and been commanding very high salaries.\n\nAnd we, like a lot of companies, were impacted by that. So we've been very transparent with our customers, sharing the fact that -- and our prospects, sharing the fact that we've had to move back our release date as far as Banno outside the base. We also had to move back the release date for Banno business into calendar 2023. And so we believe, and we're hearing it from customers and prospects, that once we get Banno business out there, that's really going to light a new fire under the Banno platform.\n\nBut we're having tremendous success as it is. So we're just excited to get Banno business out there, and we're excited to be able to sell outside the base. But in full transparency, that is the line of business that was probably most impacted by the great resignation here over the past year or so.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nThe other thing I'd add is almost 100% of our new core wins takes Banno. And in fact, Banno's probably -- and I've been in this industry for a long time, Banno was probably the only solution that I have ever known that actually closed a core deal. Because -- we've actually won some core deals because we have Banno. So it is a top-of-the-line solution out there.\n\nAnd so Dave's right, we're selling 100% inside the base, but that also includes all those new core customers that we're taking away from our competitors.\n\nCharles Nabhan -- Stephens, Inc. -- Analyst\n\nGot it. Thank you very much. And Kevin, thank you for all your help over the years and best of luck in the future.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nThank you.\n\nOperator\n\nOur next question comes from Dominick Gabriele from Oppenheimer. Please go ahead with your question.\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nHey. Great. Thank you so much. I just wanted to talk about why would it be possible, let's say, medium and small asset size versus large asset size financial institutions might be willing to take on the public cloud solutions that you're developing sooner? And is that -- and then maybe it moves up market from there.\n\nDoes that sound correct? Does that make sense that it would start in the small FIs first, and they might be more willing to do that? And then I just have a follow-up. Thanks.\n\nDave Foss -- President and Chief Executive Officer\n\nNo. I think, Dominick, I mean, it's possible that could happen that way. I don't expect that to happen. I think it's going to be a larger -- it'd be the larger financial institutions that will make that move because, for them, there's more potential benefit to move into the public cloud, right? What they're paying is more than a smaller institution.\n\nThe demands of their customers generally are greater as far as flexibility and new functionality, new releases. The expectations of their customers are higher. So I think it's more likely that it will be kind of midsized regional banks that will adopt the public -- the full-stack public cloud offering first. And I think smaller institutions will follow on.\n\nNow we've got to wait and see. It's never been done before, so we got to wait and see what happens. But that's my expectation is that it will be -- the $1 billion, $5 billion to $10 billion banks that are probably going to be first to adopt. And then you'll see smaller banks and the really large regional banks kind of follow along after that as far as moving everything to public cloud.\n\nNow, I keep saying everything because we're moving different pieces to public cloud today. I mean, Banno is a public cloud solution, so there are pieces that are already public cloud. But when we're talking about full stack, I think that's the way you're going to see the progression. But we'll just have to see when we get there.\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nSo start from the middle and kind of expand out from there as far as...\n\nDave Foss -- President and Chief Executive Officer\n\nThat's what I think.\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nOK. Interesting. Very interesting. I was just curious.\n\nThank you. And I just -- you listed off of -- there's a multipronged question here, so forgive me upfront. You've -- you listed a bunch of the different kind of cost pressures that you're seeing from just normalization. You listed a whole bunch of them.\n\nIs there any way for us to think about the sizing on the various ones, just from largest to smallest? And then just a follow-on to that, but sort of separate, how are your customers adjusting to this kind of similar environment, where they're probably also seeing some of the various factors as well? And how do you think that could shift the demand for your products as they think about investing in further technology enhancements? Thanks, guys.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nYeah, so that's a good question. And as far as sizing the impact, I don't know that there's any one thing that jumps out at me. I mean, probably -- personnel costs to attract and retain talent is probably -- would probably be the biggest one. The other ones are insurance.\n\nI mean, it's just -- it's a hard insurance market out there for E&O and cyber. Sure, everybody is experiencing that. I mean, our premiums went up significantly last year, and they're going to go up again this year. And then probably right behind that, or maybe ahead of that, would be our travel expenses because not only are travel expense is going up, but we have more people traveling.\n\nSo for example, we have over 300, I believe, 300 employees going to the education conference next week in San Diego to take care of our 2,500-plus customers that are going to be there. So there's -- the travel costs are just going to be up significantly this year compared to last year, and I don't see any end in that.\n\nDave Foss -- President and Chief Executive Officer\n\nAnd so the second half of your question there, Dominick, so I think the thing to keep in mind with our customers is, our customers are in the business of lending money, right? So we all know that rates are going up. Our customers are continuing to see a net interest margin spread growth. And so although their costs are going up, and we've talked about it previously, we've done CPI increases, and they're certainly seeing that in other areas, their opportunity to make money has also gone up fairly significantly. And they are highly motivated as evidenced by our sales success.\n\nThey are highly motivated in technology solutions that can increase their efficiency as an organization and provide opportunities to grab new customers, whether it's on the deposit side or the loan side. So there is no slowing down at all in customer demand for new technology, but they do have that benefit of the lending side of their business and the increased net interest margins that they're seeing.\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you.\n\nDave Foss -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nOur next question comes from Nik Cremo from Credit Suisse. Please go ahead with your question.\n\nNik Cremo -- Credit Suisse -- Analyst\n\nGood morning, and thanks for taking my question. Congrats to you, Kevin. I was hoping just to dig into the 2023 non-GAAP margin expectations and see if we can get some color across the segment.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nAcross the segments, well, I don't -- when I say margins are going to be flat, I think they're probably going to be -- I mean, we're going to see some margin improvement probably in core and payments. Complementary, I don't know, because, obviously, we're getting the big pressure in our R&D and SG&A lines and cost of sales. So some of that margin is not impacting the segments directly because we don't have SG&A and R&D in those segments. So the margins for the segments themselves should be solid with some slight expansion, but it's below the line that we don't allocate the R&D and SG&A that's going to really make it be flat for the year.\n\nNik Cremo -- Credit Suisse -- Analyst\n\nGot it. Thanks for that extra color. And then for my follow-up, I wanted to just to ask what you're seeing from your customer base just in terms of the M&A environment. Are you seeing like a big step down in M&A activity relative to 2022 or is like the term fee guidance just more conservative?\n\nDave Foss -- President and Chief Executive Officer\n\nYeah. So Nik, we absolutely are seeing a slowdown in that. And one of the things we've stressed on these calls in the past is we have a lot of visibility into when customers are acquiring other customers. We're one of the first calls they make if they're looking at acquiring another institution because they want to get a conversion slot lined up well in advance.\n\nAnd so we have a lot of visibility. We don't necessarily know when one of our customers is going to be acquired. We have a lot of visibility regarding the overall movement in the market. And that's why we have projected the conversion revenue to be down next year because we expect M&A overall activity to be down in the coming year.\n\nNow that's reading tea leaves and just trying to understand what's happening in the space, but that's our current expectation is that overall M&A among banks and credit unions will be down in the coming year.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nYeah. I mean that's like, Nik, year before last. I mean, we did not predict the deconversion revenue would be down $33 million at the beginning of the year because M&A appeared to be fairly solid. But we knew it was going to be up this year, but we never dreamt it's going to be up $33 million this year.\n\nSo it was basically up in '22 what it was down in '21, so it's kind of flat for the two years. But based on what we're seeing in the pipeline right now, it looks like M&A is slowing down a little bit. Could that be because of the rising interest rates? Could it be due to inflation? I mean, I think, there's so many different factors that you could point to that's having an impact on the M&A environment.\n\nNik Cremo -- Credit Suisse -- Analyst\n\nUnderstood. Very helpful. Thank you.\n\nOperator\n\nOur next question comes from Ken Suchoski from Autonomous Research. Please go ahead with your question.\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nHi. Good morning, Kevin and Dave. Thanks for taking my question this morning. I wanted to follow up on those comments on Banno.\n\nCan you just talk about how much opportunity is left to go with those core customers? And then what does the opportunity look like with those noncore customers? How do we try to quantify that opportunity?\n\nDave Foss -- President and Chief Executive Officer\n\nYeah, that's a kind of a how big is big question, Ken. I'll do my best to answer that. So first off, inside the base, we have hundreds of customers who are not running Banno inside the base today. I would guess it's close to 1,000 probably existing core customers that are not running Banno today.\n\nSo lots and lots of opportunity inside the core base. And then when we get outside the core base, so think about the success that we've had with overall what we used to refer to as ProfitStars, of course, we don't use that brand anymore, but the whole goal there was to sell to non-Jack Henry core customers. And we have roughly 7,000 banks and credit unions that we've sold a variety of different noncore solutions to, to customers who are not running a Jack and Henry core, but they are running other things. So we have that base of 7,000 banks and credit unions that are already doing something with Jack Henry that's noncore that we can go and mine.\n\nThey already know us. We have a relationship with them. We can go and mine that base with new sales opportunities once we have Banno ready to go outside the base. So there's a tremendous opportunity.\n\nThe other thing I'll stress is, I've said on the call over and over, almost any bank or credit union in the United States today is running a mobile banking solution and an Internet banking solution, and they look totally different. They function totally different. They are not the same system. Banno eliminates that concern.\n\nBanno is a single platform so the user experience is consistent, whether you're on your phone or your laptop. And banks and credit unions want to move in that direction. So there's a motivator there for them to want to go in that direction, we just need to get that delivered outside the base.\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nOK. Great. And then I wanted to ask about consolidating the brands and the opportunity there. David, I believe you mentioned that you're going to operate as one company, and I think your comments were it leads to a better client experience.\n\nCan you just talk about how you think that might impact your sales performance, your revenue growth and I guess retention rates across your customer base?\n\nDave Foss -- President and Chief Executive Officer\n\nSure. Yeah, so we're very excited about this adjustment. We have made the announcement on August 1, so just a couple of weeks ago. And it ties in -- so a few key points to this.\n\nNumber one, we now can eliminate any of the marketing expense associated with supporting several different brands. So there's a logical expense cost savings there when you move to one brand. But more importantly, I think, we've had this initiative that we call One Jack Henry in play for about a year or two now. Greg Adelson, our president, talked about it at the May Investor Conference.\n\nAnd it's been this push that we've had toward delivering a more consistent experience for our customers. In the past, with the three different brands, there's kind of this natural thought that the different brands are almost like different companies. And so moving toward one brand, one company, consistent processes, consistent experience for our customers and certainly for our prospects, we believe will aid us not only on the expense side, but on the sales side, will help when it comes to a customer perception of our company and making sure that any existing customer gives a really positive referral to a prospective customer around doing business with Jack Henry. So I would say, some of you published studies on our customer sat ratings.\n\nWe report them regularly. Jack Henry has the highest customer satisfaction ratings in our industry. The one thing that we get knocked on once in a while has been, well, you kind of operate like separate companies. Well, with this project, we hope to eliminate that concern.\n\nAnd then overall, we'll have the highest customer sat ratings by far.\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nGreat. Thank you very much, David. Appreciate the thoughts, as always, and Kevin, congrats on your retirement.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nThanks, Ken.\n\nOperator\n\n[Operator instructions] Our next question comes from James Faucette from Morgan Stanley. Please go ahead with your question.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nHey. Good morning, everybody. And thanks for all the commentary. I wanted to go back to Banno.\n\nAnd you talked about like how you -- the great resignation is impacting a bit the release dates, but also found your commentary around the market and where you think you'll see early traction and how that will evolve interesting. How about, from a feature and future development perspective, how much future development do you think needs to evolve to address the different market opportunities that you're looking at for that platform and capabilities? And how does kind of staffing and those kinds of things impact adding those features and maturing them?\n\nDave Foss -- President and Chief Executive Officer\n\nYeah. It's an interesting question, James. When you're in this business, the request for new features never stops, right? As soon as you get to where you think you get everybody beat, somebody comes up with another idea. And it sure would be nice if you would do x.\n\nSo that's an ongoing project. The good news for us is, we know on the consumer side, with what we have in market today, we know that we have a tremendous solution that beats pretty much any competitor on the consumer side. The only missing piece has been for commercial customers with Banno business. So we're very confident that once we get Banno business in market, we're going to have a terrific solution to compete with anybody.\n\nBut you can't ever expect that you're going to stop developing new features, adding new features, adding enhancements to a solution like that because not only does our customer demand increase, but their customers are demanding more functionality through a platform like that. They want to be able to do more things through a platform like that. So that's an ongoing commitment for us for -- I don't want to say forever, but forever is a long time, but it will go on for a very long time. The really good news is the whole tech modernization strategy that we've been talking about is built on that same platform that Banno is on.\n\nAnd so anything that we do in the future with Banno kind of adds to the overall story of the tech modernization offering that we'll have from Jack Henry. And so it just continues to bolster what we've been talking about as the future of technology for financial institutions.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nAnd then what is your sense -- I mean, it's an interesting period and one that a lot of us aren't familiar with in terms of like prices, price changes and increases and the general inflation. How does that impact or how are you expecting that will impact the pricing discussions in that part of the selling motion, even for your products? And obviously, what's the competitive environment associated with that look like?\n\nDave Foss -- President and Chief Executive Officer\n\nYeah, the competitive environment has not changed. And we've talked about it before, pretty much any large purchase in our space today. Customers banks and credit unions will involve a consultant, and the consultant's role in that engagement is not only to do the comparison of one product to another, but it is to negotiate price. And so regardless of what's happening in the economy, the consultant is there to try and make sure that they squeeze every opportunity out of the engagement that they can.\n\nSo I can't say that anything dramatic has changed as a result of what's happening in the general economy when it comes to customer expectation or consultant expectation. And I don't think anything is going to change. The opportunity for us when it comes to pricing is by offering an enhanced solution, a differentiated solution, kind of back to your first question, right? The more we add to these platforms that are differentiated from our competitors, that's where the opportunity is to charge more because then we're not -- then it's not just table stakes. It's not just which solution looks better, it's which one really functions better.\n\nAnd today, Banno has that reputation. And so that's our opportunity and our challenge is to make sure that we continue to stay ahead of the pack as far as feature function because that's where customers will pay you more.\n\nOperator\n\nAnd our next question is a follow-up from Dominick Gabriele from Oppenheimer. Please go ahead with your follow-up.\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nHey. Great. Thanks. I just wanted to talk to you about the guidance on the revenue growth and how we should -- how investors should think about.\n\nIn the investor day, I think there was a slide that said the long-term revenue growth expectation between 8.5% and 9%, and then we're kind of maybe roughly 50 basis points below that for '23. Is there any way you could help us walk between those two points, new customer sales and all those various waterfall features that is creating the delta? Thanks so much.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nWell, I mean, you're absolutely right. I mean, at the Analyst Day, I've said eight and a half to nine, and we're right at the eight and a half. So yes, we're on the low end of that. But considering the year that we're coming off of with the huge growth we had of almost 9% in '22, I mean, it makes for a pretty tough comp.\n\nSo I mean, if we can grow eight and a half percent in '23 compared to '22, I mean, I'm thinking for a company that's 90-plus percent recurring revenue, that's a pretty good feat to grow at that pace. Obviously, can we grow -- get back to 9% in '24? I would hope so, but my crystal ball is a little foggy going out that far.\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nSure, and that makes sense. And congrats on all the wins this quarter too.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nYou bet. Thank you.\n\nOperator\n\nAnd ladies and gentlemen, with that, we'll conclude today's question-and-answer session. I'd like to turn the floor back over to Kevin Williams for any closing remarks.\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nThanks, Jamie. Obviously, we're very pleased with the results of our ongoing operations, and we are excited for the future with everything that -- all the new deals that we've signed in the previous quarter. I want to thank all of our associates for the way they have handled these challenges by taking care of themselves and our customers and continuing to work hard to improve our company to continue moving forward for the future. All of us at Jack Henry continue to focus on what is best for our customers and our shareholders.\n\nI want to thank you again for joining us today. And Jamie, with that, would you please provide the replay number.\n\nOperator\n\nAnd ladies and gentlemen, with that, we will conclude the conference call today. To access the digital replay of this conference, you may dial 1877-344-7529 or 412-317-0088, beginning approximately one hour after the conclusion of today's event. You'll be prompted to enter a conference number, which will be 2792074. Please record your name and company when joining.\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKevin Williams -- Chief Financial Officer and Treasurer\n\nDave Foss -- President and Chief Executive Officer\n\nVasu Govil -- Keefe, Bruyette and Woods -- Analyst\n\nRayna Kumar -- Evercore ISI -- Analyst\n\nJohn Davis -- Raymond James -- Analyst\n\nPete Heckmann -- D.A. Davidson -- Analyst\n\nDave Koning -- Robert W. Baird and Company -- Analyst\n\nCharles Nabhan -- Stephens, Inc. -- Analyst\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nNik Cremo -- Credit Suisse -- Analyst\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nMore JKHY analysis\n\nAll earnings call transcripts"
}