{
  "companyName": "Domo",
  "companyTicker": "DOMO",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/08/domo-domo-q3-2023-earnings-call-transcript/",
  "content": "Domo (DOMO -0.77%)\nQ3 2023 Earnings Call\nDec 08, 2022, 5:00 p.m. ET\n\nOperator\n\nHello, everyone, and welcome to the Domo Q3 fiscal year 2023 earnings call. Today's call is being recorded. All lines have been placed on mute to prevent any background noise. And after the speakers' remarks, there will be a question-and-answer session.\n\n[Operator instructions] And I would now like to turn the conference over to Peter Lowry. Please go ahead.\n\nPeter Lowry -- Vice President, Investor Relations\n\nGood afternoon, and welcome. On the call today, we have John Mellor, our CEO; Bruce Felt, our CFO; and Julie Kehoe, our chief communications officer. Julie will lead off their safe harbor statement and then on to the call. Julie?\n\nJulie Kehoe -- Chief Communications Officer\n\nOur press release was issued after the market close and is posted on the Investor Relations section of our website, where this call is also being webcast. Statements made on this call include forward-looking statements related to our business under federal securities laws, including statements about financial projections, the plans, and expectations for our go-to-market strategy, our expectations for our sales and new business initiatives, the impact of the macroeconomic and other conditions on our business and our financial condition. These statements are subject to a variety of risks, uncertainties, and assumptions. For a discussion of these risks and uncertainties, please refer to the documents we file with the SEC, in particular, today's press release, our most recently filed annual report on Form 10-K and our most recently filed quarterly report on Form 10-Q.\n\nThese documents contain and identify important risk factors and other information that may cause our actual results to differ materially from those contained in our forward-looking statements. In addition, during today's call, we will discuss non-GAAP financial measures, which we believe are useful as supplemental measures of Domo's performance. Other than revenue, unless otherwise stated, we will be discussing our results of operations on a non-GAAP basis. These non-GAAP measures should be considered in addition to and not as a substitute for or in isolation from GAAP results.\n\nPlease refer to the tables in our earnings press release for a reconciliation of our non-GAAP financial measures to their most directly comparable GAAP measures. With that, I'll turn it over to John.\n\nJohn Mellor -- Chief Strategy Officer\n\nThank you very much, Julie, and thanks to everyone for joining us on today's call. Before I discuss our third quarter performance, I want to recognize Bruce and discuss the CFO transition we announced today. After eight years at Domo, The Bruce will be transitioning out as Domo's CFO. Bruce and I have discussed his next chapter for some time now, and we're grateful that he'll continue in his role until a successor is named.\n\nBruce is an active part of the search team to find a replacement and is committed to a seamless transition once a successor is identified. Everyone on this call is familiar with Bruce and his many successes, both before and at Domo, and I want to know what a strong partner he has been to me, our board, and our leadership team and the important role he has played in our success. In addition to helping advance our strategy, Bruce has elevated the entire finance function at Domo and helped us successfully navigate through the pandemic. I know I speak on behalf of everyone here in saying that we're grateful for his leadership and dedication, and I'm personally appreciative of his support during my first year as CEO.\n\nAlong with the CFO succession planning, I'm working closely with our executive team during our fiscal year '24 planning cycle to determine ways to optimize our business and leadership so that we can better serve our customers and operate more efficiently. It's important that we run lean and stay agile. And I look forward to sharing more details as planning evolves over the coming months, and we assess our needs and plans for fiscal year '24. With that, let's dive into our third-quarter results.\n\nIn Q3, our total revenue growth was 21%. Our subscription revenue growth was 22%, and our billings growth was 5%, and I'm particularly pleased that for the first time in the company's history, we achieved a positive non-GAAP operating margin. This underscores our ongoing commitment to operate efficiently and prudently as a business. I'm also pleased with the progress we have made in the sales organization.\n\nSales rep attrition has slowed. We have brought renewed consistency and rigor to pipeline management and both the size and quality of the pipeline have improved. Based on the changes we announced last quarter, we've seen good production from our corporate sales team where we are putting incremental focus. Additionally, we're seeing progress from our enterprise team in new logo and upsell opportunities and continue to provide transformational experiences for some of the largest companies in the world.\n\nI also want to recognize the tremendous work from our customer success organization, who help customers realize value from their investment in Domo in ways that truly transform how their businesses run. In Q3, our customer success team achieved a gross retention rate of over 90%, which is a strong testament to our team's commitment to customer success and the power of the Domo product. In terms of the macro environment, we're seeing deals more scrutinized and slowed, resulting in our seeing some early signs of pipeline aging with accounts of all sizes. We aren't yet clear on how long this trend will continue, but we're keeping a close eye on it.\n\nRegardless, we don't see this as a reflection of Domo's value proposition as our win rates remain consistently strong, and we continue to see strong top-of-funnel demand. With today's market conditions, whether it be the macroeconomy, supply chain issues, or shifting business priorities, companies are faced with how to optimize their existing processes and how to do more with less, particularly with how they drive action with real-time data in their organizations. Companies are looking for technology solutions that provide a compelling business impact and do so in record time. We integrate, manage, and make data actionable by putting it in the hands of an organization's employees, customers and partners through self-serve analytics and apps that optimize business process workflows so everyone in the organization can drive better outcomes in the time and place where work gets done.\n\nDomo delivers this rapid time to value for companies in all stages of maturity. For companies earlier in these stages, instead of separately sourcing, managing, and integrating multiple point solutions for data connection, storage, integration, and delivery, Domo provides a pre-integrated end-to-end cloud-native platform to rapidly address business problems without the need to stitch together multiple solutions. And for companies further along in their maturity that have existing infrastructure investments, Domo can be plugged in to rapidly fill the gaps they have and leverage their existing systems without having to rip and replace existing technology. Today's organizations are looking to do more with less, faster, which is right in Domo's sweet spot.\n\nNow, let me talk about some customer success stories and Q3 customer highlights. In September, I was able to attend Domopalooza Japan, and it was so exciting to hear the customer success stories coming from that market. For example, we heard from Rakuten, Japan's largest e-commerce retailer and our first customer in Japan, which was also recently named by LinkedIn as the No. 1 place to work in that country.\n\nRakuten is committed to a data-driven culture. In fact, LinkedIn highlighted the three top skills that Rakuten employees must know as English, Kubernetes, and Domo. When we spoke to Rakuten at Domopalooza, we talked a lot about their data democratization journey, and how it's designed to help them better serve their 1.6 billion customers all over the world and to better run the business. Stories like this validate the value we deliver to some of the largest companies in the world.\n\nAs far as Q3 highlights, one significant win in the quarter was a seven-figure ELA upsell with a Fortune 50 healthcare company to provide improved data access across the organization. This company's contract value is now 12 times the size of our initial contract from 2015, showing the power of Domo as it spreads across an organization to literally tens of thousands of people who are touched by Domo via apps. Another significant win was with a large bank in our APAC region, this was a POC, including services contract over $500,000 to support their development of an app that would allow its marketing team to optimize billions of dollars of marketing spend through a multichannel attribution solution using Domo and our data science offering. And a significant new logo win was with a North American construction management software company.\n\nThis company had been using one of our primary legacy competitors' solutions to provide analytics for several dozen of its customers but could not scale or even support these customers due to product limitations and wanted to provide analytics to its tens of thousands of additional customers. The company chose Domo and our Domo Everywhere solution to monetize and provide better, more scalable self-service and customizable analytics for their customers. Domo Everywhere, which allows our customers to share data with their customers and partners, continues to be a highly differentiated offering that allows customers to securely extend the full power of Domo to external parties, expanding adoption beyond just their internal use cases. Before I hand this over to Bruce, I have a few more business highlights I want to touch on.\n\nWe continue to receive validation from industry analysts of the strength of our technology and our ability to deliver speed to value for our customers. In Q3, Domo was named Customers' Choice in Gartner's Peer Insights Voice of the Customer report for analytics and business intelligence. Domo was also ranked a technology and credibility leader in Dresner Advisory Services 2022 small and mid-sized enterprise business intelligence market study. This marks the sixth time Domo has received this distinction.\n\nIn Q3, we, along with our customer, Walker Edison, received a Nucleus Research Award for achieving a total ROI of 1,670%, with a payback period of less than a month through Walker Edison's adoption of Domo's low-code data app platform. Walker Edison, a global furniture company runs its entire business on Domo and gives everyone across its organization access to the insights they need to help the business move more quickly and compete against larger players. Third, culture is critically important to us as we look to build a workplace where the best talent thrives. I am pleased that during the quarter, Monica Pool Knox joined us as Chief People Officer.\n\nMonica has provided strategic HR leadership for companies such as Microsoft, PepsiCo, Sony, and the Walt Disney Company, bringing a depth of experience to help build our organization for long-term sustained growth. In closing, I'm pleased with the progress we have made in the sales organization in Q3. We continue to drive tremendous business value for our customers, large and small, and we plan to continue to do so in any economic environment. Now, I'll hand it over to Bruce.\n\nBruce Felt -- Chief Financial Officer\n\nThanks, John, for the kind words earlier. It's been a privilege to work alongside John, our executive leadership team, and all the incredible people at Domo. I'm very proud of our finance organization and the best-in-class practices that we've put in place. We've accomplished a lot in the last eight years.\n\nAnd the timing is right for me personally. As John mentioned, I've committed to facilitating a smooth transition once my successor is named, and I look forward to maintaining our momentum through that process. Now, let's turn to our results. I think it is appropriate to lead with the milestone of Domo reaching non-GAAP operating margin positive status in Q3.\n\nThe combination of our top-line performance and expense management allowed us to sequentially increase our net -- our non-GAAP operating margin by almost 800 basis points. We have been disciplined in our expense management as evidenced by our cost reduction efforts last quarter and have been careful with any new spending initiatives and net new headcount. We have also begun to hire directly in low-cost geographies as a new method to continue to staff strategic initiatives but do so in a much more cost-effective manner. We are in a good position to generate positive operating margin in Q4 and for the full-year fiscal '24.\n\nIn Q3, we posted 5% billings growth and 22% subscription revenue growth. The results in the quarter were driven primarily by sales to our corporate customers, which experienced 31% revenue growth, consistent with Q2. Revenue from our enterprise customers experienced 13% growth, up from 10% in Q2. Fluctuations in FX had a 2% negative impact on our billings growth and about a 2.5% negative impact on our revenue growth, primarily due to the strengthening of the U.S.\n\ndollar against the Japanese yen. We delivered Q3 billings of $74 million, a year-over-year increase of 5%. I am pleased that our gross retention rate was above 90%, and up from Q2 as this represents durability and stickiness within our customer base, which should be a protector of growth should we enter into a recession. Net retention on a contracted ARR basis was above 105%, down slightly from Q2.\n\nOur current RPO of $230.3 million grew 21% year over year, while our total RPO grew 19% to $354.3 million. On a dollar-weighted measure, we now have 65% of our customers under multiyear contracts at the end of Q3, up from 61% a year ago. Q3 total revenue was $79 million, a year-over-year increase of 21%. Subscription revenue grew 22% year over year, representing 87% of total revenue and was slightly down from 23% growth in Q2.\n\nInternational revenue in the quarter represented 22% of total revenue, consistent with Q2. Services and other revenue was up 18% year over year in Q3, driven by increased billable hours and the delivery of more custom data apps. Our subscription gross margin was 84.5%, up 1.7 percentage points from Q3 of last year and down 0.7 percentage points from Q2. In Q3, our operating costs were down from Q2 as a result of our recent cost reductions.\n\nOur non-GAAP operating margin was up 11.4 percentage points from a year ago. Our net loss was $4.5 million, down from $10.3 million a year ago, and our net loss per share was $0.13. This is based on 34.4 million weighted average shares outstanding, basic and diluted. In Q3, cash used in operations was $6.5 million, in part from the cash payments resulting from our Q3 cost reductions and also slower cash collections from our customers that we attribute to the macro.\n\nOur cash balance declined $8.8 million from last quarter to approximately $71 million. We expect Q4 cash flow from operations to be negative but an improvement from Q3 and we expect Q1 fiscal year '24 cash flow from operations to be positive. Given our focus on costs and managing the positive operating income, we believe we have enough cash on the balance sheet to allow us to meet our long-term financial objectives. For Q4, we're guiding to billings of about $107 million.\n\nAs we mentioned on our last call, our near-term billings growth is being impacted by temporarily reduced quota capacity that we're in the process of increasing. We're being cautious in our billings outlook as we increase our capacity and at the same time are aware of potential macro headwinds. We have specifically reduced the number and amount of large deals in this Q4 outlook compared to the same quarter last year. During the last two months, we have seen a significant improvement in sales rep turnover.\n\nSo, we're on the right path. Our guidance implies full-year billings growth of about 10% year over year, down from our previous guidance of about 13%. Now, the guidance for our GAAP metrics. For the fourth quarter of fiscal year '23, we expect GAAP revenue to be in the range of $77 million to $78 million, we expect non-GAAP net loss per share, basic and diluted, of $0.07 to $0.11.\n\nThis assumes 34.7 million weighted average shares outstanding, basic and diluted. For the full year of fiscal '23, we expect GAAP revenue to be in the range of $306 million to $307 million, representing year-over-year growth of 19%. We expect non-GAAP net loss per share, basic and diluted of $0.68 to $0.72. This assumes 34.1 million weighted average shares outstanding, basic and diluted.\n\nLooking ahead to fiscal 2024, although we're early in the planning process, we are very focused on managing profitability with reasonable growth. Our outlook assumes we will see some macroeconomic headwinds next year. And therefore, we're being cautious with our spending plans and will meter our investments based on our near-term outlook. We still plan to increase sales capacity, but with a greater emphasis on ramping reps we have recently hired rather than aggressive new hiring.\n\nAnd so, rep additions will be -- likely be below historical levels next year. Based on our caution around an economic slowdown and a lower-than-previously planned sales capacity, we're providing a preliminary revenue growth outlook for fiscal year 2024 of about 10%. For fiscal year 2024, we're also planning for positive non-GAAP operating margin for the year. In closing, we're pleased that we were able to achieve a positive non-GAAP operating margin in Q3 and believe we're well-positioned to manage our near-term growth in a manner that allows us to meet our profitability targets.\n\nWith that, we'll open the call for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question will come from Sanjit Singh with Morgan Stanley. Please go ahead.\n\nTheo Thun -- Morgan Stanley -- Analyst\n\nHi there. Thank you so much. This is Theo on for Sanjit. Just to start off with the billings number maybe.\n\nAny detail on how much lower was billings growth this quarter due to the sales capacity versus the macro having an impact? And then I have a follow-on.\n\nBruce Felt -- Chief Financial Officer\n\nI would say the major driver for the numbers this year has been sales capacity. It is down from our targets. And the quota assignment that's out is lower than we had originally planned by a significant amount, actually. So, that's the big driver.\n\nThe macro is more of an overlay that we are observing certain behaviors from some of our customers, particularly, the large customers that just seem to be much more reluctant to step into larger deals. We're seeing on the edge a little bit slower collections, not necessarily bad debt is another one. But the smaller customers seem to be buying a reasonably good velocity at this point. So, I'd say, yes, there's macro.\n\nThere's definitely a macro overlay to everything we're seeing. But it's -- for this year, really, the impact has been based on sales capacity.\n\nTheo Thun -- Morgan Stanley -- Analyst\n\nOK. Great. That makes sense. Thank you.\n\nAnd then on the collections point, maybe just sort of thinking through fiscal year '21, and thanks for providing the guidance there. How do you sort of think about collections into next year? And I'm specifically asking to get a sense for free cash flow next year now that you guided to operating margins positive.\n\nBruce Felt -- Chief Financial Officer\n\nYeah. We're set up, actually, pretty well, could be cash flow positive next year. I mean, the cost cuts we did last quarter definitely benefited this quarter, will benefit Q4. And we're taking a much more cautious posture on spending, not so much that we still aren't building sales capacity, but kind of spending in other areas.\n\nAnd that really leads to having a nice Q4 in billings. That's just a seasonally high number against modest increases in spending, in some cases, decreases. That really sets up Q1 to be a pretty good cash flow quarter. And then I think the whole year is set up pretty well as well.\n\nTheo Thun -- Morgan Stanley -- Analyst\n\nThank you so much.\n\nOperator\n\nOur next question will come from Derrick Wood with Cowen. Please go ahead.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nThanks. Well, Bruce, you did it again on the profitability side, congrats. It's been a long haul on that, and you'll be missed. It's been a fun ride, good luck in your next venture.\n\nBack on the sales side, it sounds like you've been a little bit under-planned. Where do we stand today in kind of turnover trends? And can you just give us a sense of kind of what the level of productive sales capacity growth is today or what you're expecting exiting Q4?\n\nJohn Mellor -- Chief Strategy Officer\n\nHey, Derrick, this is John. Thanks for the question. I'll give a little bit of color and then hand it over to Bruce. I think the sales organization -- and Ian has done a great job of managing the attrition there.\n\nI think we've seen that stabilize and get much more positive in the last couple of months. So, that team is building. And just the rigor around pipeline management, hygiene of prospecting activities, things like sales blitzes. It's just a -- it's a muscle that we're digesting first half and really getting the rigor muscle back in place.\n\nAnd on the demand side, we continue to see strong demand. The top of funnel is working. Pipeline is healthy. It's as strong as it's ever been, frankly.\n\nSo, we feel like the demand environment is strong and the sales execution is really getting to where we want it. I'll let Bruce comment on the rep numbers.\n\nBruce Felt -- Chief Financial Officer\n\nWe're actually still building sales capacity on the one hand with the metric that we call ramped sales heads. One of the challenges we have on the numbers is, however, we kind of had a mix change in the business in favor of the corporate sales reps, and they just generally have lower quotas. So, from a headcount view, we're doing fine, we just have to work that through the system and rebalance in a way where we have the kind of the quoted capacity at the street to be commensurate with the headcount. And we do have plans to get that rebalance kind of as we go into next year.\n\nAnd while I'm at it, we think we're in a good position to really get the enterprise being a much bigger contributor to us next year. We have great reps that are here. They know their accounts well, extremely engaged. The value proposition seems to be showing even better in this economy, even though we have to deal with the budget challenges of our customers on the one hand.\n\nBut we have the right kind of architecture and approach and the modern BI that's just going to play well. And we think the large enterprises can actually be a tailwind to us next year. So, yes, we look forward to getting into next year.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nWow. I was going to ask a question about the enterprise. I didn't expect that answer. That's good to hear.\n\nBut I imagine that -- when I'm looking at your Q4 guidance, I mean, you have revenue down sequentially. Maybe there's some professional services volatility in there. But is it fair to say -- I mean, how come we're not seeing more seasonal strength in revenue in Q4? Is it just because you don't have the level of enterprise business, which is typically a big Q4 seasonality as you did a year ago, and so that's a tougher comp, but once we get through that, we should start to see it better in second half? Maybe you can walk through the puts and takes on the Q4 guide for revenue.\n\nBruce Felt -- Chief Financial Officer\n\nTwo main items to me. One, we're being very cautious in the new business and the contribution of new business and the revenue contribution. Well, I'll even add to that, even being cautious in the renewal rates and the revenue we get out of that. We think this is just that prudent.\n\nIt's prudent to do so given these numbers are quite large going into Q4. And then we don't have factored in the same number of like service delivery hours and app delivery. It's possible if it is commensurate with what we've seen just recently, there's some upside there, but it's not baked into the number as we sit here right now. So, that's why it's really services-driven, I would say, in terms of like what's really causing that.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGot it. OK. Thank you for that.\n\nJohn Mellor -- Chief Strategy Officer\n\nTypically, a big deal quarter, and we're just -- we're being conservative when we look at these deals.\n\nBruce Felt -- Chief Financial Officer\n\nYes.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question will come from Pat Walravens with JMP Securities. Please go ahead.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you. Bruce, sorry to see you leave. When did you decide that it was time to leave?\n\nBruce Felt -- Chief Financial Officer\n\nThat has developed over time as I just assessed where I want to be, where Domo needs me to be, what I've accomplished. How much time I've been here, if you've counted it, eight years, that's a long time. But I'll also add, I mean, I just entered an agreement that goes on until about March 26. So, you can kind of argue I might actually be overdoing it by staying here.\n\nBut yes, it's been kind of a collaborative discussion I've been having with John and the team about, like, what's needed, what's the state of the business. And one of the things that we spent a lot of time was just the strength and the talent and the finance organization. And frankly, I kind of put myself out of the job, they're so good, so. But I'll be around for a while.\n\nI mean, I'm fully engaged here, and I have a vested interest in making sure the stock is, when I sell it, it's much higher than where it is here. And to be engaged gives me a better shot at influencing that than if I wasn't.\n\nPat Walravens -- JMP Securities -- Analyst\n\nAll right. Great. Thank you. And then, John, this is a tricky one, but we might as well address it.\n\nSo, Domo's agreement with Josh James expires on March 1, 2023. What should people expect and what key points would you make to investors?\n\nJohn Mellor -- Chief Strategy Officer\n\nYeah. I would say that the team that's here is really, really solid and focused on operating the business in a prudent way. I think this is a fantastic business. If you just look at the top lines of $300 million in recurring revenue, 90% retention, 80% gross margins, operating margin positive, that was a big, big milestone.\n\nSo, we're focused on running the business. We're not really trying to answer those questions right now with the team.\n\nPat Walravens -- JMP Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nAnd our next question will come from Eric Martinuzzi with Lake Street Capital Markets. Please go ahead.\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nI know it's still early days here. You talked about the 2024 planning process. But just curious to know if the -- if we're drafting a change in the sales compensation architecture, either kind of payouts for corporate or skewing that toward the front half of the year versus back half of the year. Any early thoughts on sales comp?\n\nJohn Mellor -- Chief Strategy Officer\n\nWe're right in the middle, I'd say at the planning process for next year, which is it's kind of exciting to be able to plan for next year and look at the progress we've made this year. And we want to be conservative. We want to be prudent for where we are in the macro environment, but also, we're pretty bullish on the value proposition that Domo brings to customers. I mean, we see it every single day with these customers, who are actually transforming how they do business with the Domo product, and we think that is a real significant positive in this environment.\n\nBruce Felt -- Chief Financial Officer\n\nYeah. And I'll add. The big mistake this year was in the sales reorg, so to speak, quotas were too high. The ability to get the business just wasn't where it needed to be for a set of reps to make their number, and that really has contributed to sales turnover.\n\nWe know that. We're planning next year. One of the principles is the sales guys have to make money or sales, men and women, have to make money. So, that's a given.\n\nAnd we're going to make sure that we have plans that do that. And by the way, sales reps that are listening to this, ignore this comment. This is for investors only. I'm only kidding.\n\nJohn Mellor -- Chief Strategy Officer\n\nWe love our sales reps.\n\nBruce Felt -- Chief Financial Officer\n\nBut we do need to make sure there's a structure where they get paid. I'm fully supportive of that, and I'm working with Ian and his sales reps team on making sure that's set up. And we're doing it early this year, too. So, we hope to get off to next year with a bang.\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nOK. And then I want to make sure I understand expectations for the operating expenses for Q4. And then, I guess, might as well address at least early on for Q1. Am I to understand that there's not an expectation that opex would rise with the potential incremental investment in sales force, or is it the variable part? We'd hope that would rise, what's the expectation for opex in Q4 and Q1?\n\nBruce Felt -- Chief Financial Officer\n\nYeah. We're focusing on non-GAAP operating margin. And expenses or revenue could flex a little bit, but the commitment we have is to make sure we hit our target and definitely be positive in Q4. And all our planning models are targeting positive in fiscal year '24.\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nOn a full-year basis but not necessarily on a quarter-by-quarter?\n\nBruce Felt -- Chief Financial Officer\n\nWell, we'll say full year for now. And when we get to like formal guidance at the end of Q4, we may provide some more color about how that could be divided among the quarters, between the quarters.\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nOK. Thanks for taking my questions.\n\nOperator\n\nAnd with no further questions, that will conclude today's conference. [Operator signoff]\n\nDuration: 0 minutes\n\nPeter Lowry -- Vice President, Investor Relations\n\nJulie Kehoe -- Chief Communications Officer\n\nJohn Mellor -- Chief Strategy Officer\n\nBruce Felt -- Chief Financial Officer\n\nTheo Thun -- Morgan Stanley -- Analyst\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nPat Walravens -- JMP Securities -- Analyst\n\nEric Martinuzzi -- Lake Street Capital Markets -- Analyst\n\nMore DOMO analysis\n\nAll earnings call transcripts"
}