{
  "companyName": "Boeing",
  "companyTicker": "BA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/boeing-ba-q3-2022-earnings-call-transcript/",
  "content": "Boeing (BA 0.84%)\nQ3 2022 Earnings Call\nOct 26, 2022, 10:30 a.m. ET\n\nOperator\n\nThank you for standing by. Good day, everyone, and welcome to The Boeing Company's third quarter 2022 earnings conference call. Today's call is being recorded. The management discussion and slide presentation, plus the analyst question-and-answer session are being broadcast live over the internet.\n\n[Operator instructions] At this time, for opening remarks and introductions, I'm turning the call over to Mr. Matt Welch, vice president of investor relations for The Boeing Company. Mr. Welch, please go ahead.\n\nMatt Welch -- Vice President, Investor Relations\n\nThank you, John, and good morning, everyone. Welcome to Boeing's third quarter 2022 earnings call. I am Matt Welch, and with me today are Dave Calhoun, Boeing's president and chief executive officer; and Brian West, Boeing's executive vice president and chief financial officer. As a reminder, you can follow today's broadcast and slide presentation through our website at boeing.com.\n\nAs always, we have provided detailed financial information in our press release issued earlier today. Projections, estimates, and goals we include in our discussions this morning involve risks, including those described in our SEC filings and in the forward-looking statement disclaimer at the end of this web presentation. In addition, we refer you to our earnings release and presentation for disclosures and reconciliation of certain non-GAAP measures. Now I will turn the call over to Dave Calhoun.\n\nDave Calhoun -- President and Chief Executive Officer\n\nMatt, thanks. Welcome to everybody. Thanks for joining us. I will acknowledge upfront that our plan's for the investor conference middle of next week.\n\nWe're looking forward to them. We hope we can give some guideposts for the forward look in The Boeing Company. So many of our comments today will be a little shorter than usual and focused strictly on the quarter. This quarter was a big one for us.\n\nWe hit a marker, a marker we've set since the beginning of our turnaround effort in the beginning of 2020, and that was to generate positive free cash flow. So we generated $2.9 billion in the quarter. That puts us on the path that we projected for 2022, which was positive. So again, a very important accomplishment for us and I think begins the real turning point for the company.\n\nAt the same time, we took a charge on our fixed-price development contracts. These are contracts that we have talked about now repeatedly on these calls. We believe, as we always do, that the charge that we took is meant to complete these contracts ultimately to deliver them to satisfy customers in the Air Force or the armed forces. And anyway, we're not embarrassed by them.\n\nThey are what they are, and we intend to deliver against these contracts and satisfy our customers. Without a doubt, and you've heard it from all of the earnings calls over the course of the week, the supply chain, inflation, labor shortages, macroeconomic challenges are challenging for everybody. That is reflected in these third quarter calls, Again, the charges in our fixed price development world, etc, all of that's embedded. We're not anticipating or suggesting that the supply chain world is going to get much better in the near term.\n\nWe expect it will continue to be challenged over the course of 2023. One of our problems is not demand. Demand is very strong. It's strong across the portfolio of products, and it's strong across the world with all of our customers.\n\nWhy? Because their demand is strong. Bookings in pretty much every geography is strong with the exception of China. But also there are concerns about the very supply constraints that we're all referring to, sort of force them to want to get in line and get their orders in so that they have the lift they need as the world returns to some normal state. What's our job in this supply constrained world? Well, we're in the factories.\n\nWe don't push the system too fast. We slow down when we have to and we try not to compound problems that may arise from the supply chain or from our own shops. We've added more than 10,000 people this year, and we are investing in training and development to accelerate their experience curve and improve our productivity over time. And we're driving stability in the supply chain.\n\nWe've introduced all kinds of on-site technology, digital tools to watch what they're doing, but also we've added people to those organizations that are more challenged than others. And we've increased inventory, safety stock wherever we can. Truth is it will still take time to normalize. And our objective in the investor conference that lies ahead is to give you that projection as to how and when we think that is likely to happen.\n\nDespite the challenges, I'm very pleased with the progress broadly. Our 87 deliveries have returned. It's a reflection on us focusing on the right things. Strict conformance with respect to our manufacturing processes is very important.\n\nWe've gotten it right, and the delivery process has started, and so far, so good. On the 737 MAX, return to service, again, philosophy is one at a time. 1 million revenue flights, exceptional schedule reliability, that's what we've experienced. And that is why the folks who have leaned into the MAX continue to lean into the MAX and continue to place orders with us.\n\nIn total, over the quarter, 227 orders for airplanes, WestJet, UPS, Cargolux, China Airlines, just a few, again, very strong. You probably have seen today, Alaska has upped their commitment to the MAX, and we greatly appreciate it from all of them. In a strong demand and yet supply constrained world, our inventory, the fixed -- finished goods inventory that we have is an asset, not a liability, and we use it to de-risk that delivery outlook. And as for China, we continue to derisk.\n\nThat's been our objective. We still would like to deliver airplanes to China. We continue to support our customers. We continue to support the regulator.\n\nAs we all know, the COVID restrictions and policies in China have reduced demand for airplanes in general. And we hope that is what is restricting the acceptance of our -- of the airplanes that they have on our tarmacs. But we also are clear eyed about the geopolitical risks that are out there, and we are not going to impart new risks on our investors, and we believe we can derisk what we have. We're progressing on our development programs, the -7, the -10, the 777-9, and the -8 freighter.\n\nAll of these are progressing well. As everybody knows, we are up against a deadline here at the end of the year. We remain confident that we can get an extension of that deadline because this is the safe answer. And we've heard from airlines, we've heard from pilots, we've heard from our workers, associates, and we know that the FAA has been putting in the work to certify these airplanes.\n\nSo we remain not just hopeful but confident that we can get this across the finish line. And then those airplanes, as many of you know, complete that narrow-body portfolio in a way that allows us to compete head-to-head with our important competitor, Airbus. BDS, Boeing Defense, yes, we have these fixed-price development challenges. But we have a rich portfolio.\n\nWe delivered four MH-139 Grey Wolf test aircraft to the U.S. Air Force. We received contracts for additional KC-46A tankers for both the U.S. Air Force and the Israeli Air Force.\n\nAnd despite the challenges on our real development programs that the tanker T-7 and MQ-25, we still remain confident in our long-term success and contribution to our cash flow. And then Boeing Services, BGS, just another very strong quarter. They're trying to keep up with demand the best they can. They delivered their 100th contracted 737-800 Boeing freighter conversion to AerCap.\n\nWe've got key awards in both commercial and defense customers and things are going well, and margins continue to expand. And then finally, we have not stopped investing in our foundational capabilities. We had some pretty good examples of that over the course of the quarter. We opened three advanced facilities across the country, composite fabrication, additive manufacturing, and an important autonomy investment alongside MIT just in Cambridge.\n\nAlso very excited about Wisk's unveiling of the world's first autonomous self-flying four-seat all-electric vertical takeoff and landing air taxi. There's a very bright future ahead for that. And with respect to autonomy and its advancement in the world of certification, it's a very, very important part of our strategy. So we're making great progress.\n\nI feel good about our turnaround. I do think the cash flow numbers in the quarter are, in fact, a marker for us. We've been focused on it. We will continue to manage the company on the basis of the cash economics that we support our investors with.\n\nAnd that'll be that. So I'm happy to turn it over to Brian now for some color on the quarter.\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nThanks, Dave, and good morning, everyone. Let's jump right in. Cash flow, as Dave mentioned is our primary financial metric and it was positive in the quarter. Operating cash flow was $3.2 billion and free cash flow was $2.9 billion, both up pretty significantly versus both prior year and prior quarter, essentially driven by higher deliveries and some receipt timing.\n\nRevenue, earnings both impacted by charges in our defense business, where we took a $2.8 billion hit across five fixed-price development programs, which I'll go into. The macro-environment challenges that Dave described required us to make certain adjustments, including a reassessment of future period cost forecasts. These adjustments are important to our go-forward momentum as we de-risk our defense portfolio and move to more predictable performance. And we still think about our performance in three parts and are positioning ourselves for an improving trajectory.\n\nFirst, we have reached important milestones across the business and made progress on commercial deliveries with the resumption of the 787 in August. Also, the 737 MAX return to service is largely complete, and we're derisking the near-term delivery skyline for China. Next, we started to see improvement in our primary financial metric of free cash flow. This third quarter performance puts us on track to be positive for both the second half and the full year of 2022.\n\nAnd finally, as we look to 2023, our operational and financial performance should continue to improve. Now the acceleration will not be as significant as previously anticipated, and our path to recovery is taking a bit longer than expected driven by the challenging macro environment. Longer term, there is a significant opportunity for our company to return to sustainable growth. As we liquidate the 37 and the 87 inventory, we improve execution on a de-risked BDS portfolio and achieve certification on the MAX, -7, the -10, and the 777X development programs.\n\nWe look forward to sharing our plans at our investor conference next week. Before getting into the financials, I want to make a few points on the current business environment. Slide 3. While the turnaround is taking a bit longer, one thing that remains strong is demand for airplanes, as the commercial market recovery is playing out better than expected.\n\nWe still see overall passenger traffic returning to 2019 levels in the 2023 to 2024 time frame. And although the economic indicators point to challenges ahead, this demand has proven resilient. In August, domestic traffic was at 85% of 2019 levels, led by the U.S., Europe, and Latin America. Going forward, the recovery will be driven by China domestic and international traffic, which remain below 2019 levels at 62% and 67%, respectively.\n\nIn aggregate, commercial passenger traffic was at 74% of 2019 levels. So even with economic headwinds, we see the strength of demand continuing as air traffic recovers to its historic levels. In Defense and Space, we see solid long-term markets, both domestically and internationally. In the U.S., there's broad support for increased defense spending in Congress to meet current challenges.\n\nAnd internationally, ongoing global tensions are driving our partners and our allies to announce plans for increased spending and additional capabilities for national defense, and we're working hard to support their needs. In services, our business is well-positioned with a broad set of offerings and will continue to benefit from the growing commercial fleet, a robust cargo market, and increasing defense budgets. Turning to the supply chain. Constraints continue to impact production in both our commercial and defense businesses.\n\nOn the commercial side, we're focused on a few key areas, namely engine deliveries, which is the primary constraint to 737 production rate stabilization and subsequent increases. Customers are counting on us to resolve the situation with our supply chain partners, and we will. We're taking actions to mitigate these impacts and support the supply chain. And as Dave described, we've increased our on-site presence at first-tier and sub-tier suppliers to support work movement and address industrywide shortages.\n\nAnd we're utilizing our own internal fabrication for surge capacity and managing safety stock inventory levels and increasing where necessary to protect risk. With overall healthy demand, finished goods inventory, and a diverse backlog, we feel well-positioned to navigate the current environment and are confident that our product lineup is well-suited to meet our customer needs. With that backdrop, let's turn to the financials on Slide 4. Third quarter revenue of $16 billion increased 4%.\n\nCore operating earnings were negative $3.1 billion, resulting in a loss per share of $6.18, largely driven by $2.8 billion of defense charges. We generated $3.2 billion of operating cash flow, a significant improvement from the same period last year, primarily due to higher commercial airplane deliveries and favorable receipt timing. Also, similar to the same period last year, we benefited from a tax refund of $1.5 billion in the quarter. Let's move to Commercial Airplanes on Slide 5.\n\nThird quarter revenue was $6.3 billion, up 40% primarily driven by the resumption of the 787 and higher 737 deliveries. Operating losses of $0.6 billion and the resulting negative margin rate reflect abnormal costs and period expenses. On the 87 program, we delivered nine airplanes in the quarter and have 115 airplanes in inventory. The pace of deliveries from inventory going forward will be based on finishing rework as well as customer fleet planning requirements.\n\nWe expect most of these airplanes to be delivered over the next two years. We continue to produce at low rate and will gradually return to five airplanes per month over time. Near term, the supply chain remains a key watch item for 87 production and deliveries. Longer term, with more than 400 airplanes in backlog, we anticipate higher production rates due to the expected wide-body market recovery.\n\nAs customers return to medium-term fleet planning, we continue to have positive discussions with our customers on the 87. We recorded $330 million of 87 abnormal costs in the quarter, in line with expectations, and we still anticipate a total of about $2 billion, the most be incurred by the end of 2023. These costs are driven by rework and production rates below five per month. Moving on to the 37 program.\n\nWe delivered 88 airplanes in the quarter, below our previous expectations, primarily due to supply chain disruptions, which impacted factory flow time. We continue to work toward stabilizing deliveries. However, given our delivery to date, we now estimate about 375 737 airplanes this year. The monthly delivery trend is expected to remain in the low-30s into next year.\n\nWe ended the quarter with 270 MAX airplanes in inventory, down 20 versus last quarter. There were 35 deliveries out of storage, largely in line with our plan, but we also began positioning for MAX 7 deliveries and built 13 airplanes in the quarter. Of the inventoried airplanes, 138 are for customers in China. We continue to explore options to remarket some of these airplanes as we derisk our near-term delivery plan.\n\nBased on our latest assessment of China and the -7, -10 certification time lines, we now expect most of the inventoried airplanes to deliver in 2023 and 2024 with some moving into 2025. Moving on to the 777-9 program. Development efforts are ongoing and the program time line is unchanged from what we shared last quarter. We still anticipate delivery of the first 777-9 airplane in 2025 and continue to coordinate with the FAA to prioritize resources across our development programs.\n\nWe booked $111 million of 777X abnormal costs in the third quarter, in line with our expectations, and we still expect to record about $1.5 billion of these costs through 2023, while 777-9 production remains paused. During the quarter, we booked 227 commercial airplane orders. As Dave mentioned, the customers we are proud to serve. In September alone, we received orders for each of our programs, including the 737 MAX, the 767, 787, 777, 777X.\n\nAnd at the end of the third quarter, we had over 4,300 airplanes in backlog valued at $307 billion. Let's now move to Defense, Space, and Security on Slide 6. Third quarter revenue was $5.3 billion, down 20%, and operating margin was negative 52.7%. Results were driven by approximately $2.8 billion of losses on certain fixed-price development programs.\n\nKC-46A and VC-25B made up the bulk of these charges at $1.2 billion and $766 million, respectively. We also recorded losses on T-7A, MQ-25, and commercial crude programs and saw pressures across other programs. These losses reflect a comprehensive review of program financial estimates. While some changes resulted from new information or developments during the quarter, others were the result of our most recent assessment of estimated future performance.\n\nAdjustments were primarily due to higher estimated manufacturing and supply chain costs as well as technical challenges, which are expected to continue longer than anticipated. The cash impact of the losses we recorded year-to-date are now heavily weighted in the near term, resulting in a cash flow usage at BDS for both 2022 and 2023. While current performance doesn't reflect where we'd like to be, for sure, we're focused on driving execution stability. These programs have an outsized impact on BDS margins and will be key to margin recovery in future periods.\n\nOn the demand side, we received $5 billion in orders during the quarter, including tanker awards from both, the U.S. and Israel, resulting in BDS backlog of $55 billion. Additionally, the Apache helicopter has been selected by the Polish military. Now let's turn to Global Services results on Slide 7.\n\nThe Global Services business had another strong quarter, primarily driven by our parts and distribution business. Third quarter revenue was $4.4 billion, up 5%, and operating margin was 16.5%. Results were driven by higher commercial volume and favorable mix, partially offset by lower government volume. We received $5 billion in orders during the quarter, including a tanker support contract for the Italian Air Force and an F/A-18 depot expansion contract.\n\nThe BGS backlog is $19 billion. With highly valued commercial capabilities and support for our defense portfolio, our service business is positioned to see continued growth. Based on what we've seen so far this year, we anticipate healthy total services top-line growth for 2022 and similar growth in 2023. Now let's turn to Slide 8 and cover cash and debt.\n\nWe ended the third quarter with strong liquidity with $14.3 billion of cash and marketable securities on the balance sheet, an improvement of $2.9 billion since the end of the second quarter driven by free, cash flow generation. During the quarter, due to our improving cash flow and business outlook, we chose to reduce the size of our revolving credit facility capacity from $14.7 billion to $12 billion, which remains undrawn. Year-to-date operating cash flow was a generation of $55 million, and free cash flow usage year-to-date was $841 million. We expect our primary financial metric, free cash flow, to be positive for the fourth quarter and the full year, driven by commercial deliveries.\n\nOur debt balance is consistent with the end of the last quarter at $57.2 billion. Our investment-grade credit rating is a priority, and we remain committed to reducing debt levels through strong cash flow generation over time. In conclusion, while we have more work to do, we're executing on our turnaround, and we've come quite a long way over the last three years. We remain focused on our own performance and taking the right actions to drive stability and growth for the future.\n\nWe also continue to invest in key capabilities that will lay the foundation for the future. And through it all, our team is demonstrating exceptional resilience and dedication. More work ahead, but we're confident that we're on the right path. With that, over to Dave for closing comments.\n\nDave Calhoun -- President and Chief Executive Officer\n\nYes. I'll keep it short and sweet. We're on a turnaround. We've been on a turnaround.\n\nWe've made very important progress with our regulators. We've made very important progress with our customers and even more importantly, the flying public. And now we're wrestling through supply chain constraints. And when we get through it all, we'll get back to normal and ultimately deliver what our shareholders are expecting.\n\nSo I'll leave it at that and open up to questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Sheila Kahyaoglu with Jefferies. Please go ahead.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nHey. Good morning, Dave and Brian.\n\nDave Calhoun -- President and Chief Executive Officer\n\nHi, Sheila.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nHi. You started the call with comments around the supply chain challenges that you're seeing, and you talked about it lasting through 2023. And it doesn't seem inventories issue, and it's mostly engine. So what sort of steps is the team taking to work with suppliers to resolve these risks? And how do you expect it to impact the output and, ultimately, deliveries? I think you mentioned low-30s through next year on the next.\n\nHistorically, you've said eight to 10 out of inventory. So how do we think about the production pipeline there?\n\nDave Calhoun -- President and Chief Executive Officer\n\nWell, that -- let me start with steps. So I'll let Brian maybe quantify best he can. But I -- the steps are they're as clear as they can be. We've been talking about this for quite a while.\n\nWe get on regular calls with our counterparts at the engine suppliers. And as you know, in our case, it's predominantly CFM and then GE broadly across the wide-body fleet, etc. So we literally go down through all of those schedules. It inevitably comes down to castings and the support that they get from the two big casting suppliers.\n\nSo the best thing I can say now is that we are clearly on the same page, ourselves and our suppliers. We are taking steps to increase at a very gradual and, I hope, a disciplined way, the increase in rate with respect to castings and then ultimately from engines to us. I don't want to predict outcomes on that front. I think the most important thing is we're not being surprised as frequently as we used to be, and I do think that the engine suppliers are getting their heads -- their arms around things in a much better way than they had previously.\n\nSo that's really the situation as it is. I am confident that the industry will step up, but it will take more time than I probably had hoped when we started these conversations. And I suspect it won't be until we get to the sort of end of next year before we can really make sizable rate increases with respect to that constraint. Brian?\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nAnd what I would say is that my comment on being in the low-30s, year to date, we've been in the low-30s. And as we turn the quarter into next year, that all of a sudden is going to snap up to a 40-type number. So it's going into the year. We're going to be constrained, as Dave mentioned, largely by the engines, and will be that low-30s.\n\nBut as we get through next year, that rate will go up. And we'll talk a lot more about that next week.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nNext we go to Myles Walton with Wolfe Research. Please go ahead.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nThanks. Good morning. I'm wondering on the defense charge. Obviously, we've gone through a number of these, but they sort of keep growing in magnitude.\n\nAnd was there anything different, tripwire-wise that triggered the size and expansiveness of this charge? And I know you gave more color on the slip-out of the tanker, which seems to continue to happen. But maybe was tripwire? Number one. Number two, this -- forward losses that have accumulated on the balance sheet, the size of the headwind in '23 versus what you experienced in '22 would be helpful. Thanks.\n\nDave Calhoun -- President and Chief Executive Officer\n\nYeah. Thanks, Myles. Let me get to the last part. It's going to be about the same in terms of the headwind, to answer your last comment.\n\nOur BDS portfolio, the 85% of the business is doing pretty well. It's these fixed-price development programs that, unfortunately, we're working our way through. We had to account for recent performance, including a reassessment of our forecast cost to complete. There's no doubt about it.\n\nThe biggest impact was the tanker, as you mentioned. At $1.2 billion, it was driven by two things. The supply chain constraints and specifically part shortages have been persisting and they likely will persist longer than we had contemplated; and then, two, this labor instability. As you know, all airplane programs contemplate a learning curve improvement over time.\n\nAnd we adjusted our assumptions because labor stability is an issue that is likely to continue into the future. We can hire. It's getting the workforce trained and up to speed that we had to account for in this particular period. We applied the similar framework to the VC-25B, where the labor stability issues are magnified because of the requirement to get secured -- security clearances.\n\nAnd that's also contributed to schedule shifts. So those are the two big ones. And it's just at this moment, the provision reflects what we think is likely to happen in front of us. The other bucket really relates to what I would call true development, which is MQ-25, T-7, and commercial crew.\n\nWe did adjust for similar macro constraints where needed. But there's also a recognition, there's technical challenges that we're organized through and sometimes impact schedule. But overall, we feel very confident about those programs long term and the benefits that we'll accrue, once we get them out in the market. So there's no doubt that we derisk these programs.\n\nNow the two big ones for the next two years, and I'm not suggesting perfection, but we definitely lowered the risk profile. And for the smaller programs, in some cases, we derisked even longer. I think the thing we have to keep in mind is that our mandate is to stabilize and now deliver very important products to our customers who need them, anyway.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nOK. And then, just clarification on the tax refund, you had one last year this year. Do you anticipate another one next year, no?\n\nDave Calhoun -- President and Chief Executive Officer\n\nNo.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is from David Strauss with Barclays. Please go ahead.\n\nDavid Strauss -- Barclays -- Analyst\n\nThanks. Good morning. Brian, you made the comment that I believe the recovery is not accelerating as fast as you expected. I'm sure you'll give us a lot more on this next week, but maybe some broad strokes as to what that means in terms of the trajectory of free cash flow generation from here in your ability to delever as you have a fair amount of maturities coming due in the first half of next year?\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nSo I'd answer that question. We're confident that we will be able to satisfy the maturities in front of us. We'll talk a lot more about that. But, given the fact that where we ended the quarter with our cash balance, $14-plus billion, plus being able to be cash flow positive in the fourth quarter, that's not a concern.\n\nIn terms of the rate of change, we have a supply chain, as Dave mentioned that we've been dealing with, and that's been reflected in our commercial deliveries through the course of the year. And we're working our best to stabilize and get more predictable. But, while it may not be quite the rate of acceleration going forward, momentum is going to improve. It just could take a little bit longer, and we're going to share a lot more about that with you next week.\n\nBut, in terms of our liquidity position, what's in front of us, high degree of confidence.\n\nDavid Strauss -- Barclays -- Analyst\n\nOK. Quick follow-up. The airplanes that you have in inventory for China, how many of those have you remarketed at this point?\n\nDave Calhoun -- President and Chief Executive Officer\n\nWell, there's active discussions with customers about that topic. More to come in terms of things getting finalized, but it's an active discussion, so that we can no longer defer that decision and actually start to think about how we liquidate that in terms of working capital improvement and cash flow. More to come, and we'll keep you updated.\n\nDavid Strauss -- Barclays -- Analyst\n\nThanks very much.\n\nOperator\n\nNext we go to Peter Arment with Baird. Please go ahead.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nGood morning, Dave. Brian. Hey, Dave, maybe I could just circle back on the China question that David was just talking about. Have you seen any kind of positive movement from customers over there regarding wanting the MAX? And right now you're up to 51% of the store fleet is tied to China with 138 aircraft.\n\nAnd just, how you're thinking about that because that obviously that percentage is going to continue to grow? Thanks.\n\nDave Calhoun -- President and Chief Executive Officer\n\nYes. So I'll start with my hope. My hope is that these two big geopolitical forces get together and endorse free trade again and COVID policy ultimately lightens sometime in the future in China so that they can take more deliveries of airplanes. So we're going to keep supporting our customers, keep supporting their regulator every step of the way.\n\nBut, we are also going to take steps to derisk. I have not gotten a single signal. And I'm surprised by it. They're going to take deliveries in the near term.\n\nSo we are going to continue. We're going to -- we have begun and we're going to continue to remarket these airplanes as we move forward, and we're confident that there's a market for it, not a little market but a big market. In some ways, there are a lot of ways we could take advantage of it. I would prefer not to take advantage of it.\n\nI'd prefer to just reinstate deliveries with our China customers. But anyway, that's the course we're on. It hasn't really changed much. But it is really hard for me to find signals that things are going to change in China and move in our direction.\n\nSo hopefully, that will give you everything you need here in terms of the way we're likely to move.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nAnd just as a follow-up, Brian, just the eight to 10 out of storage, is that still a good number on a monthly basis? Thanks.\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nYep.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from Ron Epstein with Bank of America. Please go ahead.\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Hey, good morning, guys. Thanks for the time. You mentioned on the call that your primary focus metric is going to be free cash flow.\n\nIn the past, focusing on free cash flow got the company to where it is today that didn't end very pretty. How are you viewing that differently than how it was viewed in the past? Dave, you were on the Board when a lot of the decisions were made in the past. So what's -- how are you going to view this cash focus different than you did, call it --\n\nDave Calhoun -- President and Chief Executive Officer\n\nYeah. Ron, I'm not going to comment on the past. I'm not sure that's helpful to anybody. Our need to focus on free cash flow is a result of having taken a significant amount of debt on in light of the crisis that we had, some self-inflected; some definitely COVID related as it relates to the marketplace and all the things that we've had to contend with.\n\nSo we took on a lot of debt. Shareholders told us it would be great if you got rid of that debt sooner rather than later. And so we've been focused on free cash flow. It is a great metric, period, in terms of how we measure all of our people and the work that we're doing.\n\nIt does not suggest that we have stopped investing in new capabilities that will ultimately differentiate this company and bring it right back to the leadership role that's always enjoyed. So I'm probably not going to take the bait. I do have confidence that we are doing exactly what we need to be doing, and the free cash flow metric is a very clear indicator of performance, not just in the near term but also the medium and long term. So I'm sorry, but that's the answer.\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nNo. That's fine. And if I may, just a quick follow-on. Of the 787s you have in inventory, can you give us a sense on how many are like ready to be delivered, how many have to be depickled, how complicated a process that is?\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nWell, thanks, Ron. They all have to go through a prescribed set of rework. We've been very clear on that. And we've contemplated what that is going to take.\n\nAnd now it's up to our great team in Charleston and in Everett to get that work done. And it's going well. It's early innings, but it's going well. And we have high confidence that they will get done what they need to do to get those inventoried airplanes in the customers' hands over the next two years.\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nNext we'll go to Seth Seifman with J.P. Morgan. Please go ahead.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nThanks very much and good morning. I just wanted to dig in a little bit more on this issue of engines and castings. LEAP deliveries were up significantly in the third quarter. And it sounds like they see things getting better.\n\nI haven't gotten the impression from Airbus that they're expecting quite the pressures next year that you are. It seems like they expect that things are getting better. Is that because most of the LEAPs are going there and you guys have to wait longer, or is there more to it, or are these increasing CFM deliveries, is that not really enough to help you guys?\n\nDave Calhoun -- President and Chief Executive Officer\n\nYeah. So just in context, things are getting better. They are getting your hands around things and they're beginning to project forward. The real issue for us is simply -- when I refer to constraints, it's because we have such huge demand for the airplanes that we wish we could do double the rates.\n\nThat is why we will refer to this as a constraint and a difficulty. The measurement of where engines are going with respect to Airbus versus us is the easiest thing in the world to measure. And so we're well aware of it, and we don't see any indication that one's being favored over another. And then, with respect to maybe suggestions that they're not having any trouble, that's not what the industry tells us.\n\nAnd frankly, that's up for them to explain and to all of you, and I'm sure they will. So I'm not worried about this as the industry favoring one over the other. It's too easy for both sides to measure and to hold people accountable. And yes, it's improving, but it's nowhere near where we all want it to be because the demands -- or demand on our airplanes is just so strong.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nOK. And just to be clear then, it is the engines though that is preventing Boeing from delivering 737s off the line between, let's say, the expected pace of 20 a month to be at a total delivery pace of low-30s versus the nominal production rate of 31 a month. So they're only able to get you engines to deliver at roughly 20 planes per month or so.\n\nDave Calhoun -- President and Chief Executive Officer\n\nYes. We're short of engines. We have a clear picture of what it's going to take to make it up, and we'll get back on rate. But yes, the answer is yes.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nOK. Thanks very much.\n\nDave Calhoun -- President and Chief Executive Officer\n\nYep.\n\nOperator\n\nAnd next we'll go to Noah Poponak with Goldman Sachs. Please go ahead.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nHi. Good morning, everyone.\n\nDave Calhoun -- President and Chief Executive Officer\n\nGood morning, Noah.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nA lot to work through, but it seems like what underpins some large portion of your challenges is labor availability, both for yourself, for the supply chain. It seems like it's behind a decent amount of the defense charges. Can you put some numbers on it? How many people do you need to hire? How far into that have you broken? When you say it takes time to get somebody trained and seasoned, how long does that take? And do you have those numbers in the castings part of the supply chain? I mean how many people do they need to hire? And how far along are they? And where are these people going to come from given the macro-level openings versus workers' gap?\n\nDave Calhoun -- President and Chief Executive Officer\n\nWell, that's a big complex and macro question. I'll start with us. We have brought on 10,000 people. We are at a headcount level that we think can handle rate increases and all the things that we need inside our own shop.\n\nWe have significant training and development programs and investments that are being made as we speak, so that we are productive with the introduction of all of these new people. I don't have a number with respect to all of the supply chain constraints and labor shortages that they might have. But a lot of our constraints and -- with those suppliers that represent constraints are labor related. Some like in the casting world, are a little more labor and experience related because you may know in the casting world, that is not a simple process.\n\nIt's not just bring in people and start them up. There's a real learning curve and cycle that is needed to sort of ramp up capacity. So I don't have a sort of big number for you. I wish I did.\n\nI know this. All of us, all of us in this industry are wrestling through these constraints. We try to compare notes. We're trying to help our suppliers on the commodity side with our own contracts and the application of those contracts to their needs.\n\nAnd then on the labor side, anything that we can do to help them find people, that's what we do. And we often second or send our own people out there to help them. So it's -- this is just what we're in. I think it's going to take probably all of next year before things really do begin to stabilize because we begin to see layoffs in other industries.\n\nWe definitely feel that in the software world, we're not having any kind of trouble bringing in the engineering resources that we need, particularly as it relates to software development because the rest of the industry that competes with us is beginning to soften considerably. So I wish I had a big specific number and an easy resolution. I don't. This is what we're going to struggle through all year next year.\n\nOperator\n\nOur next question is from Rob Spingarn with Melius Research. Please go ahead.\n\nRob Spingarn -- Melius Research -- Analyst\n\nHey. Good morning. Dave, a couple for you. You've said numerous times today that demand is not the issue.\n\nSo I was going to ask if you could talk about the developing wide-body cycle and the environment for that. And could it mitigate some of the narrow-body issues in China, in other words, selling wide-bodies into China? And how might that influence your rate plan for 87 and 777 freighter?\n\nDave Calhoun -- President and Chief Executive Officer\n\nIt's a great question. Number one, I -- the wide-body world is heating up. There are some significant orders out there that we're all competing for. So that's just a reflection of the markets that are returning, largely in international base, but a lot of domestic carriers as well, so anyway, a big robust.\n\nThe answer on China is just as you're suggesting and the premise that underlies it, which is -- that is the airplane they are going to likely need from us more than any other. They don't have a domestic alternative. And I don't believe that a single provider from France can meet those requirements, so. And we do get orders, but they're -- I put them in the incremental category for airplanes, large wide-bodies, freighters in particular, from China.\n\nDoes that ramp up? It's not something we're counting on, but it could. And if it does, that will compete for a very crowded skyline. So again, if China really does rebound and we can get the geopolitical tensions to calm down somewhat, that's going to present another challenge for us on the demand and the supply front, but one we would welcome and probably be upside to whatever guidance we provide next week.\n\nRob Spingarn -- Melius Research -- Analyst\n\nOK. And just to clarify, a slightly different topic. How does this BDS review differ from prior reviews? How confident are you that you've captured everything here?\n\nDave Calhoun -- President and Chief Executive Officer\n\nI'll start and then I'll let Brian in to talk. So the best, I mean, fact set that we can give is, number one, we're getting closer to the end of these programs. So we're getting work done. We know more.\n\nWe see more. We're also running out of time with respect to learning curves. There's no time to develop learning curves. They take a couple of years.\n\nWe don't have a couple of years. We're -- so we don't have any baked-in learning curves anymore. We are simply saying these supply constrained -- supply constraints that we're facing today will not end until we finish. So we're trying to assess these programs with real clarity and realism with respect to what we're experiencing now and not projecting significant improvements in the future.\n\nSo it's -- for me, that's sort of the set around it. It's definitely the way we went into it. And of course, Brian has been through every little detail. So, Brian, I'll let you add.\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nI don't have much to add other than we sit in this environment and you can't ignore these macro constraints and how they impact these programs. And that just is what happened this quarter. But the thing that we've done our best to do is derisk, and derisk, as Dave mentioned, some of these assumptions and future cost forecasts. So we like where we closed the quarter of our position.\n\nWe do it every quarter, and we feel confident. This particular quarter, it really was the recognition of the very rapidly changing environment that is persistent, and can't assume it's going to get better anytime soon.\n\nRob Spingarn -- Melius Research -- Analyst\n\nThank you, both.\n\nOperator\n\nOur next question is from Cai von Rumohr with Cowen. Please go ahead.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nYes. Thank you for taking the question. So I guess, I kind of get the $2.8 billion on the development program, although that seems large. What confuses me is that excluding the $2.8 billion all those mature programs, F-18, F-15, Apache, etc., look like they're at breakeven.\n\nThey're making no money when Lockheed and GV have their issues, but basically, the mature stuff is doing OK, how come?\n\nDave Calhoun -- President and Chief Executive Officer\n\nBrian, you probably want to grab that one.\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nWe saw across some of these other programs, similar disruptions in terms of both, factory stability, part shortages, labor. So those weren't immune at all. It's just that they're not magnified in the sense that there are these big fixed-price development programs that have these reach forward losses embedded in them.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nAnd then --\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nYou know in making comparisons across our companies, our BDS is programs only. It's not including the government services part of our business, which continues to run at reasonably healthy margins and does its things. So I know you know that, but I just want to point it out.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nAnd then -- so I mean, we've seen sort of a whole set here. We thought first quarter, $900 million, got it done. Now we have $2.8 billion. What should we be looking for to see -- to feel confident that, in fact, you guys really are out of the woods at BDS?\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nBetter numbers, better performance, better everything. So I don't want to tell you anything other than that. Our objective is to make sure these tankers are doing the job for our military customer. That is it.\n\nThat's all we're focused on. And they are doing that. And they are now permitted to do all the missions that are required. So we are knocking down risk and we are implementing these programs.\n\nAnd so I am confident we're going to get where we need to get, and you'll be confident when you see the numbers play out the way I expect them to play out.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nYeah.\n\nDave Calhoun -- President and Chief Executive Officer\n\nAs you know, better than anyone, these are complicated programs, lots of assumptions, lots of moving parts, backdrop of a volatile environment. We did our very best to derisk.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nGreat. Thank you.\n\nMatt Welch -- Vice President, Investor Relations\n\nOperator, we have time for one last question.\n\nOperator\n\nAnd that will come from Doug Harned with Bernstein. Please go ahead.\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nGood morning and thank you.\n\nDave Calhoun -- President and Chief Executive Officer\n\nHey, Doug.\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nI wanted to go back to the MAX rate and engines,, because on the earlier -- I think Seth's question earlier talked about the LEAPs out there, and we're looking at GE just reported 347 LEAP deliveries for the quarter. We are seeing Airbus finally, and they've struggled. But finally, that -- the LEAP-powered A320 seemed to be coming through. When I look at -- if we look at the numbers and you had sort of that target production rate of 31 a month and look at what Airbus is doing, it seems like CFM is finally getting there.\n\nAnd then on top of it, we know that well over 100 LEAPs were delivered ahead of production before. So I'm just trying to understand how the engines can be the main constraint here. Is there another issue that's also slowing down the delivery rate or the -- I'm sorry, the production rate?\n\nDave Calhoun -- President and Chief Executive Officer\n\nDoug, no, I can try to reconcile numbers. All I can tell you is I personally witnessed alongside my counterpart the reconciliation of the engines we need to deliver the airplanes and the engines they're producing on weekly rates. And so we just have -- we have a gap. We got room to make up.\n\nAnd we're going to get there, but it's going to be at a constrained rate and we know that. And that's what we're trying to factor into our forward looks,, and that is what you will see when we get together next week. So there's no -- there is no other constraint, Doug, with respect to our rate projections and others. There are lots of weekly constraints that just simply impact the stability of the line, but they are not going to be rate limiters, either short term or long term.\n\nIt will boil down to engines and the competition for castings between Pratt and CFM.\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nAnd then, if I can just follow up with one more thing, which when you guided early in the year to positive free cash flow for the year, was that including the assumption of this tax benefit that we saw this quarter? Because just wondering if you're thinking about positive free cash flow still in the absence of that sort of $1.6 billion additional benefit here.\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nIt was contemplated, Doug.\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nOK. So that's part of the outlook you had. OK.\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nSure.\n\nMatt Welch -- Vice President, Investor Relations\n\nAll right. That completes The Boeing Company's third quarter 2022 earnings conference call. Thank you all for joining.\n\nDuration: 0 minutes\n\nMatt Welch -- Vice President, Investor Relations\n\nDave Calhoun -- President and Chief Executive Officer\n\nBrian West -- Executive Vice President, Chief Financial Officer\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nMyles Walton -- Wolfe Research -- Analyst\n\nDavid Strauss -- Barclays -- Analyst\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nRob Spingarn -- Melius Research -- Analyst\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nMore BA analysis\n\nAll earnings call transcripts"
}