{
  "companyName": "Madison Square Garden Sports Corp.",
  "companyTicker": "MSGS",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/18/madison-square-garden-sports-corp-msgs-q4-2022-ear/",
  "content": "Madison Square Garden Sports Corp. (MSGS 1.02%)\nQ4 2022 Earnings Call\nAug 18, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning. Thank you for standing by, and welcome to the Madison Square Garden Sports Corp fiscal 2022 fourth quarter and year-end earnings conference call. [Operator instructions] I would now like to turn the call over to Ari Danes, investor relations. Please go ahead.\n\nAri Danes -- Senior Vice President, Investor Relations\n\nThank you, operator. Good morning, and welcome to MSG Sports fiscal 2022 fourth quarter and year-end earnings conference call. Our president and CEO, Andy Lustgarten, will begin this morning's call with an update on the company's operations. This will be followed by a review of our financial results with Victoria Mink, our EVP, chief financial officer, and treasurer.\n\nAfter our prepared remarks, we will open up the call for questions. If you do not have a copy of today's earnings release, it is available in the investor section of our corporate website. Please take note of the following. Today's discussion may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nAny such forward-looking statements are not guarantees of future performance or results and involve risks and uncertainties that could cause actual results to differ materially from those in the forward looking statements. Please refer to the company's filings with the SEC for a discussion of risks and uncertainties. The company disclaims any obligation to update any forward-looking statement that may be discussed during this call. On Pages 4 and 5 of today's earnings release, we provide consolidated statements of operations and a reconciliation of operating income to adjusted operating income or AOI, a non-GAAP financial measure.\n\nAnd with that, I'll now turn the call over to Andy.\n\nAndrew Lustgarten -- President and Chief Executive Officer\n\nGood morning, and thank you for joining us. As we look back on fiscal '22, we are incredibly proud of the year we had, highlighted by record full year financial results with revenues of over $820 million and adjusted operating income of more than $140 million. In addition, every major revenue line exceeded results for fiscal 2019, our last full year prior to the pandemic. From tickets, sponsorship, and suites, to food, beverage and merchandise sales, and media rights.\n\nThis is a true testament to the incredible demand and enthusiasm for our iconic franchises, especially in the Knicks and Rangers first full regular season in three years. The Garden was packed night after night with our fans, who are clearly thrilled to be back supporting their teams in person. But it's also important to remember that the environment in which we operated over the past year was far from perfect, including restrictions on international travel, very low office occupancy rates in New York, and the impact of both the delta and omicron COVID-19 variants. And yet, despite these headwinds, we successfully navigated our business through these uncertainties.\n\nWe have used the last few years to enhance the way we operate, including updating our infrastructure and processes, emerging as a stronger and more nimble organization with new growth strategies in place to drive our business. And as we look ahead, we will focus on executing against these strategies and see numerous ways to grow our business, both in the near and long term. These opportunities include new ticketing and premium hospitality products, such as new courtside seating, valuable sponsorship inventory, including our team jersey patches and growing Knicks international presence; increasing our focus in knowing our consumer, including through social content which drives our sponsorship business and through new and tailored merchandising offerings; and at the league level, further upside in media rights as national deals come up for renewal. After record financial results this past year, we're already seeing our momentum carry forward.\n\nAnd from what we could see, excluding the impact of the playoffs, our business is poised to deliver year-over-year growth across key revenue lines in fiscal '23. Furthermore, we remain confident that our ownership of two of the most renowned teams in all of professional sports positions us well to drive long-term value creation for our shareholders. Let's now turn to those franchises. Both the Knicks and Rangers have a talented young core developing players with most under contract for multiple years.\n\nThe Knicks has also amassed a substantial number of draft picks over the next seven years, further positioning the team for success in the years ahead. And for the Rangers, the end of '21, '22 season was marked by thrilling postseason run. The impact of which you could see in today's results. This included the team's first trip to the Eastern Conference finals since 2015, which generated one of the highest per-game gate revenues ever for any NHL team in any playoff round, including the Stanley Cup Finals.\n\nLooking ahead, we know our fans are ready for play to begin, with all signs pointing to continued positive momentum for our business. For example, the average combined season ticket renewal rate for the Knicks and Rangers '22, '23 seasons has climbed to approximately 91%, while sales of season ticket packages to new members remained strong. We anticipate that the momentum we've seen, coupled with an increase in Ranger season ticket prices, the introduction of new technologies that have increased the effectiveness of our sales process, as well as a reconfigured Knicks courtside layout providing new floor seats will drive solid growth in ticket revenue. The enthusiasm from our fans extends beyond just the tickets in their hands.\n\nAnd they've demonstrated that all season at The Garden. We saw it in double-digit percentage increases versus fiscal '19 levels in food, beverage, and merchandise per-cap spending, with results hitting season highs on Henrik Lundqvist special retirement night at the arena and during the Rangers playoff win. They also showed it in their desire to engage with our teams outside The Garden. For example, across both teams' social media channels, we added over 1 million net new followers this year, as we continue to focus on creating compelling content to directly connect with and grow our audience.\n\nThe growth in followers on our social media platforms also creates valuable additional inventory for our marketing partners. We also saw fans' enthusiasm reflected in strong viewership across traditional media. For example, the Rangers-Penguins opening round playoff series on TNT and TBS was the most watched NHL first-round cable broadcast on record. a remarkable stat that doesn't even take into account that the series simultaneously delivered robust ratings on MSG Networks' local broadcast.\n\nAnd the impressive ratings continued as the Rangers-Lightning series in June was the most watched Eastern Conference finals since 2013. But this ratings stream wasn't just limited to the playoffs. Across both leagues, the demand for premium sports content was evident the entire season. The NBA's average regular season viewership was reported to be up 19% versus last season and was the most watched regular season since 2018, '19.\n\nAnd in the first year of the NHL new U.S. national media rights deal with Disney and WarnerMedia, average viewership for the league in the U.S. was up 16% as compared to last season, making it the NHL's highest since the '16, '17 season. As we have previously discussed, the NHL's new agreements align the leagues with two of the leaders in sports programing, which has clearly aided in increasing viewership and further raising NHL profile.\n\nIn recent weeks, new media rights agreements across various leagues have been announced, serving as further evidence of the popularity and importance of premium live sports content. This includes Major League Soccer, which landed a 10-year global deal with Apple; Formula 1, which reached a significant renewal with ESPN; and cricket Indian Premier League, all of which are reportedly multiples of the prior media rights agreements. As a reminder, the NBA's U.S. deals with Disney and WarnerMedia won through the 2024, '25 season and with national media rights across professional sports continuing to increase in value, we remain bullish on the opportunity ahead for the NBA.\n\nTurning to marketing partnerships. Fiscal 2022 ushered in robust activity from both existing and new partners as companies reengage with our assets and brands coming out of the pandemic, driving our marketing partnerships business to a record level. The year was highlighted by successful renewals across a slate of key partners, from Anheuser-Busch to Kia, as well as our expansion into new categories. This includes partnerships with Infosys and Benjamin Moore, as well as our push into mobile sports gaming following its legalization in New York state.\n\nIn partnership with MSG Entertainment, we were swift and strategic in forming three expansive deals with BetMGM, Caesars Sportsbook, and DraftKings. And fiscal '23 will benefit as we will see the full run-rate impact of this new category for the first time in our results. These partnerships demonstrate the unparalleled exposure we offer to companies trying to reach consumers in the New York market. And it leaves open a new sponsorship inventory, we are confident we'll continue to do the same with current and future partners.\n\nWhether it's the NHL jersey patch and digitally enhanced dashboards, or the NBA expanding the number of international partners the team can have, these are compelling opportunities, and we will be measured in our approach to the sales process. In the past year, we have also demonstrated the strength of our premium hospitality offerings, reminding companies as they return to corporate entertainment that there is no experience like a live team experience at The Garden. In partnership with MSG Entertainment, we saw strong suite renewal rates and new sales activity, driving record suite revenues and with the average usage of our suites for Knicks and Rangers games exceeding pre-pandemic levels in the last few months of the season, we are confident in our outlook heading into next season. As we look ahead to fiscal '23, with new sponsorship opportunities coming to market and corporate entertaining expecting to make a more complete return, we anticipate continued growth in these revenue lines in the year ahead.\n\nWe also expect to see positive effects on our business from the Rangers outstanding run in the playoffs. Whether to improve consumer or corporate demands, we anticipate benefits to ticket sponsorship and suite sales. Since we last spoke, we continue to be reminded of the significant value that persists for marquee professional sports teams. This includes, in the last three months, record majority ownership transactions in the English Premier League with the Chelsea Football Club and in the NFL with the Denver Broncos.\n\nAnd since the Broncos sale, Sportico has published the latest NFL team valuations with the average team valuation above 4 billion, up 18% from last year's report. And with Dallas Cowboys leading the list at a new record high of 7.6 billion, we're eager to see the next publication of the NBA and NHL team valuations and believe these recent examples continue to highlight the untapped value of our assets relative to where our stock currently trades. Before closing today, I'd like to take a moment to thank our fans, partners, employees, and shareholders for playing a vital role in our journey this year as we work to drive our business to record highs. As we look at fiscal 2023 and beyond, we see ample growth opportunities building off the existing strength in our business and the new growth strategies we've put in place, leaving us confident in the future of our company and our ability to generate long-term value for our shareholders.\n\nWith that, I'll now turn the call over to Victoria.\n\nVictoria Mink -- Chief Financial Officer and Treasurer\n\nThank you, Andy, and good morning, everyone. I would like to start by discussing our financial results for both the full year and fourth quarter. I will then review our balance sheet and liquidity. For fiscal 2022, we generated total revenue of $821.4 million and adjusted operating income of $142.2 million.\n\nAs a reminder, fiscal 2022 marked the first full season back for the Knicks and Rangers following the onset of the COVID-19 pandemic. And we are very pleased with the strong financial performance we continue to see across the business, including, as Andy mentioned, record-high results. Now turning to our fiscal 2022 fourth quarter. Our results for the quarter continued to reflect robust demand for our teams as they completed their '21, '22 regular seasons followed by a strong playoff run by the Rangers.\n\nI'd remind you that the prior-year quarter reflected the compressed timing of the shortened 2021 NBA and NHL regular seasons, which resulted in more home games played in the prior-year period than the current-year period, as well as certain revenues and expenses being recognized over a shorter time frame in the prior fiscal year. The prior-year period also reflected the impact of certain capacity restrictions, as well as three Knick playoff games as compared to the Rangers' 10 this year. These factors affected the year-over-year comparability. And as a result, total revenues for the quarter were $175.2 million as compared to $146.9 million in the prior-year period.\n\nThe event-related revenues represented $99.1 million in the quarter, which mainly consists of ticket, food, beverage, and merchandise revenue, inclusive of the playoff, while suites and sponsorship revenues, also inclusive of the playoffs, represented $34.4 million. In addition, national and local media right fees represented $31.9 million of revenue this quarter. This reflected a $40.7 million decrease as compared with the prior-year period, primarily due to the impact of the compressed timing of the shortened NBA and NHL 2021 seasons in the prior-year period. This is partially offset by the impact of the NHL's new U.S.\n\nmedia rights deal, which began at the beginning of the '21, '22 season, as well as contractual rate increases on our local media rights and the NBA's national media deals. As a reminder, the prior-year period also included the recognition of the NHL expansion fee associated with the Seattle Kraken. Adjusted operating income improved $39 million to $33.2 million, primarily due to the increases in revenues, a decrease in SG&A expenses and, to a lesser extent, lower direct operating expenses. The decrease in SG&A expenses was primarily due to the absence of severance related to team executives recognized in the fourth quarter of fiscal 2021, which was partially offset by higher playoff-related and other expenses as compared to the prior-year period.\n\nThe decrease in direct operating expenses included lower team personnel compensation and other team operating expenses, both primarily due to the compressed timing of the 2021 seasons. These decreases were partially offset by higher revenue sharing expense, net of escrow, reflecting a return-to-normal levels compared to a net credit in the prior-year period, as well as an increase in playoff-related expenses. As we look ahead, we believe our business is poised to deliver growth across key revenue lines in fiscal '23. While we expect our AOIs to also reflect higher team operations expenses, including league-related costs.\n\nTurning to our balance sheet. At the end of the quarter, we had $250 million of total debt outstanding comprised of $220 million under the Knicks' senior secured revolving credit facility and $30 million advanced from the NHL. Our quarter-end cash balance of approximately $91 million represented a net increase of $41.8 million compared to our March 31st balance of $49.2 million. Our cash and debt balances both reflect $65 million of repayments on the Rangers' senior secured revolving credit facility during the period which brought our total debt paydown in fiscal 2022 to $135 million and eliminated all outstanding balances under the Rangers facility.\n\nWith regards to liquidity, as of June 30th, we had $396 million of liquidity comprised of $91 million of unrestricted cash and cash equivalents and $305 million in borrowing capacity under the team's revolving credit facilities. Based on the momentum we're seeing heading into fiscal 2023 and with the opportunities to drive long-term growth, we remain confident in the trajectory of our business. And with that, I will now turn the call back over to Ari.\n\nAri Danes -- Senior Vice President, Investor Relations\n\nThanks, Victoria. Operator, we would now like to open the call for questions.\n\nOperator\n\n[Operator instructions] And your first question comes from the line of Brandon Ross from LightShed Partners. Your line is open.\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nHey, Andy. It's pretty clear from the prepared remarks that sponsorship has been a big part of the revenue growth story here and, frankly, at MSGE also. And just recently, there have been some headwinds, especially with the crypto pullback. And we've seen some high-profile deals abandoned there.\n\nAnd then it seems like the sports betting industry is getting a little more rational. Does this anyway cap your upside in sponsorship?\n\nAndrew Lustgarten -- President and Chief Executive Officer\n\nThanks, Brandon. So, let's take a step back for a second. So, I think when you talk about crypto, it doesn't make up a large part of our sponsorship business. We have two really strong partners.\n\nThey were new that came in last year, but it's, you know, not a very large part of our whole portfolio. So, we feel pretty good there. But when I think about crypto, I actually don't think about crypto alone. I think about the NFT space and key -- and really more so blockchain and the technology that comes from that.\n\nSo, when I think about that as a category, I don't know what's coming out of blockchain. There's a lot of companies that are emerging a new technology that I think is going to benefit our business. But that --actually, take another step back, if you went back two years, no one would have thought about crypto as part of our sponsorship book. And so, what I've had seen is there's new -- there's always new categories coming into this business.\n\nTo your point, sports betting was one that didn't exist three years ago, four years ago, which I think we've done very, very well. And I'll come back to sports betting in a second. But when you think about the way the cyclicality this business is, there's always a category that you either -- that comes into fashion or comes out of fashion. And I think we do a great job of capitalizing.\n\nAnd on top of that, the leagues have done a really excellent job of opening up new inventory, which gave us the opportunity to even further capitalize. So, whether it'd be the jersey sponsorship on the Knicks side, the NHL adding jersey sponsorship, adding digitally enhanced dashboards, the NBA opening up international, which we think is a really big opportunity. Really, opening international, allowing us to have 10 new partners. And we're really thinking about that.\n\nSo, we think there's abilities to go into new categories or new inventory. I'll tell you, you know, as we think on the horizon, you know, marijuana and CBD are now legal in New York and the New Jersey market. While they're not permitted by the league, I could see that being an opportunity. So, I think there's further growth really here in this business.\n\nWe feel really good about it. To your question about sports gaming, we think that -- we've got three great partners. We think that we've done a very good job of working with them in figuring out how to grow that business. And we think it's going to continue to do -- it's a very strong part of our portfolio.\n\nAnd I will mention that last year, it was only a partial year. So, this year, you will see the full year impact in our results as we go into the future.\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nGreat. Thanks so much.\n\nAndrew Lustgarten -- President and Chief Executive Officer\n\nAbsolutely.\n\nOperator\n\nYour next question comes from the line of Ben Swinburne from Morgan Stanley. Your line is open.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThank you. Hey, good morning, Andy. I want to ask about sort of the outlook over the next kind of 12, 24 months in a couple of ways. One, clearly, we can hear the enthusiasm for the business in your voice, but there's some concern, I think, in the market that the consumer spending we're seeing for a lot of events is sort of inflated or elevated based on pent-up demand.\n\nAnd as we lap these trends a year from now, growth will decelerate. I know you don't have a crystal ball, but you see more than we do. So, I'd love to hear your thoughts on that, particularly as it relates to New York. And then kind of a similar line of question on the corporate side, can you just remind us, as you think about suites and sponsorship, kind of the typical duration of those contracts and your opportunity to reprice those as you sort of go to market in a marketplace that's really strong right now relative to maybe the last couple of years?\n\nAndrew Lustgarten -- President and Chief Executive Officer\n\nSure, I'd be happy to. So, let me -- let's just start where I think -- we can start at the beginning. I'm very proud of I think it's come across and how we've navigated our way through the last two years, which have been incredibly difficult to operate in for a lot -- for the entertainment business, especially here in New York, where the venue was largely closed. So, what we did was we took the opportunity to really think about our infrastructure.\n\nI talked about that before. How could we operate more efficiently? We've made investments in technology that sort of allows us to sell better more effectively and drive our revenue. And then we've also put in a whole set of, I mentioned earlier, a set of growth strategies. I feel really strong about these that allow us to capitalize on our base business and then continue to drive forward.\n\nWe have a very strong ballast of long-term agreements that provide us a real level of -- you know, a certain level of certainty in our business. And then as we think through some of these growth initiatives, I feel good about where we'll take the business over the next 12 to 24 months, regardless of what the market is. And so, let's just start with what we're seeing. And I mentioned this earlier, but I'll say it again.\n\nCurrently, we're already at a 91% renewal on a combined basis, and we're still continuing to sell. That's based on particular renewals from last year. We've seen -- we have an increase of Rangers ticket pricing both on our base business, you know, the renewed, as well as any new tickets that we sell. And that's both across Knicks and Rangers.\n\nWe used our opportunity during COVID. When the Knicks came back to the playoffs, every single game we were looking and focusing on our where how many seats do we have in the building, where we can sit in the building. And what we did was, we said, \"Well, wait a second, let's go and think about exactly how we've laid out our configuration.\" And we worked with the league, and we found a whole new set by modifying our configuration and changing where the scorer's table was, and moving a few things around. We worked with the league, and we've found a whole new set of first and second row inventory that didn't exist before.\n\nSo, we think that's another opportunity for growth. And we think premium, especially in this business, is incredibly valuable. And we're going to continue to think about other premium opportunities. In terms of our sponsorship front, we think there is a tremendous amount of runway here.\n\nI mentioned this. We'll see the first full year of our betting impact this year to, you know, multiple-year deals. We think there's ability for us to get capitalize on NHL jersey patch, on the digitally enhanced dashboards, which are new sets of boards allowing consumers -- advertisers to reach their fans in a better fashion when the team's on the road. And then we think there's new inventory continuing the leads.\n\nWe have been really fabulous about thinking about and innovating around the business. On our media right seats, those are contractual, both at national level, as well as the local level. And we've talked about as the NBA renewals come up, we feel bullish about our opportunity given what we're seeing in the sports rights business, including today with the Big 10 announcements or what's being reported. And we've been really focusing on consumer, knowing them better, how do we reach them better through short-form content, through merchandise.\n\nWe've created new pack -- we're very focused on merchandising with things such as kits, parading our new Knicks jersey; Jeff Staple creating a little Ranger capsule to sell in venue. So, we think there's lots of things that we can continue to do like this that will continue to drive consumer demand, and we feel really strong. And lastly, obviously, with the Rangers' playoff run, what its impact on multiyear demand, we think, will also buoy the business and help drive our business forward. So, we think there's a lot of growth, and we look forward to the next 12 and 24 months.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThanks, Andy.\n\nOperator\n\nYour next question comes from the line of David Karnovsky from J.P. Morgan. Your line is open.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. Just one for Victoria. Wondering if you could update us on how you're looking at capital allocation.\n\nIs that paydown the priority? Or do you see room for repurchases over the next year? And how do you think about the right leverage for the business over time? Thanks.\n\nVictoria Mink -- Chief Financial Officer and Treasurer\n\nSure. Hi, David. So, you know, as we think about our capital allocation policies, you know, I'd break it down into -- you know, we have really three priorities. The first is to maintain the appropriate liquidity to fund our operations and to invest in our core business, right? Yeah, as an example, you heard me mentioned a little bit earlier that in this upcoming fiscal year, we expect higher team operating expenses and some high league-related expenses.\n\nAnd an example of that, as you know, is our -- the impact of our current roster. You know, we were well below the NBA salary cap last year. And so, I would note that for the upcoming season, the NBA salary cap is increasing, right? It has increased from $112.4 million to 123.7 million. And the NHL as well.\n\nIt's a more modest increase, but it's going from $81.5 million to $82.5 million. So, you know, it's in these areas that we're looking to, you know, continue to focus on and fund our operations and make investments in that core business. The second priority in our mind is just to keep a strong balance sheet. You know, as we discussed and as you mentioned, you know, we -- this includes our focus on paying down debt.\n\nJust, you know, to recap, this fiscal year, that's what we've continued to do. We did another $65 million paydown on the Rangers facility in the quarter, brought our total debt paydown for the full fiscal year to $135 million. And it eliminated all of the outstanding balances under the Rangers facility. So, we know the two variants we saw this year, delta and omicron, it's just another reminder that the environment really can be unpredictable.\n\nAnd it's important that we maintain the flexibility that we're going to -- you know, that we may need in the near term. And then the third priority, of course, you know, we would consider other uses of our free cash flow, including a return of capital. But at this time, we just don't have any specific plans to share.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nVery helpful. Thanks.\n\nOperator\n\nYour next question comes from the line of Devin Brisco from Wolfe Research. Your line is open.\n\nDevin Brisco -- Wolfe Research -- Analyst\n\nThanks for taking my question. With the Rangers advancing to the Eastern Conference finals, which helped contribute to an already strong quarter, could you pass out with the playoffs intact was by segment or playoff round in the quarter? And what does a strong playoff run historically meant for future performance in terms of ticketing and sponsorship suites or any other talents to your business?\n\nAndrew Lustgarten -- President and Chief Executive Officer\n\nThanks. So, I think -- I'm going to start with -- I'll start answering now and pass it to Victoria for a little bit more. But so, at the highest level, obviously, we're extremely proud of this run, the Rangers' postseason run. We have a great youth, and we feel very strong about our prospects going forward.\n\nAnd I think we see it from the fans' enthusiasm, both during the playoffs and as well as how they've been acting so far as we look going into this year. So, historically, whenever there is a postseason run, especially a long postseason run, what you see in following years is what's the effect on demand for tickets, both on renewals, selling new folds, and individuals. And obviously, individuals are able to then be more effective on dynamically pricing to capture further upside. You mentioned our renewal rates.\n\nThe combined rate is already 91% between the two teams and still rising. In addition, we've -- when we do have a playoff run, we're able to -- we modify our season ticket price for the following year. So, we're starting to see that benefit as we look forward into this year and following years. But what it really does is it also creates new fans.\n\nAnd so [Inaudible] exact data around this, but the best data I can think about is what we were able to do on our social media. So, we've been very focused on driving social media and knowing our consumer. We added about 320,000 new social followers last year in the Rangers, but almost over half of that, around half of that came just during the playoff run. Those are new fans or new people really engaged with our business that we will see buying tickets, buying merchandise, coming to our games, and consuming our products.\n\nSo, we feel good about what that's going to do to our business. And of course, that all happens the same when we think about our suite renewals. As those come up, we've got more demand and ability to price those effects patiently and find a larger market for it. Corporates need to be part of the best of entertainment here in New York City, and I hope we deliver it.\n\nAnd we see that with our partners. As partners come up -- our marketing partners come up, we're able to think about price differently. We were able to market our inventory to different levels. And so, we think there's flow on for that.\n\nSo, it's great in the quarter or the year that it happens, and it's great for follow-on years as well. Victoria, you wanted to talk a little bit more detail into this quarter?\n\nVictoria Mink -- Chief Financial Officer and Treasurer\n\nSure. So, all right, of course, as Andy mentioned, you know, we couldn't be more proud of the Rangers' strong playoff runs. So, just to give a little recap and a little more color. We hosted 10 playoff games at The Garden in the fourth quarter.\n\nAnd as you can see in our results, these games provided a significant boost to revenues and AOI. You know, part of that comes from tickets. Our tickets are priced at a significant premium to our regular season games. And, you know, it's just sort of a notable mention here, we generated one of the highest per-game gate revenues ever for any NHL team in any playoff round, including the Stanley Cup Finals.\n\nAnd of course, the excitement in the arena translates to strong F&B and merchandise sales, which is -- which was all great. And I think -- as I mentioned on our last call, each home playoff game in the first round was expected to generate AOI of more than about $1.5 million. And as we went deeper into the postseason, that per-game AOI increased meaningfully as our ticket prices rose. So, in the quarter, our playoff-related revenues were $64.8 million as compared to $15.2 million in the prior-year period, which reflected the three Knicks home playoff games last year.\n\nSo, this translates to approximately $6.5 million in per game revenues. And with about $3 million in per game direct expenses, it results in a net $3.5 million per game on average, you know, which is, of course, skewed higher toward the later rounds. I do -- I will note, though, this does exclude some of our marketing administrative costs that we would incur in connection, you know, with our playoff participation.\n\nDevin Brisco -- Wolfe Research -- Analyst\n\nGreat. I appreciate the color. My second question is, now that gambling in New York has been legalized for going on eight months, you've had some time to partner with major sports betting companies, and your ratings are really strong, and just NBA and NHL ratings are strong across the league. Could you speak to the increase in engagement you've seen across your existing fanbase or by new fans due to gambling? And how much of the sports betting opportunity are you monitoring at this point? And how do you see that evolving from here?\n\nAndrew Lustgarten -- President and Chief Executive Officer\n\nThank you. Well, I'll note you actually have a few of the key points. So, as I respond, it's still early. It's only eight months into the run.\n\nAnd, you know, when you think about engagement, the first point of engagement to me is ratings and people coming to our events. So, both of those are up. It's very hard to parse exactly what's driven by what factor, but as I take a more macro point of view, the New York market is clearly very large for gaming. We have three great partners.\n\nThere has definitely been some hesitancy by certain, well, publicly and by other partners about the tax rate. And so, we think that we could see as -- over time that the tax rates change to even further investment and further interest in this market by our partners. But when I began to take a more macro point of view and say, \"Where is sports betting much more developed?\" If you go to Europe or you go to other sports that have been ingrained for a long time, you see more in-game bets, you see more immediate betting, you see -- and those are the things that actually when I take -- over long periods of time, I've always talked about, \"Yes, I'm excited about what this does for revenue directly from marketing partner.\" But what it does for consumer engagement, that comes from small and micro bets that are more, you know, quick bets about what's going to happen next. So, you look at sports like tennis, which is one of the betting sports in other parts of the world.\n\nThere's so many points of places for people to better their further engagement. I think that we're going to see that here both in the NBA and the NHL, as well as other sports here in the U.S. As it develops further and as the technology moves along, we'll see more of those types of actions, which will drive even further engagement. So, I think it's been a great -- I think we've done very well as we launched.\n\nI think -- I think our partners have been very happy with how we've been able to help drive their business. And I think that there's further growth in this industry, especially if there is changes in regulations, such as kiosks and tax rates. So, we feel very good here.\n\nDevin Brisco -- Wolfe Research -- Analyst\n\nThank you.\n\nAri Danes -- Senior Vice President, Investor Relations\n\nThanks, Devin. Operator, we have time for one last caller.\n\nOperator\n\nYour final question comes from the line of Farshid Javar from Jefferies. Your line is open.\n\nFarshid Javar -- Jefferies -- Analyst\n\nThanks for -- thanks for squeezing me in here. You know, you briefly touched on this a little bit, but with broader tailwinds in the NBA for international sponsors, can you maybe elaborate more on what that specific space looks like for the company?\n\nAndrew Lustgarten -- President and Chief Executive Officer\n\nSure. Absolutely. So, again, I think both leagues have done an amazing job of -- prior to COVID, thinking about new categories and new inventory, but really during COVID and coming out of it, how do we think about leading and pushing our business. So, one of the things that the NBA has done is there was always the opportunity to get partners internationally.\n\nAnd what that means is outside -- besides China and Canada, the ability to have a partner activate in international markets. The issue was when you only had two is -- the truth is we didn't spend a ton of time focused on trying to find the partners. So, now the NBA has raised it to 10 partners. And so, what we've done is -- and let me take a step back and say we are -- we have a lot of international experience here within MSG.\n\nI came from the NBA. I ran global strategy. I have a ton of experience doing international. Our president of business operations here is David Hopkinson.\n\nHe came from, before this, with Real Madrid, where he was the head of global head of partnerships. So, tremendous international experience. And so, when we think about this, we say, \"Well, this is a great opportunity for twofold. One, it allows us to find either domestic partners who are trying to activate internationally or, where I think we're going to see further upside, is new international partners.\n\nAnd those partners can either be focused in their home markets. And so, we could divvy up even a category and have a domestic partner in a category and have an international partner in a category, or an international partner that's actually trying to find its way to the U.S. And unless you're out there talking to them and showing -- talking about your business, you're not going to find it. And so, now that we can have 10 partners, it's actually worth investing around it.\n\nSo, we hired a couple people who are very only focused on finding international partners. And with Dave Hopkinson and my experience, I think there's a real ability to grow this business. And as we grow this business, to take us -- to really put the Knicks and New York as a lifestyle brand that we can take into those international markets. So, we'll have opportunities to grow -- to broaden our exposure, broaden our reach, and broaden our family.\n\nSo, we really -- we think this is a great opportunity. It's obviously going to take a little while to harvest. It's not immediate. And actually, the last one more point that I should add is, if you look at some of the largest or the largest jersey patch deals, those have all come from international buyers who are trying to reach the U.S.\n\nAnd so, I'm even further enthused, as I think about the future of the jersey patch opportunity, given the ability for us to invest around the international to go find partners. So, this is a real -- this will be a real driver for our business long term. It will take a little to get there, but it'll be a big driver.\n\nFarshid Javar -- Jefferies -- Analyst\n\nI appreciate the color. That's all for me. Thank you.\n\nOperator\n\nAnd this ends our Q&A session. Mr. Ari Danes, I turn the call back over to you for some final closing remarks.\n\nAri Danes -- Senior Vice President, Investor Relations\n\nThank you, all, for joining us. We look forward to speaking with you on our next earnings call. Have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAri Danes -- Senior Vice President, Investor Relations\n\nAndrew Lustgarten -- President and Chief Executive Officer\n\nVictoria Mink -- Chief Financial Officer and Treasurer\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nDevin Brisco -- Wolfe Research -- Analyst\n\nFarshid Javar -- Jefferies -- Analyst\n\nMore MSGS analysis\n\nAll earnings call transcripts"
}