{
  "companyName": "Burning Rock Biotech Limited",
  "companyTicker": "BNR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/31/burning-rock-biotech-limited-bnr-q2-2022-earnings/",
  "content": "Burning Rock Biotech Limited (BNR)\nQ2 2022 Earnings Call\nAug 31, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day and thank you for standing by, and welcome to the Burning Rock 2020 Q2 earnings conference call and webcast. At this time, all participants are in listen only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator instruction] Before we begin, I'd like to remind you that this conference call contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended and as defined in the U.S.\n\nPrivate Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as will, expects, anticipates, future, intends, plans, believes, estimates, target, confident, and similar statements. Statements that are not historical facts, including statements about Burning Rock's belief and expectations of forward-looking statements. Such statements are based upon management's current expectations and current market in operating conditions.\n\nAnd relate to events that involve known or unknown risks, uncertainties, and other factors. All of which are difficult to predict, and many of which are beyond Burning Rock's control. Forward-looking statements involve risks, uncertainties, and other factors that could cause actual results to differ materially from those contained in such factors, in such statements. Burning Rock does undertake any obligation to update any forward-looking statements as a result of new information, future events, or otherwise, except as required under applicable law.\n\nPlease note that today's conference call is being recorded. I would now like to hand over to your first speaker, Mr. Yusheng Han. Please go ahead, sir.\n\nYusheng Han -- Founder and Chief Executive Officer\n\nThank you. And thanks for coming to Burning Rock 2022 Q2 conference call. I'm Yusheng Han, the CEO, and founder of Burning Rock. For today, we have our COO, CTO, and CFO in a meeting.\n\nWe know that Q2 was really a hard time for most of the companies in China, with completely locked down of Shanghai in April, and May and a half locked down of Beijing in May. Despite its difficulties, we're still reporting a year-on-year increase in Q2 in terms of revenue. The gross was contributed by strong in-hospital revenue growth outside of Shanghai and Beijing. New product lines such as MRD products and pharma business.\n\nSo let's review our business outline and the progress, and our COO, Shannon will go through the development of our product line, and after that our CFO, Leo will go through the financials. Let's turn to Page 3. So that's a basic introduction of Burning Rock. We started with therapy selection business in 2014 and have grown to the market leader in this segment.\n\nAnd the leading position has laid a good foundation, and given those advantages moving forward to new business of early detection, MRD, and pharma collaboration. Let's turn to Page 4. And this is for our business objectives in the future. So therapy selection is a segment that we have working on for 8 years.\n\nIn the past year, our main goal for this segment is to expand market-share in both in-hospital model and a central-lab model. And the in-hospital model now is operating profit positive, while central-lab is loose making. And we are strongly, now we are strongly leaning our strategy to in-hospital model. We have select a clear goal of making oncology profitable in 2023.\n\nNew clinical utility evidence and technology development demand mature liquid-biopsy technology and personalized panels. Therefore, we initiate trials in lung, CRC, and other cancers. This will be the barrier for our product and not easy to be replicated like therapy selection. The pharma business is a channel with strong needs of both therapy selection and MRD.\n\nAnd this thrives highly depend on the institution's values such as quality, and registration capability. In the business, has been profitable and strong growth continues. The multi-cancer early detection, we believe that it is the ultimate solution for cancer early detection, powered by multidimensional testing, including methylation, plus NGS, plus machine learning. Multi-cancer early detection has better performance versus single-cancer early detection.\n\nAnd by the way, in a real scenario, we cannot draw out like a 22-cell block if we want to detect 20 types of cancers. Thus, we invest the huge resource of technology development and clinical trials. We believe that it will build strong barriers that can last for many years. And the good news is that the competition with the [Inaudible] cancer early detection registration gets better recently.\n\nSo let's turn to Page 5 for our recent of progress. The in-hospital model revenue keeps strong increased. Our regions, excluding Beijing and Shanghai, grew over 60% year-on-year in Q2 in terms of volume. In a new product, including MRD, [Inaudible], help us gain market-share in central-lab model.\n\nAt the end of Q2, we optimize [Inaudible] and started to reduce at the end of Q2, we started to reduce the commercial investment oncology business unit as well. And due to the excellent execution impact to the revenue is very limited. We are in a much better position to grow through the winter. And the commercial ramp of MRD is strong since we launched the product in March, especially after the data read-out on mass market on lung cancer NSCLC in Asia.\n\nThe revenue of biopharma grew triple-digit year-on-year to RMB 18 million contributing to 14% of all revenue. And a backlog continues to build with contract project value grew 49% year-on-year, to RMB 158 million during the seven months in 2022. For early detection, the data by Promise was released as a data of over 2000 participants for nine cancer tests, read-out at ESMO in September. And for the clinical programs of early detection, to prevent the study was launched and it is a trial composed of 12,500 participants and is China's first multi-cancer prospective interventional study.\n\nLet's turn to Page 6. In this page, I just want to utilize the graph to illustrate that the pharma business is growing really strongly. The green columns are combination of contract value of 2021 versus 2020, and the blue columns are combination of contract value of the first seven months of 2022 and 2021. And this is achieved in a situation that Shanghai was totally locked down in April and May.\n\nAnd that way we know, as we know, that Shanghai the headquarters of many pharma where we would like to say that this achievement is great, and yeah that's basically about our lineup very well, and then I will pass to Shannon, does talk about our pipeline.\n\nShannon Chuai -- Director and Chief Operating Officer\n\nOK. Thank you, Yusheng. So now let's move on to Page 8. So first I'd like to take a minute and reillustrate the opportunities of MRD tests in early stage patients.\n\nAs the establishment of different community activities will ultimately drive the market growth. So on this diagram, we can see that an early stage patient could go through neoadjuvant and or adjuvant therapy before and after surgery, and then hopefully a long disease-free period afterward. As we all know, the most well-established MRD utility is the prognosis prediction, and multiple studies across different cancer types and different technology platforms have validated the strong and robust association between MRD status, and the patient prognosis at both the landmark and longitudinal timepoint. So such utility is marked as green on this diagram, you can see that they happen at different time points along the way.\n\nHowever, this prognosis utility itself would probably not be strong enough to drive a very high penetration of MRD test, because it would be the kind of nice to have but to what test which is informative but not exactly actionable for clinicians. But, with that said, we're now starting to see more and more truly actionable utilities of MRD tests to evolve, which are the one labeled rad on this diagram. Among these utilities, the most important one, and also I think the most immediate one, is to differentiate low-risk and high-risk patients based on the landmark MRD right after surgery and to commence escalated or be escalated as one therapy regimen. So if clinical trials in the coming years can validate such MRD guided treatment selection strategy, then the penetration of market tests among early stage patients would become very, very significant.\n\nTo Page 9 and Page 10, actually show 2 [Inaudible] in terms of what kind of results from trials, which serve the need as validation of the MRD guided treatment strategy, they are both our recent studies. Page 9 is the IMvigor010 study, which is a phase three trial of Atezolizumab in bladder cancer patients after maintenance treatment. So on the top corner, the top left corner here, it shows that in this trial, the whole ITT population did not show any efficacy from the treatment compared to the control arm. And then on the right, we can see that if we zoom in, only the 39% MRD positive patients at landmark benefited from a T-bill.\n\nSo this is a very strong evidence, this is a great example to show that the MRD utility as to identify the high-risk group and give them more therapy. Of course, the MRD analysis in this study was only retrospective, and that's why [Inaudible] 11 has been initiated as a prospective study and will be able to confirm if such utility can be validated in the CDX type of setup. And then Page 10 is an even more recent example. This is a dynamic study in the colon cancer, patients were randomized into two groups, was standard of care or ctDNA guided treatment strategy.\n\nSo in the past ASCO meeting, which has happened a couple of months ago, it has reported that the MRD negative patients in this study who underwent far less adjuvant chemotherapy, achieved similar or non-inferior recurrence-free survival compared to the standard of care group. So if this is validated repeatedly in multiple studies in the near future. It would mean that MRD negative studies actually represent this have cured patients after surgery who can be exempt from adjuvant chemotherapy. So again, studies like these would surely bring MRD into a [Inaudible] biomarker and greatly increase its penetration down the road.\n\nSo because of these advancements, we're also witnessing more endorsements for MRD in the commission community, including, it's mentioning in the FCC and colorectal cancer guidelines in the ESMO recommendations in [Inaudible] as we have shown last time. Page 11 is the consensus among Chinese lung cancer doctors for MRD, and this particular consensus has been widely talked about recently within the China doctor community. And also, as far as we know, a consensus on MRD in colon cancer among Chinese oncologists are also being written and should be expected in the near future. With all that, on page 12, we outlined a development plan for brProphet, which was to capture the personalized MRD assay we have developed and launched a few months ago, starting from March.\n\nThe initial market response has been pretty exciting, which our CFO Leo will cover in later slides. And as we have introduced before, the nonprofit is able to reach an MRD of 0.004%. We have released initial clinic validation data on lung cancer and colorectal cancer cohorts in the past AACR. And then on the bottom half of page 12 here, we lined up our additional clinical programs and expected data read-out timeline, for example, for lung cancer, for the observational studies at the pink bar is showing on the top, we will submit the metal cohort for publication in a few months, which I'll show some key findings in the next page.\n\nWe also have two interventional studies launched or planned to launch later this year. We expect to start having data read-outs from these interventional studies, to validate the MRD guided treatment section utility in lung cancer in 2025, which is shown here at the Dark Red Bar. And then the timeline, colorectal cancer is actually similar to lung cancer. In our plan, we expect to have a large cohort operational study results reported in early 2024, as in the light blue bar.\n\nAnd we're also initiating interventional studies which expect to have data read-outs by 2026, as in the dark blue bar. So for other cancer types, which are in the last bar, we have initiated multiple operational studies, mostly in esophageal cancer, breast cancer, etc. The earliest time for data read-out expected is in 2024. So our expectations for the market growth were already in China is also matched with the clinical program timeline outlined here.\n\nSo which means that from 2022 to 2024 is what we expect to be the early market adoption period, mostly driven by the prognosis part of the MRD utility, which has been well established. And then between 2025 and 2027, where more and more international studies conclude the actionable part of the MRD that you could see will be fully established. So we would expect for the second wave a strong growth of MRD around that time. So now let's turn to Page 13.\n\nHere we want to take a couple of minutes to briefly show some key results from the three medical boards. In the study, which contained about 200 participants, their profit was compared actually to a six-dependent approach in terms of landmark and longitudinal MRD testing. But what we have observed on the last graph is that the nonprofit identified almost three times as many to high-risk patients as the six panels say at the landmark timepoint. This shows the superior sensitivity of the brProphet at the personalized approach.\n\nAnd then in the middle graph, you can see that the longitudinal MRD negative patients, which are the blue line here on the top, has a near-perfect prognosis in about three years on follow-up, indicating that the beyond profit MRD test, when applied repeatedly, can pretty accurately identify the patients who are practically cured. And then on the right graph here, we can see that the prognosis separation between MRD positive and MRD negative patients defined by brProphet is actually across different states. So it doesn't matter whether you are stage one or stage three, the prediction power stays the same. So we think this is a very strong validation for the sensitivity and accuracy of brProphet.\n\nNow I'll skip page 14, which is our MRD data on colorectal cancer because we already talked about it last time. And let's go directly to the early detection part. Since we have gone through our development roadmap for multiple time quality detection programs, I'll be very brief today on this topic and just bring your attention to page 17. On Page 17, there are two major updates here.\n\nFirst, as you already mentioned, the Promise study, which is the pilot case-control study for a noncancer type assay has been completed. The results will be released at the coming [Inaudible] in a few days. In short, we successfully expanded the model from 6 cancer to 9 cancers, which showed promising improvement and sensitivity in some of the nine cancers, compared to the previous version, while maintaining equally high specificity and [Inaudible] accuracy. Interestingly, we have tried to combine multi-omics data, including DNA methylation, DNA mutations, and protein markers to show the contribution of each omics data on different cancer types.\n\nWe will be able to share the details of this performance in the Promise study in the next call. But of course, you are welcome to weigh down the details in our ESMO poster. The other update here is the prevent study. Unlike all the other studies we have done before, prevent study is a prospective study conducted on a symptom-free population.\n\nIt's the first study of this kind in China for kids' early detection with a sample size greater than 10,000 participants. It's also designed so that our six cancer and my cancer patients can be both tested for their performance later on this cohort of individuals. We started patient enrollment in Q2, and we're seeing pretty good accrual progress. So that's all from me.\n\nNow I turn to Leo Li to walk you through our financials.\n\nLeo Li -- Chief Financial Officer\n\nThanks, Shannon. Let's move on to financials, and we'll start with Page 22. And for the second quarter, as Yusheng mentioned earlier, we have two things going on. We have number one, Covid impact, and number two, our underlying growth momentum.\n\nSo in the following two pages, we try to separate that provide better clarity on the volume trend, underlying trend. In other words, we're trying to address the question that if we assume that Covid impact is eventually going to go away in China, and what would our volume factor is eventually going to go away in China and what would our volume trends look like? So first of all, a brief recap on Covid in China during the second quarter impact havoc in China. Shanghai was locked down for more than two months. There were multiple other large metropolitans that have been shut down or have lockdowns.\n\nBeijing had school closures and partial lockdowns. And so frontline anecdotes appeared data indicated that our industry was generally down in the second quarter, and appears generally down year-over-year on their volumes. If we look at our volume data, the in-hospital channel was heavily impacted at Shanghai was a large market for us, for the in-hospital channel central-lab held up ok, and this is supported by new products, particularly MRD. Then on Page 23, we provide further granularity on the trend over time and across different regions with varying Covid impact.\n\nOn the left, we see that for our central-lab as MRD started to generate volumes since its launch in March, it supported a sector that industry uptrend for the central-lab channel through the second quarter, and we continue to see very good momentum on this MRD take up by the physician market in China. For in-hospital as shown on the right-hand side, Shanghai and Beijing represent a large market for us and these were heavily impacted. And our latest monthly print for July shows that there was partial recovery, but we're not back to normal. We did manage to grow very strong in regions where the Covid impact was small, and we try to show that nearby breaking out other regions apart from Shanghai and Beijing for the in-hospital channel, and those regions grew very good double-digits throughout the second quarter.\n\nNow moving on to our financials on page 24. First, on revenues, we were up 3% year-over-year, or down slightly on a sequential basis. Because of the Covid impact and the disproportionately large impact in Shanghai, the in-hospital revenues were heavily depressed in the second quarter, which weighed on our overall revenue growth. Other than in-hospitals, central-lab was down 2% year-over-year and was actually up 6% on a sequential basis compared to the first quarter.\n\nMRD launched since March drove the sequential top-line growth despite Covid impacts across various cities in China. The pharma revenues continued to go up in the second quarter as we bear fruits from the strong backlog that we have been able to build as previously shown on page six. And pharma revenues represented 14% of our total revenues in the second quarter. So that is starting to make meaningful contributions to our overall top line.\n\nAnd our pharma product backlog continues to build nicely, and our pharma revenues are generally recognized as those studies, or studies of our pharma customers are executed over time. So there could be some lumpiness and is dependent on the kind of progress of our pharma client study. So there could be lumpiness quarter-over-quarter as we have seen from other peers, for example, in the U.S., other side, we don't have any Covid-related revenues in our top line, so it's 100% precision oncology testing revenues. So we don't have to worry about a cliff or a decline of Covid testing revenues at all going forward.\n\nYou're looking at our margins first on our gross profit margin on a non-GAAP basis, which excludes depreciation and amortization. Our non-GAAP GP margin is generally stable, we did a 70% GP margin in the second quarter. Now moving to our operating expenses, first on our R&D line, we are becoming more focused as we put higher focus on operating efficiency, i.e. we have reduced our spend on maintenance or non-core projects while continuing our core R&D on early detection, and separately enrollments slowed down due to Covid in the second quarter, also brought down clinical study-related expenses.\n\nNow, moving on to the sales and marketing line. The biggest component is our headcounts here, and as Yusheng mentioned in his remarks, we have strived to achieve higher efficiencies starting this year for the patient testing business, and we carried out a organization optimization program in the second quarter. The result of that, both our headcount for the oncology sales organization down as of June and both sequentially and year-over-year basis. And during the second quarter, however, there were one-off or restructuring costs involved.\n\nThe numbers appeared lumpy, but as we called out in the previous quarters, the direction of travel should be trending down, and efficiency should improve as we move forward. Then moving on to the G&A line, we also incurred one of items in the second quarter. The biggest component of our G&A is our headcounts, which that's the biggest component, and that has started to trend down on a sequential basis as well. So as we mentioned before, we are putting a higher focus on our operating efficiency, and we generally expect operating efficiencies or operating expenses to change down over time.\n\nThen I'm talking about our guidance. Covid situation remains very fluid in China as the Covid policy [Inaudible] place. And there were a couple of cities that recently announced lockdowns over the past few days, if COVID does worsen or if we have large-scale lockdowns, this will have a significantly negative impact on our revenues. However, we believe that the point is not for us to make a forecast on Covid, so we will not try to do that.\n\nAnd we do see strong momentum on an underlying business coming from. Number one, to market-share gains or the in-hospital strategy. Number two, MRD volume ramp. And number three is strong backlog of our pharma projects converting to revenue.\n\nSo we, therefore, retain our current guidance for the full year, and we just call out the lingering Covid risk. And lastly, I want to mention our cash balance. We show our operating cash outflow on the page here as well. So as of the end of second quarter, we have a healthy cash and investments balance of RMB 1.15 billion, or $172 million.\n\nWe believe this supports us beyond the next two years, so we're happy with the cash balance and we believe this is also the largest cash balance in our industry, which will provide strength into our long-term product development efforts into early action, making us the longest cash runway in the industry. So that concludes our prepared remarks and we are happy to open for questions.\n\nOperator\n\nThank you.[Operator instruction] The questions come from the line of Max Masucci from Cowen. Please ask a question. Your line is open.\n\nUnknown speaker\n\nHi, this is Stephanie on for Max. Thanks for taking my question. To start off, could you speak to some of the key revenue drivers and any assumptions based in for the second half of this year? What gives you confidence in maintaining the full year 2022 guidance in order any potential sources of upside to keep in mind?\n\nLeo Li -- Chief Financial Officer\n\nYeah. So when we made our guidance toward the start of this year, we did leave some buffer for Covid, and I would say those buffers were pretty much used off in the second quarter. So we were conservative to start with. And if we don't have any other Covid outbreaks going forwards and based on the underlying trends, we are happy.\n\nWe have confidence to of our guidance. We saw a large drop in Shanghai and those comeback, we will get pent-up demand there. Apart from just getting back to normal from Covid, the underlying growth from pharma and from MRD, from additional gains in the hospital are strong when there's no Covid impact. So I think totally remains the number one factor.\n\nBut if we take that aside, we are still confident about the guidance that we have for the full year.\n\nUnknown speaker\n\nGot it. Understood. That's helpful. And then following the lockdown, could you give us some more color on what Shanghai and Beijing currently look like? You mentioned some pent-up demand there.\n\nAny more color you can give on that as patients return to get tested? And then if you can share, do you mind sharing how much Shanghai and Beijing make up of your total revenue?\n\nLeo Li -- Chief Financial Officer\n\nYeah. They make up. I mean, for the in-hospital, they make up the [Inaudible] share. More than half of our in-hospital volumes.\n\nFor the overall volume, they represent a significant portion, about a quarter, roughly speaking. And we have seen improving trend over time, but they're not back to full normal yet. But if there's no further impact, we do expect patients to return. And a lot of patients go to Shanghai and Beijing from regions outside of Shanghai and Beijing, so that travel can come back.\n\nYou know, there is a volume that we have yet to be able to catch up with, so that's something to keep and watch. We provide in the presentation the latest reads in July, and we will continue to try to provide as much clarity as possible going forward.\n\nUnknown speaker\n\nGot it. Thanks for that color. I can squeeze in one more. It's great to hear the uptake of your MRD test following its launch in March, as well as the complexity of MRD for lung cancer among ten physicians.\n\nWhen should we expect a similar consensus view for colorectal cancer? And are there any catalysts to keep in mind in the near to mid-term that could further drive MRD adoption?\n\nShannon Chuai -- Director and Chief Operating Officer\n\nYes. In terms of the consensus among the colorectal cancer. What we can comment on right now is that it's being very actively discussed, and there have been multiple conferences focused on MRD and how should the consensus be reached. But I can't predict precisely when the exact consensus is going to happen.\n\nBut I can say that just the discussion itself has brought a lot of attention around the community. So we are pretty optimistic that the colorectal cancer community for the clinicians are going to catch up with the lung clinicians community in terms of their awareness of the MRD usage. And then in the near future, I think the upcoming studies, for example, like the dynamic, the circulate depend. So I think people aren't anticipating the results from these interventional studies because people have been fully convinced about the prognosis prediction part of the MRD.\n\nBut now they are waiting to see whether the MRD can resolve the ultimate the what question. So I think the circulate depend and dynamic are very well-designed studies to answer those questions. And, so far the dynamic results showing the MRD active half from the study have been viewed as very promising and pretty exciting. So I think in the next couple of years, these studies will have their read-out and if they continue to show positive results, it would be a very, very strong push for the community.\n\nAnd also another potential factor is the pharmaceutical companies' adoption of MRD to embed MRD into their drug development studies, for example, the MERMAID-1, MERMAID-2 study from AstraZeneca. I think those were had MRD embedded in their design. And also the results from those trials would be very critical in terms of people's view on the MRD utility automakers.\n\nUnknown speaker\n\nGot. Thanks so much, Shannon, for that color. And just one quick one on the guide. Does your guidance contemplate the uptick in pharma revenues in the first half of this year when you set that guidance range?\n\nLeo Li -- Chief Financial Officer\n\nYeah. Pharma has been on track or slightly beating our internal forecast so far this year. So we're happy about the progress there, and it has been a strong factor in our outperformance across peers in industry. But I would say that I think the visibility of that has been built already previously on the backlog and that continues to build.\n\nSo that should provide us with further runway going forward as well.\n\nUnknown speaker\n\nGot it. Understood. Thanks so much for taking all my questions.\n\nLeo Li -- Chief Financial Officer\n\nThank you, Stephanie.\n\nOperator\n\nWe have no further questions at this time. I'll hand back the conference to Yusheng. Thank you. Please go ahead.\n\nYusheng Han -- Founder and Chief Executive Officer\n\nSo thanks, everybody, for attending our earnings call today. And if you have any questions, please do come back to us. Thanks very much for your time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nYusheng Han -- Founder and Chief Executive Officer\n\nShannon Chuai -- Director and Chief Operating Officer\n\nLeo Li -- Chief Financial Officer\n\nUnknown speaker\n\nMore BNR analysis\n\nAll earnings call transcripts"
}