{
  "companyName": "Weber",
  "companyTicker": "WEBR",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/14/weber-webr-q4-2022-earnings-call-transcript/",
  "content": "Weber (WEBR)\nQ4 2022 Earnings Call\nDec 14, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. Welcome to Weber Inc.'s 2022 fiscal fourth quarter and year-end earnings call. [Operator instructions] At this time I will turn the call over to Brian Eichenlaub, vice president of investor relations and treasurer for Weber. Mr.\n\nEichenlaub, you may begin.\n\nBrian Eichenlaub -- Vice President, Investor Relations and Treasurer\n\nGood morning. Thank you for joining us today for our 2022 fiscal fourth quarter and year-end earnings call. I am joined this morning by Alan Matula, our interim chief executive officer; and Bill Horton, our chief financial officer. I'll start with our forward-looking statements disclaimer.\n\nAs you are aware, certain statements made today, such as projections for Weber's future performance are forward-looking statements. Actual results could be materially different from those projected. For further information concerning factors that could cause results to differ, please refer to our public 10-K SEC filings, our earnings release, and our SEC filings, all of which are available on the company's website. During the call today.\n\nThe company may also discuss certain non-GAAP financial measures For a reconciliation of these measures to GAAP reporting, please refer to the company's earnings announcement, which has been posted on the company's website at investors.weber.com and can be found in the company's SEC filings. A recording of today's webcast will be archived for at least 90 days at Weber's investor relations website. And now, I'd like to turn the call over to Alan.\n\nAlan Matula -- Interim Chief Executive Officer\n\nThank you, Brian, and good morning, everyone. Earlier this week, we announced two large developments for Weber. First, we announced a go-private transaction with BDT Capital Partners. Over a decade, BDT has been a long-standing strategic partner with the Weber team.\n\nWith their continued support, our global team will move forward in executing our long-term strategy with consumers and customers as our top priorities. In addition to this transaction, we've optimized our capital structure to navigate the current operating environment. In early November, we entered into an unsecured term loan agreement with BDT managed investment funds for an initial aggregate principal amount of $61.2 million. Then, earlier this week, we secured incremental funding from BDT in the form of an unsecured $230 million revolver and a $120 million unsecured term loan for incremental financing of $350 million in aggregate.\n\nWe intend to utilize the revolver and the loan for general corporate purposes, including repaying existing indebtedness, making necessary capital investments that support our new product initiatives and funding working capital for the upcoming 2023 outdoor cooking season. This financing offers the organization an immense flexibility as we continue to execute our growth and margin expansion strategies from a liquidity standpoint. We expect to remain in compliance with all of our credit agreement for the foreseeable future. Now, let's review a summary of our fiscal results, and Bill will provide additional details shortly.\n\nIn fiscal 2022, we generated net sales of 1.6 billion, a 20% decrease versus last year. Our business is performing amid a challenging operating environment that we're executing around the world. If we look at performance on a three-year basis, sales have increased 22% above 2019 levels, or $290 million, highlighting the strength of this category and the Weber brand over the long term. This perspective is important as we maintained significant top-line growth compared to pre-pandemic levels despite some recent global consumer sentiment changes.\n\nWeber's growing business is positioned to navigate current headwinds. Adjusted EBITDA decreased to a loss of 1 million from 307 million last year. Management is focused on margin expansion in fiscal year 2023, and we've taken the necessary steps to address our profitability profile. Operationally, we continue to execute on our mission and purpose to deliver the highest quality, most innovative products, and best-in-class customer service around the world.\n\nOur unmatched global infrastructure, unique manufacturing footprint, and owned distribution channels continue to be our greatest differentiators in driving efficient operations. Our new product reviews and customer satisfaction scores have continued to be excellent, remaining above a 4.5 star average out of five stars from the purchasers online. Now, I want to take a moment to update you on market trends we are observing. The consumer behaviors and dynamic market shifts we've experienced over the second half of our fiscal year have persisted.\n\nThe outdoor cooking sector continues to contract from pandemic sales levels. The industry has seen a significant drop-off in year-over-year point of sales data, with sharply reduced shopper traffic, both in retail stores and online. We see indications that some of these pressures are softening, and I can confidently say we're addressing challenges we see in the operating environment head on. This is demonstrated through the ongoing improvement we're making in one of our greatest strengths, our global supply chain.\n\nWe are enhancing this core competency through a number of digital initiatives. We are prioritizing disciplined investment in our processes and technology to build one of the most agile global supply chains and distribution networks in the industry. Our systems we have launched centralize processes and add efficiency. We believe they'll have immediate benefits to our margin profile in fiscal year 2023.\n\nWith that, I want to now turn it over to Bill, who will review the fourth quarter and full year performance. Bill?\n\nBill Horton -- Chief Financial Officer\n\nThanks, Alan, and thank you, everyone, for attending our call today. Turning to our financials. Fiscal year-end 2022, net sales decreased 20%, or 396 million, to 1.59 billion from 1.98 billion last year. As Alan mentioned, on a pre-COVID three-year basis, sales increased 22% above 2019.\n\nExcluding the negative impact of foreign exchange, on a three-year basis, sales increased 27% versus 2019. Of the year-over-year sales reduction, foreign exchange accounted for 65 million, or 16% of our year-over-year decline, driven by U.S. dollar strength against the euro, GBP, and Australian dollar. Excluding the impact of foreign exchange, net sales declined by 17%.\n\nFor the Americas, net sales decreased 26%, or 283 million, to 820 million from 1.1 billion last year. As a point of reference, for the last non-COVID impacted fiscal year-end 2019, Americas net sales were 715 million. And on a three-year basis, revenues increased 105 million or 15% versus 2019. For EMEA, net sales decreased 16%, or 113 million, to 613 million from 726 million last year.\n\nOn a three-year pre-COVID basis, from 2019, net sales increased 129 million or 27%. The year-over-year decrease was primarily attributable to slowed consumer purchases due to macroeconomic and unfavorable foreign exchange rates. Excluding the impact of 56 million of negative foreign exchange headwinds, net sales contracted 8% versus the prior year. In addition to foreign exchange, the year-over-year sales reduction was primarily driven across our big markets like Germany, the U.K., and Denmark, along with the suspension of operations in Russia.\n\nWhile overall EMEA sales were down, we did grow charcoal, pellet, and electric product families above last year's levels. In Asia-Pacific, net sales decreased 0.2%, or 0.3 million, to 154 million, essentially flat versus prior-year sales. On a three-year pre-COVID basis, from 2019, APAC net sales increased 56 million or 58%. While flooding in certain regions in Australia adversely affected product demand, we were able to offset this challenge with solid growth in New Zealand, South Korea, and China.\n\nFor the year, foreign exchange negatively impacted sales by 7 million, primarily driven by the Australian dollar weakness against the U.S. dollar. So, on a constant currency basis, sales grew 5% above last year. For the year, as expected and indicated on previous calls, gross profit decreased 391 million, or 47%, to 434 million from 825 million last year.\n\nAnd gross margins decreased 1,427 basis points to 27.4% from 41.6% last year. The decreases in gross profit and gross margin were primarily driven by higher inbound freight costs, higher commodity costs, unfavorable foreign exchange impacts, and lower sales volumes that were partially offset by price increases. Selling, general, and administrative costs for the fiscal year-end decreased by 154 million, or 21%, to 585 million from 739 million last year, and decreased 42 basis points to 36.9% from 37.3% of sales last year. The decrease was primarily driven by lower stock-based compensation expense, reductions in advertising and corporate marketing expenses, and lower incentive compensation expense.\n\nFor the year, net income decreased by 336 million to a net loss of 330 million from net income of 6 million in the prior year. As previously discussed, the decrease was primarily driven by lower sales; cost of goods sold increases, including inbound freight and commodity costs; foreign exchange losses; higher income taxes; and restructuring costs, partially offset by reductions in SG&A. For the fiscal year-end, adjusted EBITDA decreased 308 million to a loss of 1 million from 307 million last year and decreased 1,542 basis points. Adjusted EBITDA margin came in at negative 0.1% versus 15.5% last year.\n\nTurning to cash flow, net cash used in operating activities was 363 million versus 54 million of cash generated by operations in the prior year. Increased cash usage was driven primarily by our net loss. The cost management plan we introduced last quarter was created to reduce structural costs and improve cash flow. Since our last call, we have nearly completed all of our restructuring initiatives in addition to suspending our dividend.\n\nIn total, this will yield annualized cost savings in excess of 110 million, net of restructuring costs. Before we transition to Q&A, we would like to ask that questions remain focused on the fiscal fourth quarter and full year operations. We are not going to share any additional details with respect to the go-private transaction or any forward-looking guidance. Operator, please open the call for questions.\n\nOperator\n\n[Operator instructions] OK, there are no questions for today. So, I will hand it over to Alan Matula for any further remarks.\n\nAlan Matula -- Interim Chief Executive Officer\n\nYeah. Thank you for joining today. And I'd just like to thank everybody on the Weber team for all the efforts over the 2022 year, and wish everybody a very happy and healthy holiday. So, thank you for joining.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Eichenlaub -- Vice President, Investor Relations and Treasurer\n\nAlan Matula -- Interim Chief Executive Officer\n\nBill Horton -- Chief Financial Officer\n\nMore WEBR analysis\n\nAll earnings call transcripts"
}