{
  "companyName": "Unum Group",
  "companyTicker": "UNM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/unum-group-unm-q3-2022-earnings-call-transcript/",
  "content": "Unum Group (UNM -0.34%)\nQ3 2022 Earnings Call\nNov 02, 2022, 8:00 a.m. ET\n\nOperator\n\nHello everyone, and welcome to the Unum Group third quarter 2022 earnings results conference call. My name is Alex, I'll be coordinating the call today. [Operator instructions] I will now hand over to your host, Matt Royal, senior vice president of investor relations Matt, please go ahead.\n\nMatt Royal -- Senior Vice President, Investor Relations and Treasury\n\nThank you, Alex. Good morning, and welcome everyone. I'm excited to be hosting my first call where we'll be discussing the third quarter 2022 earnings for Unum Group. Our remarks today will include forward-looking statements, which are statements that are not of current or historical fact.\n\nAs a result, actual results may differ materially from results suggested by these forward-looking statements. Information concerning factors that could cause results to differ appears in our filings with the Securities and Exchange Commission, and are also located in the sections titled Cautionary Statement Regarding Forward-Looking Statements and Risk Factors in our annual report on Form 10-K for the fiscal year ended December 31st, 2021, and our subsequent quarterly reports on Form 10-Q. Our SEC filings can be found in the investors' section of our website at www.unum.com. I remind you that the statements in today's call speak only as of the date they are made, and we undertake no obligation to publicly update or revise any forward-looking statements.\n\nA presentation of the most directly comparable GAAP measures and reconciliations of any non-GAAP financial measures included in today's presentation can be found in our statistical supplement on our website in the investors' section. Yesterday afternoon, Unum reported third quarter 2022 net income of $410.7 million or $2.04 per diluted common share, an increase of $328.6 million or $1.60 per diluted common share in the third quarter of 2021. Net income for the third quarter of 2022 included the after-tax amortization of the cost of reinsurance of $12.1 million or $0.06 per diluted common share. A net after-tax investment loss on the company's investment portfolio of $3.4 million or $0.02 per diluted common share, and the reserve decrease related to reserve assumption updates of $122.5 million or $0.61 per diluted share.\n\nThat did come in the third quarter of 2021 included the after-tax impairment loss on internal use software of $9.6 million or $0.05 per diluted common share. The after-tax amortization of the cost of reinsurance of $15.5 million or $0.08 per diluted common share. The net after-tax reserve decrease related to reserve assumption updates of $143.3 million or $0.70 per diluted common share. And an after-tax net realized investment loss on the company's investment portfolio of $100 thousand at the amendments impact on earnings per diluted common share.\n\nExcluding these items after-tax adjusted operating income in the third quarter of 2022 was $303.7 million or $1.51 per diluted common share, an increase from $210.5 million or $1.03 per diluted common share in the year ago quarter. Participating in this morning's conference call are Unum's president and CEO, Rick McKenney; chief financial officer, Steve Zabel; chief operating officer, Mike Simonds; as well as Mark Till, who heads our Unum international business; and Tim Arnold, who heads our colonial life and voluntary benefits. And now I'll turn the call to Rick for his opening comments.\n\nRick McKenney -- President and Chief Executive Officer\n\nThank you, Matt, and good morning, everyone. We're happy to be with you today to share the results of the third quarter, as well as our positioning in the current environment. Our performance in the third quarter continued to build on the momentum of the first half of the year, with growth in operating earnings per share of 47% on a year-over-year basis. Starting with the top line premiums in our core businesses grew at a rate just shy of 4% on a constant currency basis.\n\nAdditionally, we continue to see very strong benefits experienced, particularly in U.S. group disability and colonial life. The growing top line, solid margins, and a better interest rate environment layer on top of already strong capital levels. This provides us the ability to invest in our growth and positions us to navigate the multiple macro scenarios that may emerge.\n\nAs we look to close out 2022, there are many things that give me confidence in our franchise and future growth prospects. When I reflect on our company's leadership in the employee benefits space, it is not a commentary on recent sales or even market share, though both are strong. It is more statement that we are consistent in our purpose of serving employers and their employees. We have a deep understanding of the realities and dynamics of the workplace, whether it's managing leaves, comforting people through tragedy, or continued focus and progress returning someone to work.\n\nOur teams and processes deliver for our customers. This requires ongoing investments in our people, capabilities, and operations, something we continue to build on over the past several years. With COVID shifting to a more endemic phase, we are poised to benefit from the advancements we've made to connect and serve our customers a new leading digital-first ways. Further, the current environment is very good for our franchise.\n\nOur position is benefiting from awareness, for employment, related wage inflation, and much higher interest rates. So let me unpack that for you. The pandemic brought an acute awareness of the financial fragility that many workers and their families face, reinforcing the need for the types of protections we provide and the importance of providing them through the employer. Changing workforce dynamics caused companies to rethink their overall employee value proposition inclusive of benefits, as the competitive environment for talent continues.\n\nFrom a growth perspective, as you see in this quarter's results, our core businesses have rebounded nicely. Increasing employment levels and rising wages have continued to generate higher levels of what we call natural growth. That is our incremental premium, we realize, from rising payrolls at our insured customers. With this tailwind, which primarily impacts our group lines, we realize over year growth in premium income of 3.9% in our core business segments on a constant currency basis.\n\nIn addition, core business sales rose 14.1% on a constant currency basis with growth across all segments. With regards to interest rates, we are prudently measured as a company over many years of declining rates. Today's rising rates are a welcome change and benefit the company in multiple ways. New money yields continue to rise in the third quarter and are at levels that exceed portfolio rates that back our product lines.\n\nHigher interest rates also provide greater flexibility to manage interest rate risk, and as you may have seen in our earnings release, we took steps to lock in these benefits by entering into another series of treasury interest rate locks this quarter. These actions reduce uncertainty in our LTC business by locking in some of today's rates for future cash flows. We will continue to actively explore ways to further reduce risk associated with our LTC block. At the same time, we have always have a watchful eye on our investment portfolio.\n\nThe underlying credit quality of the portfolio is strong, and the investment team remains diligent in their analysis of our credits through the changing market dynamics. We view credit analysis and management as a core competency over many years, and over many years, and through many different credit cycles. We have consistently shown favorable default rates compared to industry averages. Turning to us environmentally driven dynamics and certainly, at the heart of what we do, we are very pleased with the benefits experience we have seen across the board.\n\nWe think this showcases our expertise and continuous investments in our underwriting, pricing claims, processes, and technology. Specifically, performance in our U.S. group disability line was very strong for the second quarter in a row. It recorded one of the lowest benefit ratios on record, and for the second year in a row, we reduced reserves as favorable trend recoveries repeated.\n\nIn addition, the Unum U.S. supplementary voluntary lines and colonial life had another quarter strong margins and combined to represent over 50% of our core business pre-tax adjusted operating income. Although results moderated slightly from the highs we saw in the second quarter, both segments posted early in the high teens. These many positive operating trends that helped drive our GAAP earnings improvement also helped drive strong statutory income, which for the third quarter doubled over the year ago quarter.\n\nAnd on a run rate basis is back to our pre-pandemic level of close to $1 billion a year. This is a great achievement by our team and a reflection of our business model's resiliency. These operating results drove notably strong capital metrics, risk-based capital for the U.S. traditional insurance companies remained at approximately 415% at the end of the third quarter, and our holding company liquidity of $1.1 billion remains well above our targeted levels, while we also de-lever to below 25%.\n\nThis capital strength, along with our contingent capital sources, gives us ample flexibility as we look to grow our high-margin core businesses to fund the needs of our long-term care block, and return capital to our shareholders through dividends and share repurchases. As we look to long-term care, we've committed over $1 billion to the premium deficiency reserve over the last several years. As you may recall, these contributions strengthen our long-term care reserves over and above our best estimate liability. At our Outlook meeting in February, we provided sensitivities to help you better understand and approximate the impacts of interest rate movements on this PDR balance.\n\nIt's important to note that the higher interest rates we're experiencing now work their way into this calculation over a three-year lookback period. When you consider the recent sharp rise in rates in the capital contributions made, projections show positive moves and future funding needs if today's rates hold. To summarize our highly profitable industry-leading core businesses are building momentum at a faster pace than we anticipated coming into the year. Coupled with a favorable operating environment, strong capital position, and prudent risk management, we are in a position to advance on our leading market positions, to continue delivering excellent customer service, and fulfill our purpose of helping the working world thrive throughout life's moments.\n\nNow, it's Steve to cover the details of the third quarter results. Steve.\n\nSteve Zabel -- Chief Financial Officer\n\nGreat. Thank you, Rick. And good morning to everybody. As Rick made clear, we are very pleased with both the operating results and strategic actions advanced in the third quarter.\n\nAs you may recall, the most severe impacts from the pandemic recorded in the second quarter, and these impacts continue to the more endemic state during the third quarter. Coupled with an increasingly favorable interest rate environment, the third quarter performance provides a strong position as we continue through the back half of the year. As I cover the results, I will primarily focus on an analysis of our third quarter results compared to the second quarter of 2022, allowing me to describe how our business lines have been progressing. For items such as premium and sales growth, I will tend to focus more on year-over-year comparisons.\n\nI will also describe our adjusted operating income results, excluding the impacts from our GAAP reserve assumption updates which typically occur during the third quarter. As we outlined in the press release, the reserve decrease related to our annual reserve assumption update totaled $155 million before tax or $122.5 million after tax. And was comprised of releases in both Unum U.S. Group long-term disability and group life.\n\nThe biggest component of the world reserve review was the release of $121 million before tax in the Unum U.S. Group long-term disability line. Claim reserve should represent our best estimate of the future liability, and since the last GAAP reserve review, high levels of performance and continued investment in our operations give us confidence these trends are sustainable. As such, these reserves have been adjusted to better reflect the expected costs of claims.\n\nThis reserve update will have little impact on our forward expectations for earnings or the expected benefit ratios. Although the impact of these reserve updates are excluded from adjusted operating income. They did contribute $0.61 per share to the company's book value. I would note that more broadly we have completed our GAAP reserve adequacy work subject to external audit and all impacts are reflected in these third-quarter results.\n\nThird quarter earnings were very strong, finishing above the improved outlook we provided last quarter, and moderating from some record-breaking results in the second quarter. Before getting into the individual segments, I'd like to provide some broader context on the quarter and frame up some of the key themes of performance we saw. First, the sustained success is driven in part by our ability to take advantage of the favorable operating environment we are in. Wages and payrolls or natural growth bolstered U.S.\n\ngroup results and supported our ability to get top-line growth back in line with historical norms. Also, we recorded another group disability benefit ratio, well below our long-term expectations, as claim recoveries continued to outperform our expectations. Not only does this dynamic aid our operating results, we now expect favorability to persist in the near term. The run-up in interest rates benefits us in a number of ways, including better new money rates for our investments, which outpaced our portfolio yields in the third quarter, as well as providing us the opportunity to reduce risk and LTC through hedging.\n\nA topic I will spend some time on later. Second. After more than two years of significant impacts from the pandemic, we are seeing the shift to a more endemic state with impact staying at a lower and more stable level than we've seen over the last several quarters. U.S.\n\ndeaths in the third quarter were estimated at 40,000, a slight increase from second quarter, but much lower compared to what we have seen prior to that. The stabilized mortality also means more normal results for a long-term care block, which benefited throughout the pandemic. In addition, as a proportion of COVID-19 deaths in the working-age population remained around 15% for the quarter, our core businesses should see less impact. With those factors in mind, I'll begin my review of our operating performance with the Unum U.S.\n\nsegment. Adjusted operating income decreased to $275 million in the third quarter of 2022, compared to $295.4 million in the second quarter. This was driven primarily by lower earnings in group life and AD&D lines partially offset by increasingly strong levels of operating income from the group Disability Line. The Group Disability Line reported an excellent quarter, with adjusted operating income increasing to $129.8 million in the third quarter of 2022, compared to $107.5 million in the second quarter.\n\nThe biggest driver of the earnings improvement was favorable benefits experience, which produced further improvement in the benefit ratio to 62.7% for the third quarter. This result marks consecutive quarters of very favorable claim recoveries in the group long-term disability product line. We are very pleased with how this block is performing, and in this environment, we believe the group disability loss ratio will be in the mid to high 60% range in the fourth quarter Results for Unum U.S. Group Life and AD&D declined from last quarter with adjusted operating income of $30.9 million for the third quarter of 2022, compared to $67.3 million in the second quarter.\n\nThis quarter-to-quarter decrease was driven by a higher average claim size, and also reflected a lack of favorable IBNR runout, which was experienced in the second quarter but wasn't expected to recur. For our group Life Block, we estimate that COVID-related mortality claims totaled approximately 200 and were generally in line with the second quarter. Non-covid-related mortality depressed the results due to a slight increase in average claim size, while the AD&D line experienced more normalized results after a strong second quarter. So looking ahead, assuming national COVID-related mortality continues at its current levels, and we see some moderation in volatility from Non-covid mortality, we would expect the benefit ratio for this line to run in the mid 70% range.\n\nSo moving on, adjusted operating income in the Unum U.S. supplemental and voluntary lines continued its strong performance in the third quarter at $114.3 million, a slight decrease from the very favorable result of $120.6 million in the second quarter. This result was driven by the voluntary benefits join a business partially offset by the individual disability block of business, which produced another excellent quarter, with the benefit ratio further improving from the strong result of 41.3% in the second quarter to 40% in the third quarter. Finally, results for the dental and vision line were slightly below second-quarter results as the benefit ratio increased to 74.5% compared to 72.9%.\n\nAs evidenced by results this quarter and for the first nine months of the year, the supplemental and voluntary lines continued to perform very well, and contribute high levels of operating income to the company. Looking ahead, we anticipate fourth-quarter results to be roughly in line with this quarter's results. So turning to premium trends and drivers, we are very pleased to see the momentum experienced in the first half of the year for Unum U.S. continue into the third quarter, with growth in premium income of 3.9% on a year-over-year basis compared to the 3.3% increase we saw in the second quarter.\n\nThis momentum was exceptionally strong in the group disability line with a year-over-year growth of 7.4% in the third quarter compared to 5.1% in the second quarter, driven by sustained high levels of natural growth. Sales growth for Unum U.S., with an increase of 11% year over year in the third quarter and 14.9% for the first nine months of the year. Underpinning these growth trends, sales in our supplemental involuntary lines grew 13.9%, driven by sharp year-over-year growth in our individual disability and voluntary benefits lines, which grew 23.9% and 19.1% respectively. And the group Disability Line, which grew 12.3%.\n\nFrom a market perspective, we saw particularly strong results in our core market segment, which are those employers under 2000 lives, offsetting lower sales. Sales in large case. Persistency continued to remain generally stable with some variation by line of business with our total group block at 89.7% for the third quarter. As noted, the current operating environment is one that is very favorable for our business.\n\nOne example of this is the contribution from natural growth in our group product lines. This quarter, natural growth continued to accelerate for us increasing to more than 5% on a year-over-year basis in the third quarter. Taken together, we are very pleased with the top-line growth trends we are experiencing in Unum U.S. and believe the good momentum we've experienced will continue to persist as we look ahead to the fourth quarter.\n\nMoving to the Unum International segment, adjusted operating income for the third quarter increased to $29.9 million from the $24.9 million in the second quarter in the face of a weaker pound-to-dollar exchange, rate. Adjusted operating income for the Unum U.K., business improved in the third quarter to £23.6 million, compared to £19.3 million in the second quarter. The reported benefit ratio for Unum U.K. was 78.6% in the third quarter, compared to 89.7% in the second quarter.\n\nAs has happened in the past few quarters, the high levels of inflation experienced in the U.K. distorted the reported benefit ratio again this quarter. As a reminder, a significant portion of our policies in the U.K. have an inflation rider, which are backed by inflation-linked gilts.\n\nInflation-linked benefits are capped, but the income we receive from the link gilts is not which benefits us in periods of very high inflation. Adjusted for this impact, the underlying benefits experienced in the third quarter was still slightly improved in the second quarter as benefits experienced in the group disability line offset an increase in group life claims. For Unum Poland, third quarter adjusted operating income was higher than second quarter, and we remain pleased with the growth and performance of the operation and humbled by the resolve of our people. Premium income for our Unum International business segment declined on a year-over-year basis in dollars but continues to show solid growth on a local currency basis.\n\nUnum UK generated premium growth of 12.1% on a year-over-year basis in the third quarter and our full in operation produce growth of 14.2% in local currency. Both businesses continued to generate very high levels of year-over-year sales growth in the third quarter, with Unum UK up 106% in Unum Poland up 21.8% in local currency. Next adjusted operating income for the Colonial Life segment was $90.4 million, compared to $101.1 million in the second quarter, a strong result following one of the highest results on record last quarter. The benefit ratio continued to perform below historical trends and improved to 46.8% in the third quarter from 47.6% in the second quarter.\n\nWe continue to anticipate the benefit ratio will trend toward the 48 to 50% range for the remainder of 2022. Despite the improved benefit ratio, expenses increased slightly, reflecting both investments in our people and technology. Although expenses in this segment were higher, expenses for the total company, as measured by the expense ratio, are still below the outlook we gave at our investor day of being up $125 to $175 basis points for the full year, and we do expect to trend to the low end of that guided range for the full year. For colonial whites top line.\n\nWe have previously indicated it will take a couple of years to return to pre-pandemic levels of premium growth. This quarter's result trended in a positive direction, growing approximately 1% over prior year, and demonstrated the strong sales recovery we have been experiencing over the past several quarters. With sales increasing 7.8% for the first nine months of the year and 3.2% for the third quarter. We feel very good with the progress we've made to build back premium income to pre-pandemic levels for this business.\n\nThis is evidenced by premium income on a trailing 12-month basis, exceeding that of full year 2019 by 1.2%. In the closed black segment, adjusted operating income, excluding the amortization of cost of reinsurance related to the closed black individual disability reinsurance transaction was $34.1 million, compared to $79.3 million in the second quarter. The decline largely reflects lower miscellaneous investment income, which fell $36.4 million from the second quarter as income from our alternative investment portfolio moderated as expected. I'll speak more to this portfolio in a few moments.\n\nFor benefits experienced, long-term care remains stable with the adjusted interest adjusted loss ratio at 85.7% compared to 85.9% in the second quarter and 81% on a 12-month rolling basis. As the pandemic transitions to an endemic. We will continue to monitor how mortality plays through this block. The level performance for LTC this quarter is consistent with our long-term expectations of an interest-adjusted loss ratio between 85% and 90%, while our prior 12 month ratio remains below the range due to pandemic-related claim of mortality.\n\nFor the close block individual disability line, in the interest of just the loss ratio decreased to 77.5% from 79.5% last quarter, remaining within our long-term expectations. Assuming a normal environment, we generally expect closed-book adjusted operating earnings to be in the $45 to $55 million range subject to volatility and income from the alternative asset portfolio. So then wrapping up my commentary on the quarter's financial results, the adjusted operating loss in the corporate segment was $49.5 million, compared to $36.9 million in the second quarter, primarily driven by higher expenses, including those related to debt management activity. Going forward, we anticipate quarterly losses in the segment in the $40 to $45 million range.\n\nRegarding debt management, last quarter we announced our intention to call $350 million in notes due to maturity in 2024 and refinanced it with the proceeds of a five-year bank term loan facility, which was priced very attractively compared to market spreads. This transaction allowed us to effectively extend the maturity by three years, foregoing the need to issue at current spread levels. Moving now to investments, we continue to see a great environment for new money yields. Given the continued run-up in interest rates and widening in corporate bond spreads so far this year.\n\nIn the third quarter, the 10-year treasury increased 81 basis points and its upward trend continued into October. But these factors applying new money rates continued to increase and now exceed product portfolio yields. Miscellaneous investment income decreased in the third quarter to $18 million, compared to $57 million in the second quarter. Second quarter results benefited from our highest level of alternative investment income on record at 54 million.\n\nLast quarter we guided for this result to moderate down below our run rate expectation of 20 to $25 million due to the market volatility seen in the second quarter. Despite this volatility, income from our portfolio was solid, posting $13 million of earnings. As our exposure to real assets continues to benefit us in this economic environment. We believe this result is a strong testament to our approach with alternative asset investments, and we have been very pleased with its performance throughout the pandemic.\n\nWe've sought to build a high-performing portfolio that is diversified, defensive, and supportive of our long-duration liabilities. So, looking ahead, our current estimate is that fourth quarter alternative asset income will be below our run rate expectation, and likely below third-quarter results, but still positive. Miscellaneous investment income from traditional bond calls was up slightly from the second quarter but remains below the unusually high volume seen in 2021. While lower bond calls pressure net investment income in the short run, maintaining a higher-than-market yield in securities is beneficial to our portfolio yields.\n\nAs discussion continues around the likely hood of a recession. I want to take a few moments to highlight the strength of our investment portfolio. First, we actively manage and monitor the profile of our investment portfolio, which is comprised largely of corporate credit. As Rick mentioned, we have consistently experienced favorable default rates compared to industry averages and our exposure to asset classes such as equities, commercial mortgage loans, CLOs, RMDF, and many structured asset class categories are below industry averages given our liability profile and focus on corporate credit.\n\nSecond., since the end of 2020, we greatly decreased our exposure to below-investment-grade securities from just under 9% of fixed maturity investments at amortized cost to just under 6%. And then lastly, year to date, we've experienced more upgrades than downgrades and currently view our portfolio as having more potential rising stars than fallen angels in the near term. While we will leave it to others to debate the probability and severity of a macro event, we feel confident with the position of our portfolio. Moving now to capital, the financial strength of the company continues to build and remains in excellent shape.\n\nThe weighted average risk-based capital ratio for our traditional U.S. insurance companies remains robust at approximately 415%, and holding company liquidity was $1.1 billion at the end of the third quarter. Both of these metrics are well above our targeted levels and are expected to further strengthen in the fourth quarter. Also, as previously disclosed, the upcoming C2 mortality factor changes that will be enacted at year-end will further bolster our capital metrics, adding approximately 25 points of RBC as we benefit from how the update impacts group life products.\n\nFurther, we anticipate another year-end dividend from first Unum in the $30 to $50 million range, which assumes a modest release of LTC asset adequacy reserves in that legal entity. These capital metrics have benefited from the rebound we are seeing in our statutory earnings results so far this year. Statutory after-tax operating income was $243.2 million for the third quarter and $725 million through the first nine months of the year. These results put us on a track to achieve roughly $1 billion in statutory earnings this year back in line with pre-pandemic levels.\n\nLooking at capital deployment in the third quarter, we paid $66.1 million in common stock dividends and repurchased $42.6 million of our shares this quarter. Through the nine months of the year, we paid $189.5 million in dividends and bought back $137.5 million of our stock, and continue to track toward repurchasing approximately $200 million for the full year. Capital contributions in the Fairwind subsidiary were $115 million in the third quarter and $465 million year to date. With the stable performance in the LTC block and the rise in interest rates this year, we continued to trend to the lower end or slightly below the range of $550 to $650 million of capital contributions to Fairwind that we guided to at our February Investor Day.\n\nOn top of temporary 2022 capital contributions, higher rates are positive for LTC over the long term and provide us confidence in our ability to recognize the premium deficiency reserve at a faster pace than the original permitted practice. Higher rates also provide us attractive options to support this goal further through hedging activities. As you recall, last quarter we executed interest rate hedges through long-duration Treasury forwards in our first Unum block of LTC business. We have remained active continuing these efforts in both the third quarter and into the fourth quarter.\n\nAs Rick described in the third quarter, we hedged cash flows in the Unum America block, which comprises approximately 80% of our LTC business. The series of trades totaled $500 million of notional hedges at an average 30-year Treasury rate in the mid 3% range. Since the end of the quarter, we have again entered an additional $100 million averaging over 4%. Again, these actions reduce uncertainty by narrowing the range of outcomes with this block of business, and we will continue to actively explore ways to further reduce risk associated with our LTC block.\n\nSo I'll wrap up with a comment on our outlook for the year. After setting our guidance for growth in adjusted after-tax operating income per share at 4% to 7% in our February Investor Day, we raised it to 15% to 20% during the first quarter. Then after favorable second-quarter results and a brighter outlook for the second half of the year, we raised the outlook again to a range of 40% to 45% off of our adjusted operating after-tax operating income per share of 2021 of $4.35. After contemplating third-quarter results, we believe this range is still appropriate for 2022.\n\nSo now I'll turn the call back to Rick for his closing comments and I look forward to your questions.\n\nRick McKenney -- President and Chief Executive Officer\n\nGreat. Thanks, Steve. Good summary of the quarter's results. I would say results were excellent.\n\nWe are very pleased with our ability to execute on our strategy and capitalize for both the short term and longer term on an operating environment that is very favorable to us. We do believe that we are very well positioned to take on any environment that may present itself with a strong balance sheet and resilient earnings power, and we remain very encouraged for the future. And now here in the call over to Alex to begin our Q&A session, Alex.\n\nOperator\n\nThank you. [Operator instruction] Our first question for today comes from Erik Bass of Autonomous Research. Erik, your line is now open.\n\nErik Bass -- Autonomous Research -- Analyst\n\nGood morning, and thank you. Can you provide some more color on the drivers of the disability margin improvement and why you think at least a portion of this is sustainable? And also, do you view a high 60% benefits ratio with the right expectation heading into 2023?\n\nRick McKenney -- President and Chief Executive Officer\n\nGood Morning, Erik. Let me turn over to Mike to talk about some of the drivers and then maybe see we'll have some comments where we see this going.\n\nMike Simonds -- Chief Operating Officer\n\nThanks, Rick, and good morning, Erik. I appreciate it. Yeah, you highlighted another good quarter in terms of experience for the group disability line. And I would say while there is a couple of things under the covers there, the primary driver is the recovery experience and we've spent time on it.\n\nIt's pretty broad-based. So we look across industries, we've looked across different durations of claims and we are seeing our ability pretty broadly against our expectation. And I think it is fair to conclude that we've got to a conducive environment out there for helping people to return to work and a productive lifestyle. And I would say internally we're well-positioned in that.\n\nWe are fully staffed, which is a really good place to be. We've got a really experienced and capable management team that our benefits organization that have implemented some process changes, focusing on different diagnoses and durations. All with the intent of delivering on that purpose of supporting people and supporting our employer clients in terms of driving productivity. So favourability continued probably a bit more so than what we are expect that had expected here in the third quarter.\n\nWe would anticipate it'll moderate a bit over time, but probably not at the pace, we would have thought otherwise. I don't know, Steve, if you have any.\n\nSteve Zabel -- Chief Financial Officer\n\nI think that's right. I mentioned in my comments that we're looking for something in the mid to high 60% loss ratio in the fourth quarter. As we look ahead to 23, we probably won't comment on that right now. We're going through our process around LDTI, and kind of recast what loss ratio is going to look like going forward.\n\nSo a lot more for you as we talk about the 23 outlooks.\n\nErik Bass -- Autonomous Research -- Analyst\n\nGot it. Thank you. And then on the hedging, it sounds like the actions you took in third quarter was sort of a step in a larger process and something that you continue to plan to continue legging into. Can you just help us think about the benefits in terms of future and I as well kind of locking in the discount rate for reserves? \n\nSteve Zabel -- Chief Financial Officer\n\nYeah. So let me just kind of recap what we did, because I know we gave you a little bit more information, even my script, than what we would have had in the release. If you go back in the second quarter, we executed in first Unum, which was pretty straightforward, $164 million of notional, pretty straightforward from how that flowed through to asset adequacy testing. It really de-risks some of the downside scenarios that you have within that testing.\n\nAnd we were very focused on the first five years of investable cash for that block, and we'd given you a little bit of guidance that we were looking at about 50% of that. As we roll forward, we like in some transactions in America in the third quarter, we executed on $500 million of notional that same type of instrument. And then in the fourth quarter, we actually took another step and put another $100 million. It's a little bit more complicated when we get into Unum America, and let me just talk a little bit of basics about what we're hedging.\n\nWe're hedging investable cash flows and think of that as the cash flows that come out of our liabilities, the premiums, the claims expenses that we have to pay, and then combine that with the cash flow needs of our investment portfolio and really how that portfolio turns over. So we're very focused on the first five years. It's important to us that we get hedge accounting on this, and so we want to really make sure there's certainty of what those cash flows are. So that's where we're focused.\n\nI wouldn't view these being put on for any kind of future income enhancement. These are risk management trades. We want to make sure that we're well protected for a downside risk in the interest rate environment. So I don't think you're going to see incremental investment income in the future on this.\n\nI do think, too, when you get into Unum America, it's a more diversified portfolio. So that makes it a little bit more complicated about which types of investment trades in the future we want to hedge. We have alternative assets in there, commercial mortgages, cheap loans, private placements, those would be harder to hedge because you need to be able to enter into a bond trade in the future to really look at the maturity of those trades. So far we've hedged about 20%, I think 15% to 20% of our expected cash flows in Unum America over the next five years.\n\nAnd we feel like this is a great start to leg into a program that we think is very important to manage downside risk in the future for this block.\n\nErik Bass -- Autonomous Research -- Analyst\n\nGreat. Thank you. Appreciate the color.\n\nRick McKenney -- President and Chief Executive Officer\n\nThanks, Erik. \n\nOperator\n\nThank you. Our next question comes from Ryan Krueger of KBW. Ryan, your line is now open. \n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nHi. Thanks. Good morning. First, I just want to follow up on the last question.\n\nI guess can you give us any thoughts on where you see the 15% to 20% headed? Do you think you'd go all the way up to the 50% of five-year cash flows that you did in first Unum? Or given the portfolio differences, would you likely stay a little bit below that?\n\nRick McKenney -- President and Chief Executive Officer\n\nYeah. Ryan, we're not going to really give any guidance, kind of where we're going to take the program. We feel very good about the steps that we've taken. We do think that there's more room to advance the program here in the future.\n\nBut we'll update the market as we lay into further transactions on that. But I don't really want to set any kind of, I guess, expectation out there for how big this may grow to.\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. Thanks. And then on the PDR, just I had a more mechanical question. So you talked about the rolling three-year impact of how it comes into results.\n\nSo I guess my question is, if interest rates end up staying high in your PDR requirement as to being lower, is the way it would work that you did have to put in the contributions now, but then if rates remain high in the rolling three-year calculation improves that you would then release those reserves back out of the entity.\n\nSteve Zabel -- Chief Financial Officer\n\nYeah. Ryan, I wouldn't think about it as releasing reserves. We have an overall premium deficiency reserve that we need to record. The state of Maine has given us the ability to do that over time.\n\nAnd so we're building toward that reserve in the current rate environment. It allows us to potentially do that at a faster pace. As far as how we recognize that I do think it's fair to say that if rates remain where they are today and we gave you some scenarios last February, it would give us the ability to recognize that full frame deficiency reserve at a faster pace.\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Got it. Thank you.\n\nRick McKenney -- President and Chief Executive Officer\n\nThanks, Ryan.\n\nOperator\n\nThank you. Our next question comes from Alex Scott of Goldman Sachs. Alex, your line is now open.\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nHi. First one I had for you is just on a follow-up on the dynamic with the PDR. I mean, I think that just based on the sensitivity you gave in the past with that probably having declined to less than $1 billion. Was that actually oddly become a tailwind, and actually release capital and give you access to more than maybe the normal $1 billion of statutory capital as we look out to 2024? And if that's at all right, I think you guys are getting closer to the point where you can start thinking about the larger amount of capital you all have to deploy every year.\n\nI'd just be interested in the mechanics there and how you, I guess, more importantly, how do you think about deploying capital as we sort of exit this period where you have a bigger drag.\n\nRick McKenney -- President and Chief Executive Officer\n\nYeah, Alex, it's Rick. Let me just take a step back to the dynamics because you talked about some of the dynamics specific to the PDR. I think it's instructive to also talk about what is the overall capital generation deployment looks like across the enterprise, because that's only one element, and I'll get to that as part of the overall. I think when you think about the generation we've had, as you said, the billion dollars of statutory earnings that we have, or at least a run rate that we have around statutory earnings is very positive in terms of generating capital for the company.\n\nSo you think about that, plus where we sit today from an overall RBC, where we sit from a liquidity perspective, Steve mentioned some of the dynamics that will be coming here in the fourth quarter. We sit in a very good position, a couple of places where we're going to put that to work. First and foremost, growth and think about core growth and we're talking about the growth of the enterprise, that is first and foremost. I think about inorganic means, we'll add capabilities where we see fit.\n\nNothing that you would unexpected. This is about building out our overall platform, we have similar to things you would have seen us do in the past. And then you get into the dividends and we continue to pay a nice healthy dividend growth rate, and then the deployment of capital that we get out. So think about the PDR in that construct, Steve mentioned the dynamics of one element, which is the interest rate element of how the PDR develops.\n\nI'd also reiterate that, as we told you earlier in the year, we've been funding it faster, we've been recognizing it faster in a balanced way relative to the $200 billion of share repurchase we've been buying. So we feel very good about how we're balancing the needs of many stakeholders and bringing back capital to our shareholders through both dividends and through share repurchases. As we look out to the next couple of years, dynamics you said around the PDR, the sensitivities we put out all still very real, but we're gonna have to see how that plays out. So I wouldn't want to get too far ahead of that and we'll lay out some of that in the 23 process.\n\nBut this is something for the future we'll continue to look at once again, very happy about where we sit, where we're going, and the ability to deploy capital in a very reasonable way.\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nThanks for that. Follow-up question on Unum U.S. Could you talk a bit about the competitive environment and how things look sort of headed into the end of the year in terms of competition, and pricing, and so forth, and how that translates into your view of revenue growth heading into next year?\n\nMike Simonds -- Chief Operating Officer\n\nSo it's like, I'll take that one and maybe we'll take a minute because we do have some good dynamics going across our markets. So I'll maybe I'll tee up the Unum brand for group insurance here in the U.S., but then ask Kim and Mark to comment on those markets as well. As you highlighted that we've built some good momentum here as we're heading into a really important close out to the year, and the January 1st effective date and encouraging buildup across all of our core operations and see sales up 14% on a constant currency basis that the core market group insurance sales here in the U.S. are particularly encouraging up approximately 30% in the quarter.\n\nAnd it's a relatively small quarter given seasonality, but it bodes well for us as we look into again, that important fourth quarter differentiators like we've been talking about the investments that we've been making in digital, and things like our HR Connect Solutions, our new total leave platform, those are really helping us drive strong sales results, particularly in our middle markets. And again, that's really encouraging our individual disability executive benefit, doing supplemental disability to our clients near record sales quarter here again in the third quarter and a lot of momentum built. I think it ties to what Rick was talking about. This is a market that's increasingly cognizant of the exposure and the need for our products around financial protection.\n\nSo we operate in very competitive markets. We have good competitors out there. But again, I think some of the investments that we've made and some of the environmental conditions are encouraging here in the U.S., and I think true also for voluntary, Tim.\n\nTim Arnold -- Head, Colonial Life and Voluntary Benefits Business\n\nYeah, thanks, Mike and Alex. Thanks for the question. Since you asked a question about Unum, I'll start there on the Unum brand for [inaudible]. We are pleased with the momentum that we're seeing building in the Unum [inaudible] brand, and we're also pleased with what we're seeing in the pipeline for the rest of the year and for 2023 as well.\n\nOn the quality like brand, we're really pleased with the progress and momentum that we've seen since the pandemic. Remember that there's a lot of businesses not benefit from natural growth that we see in somewhere along the lines, but through investments, we've made in digital capabilities, and investments in our distribution system and team, we feel really good about the prospects long term for the business. In the third quarter of 23 March case sales are a bit lumpy and they can be, and we've said previously that we view that market somewhat opportunistically, and so we saw a little bit of an impact there on March case. But we're really encouraged by what we're seeing in our target markets, especially our public sector marketplace.\n\nI'll hand it over to Mark for a point of view on the international business\n\nMark Till -- Head, International Business\n\nThanks, Tim. If I take the UK first, then the market has been growing nicely off the back of COVID. There's certainly been a kick there. You see us maintaining our market-leading position in long-term disability and in critical group critical illness, and we're starting to pick our game up in the group life market where we've been a little bit less well penetrated.\n\nAnd I think the drivers of that are the way in which we differentiate in our experience to the brokers who are the gatekeepers to the customers and the value-added services. We've been able to add into the products for the benefit of the employee and the employer. So I think we're feeling pretty good about the growth we can drive here in the UK. I think over in Poland we've seen steady growth in our individual block of business, but really some exceptional growth in our group business, particularly the strength of the product that we've got there, but also we're adding in additional distribution there.\n\nSo I think you're seeing that come through in sales growth in the overall international business, which I think this quarter in dollar terms is 62%, but in local currencies 82% growth. So that's everything from me.\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nWell, thank you.\n\nOperator\n\nThank you. Our next question comes from Tom Gallagher of Evercore. Tom, your line is now open.\n\nTom Gallagher -- Evercore ISI -- Analyst\n\nGood morning. First one is just the GAAP favorable reserving release for 3Q for the waiver claims recoveries. Is that also going to be reflected in statutory next quarter or is that a GAAP only phenomenon?\n\nSteve Zabel -- Chief Financial Officer\n\nHi, Tom. Good morning. This is Steve. I can take that one.\n\nJust a little bit background about how we go through our reserving process and our assumption study process. We look at assumptions over time based on the experience that we see. If you go back to last year, we felt like the experience we were seeing in recoveries was at such a level that we wanted to go ahead and reflect that in our GAAP reserves. The GAAP reserves and start reserves are a little bit different construct just because you need to look at the levels of margin that you accumulate on those two bases.\n\nAnd so last year we felt like it was time to change the assumptions that on GAAP we did that, we've continued to have very favorable recovery experience. So we went ahead and adjusted that again on the GAAP side, but felt comfortable with the margins that we had on the statutory side. I will say with the latest updates to expectations, we are likely to determine an update as appropriate for the statutory basis in 2023. I wouldn't expect anything to happen this year, but that is something that we'll look at next year and determine whether we need to reflect that experience and how we think about our assumptions that for statutory.\n\nTom Gallagher -- Evercore ISI -- Analyst\n\nGotcha. And Steve, for in terms of ring-fencing, what that might mean for statutory next year? Would that be similar only to the change in the GAAP reserves this year? Or might it also include something cumulative on the earnings side? So you might have to add a few pieces there to think about what the statutory impact might be.\n\nSteve Zabel -- Chief Financial Officer\n\nYeah, I wouldn't predict what the amount would be we need to go through. We need to do the work, we do hold higher levels of margin on the statutory side. So we'll do the work next year. I would anticipate it will not be as much as the releases that we took on the GAAP side.\n\nBut what will inform the market as we go through that process?\n\nTom Gallagher -- Evercore ISI -- Analyst\n\nOK. Thanks. And then just a question on long-term care or risk transfer generally. Can you just give an update for rates of obviously retire here or the one new negative in the market is at some elevated claim costs which you're not really exposed to because of your indemnity future? But with interest rates continuing to move higher here are curious if it's opening up greater possibilities advancing talks for you on potential risk transfer, maybe talk about are we getting closer.\n\nIt's still pretty far out. And is it still more likely to just be sort of smaller blocks? What of your LTC that is likely to be transacted and anything you're able to share kind of holistically at what where we're at?\n\nRick McKenney -- President and Chief Executive Officer\n\nYeah. Thomas, it's Rick. [Inaudible] a share at the macro level around what we're seeing is that with the rising interest rate environment, certainly for us as we look at our own block of business, it helps in terms of when we look at the longer term nature, the cash flows are to work. All the things that Steve talked about.\n\nWhen you think about risk transfer in the markets, I would say it's fairly unchanged in terms of how others look at the work that needs to be done is usually across liability assumptions. It's not just the interest rate piece. So there's interest out there, but I wouldn't say there's really much change in the market. And as you said, our view hasn't changed.\n\nSo when we think about how we'd want to do a transaction, and think about multiple ways to do that, including pieces of our block business, all those things unchanged. And I would just reaffirm what you said around the expense world and our indemnity nature of our block. That really doesn't come into play when you think about our ability to do a risk transfer. So not much has changed.\n\nCertainly a higher interest rate environment better, but it's something we're still actively at work on.\n\nTom Gallagher -- Evercore ISI -- Analyst\n\nOK, Thanks.\n\nOperator\n\nThank you. Our next question comes from Suneet Kamath from Jefferies. Suneet, your line is now open.\n\nSuneet Kamath -- Jefferies -- Analyst\n\nGreat. Thank you. Good morning. I wanted to go back to the assumption review, particularly related to long-term care.\n\nJust curious what your experience around morbidity improvement has been of late, and if there were any other sorts of identifiable trends, kind of post-COVID that you can talk about with respect to long-term care. Thanks.\n\nSteve Zabel -- Chief Financial Officer\n\nI can take this one. I would say there is nothing of note that came out of our review. We obviously look at our margins in the aggregate as we look at the experience that we've seen over the last year, and we fold that into our experience. So I would say our views haven't changed.\n\nI would note that like many others, as we looked at some of the experiences we had through COVID, you have to kind of deemphasize some of that experience if you think about what our long-term expectations are. And so some of the claimant mortality, maybe some of the transition activity, we discount that pretty much when we're thinking about longer-term expectations. And unless any of that would continue over the longer term. So I would say there's really nothing of no, we're very happy about the process that we've gone through.\n\nAnd like I said in my opening remarks, from a GAAP perspective, we're done with our reserve advocacy work. Obviously, we'll go through our year-end statutory work, but don't do anything there of any significance either.\n\nSuneet Kamath -- Jefferies -- Analyst\n\nOk. Got it. Thanks. And then I guess for the core business, I mean, it's great to hear all this talk about natural growth, but at the same time, we continue to hear the word recession mentioned every single day.\n\nSo I guess the question is, are you hearing anything from your corporate clients around, headcount or potential layoffs? It does seem like everybody's talking about it. But when we look at your underlying trends, it doesn't seem to be showing up, at least not yet.\n\nRick McKenney -- President and Chief Executive Officer\n\nLet me start off and maybe I'll hand over to Mike for some details. But when you think about the recessionary impact, certainly we hear what you hear and the discussions around it. You have to step back and think about the impacts of the business overall. One, you mentioned about the natural growth we've seen certainly been a good lift.\n\nAnd so you might see a little bit slowing growth, but given all the great things that the team just talked about, we still see good growth. And that's really just protecting more people. So that's one piece of it. Got to think about the investment portfolio.\n\nSteve went through some of the details on that. Feel very good and their analysis, we stress the portfolio through recessionary analysis, and I think it comes back to questions around the core business, and what happens in a recession or environment on a couple of fronts. And Mike, maybe you can give some perspectives on that.\n\nMike Simonds -- Chief Operating Officer\n\nYeah, sure. I think that a good observation, I would also say that what we see in natural growth is probably lagged by a couple to three months. So it wouldn't be a great forward-looking indicator. But in terms of conversation, I feel pretty good about the diversification of the client base when we think about potential changes, macro economically, the fact that we've had a lot of success in industries like healthcare, a lot of success certainly in some of the more cyclical, but in some of the more steady as well.\n\nSo I think that diversification has played well in prior cycles and I expect it would going forward from a top-line point of view. And then always a watch area for us will be disability risk through a recessionary environment. You're starting with SSDI, you do typically see long-term disability incidence tick up a bit in the industry. On the private side does as well.\n\nWe tend to be a bit more muted. I think looking at the last two cycles, something in that maybe 2 to 3 points on the loss ratio side from elevated incidents, and then typically recoveries actually drift up to offset that to a degree. So it's a watch area for us. We're obviously in a good spot when we think about disability risk right now.\n\nSo with we start from a position of strength. And the last thing I'd mention when you think about risk, claim risk is that typically you have four plus quarters before recessionary impacts start to work their way into the book of business. So it gives you some time to take action.\n\nSuneet Kamath -- Jefferies -- Analyst\n\nOK. Thanks, guys.\n\nOperator\n\nThank you. Our next question comes from Tracy Benguigui from Barclays. Tracey, your line is now open.\n\nTracy Benguigui -- Barclays -- Analyst\n\nThank you. Rick, I'm glad you alluded to more favorable PDR of the balance outcome than what we see per Slide 23 in your February outlook. I mean, interest rates are now well north, so that sensitivity table that cuts off at 3.5%. So I have a two-part question.\n\nFirst, can you quantify what would the 2026 pr of the balance look like? Assuming a more normal shape of the yield curve and if we see today's rates remain constant over three year? And then in contrast, can you quantify how the PR balance looks today on a trailing three-year basis in considering the current inverted shape of the yield curve?\n\nRick McKenney -- President and Chief Executive Officer\n\nYeah. A couple of things Tracy you mention is that sensitivity we put out back in February really was not yield curve focused. It was kind of ultimate rate. And so take those numbers there, which were the 10-year Treasury adds 30 or 50 basis points and that gives you a 30-year benchmark.\n\nAnd 30 year is really where it matters where a lot of our hedges are. We're thinking out on the longer end of the curve, the sensitivities you talk about, they are above the sensitivity to put out at least on that page, they do reasonably well when you think about the moves that we've seen since then. But as we've talked about multiple times, looking at 2026 isn't really where we're looking. We're thinking about how this progresses over the next several years.\n\nAnd we talked about where things are looking into this year and how they run into next year. Steve, you want to add on that.\n\nSteve Zabel -- Chief Financial Officer\n\nYeah, I just kind of go back to how the premium deficiency reserve calculation looks. And although we feel great about where rates are today, it is going to take a few years for those rates to wine their way into the discount rate calculation. So I wouldn't expect a big drop in our PDR calculation at the end of this year just to set expectations. What we're very happy about what rates have done in the near term behind us here.\n\nBut as we get through year-end, it's going to take a few years for that to work its way into the calculation.\n\nTracy Benguigui -- Barclays -- Analyst\n\nYeah, I totally got it. The 50 basis point spread just felt a little bit more normal shape of the curve that's why I mentioned that. Very basic question, so 80% of your LTC [inaudible] at Unum America, and I guess the relationship between [inaudible] and the captive reinsurer of America defeated. But how does it work? Hedging Unum America cash flows.\n\nDoes that help the PR calculation at all resulting less contributions? Or is this just for risk management purposes?\n\nSteve Zabel -- Chief Financial Officer\n\nYeah. First, this is Steve, first and foremost risk management. We just think it's a good way to manage an LTC block when you have interest rates at this level to go ahead and try to lock some of those in the near term. I would say just mechanically how that would work is right now our new money rate assumption is this trailing three-year average.\n\nSo for those investable cash flows that we have hedged, we've kind of locked in what that new money yield assumption is currently. And so it kind of accelerates, I guess, reflecting the current interest rate environment. But we view it as downside protection so that if rates in the future do come down, we know we can achieve a certain yield on our future investable cash flows.\n\nTracy Benguigui -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our final question for this day comes from Jimmy Bhullar from J.P. Morgan. Jimmy, your line is now open.\n\nJimmy Bhullar -- JPMorgan Chase and Company -- Analyst\n\nHey, good morning. So most of my questions were answered. But just on disability margins, the results are obviously pretty strong and I think they're significantly stronger than even you would have assumed earlier this year. So can you talk about what the drivers of the momentum in the business you feel are related to the economy, or to inflation, or other things that might be somewhat temporary in nature versus anything that you've done on your end that might be helping your results beyond the environment.\n\nMike Simonds -- Chief Operating Officer\n\nHey, Jim, it's Mike. And I would agree. Favorable risk results in group disability, more favorable than we would have anticipated. And like I'd mentioned, we have definitely spent time really digging in looking at various segments of that strength, comparing them to history and to our expectations.\n\nAnd like I mentioned earlier, it is quite broad-based across sector and across duration of claim. And I do think that it is reasonable to conclude that the environment is a conducive one for our people working with claimants to help them get back to a productive worksite or work back in the workplace. Teasing out how much is internal versus how much is environment is a really tricky thing, as I'm sure that you can appreciate. We felt really good about the team that we have in our benefits organization.\n\nWe feel really good about the team, and it is really a team that we have between our field organization, our underwriting groups, and our pricing actuaries that have just been very, very good over time at taking current experience and factoring that into our renewal and new business pricing process. So I know that's probably not as specific as an answer as you would like, but as Steve said, it does at this point with a few quarters year of positive experience suggests to us that it's likely to continue to a degree and sort of the moderation back toward long term loss ratio expectations is probably going to take some amount of time.\n\nJimmy Bhullar -- JPMorgan Chase and Company -- Analyst\n\nAnd then I think other companies have had fairly good margins and disability as well. Yours have been even better. But are you seeing any signs of companies sort of giving up some of that and pricing as you looked at the new season? Have you seen any indications of disability prices being a little softer because of that?\n\nMike Simonds -- Chief Operating Officer\n\nYeah. Good question, Jimmy. And you're right to ask in sort of how this might translate into market pricing. And we are really actually pleased with how our January 1st renewals went in the larger employer market.\n\nWe are replacing those in the summertime. We're continuing to work that all the way through down into the small end of the market now. And we're tracking well relative to our expectations. So that I think for us is job one is just making sure that we're keeping our clients and making adjustments, as you always will with your book of business based on risk outcomes.\n\nSo that feels pretty good. We've talked about the sales momentum across group insurance and again, feel very good, particularly in that core market which for us is a really important one, and how that's playing through. And I guess I would take a step back on when it comes to our approach to pricing. And again, you would have heard us talk about this.\n\nWe do take a very long-term lens. That's what I think our clients really appreciate is some consistency in approach and not react in quarter to quarter. So while we do have generally favorable risk experience, certainly interest rates as well are a bit of a tailwind for us, we're going to look at that over time, often in combination with other products besides group disability, pulling in life insurance, pulling involuntary benefits, and really take a long term overall client relationship. So hopefully that's helpful.\n\nJimmy Bhullar -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nRick McKenney -- President and Chief Executive Officer\n\nThank you, Jimmy.\n\nOperator\n\nThank you. We have no further questions, so I'll hand it back to Rick McKenney for any further remarks.\n\nRick McKenney -- President and Chief Executive Officer\n\nGreat. Thanks, Alex, and I want to thank everybody for taking the time to join us this morning. That does complete our call for the third quarter. We do [inaudible] to seeing many of you in the upcoming weeks and months at investors' conferences, and so I appreciate you spending the time this morning.\n\nTalk to you all soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Royal -- Senior Vice President, Investor Relations and Treasury\n\nRick McKenney -- President and Chief Executive Officer\n\nSteve Zabel -- Chief Financial Officer\n\nErik Bass -- Autonomous Research -- Analyst\n\nMike Simonds -- Chief Operating Officer\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nTim Arnold -- Head, Colonial Life and Voluntary Benefits Business\n\nMark Till -- Head, International Business\n\nTom Gallagher -- Evercore ISI -- Analyst\n\nSuneet Kamath -- Jefferies -- Analyst\n\nTracy Benguigui -- Barclays -- Analyst\n\nJimmy Bhullar -- JPMorgan Chase and Company -- Analyst\n\nMore UNM analysis\n\nAll earnings call transcripts"
}