{
  "companyName": "Main Street Capital",
  "companyTicker": "MAIN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/main-street-capital-main-q3-2022-earnings-call-tra/",
  "content": "Main Street Capital (MAIN -0.38%)\nQ3 2022 Earnings Call\nNov 04, 2022, 10:00 a.m. ET\n\nOperator\n\nGreetings, and welcome to the Main Street Capital Corporation's third quarter earnings conference call. At this time, all participants are in a listen-only mode. A brief question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, Zach Vaughan. Please go ahead.\n\nZach Vaughan -- Investor Relations\n\nThank you, operator, and good morning, everyone. Thank you for joining us for Main Street Capital Corporation's third quarter 2022 earnings conference call. Joining me today with prepared comments are Dwayne Hyzak, chief executive officer; David Magdol, president and chief investment officer; and Jesse Morris, chief financial officer and chief operating officer. Also participating for the Q&A portion of the call is Nick Meserve, managing director and head of the Private Credit Investment Group.\n\nMain Street issued a press release yesterday afternoon that details the company's third quarter financial and operating results. This document is available on the investor relations section of the company's website at mainstcapital.com. A replay of today's call will be available beginning an hour after the completion of the call and will remain available until November 11. Information on how to access the replay was included in yesterday's release.\n\nWe also advise you that this conference call is being broadcast live through the internet and can be accessed on the company's home page. Please note that information reported on this call speaks only as of today, November 4, 2022, and therefore, you are advised that time-sensitive information may no longer be accurate at the time of any replay listening or transcript reading. Today's call will contain forward-looking statements. Many of these forward-looking statements can be identified by the use of words such as anticipates, believes, expects, intends, will, should, may, or similar expressions.\n\nThese statements are based on management's estimates, assumptions, and projections as of the date of this call, and there are no guarantees of future performance. Actual results may differ materially from the results expressed or implied in these statements as a result of risks, uncertainties, and other factors, including, but not limited to, the factors set forth in the company's filings with the Securities and Exchange Commission, which can be found on the company's website or at sec.gov. Main Street assumes no obligation to update any of these statements unless required by law. During today's call, management will discuss non-GAAP financial measures, including distributable net investment income.\n\nPlease refer to yesterday's press release for a reconciliation of these measures to the most directly comparable GAAP financial measures. Certain information discussed on this call, including information related to portfolio companies, was derived from third-party sources and has not been independently verified. Now I'll turn the call over to Main Street's CEO, Dwayne Hyzak.\n\nDwayne Hyzak -- Chief Executive Officer\n\nThanks, Zach. Good morning, everyone, and thank you for joining us today. We appreciate everyone's participation on this morning's call. We hope that everyone is doing well.\n\nOn today's call, I will provide my usual updates regarding our performance in the quarter, while also providing updates on our asset management activities. Our recent declarations of another supplemental dividend payable in December and an increase to our monthly dividends for the first quarter of 2023, our expectations for dividends going forward, our recent investment activities and current investment pipeline, and several other noteworthy updates. Following my comments, David and Jesse will provide additional comments regarding our investment strategy, investment portfolio, financial results, capital structure and leverage, the impact of rising interest rates in our third quarter and future net investment income, and our expectations for the fourth quarter, after which we'll be happy to take your questions. We're very pleased with Main Street's strong third quarter results.\n\nwhich include another quarter with records for net investment income per share and distributable net investment income, or DNII, per share and with our results exceeding the net investment income per share records we set or matched over each of the prior four quarters. These positive results included contributions from each of our core investment strategies. And as a result of our strong performance, DNII per share exceeded our regular monthly dividends by 36%. We continue to be pleased with the performance of our lower middle market portfolio companies which resulted in another quarter of fair value appreciation in the equity investments in this portfolio.\n\nWe're also excited about the follow-on investments we made in existing lower middle market portfolio companies during the third quarter to support the growth strategies of these companies and the new platform investments we've made to date in the fourth quarter. Our Private Credit Group also continued its success with its investment activities in the third quarter. These positive results and our favorable outlook for the fourth quarter resulted in our recommendations to our board of directors for our most recent dividend announcements, which I'll discuss in more detail later. We continue to be pleased with the performance of our diversified lower middle market and private loan investment strategies and remain confident that these strategies, combined with the benefits of our asset management business, will allow us to continue to deliver superior results for our shareholders.\n\nOur net asset value per share increased in the quarter due to the impact of mixed results and the fair value changes of the different components of our investment portfolio, and the positive impact of our equity issuances in the quarter, which Jesse will cover in more detail. We are pleased with the continued favorable performance of our lower middle market portfolio companies, which resulted in another quarter of fair value appreciation in this portfolio. We also benefited from the exit of a previously restructured private loan investment, which generated a significant realized gain in the quarter and a net fair value increase between the realized gain and unrealized depreciation in this portfolio. Despite the recent increased market volatility and uncertainty, we are very pleased that our lower middle market and private loan strategies have both continued to deliver attractive investment opportunities.\n\nOur lower middle market investments of $112 million in the quarter resulted in a net increase in lower middle market investments after repayments of $85 million for the quarter. Our private loan investment activities resulted in a net increase in private loan investments of $174 million for the quarter. We believe that our third quarter operating results reflect the benefits of the growth of our investment portfolio over the last two years. Given the continued strength and quality of our investment pipeline, we expect to have the opportunity to further grow our investment portfolio, which we expect will continue to benefit our operating results in the fourth quarter and into 2023.\n\nTo support the growth of our investment portfolio and to continue to plan for future investment portfolio growth, in the third quarter, we increased our activities under our at-the-market, or ATM equity issuance program, and completed an incremental equity offering in August. We view these developments as positive enhancements to our capital structure, which allows us to continue to execute on our attractive current and expected future investment pipeline. We've also continued to produce positive results in our asset management business. The funds we advised through our external investment manager, including MSC Income Fund, a nontraded BDC, and MS Private Loan Fund I, a private fund, continued to experience favorable performance in the third quarter.\n\nWe remain excited about our plans for these funds as we execute on our investment strategies and other strategic initiatives, and we are optimistic about the future performance of the funds and the attractive returns we are providing to the investors of each fund. We remain excited about our strategy for growing our asset management business within our internally managed structure and are actively working to increase the contributions from this unique benefit to our Main Street stakeholders based upon our results for the third quarter, combined with our favorable outlook in each of our primary investment strategies and for our asset management business and the benefits of our efficient operating structure. Earlier this week, our board declared a supplemental dividend of $0.10 per share payable in December and an increase in monthly dividends for the first quarter of 2023 to $0.225 per share payable in each of January, February, and March. These monthly dividends represent a 4.7% increase from the first quarter of 2022 and a 2.3% increase from the fourth quarter of 2022.\n\nSupplemental dividend for December is due to our strong performance in the third quarter, which resulted in DNII per share that was $0.235 or 36%, greater than our monthly dividends paid during the quarter. The fourth quarter represents our fifth consecutive quarter of paying a supplemental dividend and will result in total supplemental dividends paid during 2022 of $0.35 per share, representing an additional 13.5% paid in excess of our monthly dividends. Including these supplemental dividends, our DNII per share for the third quarter still exceeded our total dividends paid by over $0.13 per share. We are pleased to be able to deliver this significant additional value to our shareholders.\n\nWe currently expect to recommend that our board declare future supplemental dividends to the extent DNII significantly exceeds monthly dividends paid in future quarters, and we maintain a stable to positive net asset value. Based upon our current expectations for continued favorable performance in the fourth quarter, we currently anticipate proposing an additional supplemental dividend in the first quarter of 2023. Now turning to our current investment pipeline. We are pleased to maintain attractive opportunities in our lower middle market and private loan strategies.\n\nAs of today, and after recently closing several new investments in the fourth quarter, I would characterize our lower middle market investment pipeline as average. We remain excited about the quality of the investment opportunities in our current pipeline and specifically about the prospects for future follow-on investments in existing portfolio of companies. We also continue to be very pleased with the performance of our private credit team and the significant growth they have provided for our private loan portfolio and our asset management business. And as of today, I'd characterize our private loan investment pipeline as average.\n\nWith that, I will turn the call over to David.\n\nDavid Magdol -- President and Chief Investment Officer\n\nThanks, Dwayne, and good morning, everyone. As Dwayne highlighted in his remarks, we believe our strong third quarter financial results continue to demonstrate the strength of Main Street's platform, our differentiated investment approach, and our unique operating model. We are pleased to report that the overall operating performance for most of our portfolio companies continued to be positive, which contributed to our attractive third quarter financial results at Main Street. Another contributor to our strong results during the quarter was our robust lower middle market and private loan investment activity.\n\nIn addition, we've seen repayment activity for both our lower middle market and private loan portfolio slowed significantly over the last few quarters, a trend which continued in the third quarter. Significance of these net investment activities in the quarter positively impacted our investment income. As it relates to the current investment environment, we are excited about the opportunity to thoughtfully deploy capital. As availability of debt financing has declined and the related borrowing costs have increased for prospective purchasers of businesses, we are increasingly hearing from intermediaries and others that purchase price multiples have moderated as private equity and strategic acquirers can no longer rely on inexpensive, readily available debt capital to achieve their expected leverage returns.\n\nThis change to available leverage has created an environment similar to what we've seen in the past, whereby Main Street has been able to put capital to work at attractive risk-adjusted return profiles. For our lower middle market businesses, our ability to speak to the entire capital structure puts us in an enviable position as compared to private equity investors who need to raise debt capital on a deal-by-deal basis. In our private loan business, we are seeing attractive opportunities with lower LTVs and higher yields. In the past, during times of market dislocation, Main Street has continued to thoughtfully deploy capital, and we intend to do the same in today's environment.\n\nIn 2020, we experienced similar, although harsher market dynamics during the COVID-19 pandemic when many investors halted or significantly slowed their investment activity. We carefully continue to invest during this uncertain time. And with the benefit of hindsight, we are fortunate to have completed several investments that achieved exceptional results which we would have otherwise missed had we paused our investment activity during these uncertain times. As we've discussed in the past, the primary driver of our long-term success has been and continues to be our focus on the underserved lower middle market and specifically, our strategy of investing in both debt and equity in the lower middle market companies.\n\nThus far in 2022, we've had attractive origination activities, particularly related to debt follow-ons for existing lower middle market investments. On evaluating new lower middle market platform investments, we continue to target our combined first-lien debt and equity investments to achieve a blended internal rate of return in the mid- to high teens range. From an underwriting standpoint, we achieved these targets by maintaining a disciplined mix of debt and equity investments with a typical initial investment comprised of approximately 75% to 80% debt and 20% to 25% equity. We are confident that our long-term proven success of investing in the lower middle market, combined with our prudent use of low to modest leverage at Main Street will continue to allow us to deliver attractive financial results for our investors in the future.\n\nNow turning to the overall composition of our investment portfolio as of September 30, we continue to maintain a highly diversified portfolio with investments in 195 companies between our lower middle market, private loan, and middle market portfolios spanning across more than 50 different industries. Our largest portfolio company represented 3.2% of our total investment portfolio at fair value at quarter end and 3.3% of our total investment income over the last 12 months. The majority of our portfolio investments represent less than 1% of our income and our assets. Our investment activity in the third quarter included total investments in our lower middle market portfolio of $112 million, which after aggregate repayments on debt investments and return of invested equity capital resulted in a net increase in our lower middle market portfolio of approximately $85 million on a cost basis.\n\nDriven by the capabilities and relationships of our private credit team, we completed approximately $234 million in total private loan portfolio investments during the quarter which, after aggregate repayments of debt, resulted in a net increase in our private loan portfolio of approximately $174 million. As I mentioned earlier, repayments in our private loan portfolio have slowed in 2022. When compared to our private loan investment portfolio at the beginning of the year, the 2022 year-to-date repayment rate has decelerated by approximately 25% of the repayment rate experienced in a comparable period of 2021. Slowdown was even more significant in the third quarter with a repayment rate in 2022, down approximately 70% from the same quarter in the prior year.\n\nGiven the current status of the debt capital markets, we expect this trend will continue for the next couple of quarters. During the quarter, we had a net decrease in our middle market portfolio of approximately $1 million as we continue to strategically deemphasize this portfolio. Our total investment portfolio grew 6.9% during the third quarter to approximately $4 billion at fair value at September 30. At quarter end, our lower middle market portfolio included investments in 75 companies, representing $1.9 billion of fair value, which is about 20% above our cost basis.\n\nWe had investments in 87 companies in our private loan portfolio, representing $1.5 billion of fair value; and our middle market portfolio, we had investments in 33 companies, representing $354 million of fair value. Total investment portfolio at fair value at quarter end was approximately 108% of the related cost basis. In summary, Main Street's investment portfolio continues to perform at a high level and deliver on our long-term results. Additional details on our investment portfolio at quarter end are included in the press release that we issued yesterday.\n\nWith that, I'll turn the call over to Jesse to cover financial results, capital structure, and liquidity position.\n\nJesse Morris -- Chief Financial Officer and Chief Operating Officer\n\nThank you, David, and good morning, everyone. Our total investment income in the third quarter increased by $21.6 million or 28% over the same period in 2021, and $13.2 million or 15.4% over the second quarter of 2022 to a total of $98.4 million. Interest income increased by $24.6 million from a year ago and $11 million over the second quarter, which was a direct result of the continued growth in our portfolio of debt investments and the impact of higher market index interest rates on our floating rate debt investments. We estimate that the increase in market index rates drove about a quarter of the increase over the same period a year ago and a little over half of the increase in interest income over the second quarter.\n\nDividend income was $3.6 million lower than the same period a year ago. This decrease was driven by a comparison to meaningful levels of less consistent nonrecurring dividends received in the third quarter of 2021. Further supporting the overall strength of our third quarter results, the combined impact of certain income items including dividends, accelerated OID, and prepayment fees that are considered less consistent or nonrecurring in the quarter decreased by $8 million or about $0.12 per share when compared to a year ago and was $3.9 million or $0.06 per share below the average of the prior four quarters. Expenses for the quarter increased by $8.5 million over the prior year, largely driven by increases of $6.5 million in interest expense and $1.6 million compensation-related expenses, partially offset by an increase of $0.6 million in expenses allocated to the external investment manager.\n\nOur operating expenses to assets ratio was 1.5% for the quarter on an annualized basis. This continues to be among the lowest in our industry. Our external investment manager contributed $5 million to our net investment income during the quarter, an increase of $0.8 million or 19% when compared to a year ago, and ended the quarter with total assets under management of $1.4 billion. During the quarter, we recorded a net fair value decrease, including the impact of realized gains and unrealized depreciation on the investment portfolio of $5.1 million, which included decreases of $8.4 million in our middle market portfolio and $5.8 million in our external investment manager.\n\nThese were partially offset by net fair value increases of $4.1 million in our lower middle market investment portfolio and $1.8 million in our private loan portfolio. Net asset value, or NAV, increased by $114.3 million or $0.57 per share to end of the third quarter with NAV of $25.94 per share, a record level of NAV per share. We added two investments to nonaccrual status, resulting in a total of 11 investments on nonaccrual status at quarter end, representing 0.8% of the total investment portfolio at fair value and 3.7% on a cost basis. We continue to believe that conservative leverage, strong liquidity, and continued access to capital are important components of our capital allocation strategy.\n\nOur regulatory debt-to-equity leverage calculated as total debt, excluding our SBIC debentures, divided by net asset value was 0.86, and our regulatory asset coverage ratio was 2.16 times, both of which are within our target ranges. Our liquidity as of the end of the quarter, including cash and availability under our credit facility was $420 million, which provides ample liquidity to fund our near-term funding requirements. We continue to actively pursue additional capital to continue to fund our investment opportunities. During the quarter, we amended our credit facility to extend maturity in 2027 and expand the total commitments to $920 million.\n\nAs Dwayne mentioned, we raised equity capital with $105 million proceeds rates both through at-the-market equity program and our equity offering in August. We also continue to evaluate additional sources of debt financing. Coming back to our operating results. NII per share increased to $0.83 per share and DNII per share increased to $0.88 per share with each representing an increase of $0.12 from the same period last year.\n\nDividends paid during the quarter were $0.745 per share, which includes the September supplemental dividend of $0.10 and represents an increase of 21% over the dividends paid in the third quarter of 2021. As a result of these strong earnings, the NII per share exceeded the regular monthly dividend per share paid to our shareholders by 36% and the total dividends per share paid to our shareholders by 18%. Turning to the impact to our financial results related to changes in interest rates. As of the end of the third quarter, 73% of our outstanding debt obligations maintained fixed interest rates and 76% of our debt investments for interest at floating rates.\n\nAs a result, in this rising interest rate environment, our third quarter operating results included an estimated net benefit of $5 million or $0.07 per share to our net investment income when compared to a year ago and to the second quarter. If we assume the market index rates at September 30 remain in place for the fourth quarter, assuming no changes to our existing portfolio investments and borrowings from September 30, we estimate a similar additional benefit to our results for the fourth quarter when compared to the third quarter. Finally, as we look forward, given the strength of our underlying portfolio and the investment environment thus far in 2022, we expect another strong top line and earnings quarter in the fourth quarter with expected DNII per share in excess of $0.90, with the opportunity to meaningfully exceed this level based upon the amount of dividend income and portfolio investment activities during the quarter. With that, I will now turn the call back over to the operator so we can take any questions.\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] First question comes from Kenneth Lee with RBC Capital Markets. Please go ahead.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nHey, good morning. Thanks for taking my question. I just want to dig into a little bit more on the lower middle market portfolio and specifically wondering if you could just talk a little bit more about what drove the unrealized gains in the quarter and more specifically the appreciation in the equity investments in the portfolio. Thanks.\n\nDwayne Hyzak -- Chief Executive Officer\n\nSure. Thanks, Ken. So, I would say that in the low-middle market, there's nothing that I would say is unusual or special this quarter. We had a number of companies that continue to perform well and also delever or improve their capital structure, both of which impact our valuations to the positive.\n\nWe always have a number of companies that are up in the quarter and a number of companies that are going to be down just based upon their performance of their operating results. In this quarter, we just had more of the companies that were up, had bigger changes up than the companies that had depreciation, and have netted into that increase we had across the lower middle market portfolio from an unrealized depreciation standpoint.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nGotcha. And one follow-up, if I may. I think you mentioned there could be some opportunities around follow-on investments within the lower middle market portfolio. Just curious whether you could see a pickup in such opportunities even in this current macro environment.\n\nI just want to get a better sense of that. Thanks.\n\nDwayne Hyzak -- Chief Executive Officer\n\nSure. Thanks again, Ken. I'd tell you, you've heard us say this before. I think all things being equal, we have the opinion or the view that our existing lower middle market companies are very, very strong companies.\n\nWe typically have good long-term relationships with those companies and their management teams that we have the opportunity to complete follow-on investments to support their growth or other activities that they have at the portfolio company level. We really favor those investments more so than anything else. And if you look at our activities in the third quarter, the vast majority of our investment activity in the third quarter was in existing portfolio of companies where we supported growth of those companies, specifically two companies that completed large acquisitions. And when you look at our current pipeline, one of the things we're very excited about is that a healthy portion of that pipeline would also be follow-on investments in existing companies.\n\nWe have four companies that we're working on now that if things go as planned, you could see us complete additional investments in those companies. So, we're excited about that just like we always have been and always welcome the opportunity for additional investments in our existing companies.\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nGreat. Very helpful there. Thanks again.\n\nDwayne Hyzak -- Chief Executive Officer\n\nThank you, Ken.\n\nOperator\n\nThank you. I would now like to turn the call over to management for closing remarks.\n\nDwayne Hyzak -- Chief Executive Officer\n\nSo, thank you again, everyone, for joining us today. We look forward to talking to everyone again in a few months in February when we cover our fourth quarter results. And last thing is, go Astros.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nZach Vaughan -- Investor Relations\n\nDwayne Hyzak -- Chief Executive Officer\n\nDavid Magdol -- President and Chief Investment Officer\n\nJesse Morris -- Chief Financial Officer and Chief Operating Officer\n\nKenneth Lee -- RBC Capital Markets -- Analyst\n\nMore MAIN analysis\n\nAll earnings call transcripts"
}