{
  "companyName": "eHealth",
  "companyTicker": "EHTH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/ehealth-ehth-q2-2022-earnings-call-transcript/",
  "content": "eHealth (EHTH 0.41%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, everyone, and welcome to the eHealth Inc. conference call to discuss the company's second quarter 2022 financial results. [Operator instructions] It is my pleasure to turn the floor over to Eli Newbrun-Mintz, senior investor relations manager. Please go ahead.\n\nEli Newbrun-Mintz -- Senior Investor Relations Manager\n\nThank you, operator. Good afternoon, and thank you all for joining us today, either by phone or by webcast for a discussion about eHealth, Inc.'s second quarter 2020 financial results. On the call this afternoon, we have Fran Soistman, eHealth's chief executive officer; and Christine Janofsky, eHealth's chief financial officer. After management completes its remarks, we will open the line for questions.\n\nAs a reminder, today's conference call is being recorded and webcast from the Investor Relations section of our website. A replay of the call will be available on our website following the call. We will be making forward-looking statements on this call that include statements regarding future events, beliefs and expectations, including statements relating to our expectations regarding trends in the healthcare insurance distribution industry, consumer demand, our competitive advantage and market opportunities, our expectations regarding our Medicare and Individual and Family businesses, including our Medicare enrollment and other product offerings, our expectations regarding and our ability to improve customer conversion, customer retention and other quality metrics, our expectations regarding our marketing channels, our telephone and online enrollments, our e-commerce platform and our member acquisition strategy, our expectations related to our short- and long-term strategies, operating plan and financial goals, including our transformation initiatives, our expectations regarding our financial performance, including the profitability of our business, cash flows, conversion rates, customer retention, lifetime values, member estimates and fixed and operating expenses and our full year 2022 financial guidance. Forward-looking statements on this call represent eHealth's views as of today.\n\nYou should not rely on these statements as representing our views in the future. We undertake no obligation or duty to update information contained in these forward-looking statements, whether as a result of new information, future events or otherwise. Forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those projected in our forward-looking statements. We described some of these and other risks and uncertainties in our annual report on Form 10-K and quarterly reports on Form 10-Q filed with the Securities and Exchange Commission, which you may access through the SEC website or from the Investor Relations section of our website.\n\nWe will be presenting certain financial measures on this call that are considered non-GAAP under SEC Regulation G. For a reconciliation of each non-GAAP financial measure to the most directly comparable GAAP financial measure, please refer to the information included in our earnings release issued today and in our SEC filings, which can be found in the About Us section of our corporate website under the heading Investor Relations. At this point, I will turn the call over to Fran Soistman.\n\nFran Soistman -- Chief Executive Officer\n\nThank you, Eli, and good afternoon to everyone joining us today for our second quarter '22 earnings call. During my prepared remarks, I will provide an update on our progress in implementing our strategic initiatives, discuss second quarter financial and operating results and revisit our outlook for the remainder of the year. I'd like to begin though with some higher level thoughts on our industry. The EL line and telesales health insurance distribution industry has faced multiple challenges over the past two years that have required the key players, including eHealth, to make conscious changes to our enrollment growth strategies, including a shift in approach to demand generation to achieve enrollment margins that support the economics of this business.\n\nOther top priorities for our industry include increasing member retention, continuously enhancing beneficiary experience and maintaining a solid compliance track record as regulatory requirements evolve. The businesses that respond to these challenges effectively will be rewarded with deeper relationships with our customers and carrier partners. And as the industry continues to evolve, we believe growth will return along with more stable financial performance. We believe customers deserve a trusted and unbiased advisor and shopping platform offering a broad selection of quality carrier options to meet their personal health insurance needs and preferences.\n\nFurther, consumer needs and expectations range from do-it-yourself to limited assistance or advice to full agent assistance to the customer or caregiver. Consumers also choose to interact with brokers in a variety of ways, including by telephone, online unassisted using a computer or a mobile device or through a hybrid online agent-assisted process. eHealth is listening to consumer preferences regarding the shopping experience for their health insurance needs and has built a robust and convenient omnichannel platform that continues to evolve today. eHealth Medicare and Individual and Family businesses provide significant value to both beneficiaries and carriers and remain attractive growth opportunities.\n\nOur comprehensive omnichannel shopping and enrollment platform and our expertise in using data science to simplify complex and personally impacted decisions regarding health insurance are foundational to our value proposition, which is built to meet consumers on their terms. We believe that eHealth will maintain and strengthen its leadership position in the large and growing direct-to-consumer health insurance distribution industry as we implement our impactful new short- and long-term transformational initiatives identified in the past year. I'll now move on to our second quarter progress and performance. In Q2, we continued to execute on the six-point operating plan that we've outlined on our prior earnings calls and took further steps in our cost savings journey.\n\nCurrently, we are on track to deliver more than $60 million in annualized cost savings through targeted reductions in both variable and fixed cost. In the second quarter, we implemented a targeted workforce reduction while maintaining strong expertise in areas of our strategic focus. We have also conducted a thorough review of each marketing campaign in partnership phasing out those arrangements that did not fit our member acquisition cost criteria. Additionally, as part of our cost savings initiatives, we have set a course to significantly reduce our real estate footprint and to become a virtual-first workplace.\n\nThis will eliminate a large fixed cost center over time. The primary goal of these cost savings initiatives remains unchanged, returning to profitable growth and cash flow generation on an accelerated time line. We are also seeing signs of a more rational approach to marketing spend and enrollment growth in the broader Medicare distribution industry. Based on these observations and to further our goal of eliminating the underperforming customer acquisition channels, we made the decision to reduce our investment in telesales capacity and variable marketing in the second half of the year relative to the original operating plan.\n\nThis means we expect to have fewer Medicare Advantage enrollments while achieving the same or better profitability on these enrollments by focusing on the highest ROI channels and increasing lead conversion rates. In the second quarter, we recognized a revenue impairment of $8.7 million, caused mostly by lower-than-expected retention within Medicare cohorts enrolled during the first half of 2021 before the implementation of our enrollment quality initiatives. The revenue impairment and our new lower marketing spend plan for the year informed the lower revenue guidance range, while GAAP net income and adjusted EBITDA guidance ranges were lowered by the net amount of the impairment. Conversely, our lower cost outlook for the year is also the reason that we are increasing our guidance for total cash flow outflow.\n\nBecause cash flow is not an ASC 606 item, it is not impacted by the impairment. These revised numbers can be found on our earnings press release and earnings slides. Christine will provide more context for the impairment and our new outlook for this year later on the call. At this point, I'd like to revisit each of the six areas of our operating plan and discuss our executional progress in each of them.\n\nFirst, as I mentioned, we are on track to achieve above and beyond our planned reductions in cost structure and working to identify additional areas of savings for the second half of 2022 and into 2023. Second, we are deploying marketing dollars in a way that we expect will drive better unit economics, including the optimization of our marketing mix to focus on channels where we hold strong competitive differentiation. In accordance with this goal, we have further reduced our investment in the DirecTV channel. For the upcoming AEP, our investment in DirecTV will be branded and limited to specific geographies where we see the best opportunity and we plan to build on this approach in the coming years.\n\nAbsolute dollar investment in the lead aggregator channel declined significantly in the second quarter compared to a year ago, but remained a meaningful portion of our overall channel mix. Moving into the AEP, we will be dramatically reducing the contribution from this channel, maintaining only those lead generator relationships that fit our LTV to CAC targets. In the second half of 2022, we plan to ramp our exposure to the online advertising channels, direct mail and email marketing, as well as lead nurturing, where we, for example, will leverage hundreds of thousands of online applications that are left partially completed every quarter. The emphasis on targeted marketing through audience segmentation and promoting the eHealth brand will apply broadly across our marketing initiatives going forward.\n\nAdditionally, we look forward to announcing our new Chief Marketing Officer in the coming weeks. This critical new hire will be leading the next stage of our omnichannel demand generation strategy. Third, as previously shared, we're slowing down our telephonic enrollment growth this year while emphasizing agent training and retention initiatives, piloting a local market-centric model, and increasing the contribution from dedicated carrier arrangements to derisk our marketing strategy and boost conversion rates. While our telephonic conversion rates remain impacted by the enrollment quality initiatives introduced last year, they did track ahead of our expectations in the second quarter.\n\nWe are also seeing continuing traction with our quality metrics. Our carrier partners have acknowledged our success in executing on the commitments we made coming out of the 2021 AEP to improve quality through CTM reductions. As the cohort enrolled during the 2022, AEP has demonstrated lower CTMs and better retention. We're following through on our quality commitments with impactful actions that have further strengthened our carrier relationships.\n\nIn addition, we believe that sustained improvements in CTM metrics is a leading indicator for customer satisfaction and improved retention performance for our new enrollments. In fact, members who we enrolled during the most recent AEP continue to track significantly better relative to prior AEP cohorts in terms of persistency. Year-to-date lapse rate on our '22 AEP cohort is approximately 10% better than what we've observed with the '21 AEP cohort at the same time a year ago. Ahead of the AEP, we are putting in place a number of programs aimed at further improving agent performance.\n\nOne of these programs is eHealth University, which is a higher touch training model meant to help agents enhance their sales skills in addition to obtaining required Medicare plan and regional market knowledge. Our product team also made significant progress this quarter, iterating on and testing enhancements to our selling process. In Q2, we successfully launched an online chat tool powered by licensed agents and piloted a co-browsing feature that allows our agents and customers to screen share for a more effective navigation of the enrollment experience. We are seeing early positive impact on conversion rates for customers who took advantage of these new tools.\n\nThis is an example of improving the experience for our agents and customers during the selling process as we frequently hear from beneficiaries that they want be able to see the plans in front of them as an agent is describing the available plan options. As we ramp for the AEP, we are building an agent base that is leaner and more agile than in past years, supplementing with a small number of third-party agents. Reflecting our revised outlook and focus on the most profitable enrollments, we have reduced our hiring targets this year and are currently expecting a year-over-year reduction in fourth quarter agent head count. The fourth element of our operational plan is to continue growing our online business, reinforcing our tech differentiation through targeted investment in our e-commerce platform.\n\nI continue to believe that one of our most important competitive moats is our seamless omnichannel enrollment platform, led by scalable online enrollment capabilities. We believe that beneficiaries find tremendous value in our end-to-end enrollment capabilities and that it is critical to maintain and advance this point of differentiation. As we have pulled back on our variable marketing spend across the organization, in the second quarter, we also temporarily scaled back the amount of leads we generated through paid online advertising. While we continue to grow our Q2 online unassisted Medicare Advantage enrollment of 15% year over year, this represented a slower rate of growth compared to prior quarters.\n\nThe fifth element of our plan is to work with our carrier partners to pursue revenue opportunities and value creation beyond the traditional broker record model. This includes collaborating on ways to enhance beneficiary experience post enrollment, including joint member engagement and support initiatives. Beneficiary experience is one of the top priorities for carriers and we are seeing early interest in these joint programs that could drive revenue other than broker compensation. Finally, the sixth point is to pursue cost-effective diversification initiatives.\n\nOn the IFP side, we are pursuing the emerging individual consumer health reimbursement arrangement or ICRA opportunity, which allows employers to fund IFP premiums for their workforce as an affordable alternative to small business coverage. In the second quarter, we intentionally decided to keep our powder dry in order to ramp our spend in the fourth quarter, where we see the largest potential for scaling ICRA enrollments. We're also experimenting with ancillary products to target our existing Medicare customer base, such as hospital indemnity products, as well as dental, vision and hearing products with the potential for additional products where we see opportunity. And finally, we are evaluating new areas of expansion that represent a departure from our current products and services.\n\nWe expect any diversification initiative that we undertake after initial testing to have a more favorable first year cash flow profile relative to an MA sale. Moving to second quarter financial results. Total revenue was $50.4 million. GAAP net loss was $37.5 million.\n\nAdjusted EBITDA for the second quarter was a loss of $33.3 million. We ended the quarter with $801.6 million in commission receivables. Second quarter core operational performance exceeded our revenue and adjusted EBITDA expectations driven primarily by better-than-expected telephonic conversion rates in the Medicare business. As I mentioned earlier, in the second quarter, we also recorded an $8.7 million negative adjustment in revenue, which impacted overall results.\n\nWhile we are seeing better retention on the newer Medicare Advantage cohorts enrolled after we introduced the call verification step in July of 2021, some of the older cohorts have churned at elevated rates. Excluding the impact of the negative revenue adjustment, our second quarter revenue was $59.1 million and adjusted EBITDA loss was $24.6 million. Despite recording this negative tail stemming from older Medicare cohorts, it is still true that the enrollment quality initiatives implemented last July are serving their intended purpose of creating a better overall customer experience while increasing persistency and decreasing CTM rates. As part of our transformation initiatives, we are working on strategies for enhancing eHealth's capital structure and meeting our long-term capital needs.\n\nWe expect to be able to discuss this in greater detail later this year, but we also plan to feature some of the initiatives from our three-year strategic business plan, along with revenue growth and cash flow outlook. When I was asked to lead eHealth, I was anticipating making leadership changes following the same team-building playbook that has worked for me in the past, namely building a team with complementary skills bought into our mission and vision and committed to putting the company first. I believe we are in the final stages of completing this goal. With that as context, in conjunction with our second quarter results, we filed an 8-K announcing the departure of our Chief Digital Officer, Phillip Morelock.\n\nWe appreciate Philip's contributions to eHealth during the past four years. A search for a new digital and technology leader is underway, and I'm confident we'll continue to attract great talent to complete the transformation of the leadership team. In the first half of 2022, we welcomed new executives to our management team, including our chief operating officer, chief transformation officer, Roman Rariy; our new general counsel, Gavin Galimi; and chief accounting officer, John Dolan. In addition, we plan to announce the appointment of our new chief marketing officer before the end of the month.\n\nI'm excited to have these critical hires in place as their energy and enthusiasm is contagious throughout the entire organization. While we are still in the midst of executing our transformation plan, my confidence in eHealth strategy and positioning to take advantage of the attractive Medicare Advantage opportunity remains unwavering. I am confident that the operational technology and marketing changes we are making have eHealth on the right track to reach our goal of sustainable, profitable growth and deliver value to our shareholders. I'll now pass the floor to Christine to discuss our financial results and outlook for the second half of 2022 in greater detail.\n\nChristine?\n\nChristine Janofsky -- Chief Financial Officer\n\nThank you, Fran, and good afternoon, everyone. Our core operational results for the second quarter before the impact of a revenue adjustment exceeded our expectations driven primarily by telephonic conversion rates that were favorable to our internal financial plans. At the same time, our year-over-year comparisons for conversion rates, revenue and profitability continue to be impacted by the changes in the enrollment process that we introduced in July of last year. The net impact of the negative revenue adjustment from prior period enrollments was $8.7 million across all products, with the largest impact coming from our Medicare book of business.\n\nBased on our implementation of ASC 606, we have guardrails in place that trigger a negative adjustment if cumulative churn when a cohort exceeds a certain threshold. This adjustment applies even if a cohort is early in its life and can over time, track to the original LTVs as it matures. The goal with our guardrails is to adjust our receivables in real time and prevent any sizable revisions down the road. Notably, we do not use the same review policy with respect to positive tail revenue as we are far more conservative and applying positive tail to our financial performance.\n\nInstead, positive tail is typically recognized only after we have three years of persistency observations on a cohort. As a result, we have a sizable amount of unrecognized positive tail on our Medicare book of business. Within our Medicare segment, second quarter Medicare Advantage approved enrollments were approximately 51,500 or a year-over-year decrease of 34%. This made up the majority of our approximately 59,400 in total Medicare enrollments, which were down 35% relative to Q2 2021.\n\nThe year-over-year decline in enrollments reflected a reduction in variable marketing spend and lower call conversion rates. Q2 is the last full quarter that compares our current results against quarters with higher agent productivity a year ago before the enrollment verification step and modified enrollment scripts were introduced. We ended the quarter with estimated total Medicare Advantage paying membership of 590,000 compared to approximately 563,000 at the end of Q2 2021. MA LTVs of $886 declined 2% on a year-over-year basis, driven primarily by the lower retention rate we saw within cohorts enrolled during the first half of 2021.\n\nThese cohorts were also the main contributors to the negative revenue adjustment that we booked in the quarter. All in, Medicare Advantage customer acquisition costs, including variable marketing and agent-related expense was $896. This represented a sequential decline from $986 in Q1 of this year, driven by a 25% quarter-over-quarter decline in marketing costs per approved member and reflecting our strategy of a more targeted deployment of the marketing budget and limiting marketing spend within lower ROI channels. As Fran mentioned, in the second quarter, we significantly reduced our dollar spend for DirecTV and portions of the third-party lead gen channel.\n\nGoing forward, we will continue to enhance the marketing mix prioritizing member profitability over enrollment growth. Second quarter Medicare Advantage online unassisted applications grew 15% on a year-over-year basis to just over 7,000 applications. Similar to our overall marketing strategy, we are eliminating the lower-performing areas of online advertising spend with a goal of continued growth in this channel in 2023. Medicare segment revenue was $41.1 million, down 44% from the year ago quarter.\n\nMedicare segment loss was $25.3 million in the second quarter, compared to a loss of $17.8 million in Q2 2021. Individual, Family and Small Business segment revenue was $9.3 million with segment profit of $4.3 million, compared to $23.3 million and $17.9 million, respectively, in Q2 of last year. The year-over-year decline in segment revenue and profitability is attributable primarily to a reduction in tail revenue. As a reminder, in Q2 of last year, we recorded a significant positive revenue adjustment of $15.8 million in the segment.\n\nIFP enrollments were also down on an absolute basis, partially offset by another quarter of significant year-over-year increases in lifetime values of individual products. As Fran mentioned, we will be deploying the largest portion of our annual IFP budget in Q4 when the open enrollment period takes place. We also see the most meaningful ICRA opportunities in the fourth quarter. Moving now to our expenses.\n\nIn the second quarter, total GAAP operating expense was $95.9 million, down 21% from $121.9 million in Q2 2021. The decrease in total opex was driven primarily by year-over-year decreases of $12.8 million or 35% in variable marketing expense and $9.2 million or 24% in CC&E costs. On the fixed cost side, tech and content spend declined 13% year over year to $17.8 million, while G&A decreased 5% to $17.2 million for the quarter. We also gained leverage from a decrease of $1.9 million or 24% of our fixed marketing costs.\n\nFor the full year, we expect a decline of over $60 million in full year operating expenses relative to 2021. We ended the quarter with $199.2 million in cash, cash equivalents and marketable securities and $65.4 million of debt. Our balance sheet also reflects a commissions receivable balance of $801.6 million that is comprised of $201.3 million that we expect to collect over the next 12 and $600.3 million in long-term commissions receivable. This compares with total commissions receivable of $755.6 million as of June 30, 2021.\n\nOperating cash flow for the second quarter was negative $25.8 million, compared to negative $32.1 million a year ago. Trailing 12-month Medicare commission cash collections were $323.5 million, an increase of 1% compared to a year ago. We are in the process of planning capital structure strategies that will support our operational plan. As we assess potential capital solutions, we are diligently considering all potential impacts of these solutions on our shareholders and will select the solution that gives us the best opportunity to create long-term shareholder value.\n\nWe look forward to updating you on our progress as appropriate. Turning to the outlook for the rest of the year. During the quarter, we made the decision to reduce our variable marketing spend in the second half of the year relative to our original plan. The objective is to further optimize our marketing mix and focus on the most profitable and strategically important channels.\n\nWe made a corresponding adjustment to our agent headcount goals for this AEP. The net impact of this plan is a lower overall enrollment and revenue outlook with adjusted EBITDA and GAAP net loss in line with the original operating plan, net of the negative revenue adjustment that we recognized this quarter. Our new lower spending plan for the year will also have a significant positive effect on our cash flow. Because our Medicare membership base, which grew 5% in Q2, continues to generate steady cash receipts, a significant amount of these cost savings will have a direct positive impact on our total cash flow.\n\nIn addition to our lower revenue outlook based on these operational decisions, we are also lowering our revenue, adjusted EBITDA and net loss guidance to reflect the negative revenue adjustment we recognized in Q2. The revenue adjustment is a noncash item and does not impact our expectations for total cash outflow for the year. Our new guidance ranges are as follows. Total revenue for 2022 is now expected to be in the range of $375 million to $395 million, compared to our prior guidance range of $448 million to $470 million.\n\nNet loss for 2022 is now expected to be in the range of $115 million to $92 million, compared to our prior guidance range of $106 million to $83 million. Adjusted EBITDA for 2022 is now expected to be in the range of negative $73 million to negative $45 million, compared to our prior guidance range of negative $64 million to negative $37 million. Total cash outflow for 2022, excluding the impact of our $70 million term loan and associated costs is now expected to be in the range of $110 million to $90 million, compared to our prior guidance range of $140 million to $120 million. Looking to the upcoming third quarter, we expect revenue to be relatively flat sequentially, while adjusted EBITDA is expected to decline sequentially, reflecting targeted marketing investment and telesales ramp ahead of this year's AEP.\n\nI share Fran's confidence in the transformational progress we are making at eHealth. In addition to driving cash flow upside in 2022, the revised operating plan creates leverage beyond this year by further rationalizing our demand generation strategy in line with what we are observing in the broader market and allowing us to enter 2023 on a lower cost run rate, including a stronger and nimbler telesales organization. With that, I'll turn it over to the operator to open up for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Your first question will come from Elizabeth Anderson with Evercore.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nHey, guys. Thanks so much for the question. So a couple questions maybe. I appreciate you giving us the updated churn numbers on the newest cohort.\n\nI'm just trying to think of for people who are just trying to sort of -- I know we've been sort of so accustomed to like fixating on that over the years. When do you think that like -- as we sort of think through the newer cohorts and the impact that they have on that total churn number, is that like a 2023 event before we start to see those churn numbers on a year-over-year basis move lower? Just help us think about that because I know that that's something that sort of incrementally always makes people nervous when they see it moving up.\n\nFran Soistman -- Chief Executive Officer\n\nHi, Elizabeth, it's Fran. Thanks for joining us. I think if you follow the -- follow sort of each year's life, if you will, or call it a tranche, the January 1 AEP cycle, think of it as a measurement over a 12-month period. I mean, we can do it quarterly.\n\nBut I think looking at it over 12 months is probably more credible. The next real credible measurement will be January of '23 when that cohort goes through the next annual election period, and then they're again through the OEP and then the next measurement period beyond that would be January of '24. So I think they are the kind of key milestones.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nOK. That's really helpful. And then as we think about CC&E, I appreciate you're talking through the quality initiatives that you've been mentioning. One, can you comment on the overall hiring environment now and sort of how you're -- it is? I know it's sort of early days for the full AEP ramp, but how that's trending sort of to plan? And then when do you sort of lap the implementation of the quality initiatives you put in place last year? Because I would think that that would then sort of the comparison at least on the Medicare Advantage and things conversion would become easier, right? Is that the right way to think about that?\n\nFran Soistman -- Chief Executive Officer\n\nLet me take the second question first. This quality initiatives went into effect during the third quarter of '21. So the measurement year over year would begin this third quarter. So we'll be able to do an apples-to-apples comparison and going forward.\n\nAs far as the dynamics in terms of agent recruiting, recognizing that we are now a remote-first organization and we're not sort of beholden to any one geography when we're looking to recruit agents, that gives us greater flexibility. And I would say that largely, our needs have been met provided our assumptions regarding agents attrition hold up, of course. So I would say that they're tracking pretty much to plan. And that's -- Roman is here and I'll let him comment as well, our chief operating officer, oversees our telesales operations.\n\nBut I think that the training has gone really well. We expect the graduation rate to be higher than it has been historically, and it's because we've changed the way that we are onboarding the agents with a more personal hiring with the supervisor who ultimately going to be responsible for that particular agent being the one who is doing the hiring as opposed to the recruiter. So there's just the whole process has been reengineered. So Roman, do you want to add anything to that.\n\nRoman Rariy -- Chief Operating Officer and Chief Transformation Officer\n\nThank you. So we acknowledge that this year, this is -- another year, we're operating in the most [Inaudible] environment. So we were preparing for AEP and the new Asian class, we acknowledge that and tried our best to potentially substitute the in-person interaction that you would have in the office within the training and within the recruitment. So we increased number of touch points with the new agents to increase the interaction of new agents and the seasoned agents with the management team all the way from supervisor to EVP of sales.\n\nThat seem to be giving us her indicators of increased higher stark KPI. And on balance, the stronger focus on agent training, especially early on, has given us [Inaudible] regarding the expected performance during the AEP, at least the numbers of agents for sure.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGot it. That's helpful. Thank you very much.\n\nOperator\n\nOur next question comes from Daniel Grosslight with Citigroup.\n\nDaniel Grosslight -- Citi -- Analyst\n\nHi, guys. Thanks for taking the question. I just want to go to the unassisted online enrollees in Medicare -- Medicare Advantage. So in 2Q, it was up around 12% year over year.\n\nIf I look back at 1Q, it was up around 50%. And then back in 2Q '21, it was up around 80%. I'm just curious if you're seeing any headwinds in this channel specifically? Obviously, it's growing nice for you but at a slower rate versus historical? And how should we think about that unassisted online for this upcoming AEP? Should we assume that's going to be a significant step down to last year's AEP growth, which was around 53%.\n\nFran Soistman -- Chief Executive Officer\n\nHi, Daniel, Fran. The -- we've been very careful about our marketing spend in terms of -- even on the online unassisted. There's multiple ways that that money can be directed to generate traffic to our online platform. And the spend was redirected to those areas that we felt we were going to get the greatest lift and the highest conversion.\n\nSo it is more targeted. We do expect a healthy growth from our online channel for the AEP. We're not prepared to provide the guidance quite yet on what we think that will ultimately look like in terms of how we compare to last year's AEP. But it is an important contributor to the overall story here at eHealth, so we'll provide maybe a little more guidance in the near future.\n\nDaniel Grosslight -- Citi -- Analyst\n\nOK. Great. Some of your competitors have spoken about growing revenue outside of core Medicare commissions. I'm curious, it's not something you've talked about much, but I'm curious what levers you can pull to grow outside of commissions.\n\nAnd if you plan maybe not this year, but next year, year after, if you plan on investing in new, more predictable revenue streams.\n\nFran Soistman -- Chief Executive Officer\n\nWell, I want to make sure I understand the question because there's other, I would say, somewhat related to the Medicare Advantage business that we're also compensated for. So if it's not particular to that, there's other things that we already provide in the way of services that we are in discussions with several carriers about that, I would say they value in terms of improving persistency of the membership. We can generate revenue as a result of that. So the short answer is, yes, we are definitely looking at that.\n\nWe see that as revenue opportunities that wouldn't be 606 related revenue, it would be 605 related revenue. And perhaps it would be more predictable.\n\nDaniel Grosslight -- Citi -- Analyst\n\nYup. All right. Appreciate the color, Fran.\n\nOperator\n\nYour next question comes from Tobey Sommer with Truist Securities.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nThank you. Under the new lower growth plan, do you expect eHealth to remain in the top tier for the major carriers given the lower volume levels of sales product that you expect?\n\nFran Soistman -- Chief Executive Officer\n\nHi, Tobey, Fran again. Thanks for joining. I think when we look at our partnership with the top carriers, we evaluate those relationships based on the net, meaning that if the volume and the retention combined, we're putting a lot of attention on reducing the churn and improving the quality, driving -- continuing to drive the CTMs down, which we've had great progress on, and that's been noted by several of our carrier partners. So we will remain quite relevant with our carrier partners, perhaps will be less relevant with some of the smaller ones as we put more focus on some of the larger ones.\n\nSo I would say that's the trade-offs that we make.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nOK. And you mentioned, I think, in the prepared remarks a comment about how others in the market are also being more sort of scrutinizing their marketing spend. How can you tell that competitors are also pulling back on their expectations for growth?\n\nFran Soistman -- Chief Executive Officer\n\nWell, we're relying on what they're saying publicly. We're going to take them at their word.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nOK. So -- but there's nothing in the marketplace as you see it? Are there other signs that you can see in your day-to-day business activity that that's occurring?\n\nFran Soistman -- Chief Executive Officer\n\nNot quite yet, but we would potentially see some reduction in traffic on our website. A lot of our competitors agents use our website to look up providers. They can do that using our tool because they have no other means of doing that.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nOK. And then on the CMS front, it was a little under a year ago before AEP, where there was a letter sent to remind everybody the rules of the road for marketing and sort of good behavior. Do you expect anything this year? How is the dialogue and interaction been with regulators?\n\nFran Soistman -- Chief Executive Officer\n\nWell, I don't want to go too far out on a limb here and make some precedent [Inaudible] about what CMS may or may not do. I think they realized when that came out last October, it was quite late in the process. And I would like to think that they would not repeat something like that again. So I have a call later this week with the deputy administrator that that I organized, we know each other, we had a chat a while, so this is to kind of catch him up on what's going on at ELs and see what's going on in his world and let me know what on my mind and how we can keep the dialogue open.\n\nSo hopefully, we're going to avoid those kinds of situations.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from Ben Hendrix with RBC Capital Markets.\n\nBen Hendrix -- RBC Capital Markets --- Analyst\n\nOK. Thanks, guys. I was wondering if you could give us any more information as you increasingly seem to be targeting your variable marketing spend toward those higher ROI areas. If there are any characteristics as we kind of start applying that -- the spending that you are doing in the third quarter, if there are any kind of characteristics, specific characteristics you can offer that differentiate these higher ROI channels versus those that you're deemphasizing?\n\nFran Soistman -- Chief Executive Officer\n\nHi, Ben. I would probably limit my comments right now. I mean, I think it's fair to say that we have utilized direct mail as you know, something too proprietary. It's probably less about the channel more about how you convey the message because there's a lot of traffic, as you know, during the APC.\n\nAnd then it's the message you convey and how do you make sure your message stands out above the rest so that if beneficiary is going to pick up the phone and dial, they're going to ring eHealth. And that's really what we're focused on. How do we reach our audience and what message is going to resonate with them. So -- and there are certain channels that are just I would say perfected more than others.\n\nSo that's really our focus.\n\nBen Hendrix -- RBC Capital Markets --- Analyst\n\nGotcha. Thank you. And just one more. Last quarter, you mentioned that you had a strong online completion rate of around 90% for IFP and you've called out the ICRA opportunity.\n\nAnd now given that we've seen the extended reconciliation bill passed that extended the subsidies for ACA plans. I was wondering if you could have any early thoughts on where you think your IFP mix might go over the next couple of years. Thanks.\n\nFran Soistman -- Chief Executive Officer\n\nYeah. I think the IFP business will continue to be an important part of our portfolio. I think the [Inaudible] in particular, right, I still remain bullish on it. I'm very eager to see what we can achieve in the fourth quarter and first quarter of '23.\n\nI think it's an intriguing product that could be incredibly helpful to small businesses. So I'm very bullish on that. And I still think that there's great opportunities with stage changes that we remain encouraged to play a part on.\n\nBen Hendrix -- RBC Capital Markets --- Analyst\n\nThank you.\n\nOperator\n\nAnd our final question comes from George Sutton with Craig-Hallum.\n\nAdam Kelsey -- Craig-Hallum Capital Group -- Analyst\n\nHey, thank you. This is Adam on for George. Fran, in your remarks, you mentioned the goal is to get to a profitable growth on an accelerated time line. I'm curious if there's any specific items that you could focus on that would either speed up or slow down that time line in your mind?\n\nFran Soistman -- Chief Executive Officer\n\nHi, Adam, thanks for joining. I think we're really pulling all those levers right now. We have worked very diligently to take out cost. We've made great progress there.\n\nWe continue to work to improve the conversion rates, for example, on our telesales, as well as our online and the marketing optimization will remain a focus. So we're pulling all of the right levers. We have to continue to make important progress there. And I think it basically comes down to the time it takes to get to that optimal level and continue to take out more costs.\n\nAnd I think it's kind of cliche, but it's about turning the corner. And I think we're getting closer and closer to turning that corner.\n\nAdam Kelsey -- Craig-Hallum Capital Group -- Analyst\n\nGreat. And just one more for me. With respect to the ICRA opportunity, any potential way to size what you think that may be relative to other opportunities for this year and what you think it could potentially grow into it? I know it's rather early for it, but any type of thoughts would be helpful.\n\nFran Soistman -- Chief Executive Officer\n\nWell, I'd love to stick my neck out, but my general counsel is sitting here and shooting looks at me, so I'm going to have to dodge that question a bit. Let's just say this that it's been sized on a national scale and there's insight by a couple different experts and the numbers range by pretty substantial level. So I think that when we talk about later this year, when we talk about the revenue growth opportunity, perhaps I can be a little more specific. But let me say that I'm very bullish on it.\n\nI think that it's going to gain traction and momentum over the next two to three years as small employers realize what it can do, how it can be utilized in terms of -- doesn't necessarily have to solve all of their needs, can solve part of their needs. And if they have a strategy and strategy that ELs can certainly help them work through, it's a great tool. So I'll just leave it that I'm very bullish.\n\nOperator\n\nThere are no further questions at this time. Mr. Soistman, I would like to turn the call over to you.\n\nFran Soistman -- Chief Executive Officer\n\nWell, thank you, operator. First, I'd like to leave you with a few closing thoughts. The eHealth team continues to make important changes in nearly every aspect of our business toward the goal of returning the company to profitable growth and positive cash flow as quickly as possible. Every day, we're making important progress on our strategic plan and our operational priorities.\n\nNow that we are at the end of the day here on August 8, we're T minus 68 days from the beginning of AEP and our readiness is tracking the plan. So we look forward to our follow-up conversations and continuing to share updates on our progress this year. So thank you again for joining us this afternoon. Operator?\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEli Newbrun-Mintz -- Senior Investor Relations Manager\n\nFran Soistman -- Chief Executive Officer\n\nChristine Janofsky -- Chief Financial Officer\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nRoman Rariy -- Chief Operating Officer and Chief Transformation Officer\n\nDaniel Grosslight -- Citi -- Analyst\n\nTobey Sommer -- Truist Securities -- Analyst\n\nBen Hendrix -- RBC Capital Markets --- Analyst\n\nAdam Kelsey -- Craig-Hallum Capital Group -- Analyst\n\nMore EHTH analysis\n\nAll earnings call transcripts"
}