{
  "companyName": "SVB Financial Group",
  "companyTicker": "SIVB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/21/svb-financial-group-sivb-q3-2022-earnings-call-tra/",
  "content": "SVB Financial Group (SIVB -1.91%)\nQ3 2022 Earnings Call\nOct 20, 2022, 6:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Welcome to SVB Financial Group's Q3 2022 earnings conference call. At this time, all participants are in a listen-only mode. And please be advised that this call is being recorded.\n\nAfter the speakers' prepared remarks, there will be a question-and-answer session. [Operator instructions] And now at this time, I'll turn things over to Ms. Meghan O'Leary, head of investor relations. Please go ahead, ma'am.\n\nMeghan O'Leary -- Head of Investor Relations\n\nThank you, Bo, and thank you, everyone, for joining us today. Our president and CEO, Greg Becker; and our CFO, Dan Beck, are here to talk about our third quarter 2022 financial results and will be joined by other members of our management team for the Q&A. Our current earnings release, slides, and CEO letter have been filed with the SEC and are available on the investor relations section of our website. We'll be making forward-looking statements during this call, and actual results may differ materially.\n\nWe encourage you to review the disclaimer in our earnings release dealing with this forward-looking information, which applies equally to statements made in this call. In addition, some of our discussion may include references to non-GAAP financial measures. Information about those measures, including reconciliation to GAAP measures, may be found in our SEC filings and in our earnings release. And now I will turn the call over to Greg Becker.\n\nGreg Becker -- President and Chief Executive Officer\n\nGreat. Thanks, Meghan. Before we go into questions, I just want to comment briefly on both our business and the market kind of the environment we're all dealing with just briefly. Let me start with the business.\n\nWe continue to see strength and momentum in our underlying business. I think it's really important to highlight given all the other factors that are going on. We got global fund banking term sheets near record highs, new client acquisition at all-time highs, strong credit quality, record core fee income, and investments in our four core businesses are driving better and deeper client relationships and really allowing us to give good advice to our clients as they weather this economic uncertainty. We've had great client feedback from the rollout of our digital banking platform, SVB Go, and we hit some international milestones, the U.K.\n\nsubsidization, and opening up our Stockholm office, that's going to help fuel our long-term growth. These are just a few of the many good things happening at SVB. And clearly, at the same time, the markets are undeniably challenging. Market volatility arising from a number of global issues has reduced private and public investment in the innovation economy.\n\nAnd this investment reduction, combined with elevated cash burn, is clearly pressuring deposit flow. This economic uncertainty is making it very difficult to predict when the balance of investment and lower cash burn will normalize. While we firmly believe the global innovation economy is the best market, it will get back on track. And our four-business platform is well-positioned to capitalize on its return.\n\nIn the meantime, we're well-equipped to manage these conditions with a strong liquid balance sheet with healthy levels of capital, recession-tested management, a resilient client base. And it's important to note that we remain steadfast in our focus on our strategy and laying the foundation for our long-term growth. So, with that, turn it over to the operator to open up the line for questions. Thanks. \n\nOperator\n\nThank you, Mr. Becker. [Operator instructions] Take our first question this afternoon from Steven Alexopoulos at J.P. Morgan.\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nHey, good morning, everyone. Or good afternoon, actually. Sorry.\n\nGreg Becker -- President and Chief Executive Officer\n\nHey, Steve.\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nI wanted to start with a big picture question. So, asset sensitivity has declined, but you're still asset sensitive and with rates basically moving up across the entire curve, which would suggest you should see some benefit potentially to NIM, but definitely the NII. But in the slides, you're guiding to both NII and NIM have now peaked. Can you just explain for us what's happening in the real world that your asset-sensitive model is not capturing because the guidance almost looks like your liability-sensitive bank here?\n\nDan Beck -- Chief Financial Officer\n\nYeah. Steve, it's Dan. So, if you think about what's happening, we continue to have asset sensitivity on the static balance sheet, but we continue to, with shift from noninterest-bearing to interest-bearing and use of off-balance sheet client funds on the balance sheet, driving interest-bearing to have higher levels of interest costs from an end-of-quarter perspective. So, while we are still getting some benefit from a net interest income sensitivity perspective, that shift in mix to higher levels of interest-bearing in this environment, while we're seeing higher cash burn and slower deployment in the venture space, is driving weaker net interest income on a quarter-to-quarter basis.\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nOK. Dan, if we stay with that line, the chart on Slide 9 shows inflows and outflows, which was pretty helpful. Are the outflows now at two times historical rates simply because more capital was raised during QE that's now getting spent or something else going on there? And what level of VC spend do you need to see this stabilize? \n\nGreg Becker -- President and Chief Executive Officer\n\nYeah, Steve, it's Greg. Let me take that. It clearly is a function the first part of the money that was raised last year, right? And when you think about it, the reason that you didn't see an immediate jump in all the way to max cash burn, it does take a while once you've raised all the funds, they raised last year to kind of hire the people to start spending the money. And there'll be a lag the other way as well.\n\nAnd that's probably one of the things in the last quarter that we didn't fully appreciate, that there would be a lag there. And so, it's hard to answer your question because you have to look at both of those variables. You have to look at the variable of dollars going in inflow, but it's both public and private, and then you have to look at the cash burn. So, as we think about that, this quarter was basically going back to the early part of 2020 from a level perspective and if you go back and look at that, if we get back to -- it will take a little while to get back to that same level of cash burn.\n\nWe certainly think that cash burn will continue to drop, but it may take two, three, four quarters to kind of get back to a similar level to the way it was last year. I think it's important to note that roughly we're capturing the same amount of venture capital that we have in the past, which is roughly 50%. You can go back and look at the analysis and say, over the last several years, when -- on average, when venture capital gets invested in a quarter, we capture roughly half of that. And that was still true this quarter.\n\nAnd so, it's really almost more of a function of the cash burn than it is the level. My view, I think we're going to start to see kind of this bouncing around at this level of venture capital where it's at, probably at this level for the next several quarters. So, what we really need to see is an improvement in cash burn. We expect it.\n\nBut to be honest, that crystal ball is a little bit cloudy exactly when it will happen and to what degree. \n\nDan Beck -- Chief Financial Officer\n\nYeah. The last thing to say, Steve, is that the chart that you're looking at in the earnings deck is on total client funds. So, the other thing that we have an opportunity for us to continue to direct both from off the balance sheet to on, as well as for net new money that's being deployed more toward the balance sheet to offset higher levels of cash burn. So, just something else to take into consideration, yes, that ends up costing a bit more from a liquidity perspective.\n\nBut when you're growing lending that's exiting the quarter close to 5% from an all-in yield perspective, that's still accretive.\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nThanks. So, just final question. So, on the fourth quarter deposit guide, the $168 billion to $172 billion, what VC investment level are you assuming to get into that range? And what's the assumed mix of interest-bearing, noninterest bearing? Thanks. \n\nDan Beck -- Chief Financial Officer\n\nYeah. So, Steve, again, what we think about for deposits is two things, macro venture deployment, and client cash burn. In this quarter, we saw total cash -- or venture deployment, 40% lower than Q2. If we're taking a look at our expectation to get to the higher end of the range, we would assume that we have a venture funding environment similar to Q3 with a continuation of higher levels of cash burn and continued success in bringing deposits from off our balance sheet to on.\n\nThe lower end of that range assumes a lower -- even lower deployment environment, take another 20% down from there, continuation of higher levels of cash burn, and less success of bringing those off-balance sheet funds on the balance sheet. In terms of noninterest-bearing to interest-bearing, we're probably exiting the year in that 45% to 50% range.\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nGotcha. OK. Thanks for taking my questions.\n\nGreg Becker -- President and Chief Executive Officer\n\nYeah. Thanks, Steve.\n\nOperator\n\nThank you. We go next now to Ebrahim Poonawala of Bank of America.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nHey, good afternoon.\n\nGreg Becker -- President and Chief Executive Officer\n\nHey, Ebrahim.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nI guess just following up on this cash burn dynamic. So -- if we assume that VC investment pace doesn't change from here. I think as you pointed out, Greg, this is still the best year ex 2021. So, let's say, if this is the new normal for the next several quarters or years.\n\nDo you have any visibility when that cash burn actually meaningfully slows down where you stopped seeing outflows in deposits as a result? And secondly, is it fair for us to assume that unless we see a big shift in VC investments? The mix shift will worsen in terms of noninterest-bearing totals and we could see NII decline sequentially for the next few quarters. Thank you.\n\nGreg Becker -- President and Chief Executive Officer\n\nYeah. Ebrahim, let me answer the first part of the question, and then Dan can take the second one. The visibility into the cash burn is a function of kind of what we see on a day-to-day basis, and then we extrapolate that out. What we saw is a slight decline in the third quarter, roughly 7%, 8%.\n\nAnd it's -- again, it's not a precise math. And what I would expect to see it'd be logical to see, I should say, is a similar decline over the next few quarters on a quarterly basis. So, your question is if you keep it steady, keep it flat to the level of investment, when would we start to see kind of, I'll call it, flattening? You're probably looking at about three quarters out before you kind of get to that breakeven from a flow perspective. We haven't done the back of the envelope math, but I would say it's probably generally in that area.\n\nAnd so that's what we track. But what are the other kind of communications and engagement that we have with clients and venture capitalist to kind of get a sense on that? Here's what I would -- here's how I can think about that. If you go back six months ago, the sentiment was definitely of concern. Three months ago, it was a greater concern.\n\nAnd now if you've spent time when talking to venture capitalists and we just had a global CFO Summit for VC and PE. The sentiment has gotten worse. And so, the message that they're communicating are cut your burn now, it's serious, even if you've got a lot of cash, and we'll see how long this lasts and be more defensive. That dialogue would imply that you should see cash burn continue to come down.\n\nI just would say we were a little bit surprised and maybe I was that it didn't come down even more quickly last quarter, which is why, again, it's just a little bit difficult to predict.\n\nDan Beck -- Chief Financial Officer\n\nAnd then to follow on to the question in terms of NII and net interest margin dynamic depending on how much of new money we can capture onto the balance sheet, which is generally cheaper. We may have to continue to replace dollars that are rolling off in deposits with off-balance sheet solutions, which are higher cost for sure. If I think of the overall deposit beta associated with those accounts, those are in the much higher range than what's sitting on the balance sheet with the rest of the deposits. At the same time, to the extent that we continue to see good, strong lending, we're picking up close to 90% on commercial bank lending of the beta from higher rates.\n\nSo that could be some offset. But generally speaking, I've continued to see some pressure on net interest margin and net interest income as we head into 2023 until cash burn and overall deployment start to rebalance.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nAnd then just tied to the liquidity. So, you have a ton of excess liquidity off balance sheet and ability to borrow. Is there any scenario where you see liquidating some part of the securities book to provide funding and just kind of restructuring the balance sheet to me as opposed to bringing on higher cost deposit funding on?\n\nDan Beck -- Chief Financial Officer\n\nYeah. I mean I think the way to think about it, as you mentioned, the balance sheet is really flexible. We have been using and talked about it earlier, off-balance sheet deposits and wholesale funding effectively supported by the securities book to bridge, and I think this is really important in this period of time that we're out of balance between cash burn and the amount that's being deployed into the market. First and foremost, the good news is that the securities portfolio is constantly paying down.\n\nAnd so, we're roughly seeing about $3 billion a quarter, even as interest rates increase to meet those funding needs. Additionally, as a burn and funding comes into balance, that's going to open up opportunities. We've talked about this before, where we're going to be able to drive more expensive funding off the balance sheet to reduce wholesale funding. And that will provide opportunities to reduce the overall cost of funding.\n\nSo, with all of that, we've got a lot of flexibility with the portfolio. At the same time, we're always considering ways to optimize the balance sheet. We've got a considerable available-for-sale portfolio, and we've demonstrated that we've been opportunistic with sales like that in the past.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks.\n\nOperator\n\nThank you. We go next now to John Pancari at Evercore. \n\nJohn Pancari -- Evercore ISI -- Analyst\n\nGood afternoon.\n\nGreg Becker -- President and Chief Executive Officer\n\nHey, John.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nJust back to the cash flows coming off the bond book, Dan, I know you mentioned you just did the $3 billion per quarter in paydowns. Is that the total cash flows coming off the bond book per quarter? Or is there a maturity that add to that?\n\nDan Beck -- Chief Financial Officer\n\nYeah, that's the regular maturity as we go on in time. We'll start to see some of the bullet maturities come down from a treasury perspective. But the regular principal paydowns in the portfolio, at least over the next four quarters are in that $3 billion range. And again, as we get out into later duration with some of the treasury portfolios, you'll start to see some of those bullet maturities come through.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nOK. And that $3 billion is a fully extended basis?\n\nDan Beck -- Chief Financial Officer\n\nYeah. That's -- I mean considering where rates are now and the mortgage portfolios, we think we have most the vast majority of the extension in there.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nOK. And if you could just remind us again, I know market rates if you can be more specific at what rates you're bringing on the off-balance sheet deposits, like, for example, this quarter, what rate really brought on?\n\nDan Beck -- Chief Financial Officer\n\nYeah. So as a reminder, those off-balance sheet deposits that we're bringing on -- they generally sit in money fund accounts, they're getting effectively money market rates, in order for us to effectively drive the product that allows for us to have those deposits both on or off the balance sheet, we have to pay a bit of a spread to that. So, we're paying in the, let's call it, high 2s range associated with that. And they do have higher beta obviously, than the rest of the organic deposits that are sitting naturally on the balance sheet.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nOK. Got it. And again, of the $91 billion of the off-balance sheet funds. Again, how much of that is eligible to be brought back on?\n\nDan Beck -- Chief Financial Officer\n\nYeah. We'd say it's roughly half. A lot of it is obviously client appetite. I mean, we always obviously do the right thing from a client perspective and how we're paying from a rate perspective.\n\nBut we'd say it's roughly half from an availability perspective.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nOK. And then the last thing for me, just in terms of the -- you mentioned the optionality in the available for sale portfolio, the held-to-maturity portfolio, just to -- are you still thinking that there is no intent to restructure that portfolio in any way?\n\nDan Beck -- Chief Financial Officer\n\nThere is no intent to restructure the held-to-maturity portfolio.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nOK. All right. That's it for me. Thanks.\n\nOperator\n\nThank you. We go next now to Casey Haire at Jefferies.\n\nCasey Haire -- Jefferies -- Analyst\n\nThanks. Good evening, guys. I wanted to touch on the borrowings, $10 billion last quarter and another $10 billion early in this quarter. Just what is the -- what kind of term and what kind of rate are you guys paying on the borrowings? Yeah.\n\nDan Beck -- Chief Financial Officer\n\nYeah. So, Casey, it's Dan. So, we've got a mix right now of short-term borrowings in the 3% range. We've termed some of that out to less than one-year maturity.\n\nSome of that's in the high 3s, low 4% range.\n\nCasey Haire -- Jefferies -- Analyst\n\nOK. And all that $20 billion, the $10 billion in 3Q and $10 billion in October, and the $10 billion in the second quarter?\n\nDan Beck -- Chief Financial Officer\n\nSo, in terms of balances at the end of the quarter, I believe we're sitting at $13 billion. something along those lines. So, of that, we're sitting with, I'd say, 60% less about close to a year and the rest of the short term. \n\nCasey Haire -- Jefferies -- Analyst\n\nOK. Gotcha. All right. And then just on the -- so Slide 11, the -- the deposit beta assumption and the DDA, it sounds like this -- the cash burn is going to take a couple of quarters to normalize.\n\nSo, I mean what's the -- I'm assuming that in '23, the DDA mix is moving consistently lower and then the deposit beta is obviously marching higher?\n\nDan Beck -- Chief Financial Officer\n\nYeah. Again, as we were mentioning earlier, the visibility on exactly how that's going to play out is harder to come by right now. I think there will continue to be downward pressure on the noninterest-bearing to interest-bearing proportion as we continue to see higher rates. That being said, at some point, I think you'll get to some stability of those levels.\n\nSo, I think as we go further into 2023, it will be a little bit more clear where that reduction effectively slows down. And I expect that we're going to really start to see a slowdown of that mix and shift from noninterest-bearing to interest-bearing in '23. Just how much and exactly where it bottoms out, that's a question mark. But I think we're going to see that slow here at the fast pace in rates, I think for those that are activated, that's already happening.\n\nCasey Haire -- Jefferies -- Analyst\n\nOK. Understood. And just last one for me. The fee guide for fourth quarter ex SVB Securities 345 to 360, that's a pretty healthy step up from the third quarter run rate, which I have at 316.\n\nWhat's driving that?\n\nDan Beck -- Chief Financial Officer\n\nYeah. We continue to see the benefits of higher interest rates come through on the spread on the off-balance sheet accounts, and we'll continue to see spreads improve there. So that's really the impact of the rate increase on client fund fee income coming through, as well as continuing to see good progress against our other payment categories, you look at cards, you look at FX, and the rest of our activities. So, as Greg mentioned, our clients are really active in the midst of this slower deployment environment, and we're seeing that come through in that business activity.\n\nCasey Haire -- Jefferies -- Analyst\n\nOK. Thank you.\n\nDan Beck -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. We go next now to Jared Shaw at Wells Fargo.\n\nJared Shaw -- Wells Fargo Securities -- Analyst\n\nHey, good afternoon.\n\nGreg Becker -- President and Chief Executive Officer\n\nHey, Jared.\n\nJared Shaw -- Wells Fargo Securities -- Analyst\n\nI guess when you look at the companies that have taken that down around VC financing, are there any characteristics of stick out? And I guess, for those that haven't, how long can they hold out before they sort of need to take the lower pricing? Are we closer to a point of capitulation for that?\n\nGreg Becker -- President and Chief Executive Officer\n\nYeah. Jared, the biggest challenge with, I guess, the private market repricing at a fast pace is the fact that many of them raised so much money last year. So you don't -- if you've got three years' worth of cash, you're not running out to raise more money at down round. And so, it takes time for them to do that.\n\nNow there are some things that are going to be happening coming up, right? So, at the end of the year, you have to start looking at valuations because how you do price stock options and things like that. So there -- we could see and probably will see more of a capitulation on valuations back to whatever the market is at the end of this year, which will filter through in kind of Q1-ish into 2Q because sometimes there's a little bit of a lag. So right now, we're not seeing a lot of down rounds. We're seeing more structured rounds, which means you keep the same price that maybe you do a 2x liquidation preference from a return perspective.\n\nWe're seeing more of that. But it's going to happen. We're going to see more of it. And there's always a debate when you sit down with a group of venture capitalist.\n\nSome would say never do a structured round, take your medicine and lower the valuation to the market, raise money when you can, etc., and others would say, project your valuation, if you can keep it and do a structure around, it's not the end of the world. So, we're just seeing that all play out. But that's the main reason. They end up with a fair amount of cash right now, so they don't have to come to that conclusion yet, but more of it is coming.\n\nJared Shaw -- Wells Fargo Securities -- Analyst\n\nOK. OK. that's helpful. Thanks.\n\nAnd then I guess for the investments that you're all holding on in your own investments, how are you treating valuations if there haven't been recent rounds to give that market check? Are you having to wait and take your lead from the company? Or are you proactively making any marks on your own?\n\nDan Beck -- Chief Financial Officer\n\nYeah, Jared, it's Dan. On the warrant positions, we get pretty regular updates and really current with those valuations, where we have at least some gap is in the liquid position. So we took a reserve last quarter associated with those and still had additional losses come through on some older funds where we had an ownership position this quarter. So -- and as we think about it on a go-forward basis, we would expect valuations on the illiquid positions.\n\nThey're going to be updated as a part of fund audits through Q4 and probably all the way through Q2. And that's where we may see additional losses. So think of that as a pool of about $600 million worth of illiquid positions. We could see kind of order of magnitude anywhere between 5% and 10% of that in the form of write-downs over the next couple of quarters.\n\nNow those losses may be offset by the occasional warrant gain, which we continue to see, but that, I think, is going to be a more limited quantities at this point in the cycle.\n\nJared Shaw -- Wells Fargo Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nNow we'll go next now to Bill Carcache at Wolfe Research.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nThank you. I had a question on credit. You maintained the ACL ratio at 77 basis points looks like but lowered the downside waiting to 65% from 40%. Can you discuss what's behind the lower downside scenario waiting? Any color on that?\n\nMarc Cadieux -- Chief Credit Officer\n\nYeah. This is Marc Cadieux. I'll start on that. And so, in a nutshell, the most recent Moody's forecast was much more aligned with our view on the economic outlook.\n\nAnd at the same time, after the forecast, which included an assumption of 50 basis point Fed increase, we saw 75. And so, our conclusion in so many words was that closer but not quite. And so, we took our weighting of the S3 scenario down but not all the way back to standard weights, kept it at 40% for this quarter.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nUnderstood. And separately, how would you characterize the demand that you're seeing from customers seeking funding from you relative to your capacity to provide funding? How are you determining customers that get funding? Maybe discuss a little bit on how competitive that lending environment is?\n\nGreg Becker -- President and Chief Executive Officer\n\nThis is Greg. Maybe I'll start, and then Mike Descheneaux may want to add. So, there's no question we've seen a uptick in demand, and that should be expected, right? So last year, we were definitely competing more with the healthy amount of the capital that was coming in. And yes, while it was a competitive market.\n\nBut definitely, the major competition last year was equity. This year, clearly, it's harder to raise money. And so -- or if people want insurance policies. So, debt is now back in vogue.\n\nSo, the level of activity, new clients coming on board and delivering term sheets, the pipeline, the backlog, and this is specifically in the technology and life science area across all loan products is actually -- has been very healthy. Your question on at least I'll interpret it. Do you have the capacity to fill all the orders that you may want to, and the answer is absolutely? As Dan said, we have the capacity in a lot of different ways to bring those loans onto the balance sheet assuming that qualifying, of course, that's a given. And when they do, we're able to fill those orders.\n\nSo, we see no slowdown in that. And it's actually one of the many areas that excite us about what we're seeing -- what we saw so far, especially in third quarter. So, take a look at the growth in the third quarter and what we look at as we roll into -- get ready to roll into '23. Mike, would you add anything to that?\n\nMike Descheneaux -- President, Silicon Valley Bank\n\nI think I would just go down the questions around -- are we -- essentially interpreted, are we doing anything different or being more cautious about who we're lending to and being a little bit more particular. And the answer is, of course, yes. I mean we've been through economic downturns. Our teams are very well versed into kind of what to recognize and to pay attention to in terms of companies that might be more vulnerable to this during this economic cycle.\n\nSo, for example, things such as the consumer area are definitely one area which we're going to keep an eye on because given this macroeconomic backdrop and inflation, certainly, that's an industry or sector that's going to take some sort of hit or impact. So those are just one example of kind of how we're thinking through and looking at the different sectors where we need to be a little bit more thoughtful than it had if the economic environment was stronger.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nThanks. And maybe if I could follow up with one last one. Along those lines, to the extent that you're putting up that growth, if you think about the yields that you're generating on those kinds of loans. And if we think about the sort of funding environment persisting and perhaps the money market type rates that as sort of being your cost of funds, maybe is the spread and sort of the NII accretion, is it reasonable that you'd expect that essentially that you would be asset sensitive.\n\nI think there's certainly concern that some liability sensitivity could shine through, given some of the dynamics that we're seeing. I know you're not giving guidance, but if you could just speak to that broader dynamic and your overall thoughts would be helpful.\n\nDan Beck -- Chief Financial Officer\n\nYeah. Bill, I'll start, and Mike might want to add. If we just kind of look at the dynamics of the loan portfolio, again, we talked about it, over 90% of that is a variable rate, and we're seeing on the commercial lending side, in particular, close to a 90% beta coming through on that lending. So, I feel good as our entire funding base is certainly not going to reprice at those levels that not just will we continue to maintain a strong spread there, but we'll actually be able to continue to grow it.\n\nSo, I feel good about that on the lending side. Mike, anything to add?\n\nMike Descheneaux -- President, Silicon Valley Bank\n\nYeah. I think maybe what we're getting to is the level impact of competition on the spreads, the pricings that we -- the premium we can actually have. And so, for the longest time, as we all know, it was competitive. By the way, it's still very, very competitive.\n\nAnd so, there was a drive or a trend downward spreads were getting tighter. I would say in this environment, particularly in certain segments of the loan portfolio, the downward pressure is not as significant as banks and other -- the nonbanks are being very conscientious of their cost of funds. And so, I think that is -- I wouldn't say it's abated, but nonetheless, there's a lot less downward pricing -- pressure on the spread there and a little bit more neutral this time, maybe neutral to some possible bias to little bit spreads expanding a bit.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nThat's very helpful. Thanks for taking my questions.\n\nGreg Becker -- President and Chief Executive Officer\n\nYep.\n\nOperator\n\nThank you. We go next now to Andrew Liesch at Piper Sandler.\n\nAndrew Liesch -- Piper Sandler -- Analyst\n\nHey, good afternoon. Thanks for taking the questions. Just on the increase in criticized loans here, I know we're still relatively small as a percentage of the overall. But is that concerning to you? And I guess, what drove that?\n\nMarc Cadieux -- Chief Credit Officer\n\nHi, it's Marc. I'll start. Concerning in so far as any increase in criticized loans would be concerning. And I think elective of the environment and worsening projected economic conditions that we were talking about.\n\nAt the same time, as I mentioned earlier in the call, our clients continue relative to past cycles, continue to have more robust liquidity. And so, while we are seeing that uptick in criticized, as you can see in the third quarter, we did not see it translate to an increase in nonperforming loans or loan losses.\n\nAndrew Liesch -- Piper Sandler -- Analyst\n\nGotcha. Is it issues with any individual credits or just a general downgrades of, I guess, targets to the portfolio that drove this?\n\nMarc Cadieux -- Chief Credit Officer\n\nYeah, I'd say it is concentrated in our tech and healthcare portfolio, as you would imagine. And generally speaking, there probably falls more heavily on our investor-dependent segments.\n\nAndrew Liesch -- Piper Sandler -- Analyst\n\nGot it. All right. And then just kind of a housekeeping item on the client investment fees. Are those capped at all? Or do you continue to benefit no matter how fast or how high the Fed rate is raised?\n\nDan Beck -- Chief Financial Officer\n\nYeah. Based on some good work by Mike and the teams over the last couple of years, they've renegotiated those agreements. So, we don't see a cap on those client investment fees. Now with where rates are, the expectation is every 25 basis points is probably another basis point versus like 1.5% to 2% that we got at the beginning of the rate cycle, but it is not capped and expect about a basis point for every 25 basis points.\n\nAndrew Liesch -- Piper Sandler -- Analyst\n\nGot it. All right. That was my question. Thanks so much.\n\nOperator\n\nAnd next, we go to Manan Gosalia at Morgan Stanley.\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nHi. Good afternoon. Most have been asked at this stage. But just -- I sort of recognize there's not enough visibility for 2023.\n\nBut I was wondering if you can just talk about the NII guide for next quarter as you're jumping off point for '23. Maybe there will be some more weakness if funding levels remain weak, but I was wondering if you could help quantify that. And also on the flip side, do you see a rebound in the back half of the year of -- in terms of funding and cash burn? How quickly do you think the NIM and NII can tick up in that environment?\n\nDan Beck -- Chief Financial Officer\n\nYeah. As we talk to -- it's Dan, as we talked about, it's really hard with looking at past Q4, where cash burn rates are and the potential for venture deployment to fluctuate, to have a really good sense of exactly where net interest income is going to at least start the year or jump off for 2023. I do think as long as we're in this environment where we're unbalanced between venture funding and the amount of cash burn that we're going to continue to see some net interest margin compression. We're going to have offsets to that by the higher rates and the beta that we're seeing come through on the lending side of the book.\n\nThat remixing and the use of those off-balance sheet funds again, where we have got flexibility to drive them off the balance sheet could continue to deteriorate margin and net interest income. Just how much, I think that's the degree of certainty as we get into the first quarter, I think it's going to obviously be a lot more clear. Now how quickly can it rebound? If we can -- if we start to see cash burn slow appreciably and not just a stabilization of deployment, some effective increase, and some public market activities come in, you can start to see inflows on the deposit side pretty quickly. And from there, as we mentioned in the past, we have the ability to start to either pay down borrowings very quickly or redeploy some of those funds off the balance sheet.\n\nSo exactly how and when that's going to play out is a question mark. But as soon as it does start to happen, we're going to be able to really start to move the balance sheet quickly. So probably not a super satisfying answer just because there's a little bit more uncertainty. But hopefully, you understand all the pieces.\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nYeah. That's helpful. And then typically, a cash burn gets worse before it gets better because you have to spend on severance renegotiating contracts, etc. Is that already part of the story on cash burn this quarter? I was curious what you're hearing from the private companies.\n\nGreg Becker -- President and Chief Executive Officer\n\nYeah. This is Greg. It's all factored into that one chart that we show. So it's part of the equation that is built in there.\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nOK. Great. And then Apologies if I missed this, but how much of the sweep accounts were brought on in 3Q? And what does the deposit guide for 4Q assume?\n\nDan Beck -- Chief Financial Officer\n\nSo, in total dollars, we brought in, in the quarter, roughly, let's call it $5 billion to $6 billion, something along those lines. And in terms of the fourth quarter guide, like I said, to the higher side, it assumes that we continue to be successful, albeit to a smaller degree on those off-balance sheet to on-balance sheet. To the extent that that's slower and you see slower deployment and faster cash burn that could get us to the lower end of that guidance range for the fourth quarter.\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe'll go next now to Gary Tenner at D.A. Davidson.\n\nGary Tenner -- D.A. Davidson -- Analyst\n\nThanks. Good afternoon. On Slide 24, the client investment for the client fund slide, one of the considerations you pointed out was China policy changes and investment in Chinese companies. I just wonder if you could maybe talk to China policy changes and any considerations as it relates to your strategy over there?\n\nGreg Becker -- President and Chief Executive Officer\n\nSo, this is Greg. I'll start, and I know Mike will add to it. From a policy perspective, you can look at there's a whole variety of things, and that's the problem. It changes kind of on a monthly, weekly, quarterly basis.\n\nAnd so, part of the policy is just the overall stance at a very high level I think about the policy and positioning U.S. versus China and the softening or the weakening of the relationship. So that's at a high policy level. Mike may be able to give you some color on any changes in the local market, local that is happening that would cause it on the ground.\n\nMy view is just kind of at the macro level. So, Mike, what would you add to it? Mike, I think you're still on mute.\n\nMike Descheneaux -- President, Silicon Valley Bank\n\nThank you, Greg. I think certainly, policy changes impact all of us, right? I think the key focus is kind of the U.S.-China relationship there and a good relationship will certainly help overall. But again, it's still too early to tell where that is actually trending. But setting policy aside, I think really the bigger picture, the bigger question is just on the impact of COVID and the supply chain on how that's going to impact different business and level of activities that we actually have in terms of engaging with China.\n\nAs we all know, economically, it has been extremely challenged and that certainly affected our business levels and business activities in Asia overall. So this is something to continue to watch. But no direct impact one way or the other. It's really just more about the macro picture here at this juncture.\n\nGary Tenner -- D.A. Davidson -- Analyst\n\nOK. I appreciate that. I wasn't sure if it was referencing president, more recent comments or not. And then just lastly, for a minute, just there's been a sort of question about cash burn.\n\nAnd obviously, it's not slowed to the degree that it would benefit the balance sheet yet. Why is that? I mean I think we were at this point for several years, it seems like we're kind of scale at any cost and money was free or close to it. How much has the -- I guess, the founders or the start-up CEOs of some of these companies, how has that population changed maybe over the last decade to potentially slowing the ability or desire to kind of really focus on that. Have things not sunk in yet on that side?\n\nGreg Becker -- President and Chief Executive Officer\n\nYeah. I mean there's -- some of that does exist. I will acknowledge that. But how I think about it is how I answered an earlier question about this, which is if you raise a bunch of money.\n\nLet's say you've raised three years or four years' worth of cash. And your business is, as you think about it, you're still -- the business itself is fundamentally sound, although it definitely is going to be harder for you to raise money in the future. Part of this is the mentality is, why would you cut back costs, lay people off and make the hard calls if you really believe that you're going to be to add value, grow revenue, and maybe grow back into your valuation over time, right? Is this field saying you can't cut your way to growth or you can't cut your way to success? And so, some of that exists, and it's a function of, again, a lot of it is how much money has been raised. So -- but if you fast forward six more months, nine more months.\n\nThese are for the companies that have raised a long runway. They're going to have to look at either cutting burn or raising more money at that time. And there's a lot of companies out there that are still performing well, right? Sometimes it feels like the -- that, oh, my gosh, all these companies must be really having a hard time. That's not the case.\n\nThere's a lot of them that are doing really well. And one last point. Again, if you go back two years ago, and you remember what happened in COVID, it was cut your cost. It's going to be a horrible situation.\n\nThey did that and then literally 90 days later, 120 days later, people said, no, we were just kidding, but I can raise more money and increase your burn. So, the COVID call it, fake out was definitely one that I think is still in some of their heads. So, do I think it's fully set in across the board? The answer is no. That's just a little bit of -- there's -- it's a complex answer because it's every company is slightly different, but those are just kind of the reasons that you wouldn't see or we haven't seen yet more of a dramatic reduction in burn.\n\nGary Tenner -- D.A. Davidson -- Analyst\n\nThanks. I appreciate the answers.\n\nGreg Becker -- President and Chief Executive Officer\n\nYeah.\n\nOperator\n\nWe'll go next now to Chris McGratty at KBW.\n\nChris McGratty -- Keefe, Bruyette and Woods -- Analyst\n\nOh, great. Thanks. Dan, just on the average balance sheet, the bond yields, can you just speak to me a little bit about the yield at which stuff is rolling off? I know you gave the dollars, but the yield kind of stuck around 2% on the HCM and around 170 on the AF. I was just wondering what the outlook is for those.\n\nDan Beck -- Chief Financial Officer\n\nYeah. All then yields exiting the quarter roughly 2%. There was some pickup in yield from lower premium amortization in the quarter. That just so everybody remembers, is also part of the decline in our expectations from Q3 to Q4 net interest income.\n\nBut net-net, at least as we look ahead, we are going to see some lower-yielding securities roll off, but I think we're going to bump around this 2% range here for at least the next couple of quarters.\n\nChris McGratty -- Keefe, Bruyette and Woods -- Analyst\n\nOK. And then maybe, Greg, a question on charge-offs. As you see the world unfolding, if we are going to get losses, like I'd love a little bit of color on when you think the cadence would be. You built the reserve last quarter and a little bit less this quarter.\n\nBut when do you think the losses will come?\n\nGreg Becker -- President and Chief Executive Officer\n\nHey, Chris. Well, I could help answer that question. Marc is probably better.\n\nMarc Cadieux -- Chief Credit Officer\n\nYeah. So, I think consistent with all of the uncertainty we've talked about and the challenges with guiding for '23. I think that's a really very difficult question to answer. I think it really comes back to again, that robust average client liquidity, the ability to last longer and wait for that reopening, so to speak, for capital to start flowing again.\n\nAnd I think, generally speaking, when I think about the portfolio and where borrowers are positioned going into whatever is next relative to past downturns, more of these companies will probably outlast, right? They'll live long enough to make it to that other side than might otherwise have been the case. But exactly when the losses come, if they come, is just too difficult to predict at this point.\n\nDan Beck -- Chief Financial Officer\n\nAnd to add to what Marc is saying, Chris, if you take a look at the reserve, the area that we continue to expect if we were to see those types of losses, to see the most to be in the investor-dependent early stage. And if you think about the 2008 cycle, and we're not saying that we would see something to that magnitude, that was about a 6% through-the-cycle loss. So, we're at a 4.3% range right now. So feeling pretty good relative to what that could look like in that type of environment from a reserve perspective.\n\nSo even if those losses were to come, we've got sufficient reserves associated with it. The last thing to say is just again, remember the overall lending portfolio and the concentration of capital call lending and our loss experience there when thinking about to the extent that we have a slower period, what that might look like in terms of credit losses.\n\nChris McGratty -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nAnd we go next now to Ebrahim Poonawala at Bank of America.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nHey, thanks for taking my question again. Just one question in terms of big picture, Greg. So a lot of what's happened in terms of the earnings outlook for the company is market driven. Is there anything from a self-help perspective? And I don't mean to say you need to cut your weight prosperity, as you earlier mentioned.\n\nBut is there anything either balance sheet-wise, expense-wise, capital-wise, that you could do to alleviate some of this market-driven pressure on the earnings and ROA?\n\nGreg Becker -- President and Chief Executive Officer\n\nYeah. Let me talk about it from an expense perspective. And then Dan or Mike may want to talk about the balance sheet, anything else, and Mike. But when I think about the expenses, Ebrahim, and as you know, I've been here a long time.\n\nAnd from that standpoint, the long-term belief in the potential of the opportunity we have in front of us hasn't changed. And so doing anything that is going to truly diminish the growth potential of the outlook in a year, two years or three years just doesn't make sense. It may feel good or feel better in a short run, but it won't be helpful in the long run. And as you know, we're playing the long game.\n\nBut what are we doing? One area that we're taking a look at over the last two years, we've had a lot of growth as we build out our LFI or risk-based function, large financial institution functions. And a lot of that actually came at the backs of professional services because we needed to build up the kind of core foundations. Now as we've brought in the expertise in the form of FTEs, we expect an is going to happen faster than even maybe was planned. We're going to be reducing professional services in a very aggressive way.\n\nWe've got the -- an incredibly talented team that we brought on board to help us manage through this. I feel really good about it. And so, what are we going to do? We're going to -- again, the biggest thing is reducing professional services as aggressively as possible. That's probably the biggest thing.\n\nThe second part is really taking a hard look at our overall -- the projects that we have and that project portfolio and prioritizing and say, which ones are the more of the nice to have versus the must-haves. And from that standpoint, we're looking at that, and we'll make some changes there and not eliminate it, not, not say never, but it will definitely be put on the back burner as we concentrate our efforts and focus on the highest priority must-do initiatives, which includes things like the digitization of the platform. As I mentioned in my opening comments, we've been rolling out our digital banking solution and have gotten some incredibly positive feedback. And we're going to continue to invest in that and roll out more of that over the course of '22 and '23.\n\nSo, we have to continue to make those investments. So, while the expense growth will be lower than it would have been it's still going to be healthy as we roll into '23. I don't know, Dan or you guys would add anything.\n\nDan Beck -- Chief Financial Officer\n\nI'll start and Mike might have something to add. I think we just -- one, I have to add on expenses, continue to go back to 1,800 new clients added to the platform in the quarter. $0.5 trillion worth of dry powder raised from a venture capital perspective, those are all opportunities for us in medium and the long term. So, for us to really materially pull back on investment, even cut investment levels probably cuts into that opportunity here over the longer term.\n\nSo, we're still really bullish on that. That at some point, we anticipate to play through the franchise. So that's number one. Number two, Ebrahim talk about capital and the balance sheet.\n\nYes, in this environment, we clearly see some reduction in the overall size of the balance sheet, growth in the Tier 1 leverage ratio is now close to 8% at the bank. As we think about next year, slowing cash burn, potentially seeing venture investments start to pick up, you could very quickly start to be in a spot where you need that capital to be able to support growth on a go-forward basis. So, I think that's the way we're thinking about it is that you've got that pent-up amount of venture flows waiting to be deployed. And at some point, it will be good to have the capital to be able to support that.\n\nLast but not least, we talked about the investment securities portfolio, the available-for-sale investment securities portfolio -- to be really clear, like we have no intent to restructure that portfolio at this time. We're always evaluating options. And that's the thing about this balance sheet is that it's highly flexible, and we've got a lot of options associated with it.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nWe'll go next now to David Smith at Autonomous.\n\nDavid Smith -- Autonomous Research -- Analyst\n\nOK. Thanks for taking my questions. With SVB securities, does the current environment change to how you're thinking about the build out there in terms of when or if to bring on new products or hire new teams?\n\nGreg Becker -- President and Chief Executive Officer\n\nYeah. This is Greg. So, the answer is no. And it's an interesting -- I guess, a couple of points.\n\nSo, one is when you look at the league tables, which is obviously one of the ways you kind of get how your investment bank is doing, the team is doing an exceptionally good job, right? So put the market aside and you just say, how are they competing in the market against everybody else? And they're moving up the lead tables or they're definitely hanging in where they have been and getting their fair share, and in some cases, more than their fair share. The team is truly exceptional. And I see it when I go out in the market and spend time with them, meeting with clients. And that's number one.\n\nNumber two, what we had set out for the beginning of the year for a goal for the tech and life science team that we teams, all the people we brought on board, we're going to exceed that, hit or exceed those numbers. And so that's pretty amazing given what's happened in the environment. So, we feel really good about that. the addition of Moffett Nathanson.\n\nagain, what an amazing group of people and research analysts, and they have exceeded their expectations. The people we've added on the research side to that from a tech perspective, are also leaders in the market. And the final piece is this one of the benefits of a slowdown in the ECM market is that it actually gives that team that really strong team time to spend time with the high-profile companies who will be going public when the market opens back up. And those meetings are going really well.\n\nAnd so, I believe that when that market does open up, and it will eventually, it always does, we're going to be really well positioned. So, if anything, to be honest, I've gotten more bullish on not only the team of people, the whole platform but how well it's collaborating with our commercial bank. That collaboration is actually going exceptionally well. So, I feel good about it.\n\nWhen I like the market to be more cooperative. The answer is, of course. But while we're waiting for it to cooperate more, those guys are also working awful hard to get us set up for future success.\n\nDavid Smith -- Autonomous Research -- Analyst\n\nGreat. And just to dig in on the securities here a little bit more. I appreciate the guide for $170 million to $175 million in the fourth quarter. When we talk about bumping around the 2% range for the next couple of quarters, is it going to be like a -- is it -- are you seeing any kind of meaningful uptick going into 2023? Or -- and the lower side of 2%, more likely for the next couple of quarters given that fourth quarter starting point?\n\nDan Beck -- Chief Financial Officer\n\nYeah. I think where we're exiting 2023, absent additional hedging opportunities as we think there's still room for us to effectively put on some received flow swaps to open up additional asset sensitivity in the rate environment that we're in. That could provide some additional upside should rates be higher than what we're seeing from a forward curve perspective. So, I think there's some opportunity there.\n\nI think over the next couple of years, you will see some roll-off of even lower-yielding securities. But to see a material bump up off of those levels. I don't see that in the actual cash flows coming off of the portfolio.\n\nDavid Smith -- Autonomous Research -- Analyst\n\nThank you. And lastly, as it looks like we're getting closer to peak Fed rates. Is there a point where you start to work to reduce the variable component of the lending book or otherwise protect asset yields in some way? \n\nDan Beck -- Chief Financial Officer\n\nYeah. I think -- well, first and foremost, I think the positioning right now for us is to continue to look to open up the position for asset sensitivity. At the same time, we are contractually as we've done in the past, continuing to embed loan floors just as a matter of practice, associated with that portfolio. That benefited us quite significantly in one-way protection here during the -- post 2018 moved down, and I had expected to do the same thing.\n\nSo that's the vast majority of the protection that we're putting on right now. If we see Fed funds and short-term rates move even further, you'll see us find ways to continue to manage down rate sensitivity. But as folks know, with higher levels of interest-bearing accounts right now with the off to on balance sheet moves that another great source of potential protection to downside rates for us.\n\nDavid Smith -- Autonomous Research -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. And we'll take our last question from Jon Arfstrom at RBC Capital Markets.\n\nJon Arfstrom -- RBC Capital Markets -- Analyst\n\nHey, thanks for hanging until the end. Just a follow-up on that last question. Would a Fed pause help hurt or no difference in terms of your outlook? How would you answer that?\n\nDan Beck -- Chief Financial Officer\n\nI'll start. Greg might want to add. I think if you take a big step back and look at venture deployment. There's a -- like we talked about $0.5 trillion worth of funding that's been raised, what's really stopping that from being deployed is the disconnect and valuations between public equity markets that are bouncing around and the expectation of all these amazing founders that are management teams that are working on these ideas.\n\nTo the extent that we see Fed pause or slowdown, I think that's going to start to bring some more certainty into public market valuations, reduce that uncertainty, and really start the flow of funding across our markets. So, one, just I think from a broad deployment perspective, that would be helpful. Second, rate -- a pause or slowdown from a rate perspective, could be helpful just as we continue. We would see likely additional deposit flows that are coming in.\n\nBut in terms of the asset sensitivity, a pause will really help at this point.\n\nGreg Becker -- President and Chief Executive Officer\n\nYeah. The only thing I would add is just -- and Dan said it, it's just the market is looking for certainty. They're looking for clarity and there isn't any right now. So, a clear pause and the data that backs up a clear pause, I think would be well received by the market.\n\nRight now, if you talk to five different economists, what they would say what their crystal ball would be is literally all over the map. And that clearly isn't helpful right now. \n\nJon Arfstrom -- RBC Capital Markets -- Analyst\n\nOK. I appreciate that. And then just speaking to uncertainty, but when I do the crude calculations on your fourth quarter guidance, I get in the midpoint, excluding gains or losses somewhere between 5.50 and 6 for EPS. And correct me if I'm wrong, but do you feel like that represents a trough for you for EPS? Or is that just too difficult to predict from here?\n\nDan Beck -- Chief Financial Officer\n\nAs we mentioned earlier, there are so many variables that are going to drive what things look like heading into the first quarter. And the level of cash burn, what we're seeing in venture deployment, and ultimately, the interest-bearing to noninterest-bearing mix. Those are going to be big drivers of what happens from here from a net interest income perspective. So, that could be pressured down.\n\nAnd -- or we could see stability of cash burn materially reduces from here. So, to go any further than that, I think would go against us not giving the guidance.\n\nJon Arfstrom -- RBC Capital Markets -- Analyst\n\nOK. All right. Thank you very much.\n\nGreg Becker -- President and Chief Executive Officer\n\nYep.\n\nOperator\n\nThank you. And Mr. Becker, I'll turn things back to you, sir, for any closing comments.\n\nGreg Becker -- President and Chief Executive Officer\n\nGreat. Thank you. Thanks again, everyone, for joining us. I know for people on the East Coast and so you're into the evening, so I appreciate it.\n\nI'm going to close where I started the conversation by really highlighting that -- I know most of the discussion was about the balance sheet and flows. And clearly, that's a very important part of the equation. I just want to make sure that it's not lost on everyone and that's both investors, but also our employees who are listening, all the great things that are going on inside the platform. Again, I talked about it, you can look at record term sheets and all-time high-end client funds and strong credit quality.\n\nAnd there are so many really positive things that are going on. We just can't lose sight of that. There's no question the uncertainty is out there. And as we've said, based on the fact that we're not going to give guidance into '23, that uncertainty clearly is difficult to predict exactly what will happen.\n\nAlthough clearly, we've given you some frameworks to think about for '23 and what the drivers will be, and how that could change. First off, as always, I want to thank all our clients. I mean it's -- they're stressed right now, a lot of them are. And to be honest, that's where I think we end up shining because we've been through a lot of cycles before, and we know how to support them, and we know what the right questions to ask and how to be there for them in difficult times.\n\nAnd so honestly, from my standpoint, a challenge it is to be an environment like this, it is actually enjoyable to sit down and really add value to clients. So that's the first. The second one, the bigger one, maybe even is thanks to the employees. We've got a lot of that have been here for a long period of time.\n\nWe've added a lot of new people that have in the recycle. And people are working really hard. And sometimes, you don't feel that you're getting all the recognition and benefit from all the hard work. So, on behalf of the executive team, on behalf of the Board, I just wanted to say a huge thanks to the team for doing such a great job supporting our clients, whether it's difficulty and uncertainty and hanging with us as we navigate it.\n\nSo, with that, have a great rest of your day, and thanks again for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMeghan O'Leary -- Head of Investor Relations\n\nGreg Becker -- President and Chief Executive Officer\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nDan Beck -- Chief Financial Officer\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nCasey Haire -- Jefferies -- Analyst\n\nJared Shaw -- Wells Fargo Securities -- Analyst\n\nBill Carcache -- Wolfe Research -- Analyst\n\nMarc Cadieux -- Chief Credit Officer\n\nMike Descheneaux -- President, Silicon Valley Bank\n\nAndrew Liesch -- Piper Sandler -- Analyst\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nGary Tenner -- D.A. Davidson -- Analyst\n\nChris McGratty -- Keefe, Bruyette and Woods -- Analyst\n\nDavid Smith -- Autonomous Research -- Analyst\n\nJon Arfstrom -- RBC Capital Markets -- Analyst\n\nMore SIVB analysis\n\nAll earnings call transcripts"
}