{
  "companyName": "Wells Fargo",
  "companyTicker": "WFC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/14/wells-fargo-wfc-q3-2022-earnings-call-transcript/",
  "content": "Wells Fargo (WFC -0.10%)\nQ3 2022 Earnings Call\nOct 14, 2022, 10:00 a.m. ET\n\nOperator\n\nWelcome and thank you for joining the Wells Fargo third quarter 2022 earnings conference call. [Operator instructions] Please note that today's call is being recorded. I would now like to turn the call over to John Campbell, director of investor relations. Sir, you may begin the conference.\n\nJohn Campbell -- Director of Investor Relations\n\nGood morning. Thank you for joining our call today where our CEO, Charlie Scharf and our CFO, Mike Santomassimo, will discuss third quarter results and answer your questions. This call is being recorded. Before we get started, I would like to remind you that our third quarter earnings materials, including the release, financial supplement and presentation deck, are available on our website at wellsfargo.com.\n\nI'd also like to caution you that we may make forward-looking statements during today's call that are subject to risks and uncertainties. Factors that may cause actual results to differ materially from expectations are detailed in our SEC filings including the Form 8-K filed today containing our earnings materials. Information about any non-GAAP financial measures referenced, including a reconciliation of those measures to GAAP measures, can also be found in our SEC filings and the earnings materials available on our website. I will now turn the call over to Charlie.\n\nCharlie Scharf -- Chief Executive Officer\n\nThanks, John and good morning, everyone. I will make some brief comments about our third quarter results, the operating environment and update you on our priorities. I will then turn the call over to Mike to review third quarter results in more detail before we take your questions. Let me start with the third quarter highlights.\n\nOur solid business performance this quarter was significantly impacted by $2 billion or $0.45 per share in operating losses related to litigation, customer remediation and regulatory matters primarily related to a variety of historical matters. As you know, we have been and remain focused on increasing our earnings capacity and see the positive impact of rising interest rates, driving strong net interest income growth and our continued focus on improving operating efficiencies, resulting in lower expenses, excluding operating losses. Credit quality remains strong and we continue to invest in our technology platforms, digital capabilities, and delivering additional products to our customers and clients. While we are closely monitoring trends with economic conditions expected to weaken given inflation, geopolitical instability, energy price volatility, and rising interest rates, our customers continue to be resilient with overall strong credit performance and solid cash flow.\n\nWhen looking at simple averages across the entire consumer portfolio, deposit balances per account decreased from the second quarter, but were still higher than a year ago and remained above pre-pandemic levels. However, we continue to closely monitor activity by segment for signs of potential spreads and for certain cohorts of customers. We have seen average balances steadily decline and are now below pre-pandemic levels and their debit card spend continues to decline. This is a continuation of what I referenced last quarter, but it's important to note that this remains a small percentage of our total customer base.\n\nOverall, our consumer deposit customers' health indicators, including cash flow, payroll, and overdraft trends, are still not showing elevated risk concerns. Debit card spending remained significantly above pre-pandemic levels and was up 3% in the third quarter compared to a year ago, consistent with the second quarter increase. Entertainment and fuel spending had the largest increases from a year ago, but the recent decline in fuel prices drove fuel spending to decline compared to the second quarter. Apparel and home improvement spending declined from both the year ago and second quarter.\n\nCredit card spend remained strong in the third quarter, up 25% from a year ago, with double-digit increases coming across all spending categories. Spending was up modestly on a linked quarter basis. So remember, the significant portion of this growth is from our new products, which continued to have strong credit profiles. Period-end commercial loan balances were stable compared to the second quarter, with continued growth in commercial banking, offset by declines across our businesses in corporate and investment banking.\n\nCredit performance remained strong, with net charge-offs and non-accrual loans continuing to decline from exceptionally low levels. Clients do tell us that they continue to be impacted by persistent inflation, rising interest rates, and tight labor market. And while credit quality remains strong, we are actively monitoring inflation-sensitive industries and taking proactive actions where warranted. Now, let me update you on the progress we are making on our strategic priorities.\n\nWe continue to devote significant resources to implementing an appropriate risk and control framework across the company and this remains our top priority. We continue to make progress and are executing on our plans, but significant work remains. As a reminder, though I am confident in our ability to complete the work, it remains a significant body of work and the primary focus of the company. We have set high standards for success and given the long-standing nature of much of our work, we have said that we remain at risk of setbacks until it is complete.\n\nExpenses in the quarter reflect these ongoing risks and our efforts to resolve them. As we continue our work to put our historical issues behind us and to address issues that are identified as we advance our risk control infrastructure work, outstanding issues still remain that will likely result in additional expense in the coming quarters, which could be significant. We are working to close these as quickly as possible and we remain committed to doing right for our customers and working closely with our regulators and others to resolve these matters. We recognize the importance of moving forward and the expenses in the quarter are representative of these efforts.\n\nAt the same time, we are implementing changes to better serve our customers and investing in our businesses to help drive growth. As part of the announcement we made earlier this year to limit overdraft-related fees and give customers more options to achieve their financial goals, we implemented extra day grace period for the third quarter, which provides consumer customers an extra business day to cure negative balances and avoid overdraft fees. We also began to roll out early payday, which provides consumer customers who receive eligible direct deposits the ability to access funds up to two days earlier than scheduled, further reducing the potential to incur overdrafts. Notably, while this enhancement was rolled out in only six states in the third quarter, during the first two weeks of offering this enhancement, we provided customers early access to $2 billion in funds from 1.3 million eligible direct deposits.\n\nAnd we are on track for a fourth quarter rollout of an easy-to-access short-term credit product that will give qualifying customers another option to meet their personal financial needs. These actions build on services that we have introduced over the past several years, including offering an account that does not charge any overdraft fees. We now have over 1.6 million of those clear access banking accounts, up 57% from a year ago. And as I mentioned last quarter, we have developed a new integrated banking, lending, and investment offering that is geared toward the more complex financial needs of our affluent clients called Wells Fargo Premier.\n\nDuring the quarter, we introduced Wells Fargo Premier across our entire branch footprint, initiated a branded digital experience, and launched marketing programs to help affluent customers learn more about how we can better serve them. We will continue to build the Wells Fargo Premier offering in a tough in the coming quarters. In the third quarter, we continued to launch new APIs, providing our commercial and corporate clients more flexibility and helping them drive efficiencies. For example, we launched a new real-time payment API allowing clients to send digital requests to a payer that can be approved to easily send a real-time credit transfer.\n\nWe also launched a virtual card API, which enables clients to create and configure virtual cards for B2B vendor payments and purchases. In our CIB Markets businesses, we are accelerating our investment into our electronic trading capabilities across multiple asset classes to better meet the evolving needs of our clients, which is helping to drive strong gains in trading volumes. And we are selectively adding talent in our investment banking coverage and product areas as we focus on leveraging our strong existing relationships to build our fee-based businesses. We also continued to make progress on the environmental, social, and governance work that is underway at Wells Fargo.\n\nIn the third quarter, we published our latest ESG report, which highlights the progress we made in 2021 on our ESG efforts. We consider this work a sustained long-term commitment and believe Wells Fargo is well-positioned to make a difference. We issued our second sustainability bond in the amount of $2 billion that will finance projects and programs supporting housing affordability, economic opportunity, renewable energy, and clean transportation. During the third quarter, we officially launched a new grant program in Houston, San Diego, and Milwaukee to help improve racial equity in home ownership and we have more markets coming before the end of this year.\n\nThis is part of the $60 million commitment we made earlier this year through the Wells Fargo Foundation to wealth opportunities restored through home ownership or worth. This effort aims to create 40,000 homeowners of color access -- 40,000 homeowners of color across 8 markets by the end of 2025. We announced a $1 million donation to provide urgent relief to Florida following the aftermath of Hurricane Ian. In addition, customer accommodations and employee support are available to those directly impacted by the storm.\n\nIn summary, continued high inflation has kept the better reserve aggressive with rate hikes, leading the housing market to slow rapidly and the heightened uncertainty about the economic outlook and geopolitical events caused the financial markets to be volatile. However, labor demand remains robust, consumer balance sheets remain healthy, and customers have capacity to borrow. Wells Fargo is positioned well as we will continue to benefit from higher rates and ongoing disciplined expense management. Both consumer and business customers remain in a strong financial condition and we continue to see historically low delinquencies and high payment rates across our portfolios.\n\nWe are closely monitoring risks related to continued impact of high inflation and increasing rates as well as the broader geopolitical risks and we do expect to see increases in delinquencies and ultimately, credit losses, but the timing remains unclear. As we look forward, we remain bullish on our business opportunities. Our higher operating margins and strong capital ratios have prepared us for a wide range of macroeconomic scenarios. In the third quarter, we increased our common stock dividend by 20% and our CET1 ratio was 10.3%, 110 basis points above our current regulatory minimum, including buffers.\n\nWe will continue to prudently manage our capital levels to be appropriately prepared for slowing economy and market volatility. Finally, I know many of you are interested in our 2023 expectations and on our next earnings call, we plan to provide our 2023 expense and net interest income outlook as well as more color on our path to an over the cycle of 15% ROTCE. I will now turn the call over to Mike.\n\nMike Santomassimo -- Chief Financial Officer\n\nThank you, Charlie, and good morning everyone. Net income for the quarter was $3.5 billion or $0.85 per diluted common share. As Charlie highlighted, our results included $2 billion or $0.45 per share of accruals primarily related to a variety of historical matters. These accruals drove our total expenses higher.\n\nHowever, if you exclude operating losses, our expenses would have declined as we continue to execute on our efficiency initiatives. Revenue grew in the third quarter, driven by higher net interest income, while non-interest income also increased from the second quarter. Our effective income tax rate for the third quarter was 20.2%. We highlight capital on Slide 3.\n\nOur CET1 ratio is 10.3%, down six basis points from the second quarter as the 21 basis point decline from AOCI as well as the impact from dividend payments was nearly offset by our third quarter earnings. Our CET1 ratio remained well above our required regulatory minimum plus buffers, which increased by 10 basis points to 9.2% at the start of the fourth quarter as our new stress capital buffer took effect. As a reminder, our GSIB surcharge will not increase in 2023. We did not buy back any common stock in the second or third quarters and we will continue to be prudent regarding the amount and timing of any share repurchases.\n\nTurning to credit quality on Slide 5, credit performance remained strong, with only 17 basis points of net charge-offs in the third quarter. However, as expected, losses are slowly increasing from historical lows and we expect them to continue to normalize toward pre-pandemic levels over time as the Federal Reserve continues to take actions to combat inflation. We are closely monitoring our portfolio for potential risks and are continuing to take some targeted actions to further tighten underwriting standards. Commercial credit performance remained strong across our commercial businesses, with only $6 million of net charge-offs and net recoveries in our commercial real estate portfolio for the third consecutive quarter.\n\nWe also had net recoveries in our consumer real estate portfolios. However, total consumer net charge-offs increased $72 million from the second quarter to 40 basis points on average loans driven by an increase in net charge-offs in the auto portfolio. Higher loss rates on certain auto loans originated primarily in the latter part of 2021 contributed to the linked quarter increase in charge-offs and delinquent loans in the auto portfolio. Lower loan balances also impacted the loss rate, which started -- we started taking credit tightening actions earlier this year, which have improved the quality of 2022 originations.\n\nAs a result of these actions, increased pricing competition, and continued industry supply chain constraints, the third quarter origination volumes were down over 40% compared to a year ago. Non-performing assets declined again in the third quarter and were down $411 million or 7% from the second quarter and down 20% from a year ago. While commercial non-accruals continued to decline, lower levels of consumer non-accruals were the primary driver of lower non-performing assets due to a decrease in residential mortgage non-accrual loans from the impact of customers' sustained payment performance after exiting COVID-related accommodation programs. Our allowance for credit losses increased $385 million in the third quarter, primarily reflecting loan growth and a less favorable economic environment.\n\nOn Slide 6, we highlight loans and deposits. Average loans grew 11% from a year ago and 2% from the second quarter. Period-end loans increased for the fifth consecutive quarter, but growth slowed as expected, with commercial loan balances holding relatively stable from the second quarter while consumer loans grew driven by credit card and first-lien residential mortgage loans, partially offset by continued declines in our auto portfolio. I will highlight the specific growth drivers when discussing our operating segment results.\n\nAverage loan yields increased nearly 100 basis points from a year ago and 76 basis points from the second quarter, reflecting the higher rate environment. Average deposits declined 3% from both the year ago and the second quarter, with declines across our deposit-gathering businesses. Compared with the second quarter, Wealth and Investment Management had the largest decline by dollar amount as clients looked for higher-yielding alternatives. Declines in our commercial businesses were driven mostly by outflows of non-operational deposits, which can be more price sensitive and are a less stable source of funding.\n\nOutflows in consumer and small business banking were driven by continued customer spending and increased outflows from customers seeking higher-yielding products. Our average deposit cost increased 10 basis points from the second quarter to 14 basis points. Pricing has been consistent with our expectations, with deposit costs holding relatively stable in consumer banking and lending, while trending higher across other businesses. As rates continue to rise, we would expect deposit betas to continue to increase in customer migration from lower yielding to higher yielding deposit products to also increase.\n\nTurning to net interest income on Slide 7. Third quarter net interest income increased $3.2 billion or 36% from a year ago and $1.9 billion or 19% from the second quarter. The growth from the second quarter was primarily driven by the impact of higher rates, which increased earning asset yields and reduced premium amortization from mortgage-backed securities. We also benefit from higher loan balances and one additional day in the quarter.\n\nThese benefits were partially offset by higher funding costs. In the first 9 months of this year, net interest income was up 19% compared with a year ago. We currently expect full year 2022 net interest income to be approximately 24% higher than a year ago, with fourth quarter 2022 net interest income expected to be approximately $12.9 billion. Turning to expenses on Slide 8, the increase in non-interest expense from both a year ago and from the second quarter was due to the higher operating losses that I highlighted earlier.\n\nExcluding operating losses, other non-interest expense was down 5% from a year ago as we had lower revenue-related compensation, expenses related to divestitures came out of the run rate and we continue to make progress on our efficiency initiatives. Excluding operating losses, our expenses would have been down on a year-over-year basis for six consecutive quarters. Another way you can see the impact of our efficiency initiatives is through lower headcount, which has declined for nine consecutive quarters and was down 6% from a year ago. We have also reduced professional and outside services expense by 10% and occupancy expense by 4% during the first nine months this year.\n\nThe higher level of operating losses in the third quarter will cause us to exceed our $51.5 billion expense outlook for 2022, which included $1.3 billion of operating losses for the full year. We currently expect our fourth quarter other expenses, excluding operating losses, to be approximately $12.3 billion. As Charlie highlighted, outstanding litigation, customer remediation, and regulatory matters still remain -- that will still remain and will likely result in additional expense in the coming quarters, which could be significant. Turning to our operating segments, starting with consumer banking and lending on Slide 9.\n\nConsumer and small business banking revenue increased 29% from a year ago driven by the impact of higher interest rates and higher deposit balances. Deposit-related fees were impacted by the overdraft policy changes we rolled out earlier this year, which eliminated non-sufficient funds and some other fees. The extra-day grace period launched in the beginning of August and early payday begin in select states in mid-September, so we would expect our deposit-related fees to decline further in the fourth quarter. Industry mortgage rates have increased over 300 basis points since the beginning of the year and ended the quarter at the highest level since 2007, driving weekly mortgage applications as measured by the Mortgage Bankers Association to a 25-year low at quarter end.\n\nAs a result, our home lending revenue declined 52% from a year ago, driven by lower mortgage originations and gain on sale margins as well as lower revenue from the resecuritization of loans purchased from securitization pools. While the mortgage market adjusts to lower volumes, we expect it to remain challenging in the near term and it's possible that we have a further decline in the mortgage banking revenue in the fourth quarter when originations are seasonally slower. We continue to remove excess capacity to align with the reduced demand and expect these adjustments will continue over the next couple of quarters. Credit card revenue was up 8% from a year ago due to higher loan balances, which benefited from higher point-of-sale volume and new product launches.\n\nAuto revenue declined 5% from a year ago driven by loan spread compression and partially offset by higher loan balances. And personal Lending was 9% from a year ago due to higher loan balances driven by growth in origination volumes. Turning to some key business drivers on Slide 10. Mortgage originations declined 59% from a year ago and 37% in the second quarter, with declines in both correspondent and retail originations.\n\nRefinances as a percentage of total originations declined to 16% in the third quarter. Average home lending loan balances grew 2% from the second quarter, driven by growth in our non-conforming portfolio. I already highlighted the drivers of the decline in auto originations. So turning to debit card, while debit card spend increased 3% from a year ago, spending declined 2% from the second quarter.\n\nAs Charlie highlighted, credit card point-of-sale purchase volumes were up 25% from a year ago, with the largest percentage increases in fuel and travel. Average balances were up 21% from a year ago, reflecting the strong point of sale volume which also benefited from the launch of new products, with new accounts up 11%. We will continue to remain disciplined in our underwriting of new credit card accounts. Turning to commercial banking results on Slide 11.\n\nMiddle market banking revenue increased 54% from a year ago, driven by higher net interest income due to the impact of higher rates and higher loan balances. Asset-based lending and leasing revenue increased 27% from a year ago, driven by higher net gains from equity securities, higher loan balances, and higher revenue from renewable energy investments. Non-interest expense increased 9% from a year ago, primarily driven by higher operating costs and higher operating losses. Average loan balances have grown for five consecutive quarters, and were up 17% from a year ago.\n\nLine utilization rates were fairly stable relative to the second quarter, inflation and our customers' continued efforts to rebuild inventory as supply chain challenges remain drove the growth in asset-based lending and leasing. Loan growth in the middle market banking continued to come from larger clients, which more than offset declines from smaller clients. Turning to corporate and investment banking on Slide 12. Banking revenue increased 28% from a year ago driven by stronger treasury management results, reflecting the impact of higher interest rates as well as higher loan balances.\n\nInvestment banking fees declined from a year ago, reflecting lower market activity. Compared with the second quarter, the increase in investment banking fees was due to the write-down of unfunded leveraged finance commitments last quarter. Commercial real estate revenue grew 29% from a year ago, driven by higher loan balances, the impact of higher interest rates as well as improved commercial mortgage bank-backed securities gain on sale margins. Markets revenue increased 6% from a year ago, reflecting volatility and strong client-demanded equities, rates and commodities, and foreign exchange trading.\n\nAverage loans grew 19% from a year ago, with broad-based growth across our businesses to fund clients' working capital needs, but the pace of growth slowed in the third quarter with average balances up 3% and period-end loans down 3% from the second quarter. On Slide 13, Wealth and Investment Management revenue grew 1% from a year ago as the increase in net interest income driven by the impact of higher rates offset the decline in asset-based fees driven by lower market valuations. As a reminder, the majority of WIM advisory assets are priced at the beginning of the quarter, so third quarter results reflected the lower market valuations as of July 1st. And while the S&P 500 and fixed income indices declined again in the third quarter, the decrease was not as steep as the second quarter decline.\n\nSo while there will be another step down in asset-based fees in the fourth quarter it will be less significant than the third quarter decline. Expenses decreased 4% from a year ago due to lower revenue-related compensation. Average loans increased 3% from a year ago driven by continued momentum in securities-based lending. Slide 14 highlights our corporate results.\n\nBoth revenue and expenses were impacted by the divestitures last year of our Corporate Trust services business and Wells Fargo asset management. These businesses contributed $459 million of revenue and accounted for approximately $305 million of expense in the third quarter of 2021. Revenue also declined from a year ago due to lower equity gains in our affiliated venture capital and private equity businesses, and given current market conditions, we don't expect equity gains to improve in the fourth quarter. Expenses increased from a year ago due to higher operating losses.\n\nIn summary, although the high level of operating losses we had in the quarter significantly impacted our results, the underlying results in the quarter continue to reflect our improving earnings capacity. We had strong net interest income growth from rising rates, and if you exclude operating losses, our expenses would have declined as we continue to execute on our efficiency initiatives. Both our credit performance and capital levels remain strong. We will now take your questions.\n\nOperator\n\n[Operator instructions] And our first question for today will come from John McDonald of Autonomous Research. Your line is open, sir.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nThank you. Good morning, guys. Mike, I wanted to ask on the expenses. The first -- in terms of the operating losses, I know it's tough to answer, but should we think of the op loss accrual this quarter as you reassessing what you might have to pay in the future, or you got hit with some stuff that you didn't expect and you've already paid up? Is there some combination of those? How should we think about what happened this quarter with the op loss accrual?\n\nCharlie Scharf -- Chief Executive Officer\n\nHey, John. It's Charlie. Look, I guess the way I'd describe it is, I mean, like I think you all know the accounting rules on when you accrue things are pretty clear based upon, generally, when you know something or have a pretty good sense that something is going to be done and so it's probable, and you can put an estimate on it. And so as we've said, we've tried to be very, very transparent that there -- that we do have things that will be lumpy, that could be significant.\n\nAnd it's in our best interest to get as much behind us as quickly as we possibly can. It's what we've been trying to do, both with our work but also the financial impact of these things, and that's what you're seeing in the quarter.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nOK. And then maybe, Mike, I could follow up on the non-op expense outlook for $12.3 million in the fourth quarter applies up from the $12.1 million this quarter. Maybe just some context of what's driving that? Is it seasonality? And then can we think of that jumping off point of the fourth quarter as the beginning of annualizing that for next year? And what would be the -- roughly the puts and takes for thinking about next year from the fourth quarter? Thanks.\n\nMike Santomassimo -- Chief Financial Officer\n\nYeah. No. Thanks, John. And I think when you think about the change from third quarter to fourth quarter, it really is just some seasonal things.\n\nIf you go back over a long period of time, you just see year-end accruals related to a bunch of different items that sort of end up in the fourth quarter, and so there is no story there other than that. I think we continue to be on track on the efficiency work that we laid out at the beginning of the year, and so you'll see some of that come through those numbers as well in there. As it relates to 2023, as Charlie said in his remarks, we will lay that out in more detail in January.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nOK. Maybe a broader comment just on efficiency and where you are relative to your longer-term targets?\n\nMike Santomassimo -- Chief Financial Officer\n\nYeah. No. I think we're right on track on the plan that we laid out, John. And we said we would deliver about $3.3 billion of impact in 2022, and that's -- we're on track to do that.\n\nAs we -- as Charlie and I both said a number of times, we're not done, and I think there is still more opportunity. And we're going through those conversations as we go through our budget process now, and continuing to unpick the onion around where there is more opportunity. So I think those -- that program will continue to evolve, but we still feel we've got more opportunity to drive incremental efficiency, and we're on track for the things we laid out.\n\nCharlie Scharf -- Chief Executive Officer\n\nAnd John, the only thing I would add, because I know it's on a lot of people's minds, is that -- I mean, from our standpoint, there is nothing new in our thinking from what we've talked about last quarter, both in terms of where the opportunities are and how we're thinking about the future. And we just do think that it makes sense when we get to the end of next quarter, when we talk about our path to a 15% sustainable through different cycles, ROTCE, that's also an opportunity to talk more specifically about expenses and how that fits in, including what it looks like for next year. And so by that point, we will have finished our budget process. We will understand all the puts and takes, and be in a really good position to talk about it.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nGot it. OK. Thanks.\n\nOperator\n\nThank you. The next question will come from Scott Siefers of Piper Sandler. Your line is open.\n\nScott Siefers -- Piper Sandler -- Analyst\n\nThanks, guys. Thank you for taking the question. I guess I wanted to ask broadly on NII. Once the Fed stops raising rates, can you sort of discuss broadly how and for how long you could maintain positive NII momentum?\n\nMike Santomassimo -- Chief Financial Officer\n\nWell, Scott, I think there is a lot that needs to play out for us to answer that with any degree of accuracy, right, in terms of what we're seeing in the economy, loan growth, what's happening with deposits and so forth. But the only thing I would point out that you do need to keep in mind as you think about it is there will be a lag on deposit pricing, and that happens in every cycle. It happened in the last cycle and will happen again here. Once the Fed stops raising rates, you will see a lag before deposit pricing stops going up, and that's just normal and to be expected.\n\nAs it relates to overall NII at that point, I think there is a lot of what-ifs that need to go into that scenario. And as we all have seen, even over the last few days, some of those expectations continue to evolve. So -- but I would keep in mind as you think about that, the deposit pricing lag.\n\nScott Siefers -- Piper Sandler -- Analyst\n\nYeah. OK. Makes sense. Thank you.\n\nAnd just returning to the operating losses for a second, just to help put the $2 billion in third quarter targeting context, just I guess, given the magnitude of charges that Wells had already taken, what -- at this point, what is pushing those losses so high and what could keep them high going forward? And I guess I ask it within the backdrop of I know, like, you guys weren't really there when these issues took place. But just given how high they have been for so many years, just curious like what's keeping them at such a level?\n\nCharlie Scharf -- Chief Executive Officer\n\nYeah. Scott, this is Charlie. I'll take a shot at it, and Mike, feel free to pipe in. Listen, I think, again, if you go through things that we've said in the past and go through our disclosures, we still have open regulatory matters that do relate to the past.\n\nWe do have litigation that relates to a series of those things, which we do cover a lot of it in our disclosures. And the other thing which I just -- as we continue to make progress and move forward and build the control environment, we do find things ourselves that do relate to the environment that we've had in the past, and those things have to be remediated. So as I said earlier, we would like to get both -- just both operationally and financially, things done as quickly as we can. The accounting rules dictate on when you -- whether it's appropriate to take the charges, and we just, again, want to try and be as clear as we can.\n\nWe are not surprised. I mean, when I say not surprised, we don't like the charge for sure. But it is just the reality of the position that we're in to get these things behind us and try to be clear in the remarks that this isn't the end of it. But we would like to move as quickly as we can on everything that's remaining to get behind us.\n\nScott Siefers -- Piper Sandler -- Analyst\n\nOK.\n\nMike Santomassimo -- Chief Financial Officer\n\nYeah. And one thing overall. And I think even with these costs and the charges, we're continuing to make sure that we invest in the underlying businesses, too. I think Charlie highlighted a little bit of that in his remarks, but we've got to keep making sure that we're adding people where we need to, we're building out the capabilities where we need to.\n\nAnd we've talked some -- about some of those opportunities in the past, but we are also doing that as well as executing on the efficiency agenda to make sure the earnings capacity of the company continues to get better.\n\nScott Siefers -- Piper Sandler -- Analyst\n\nIt helps. OK. Perfect. Thank you, guys, very much.\n\nI appreciate it.\n\nOperator\n\nThe next question will come from Ken Usdin of Jefferies. Your line is open, sir.\n\nKen Usdin -- Jefferies -- Analyst\n\nThank you. Good morning, Charlie and Mike. Charlie, I want to ask you a follow-up on your comments about protecting your capital in an uncertain environment. Going back to the CCAR, when you correctly stated you've got a lot of excess room, a lot of flexibility.\n\nJust wondering how you expect that CET1 to traject relative to where you want to keep it? And what does that mean in this environment for the prospects of doing share repurchase? Or do you just -- is it a build in, just keep it and be protected environment? Thank you.\n\nMike Santomassimo -- Chief Financial Officer\n\nMaybe I'll start, Ken, and then Charlie can add anything. I think our thinking hasn't changed much since last quarter. We don't feel like we need to build from here. As you know, we've got about 110 basis points of cushion over our reg minimum and buffers together.\n\nAnd I think as you sort of look at the environment we're in, we just -- we want to be -- continue to be prudent about how and when do we do buybacks. I think even if you think about the third quarter and look at the rate volatility we saw in the last three weeks of the quarter, and even in the last number of days of the fourth quarter now in the beginning, we've seen quite a bit of volatility happening. And so it's just all of those things that go into the calculus we do every quarter to look at where the risks and opportunities are, and make sure that we're just being smart about managing it.\n\nCharlie Scharf -- Chief Executive Officer\n\nAnd the only thing I would add is I think, as Mike said, we feel very good about the growing earnings capacity of the company. And certainly, as we sit and look forward based upon what we actually see, we feel very good about the position that we're in. We just also -- and in the most comments, trying to point out that when it comes to managing capital, we should be extremely conscious of what the risks are that are around us. There are swings in AOCI that have impacted many of us.\n\nThere are these geopolitical risks out there which something could trigger something, which could ultimately have a broader impact on the economy. And those are all reasons just, given where we sit today, to be more conservative on capital rather than less conservative. And so a combination of those things with our own issues just lead us to say let's just see how those things play out. And that, for this environment that we're in, is probably the best use of that capital.\n\nKen Usdin -- Jefferies -- Analyst\n\nGot it. And a follow-up just in terms of other uses of that capital, just in question. You did build the reserve a little bit this quarter and alluded to the potential for a greater uncertainty. Just -- can you help us understand just where you live now in a scenario weightings in terms of your reserve? And Charlie, your point in your prepared remarks is just things might turn, but it's just unclear to say how.\n\nSo how do you contemplate, how do we get a better sense of what that might mean for reserves, and how your view on potential losses has changed?\n\nCharlie Scharf -- Chief Executive Officer\n\nThat's a hard one to answer. So when we set our -- when we go through the process of set reserves, I think we do what everyone else does with the CECL calculations, which is we have a series of scenarios that we look at that are economically driven based upon economists' view of what will happen to a series of variables that will impact our credit. We then go through and figure out what we think the right weighting is for those, depending on as we sit here in the environment, and then models produce a bunch of results. So there just -- there is so many factors that go into it.\n\nThere is a lot of signs behind it, but there is also a judgment that sits on top of it relative to how you weigh these things and whether the models are ultimately right. We think that, on a relative basis, just the way we think about things, to the extent you can build, you can be conservative, you're trying to be. But it's got to be fairly formulaically driven. And I would say as we sit here today, we're not assuming -- let me say differently.\n\nI think the comments that we're making about the risks in the environment factor into how we weight the different scenarios and so we do have weightings to the different downside scenarios. And I think that's --\n\nMike Santomassimo -- Chief Financial Officer\n\nYeah. And maybe I'll just add, we've said this now for the last couple of quarters, we've had a pretty significant weighting on the downside scenarios for a while and haven't changed that. I think you -- if you look at what we've built over the -- during COVID, I guess, a couple of years ago now. Relative to where we are today, we haven't released all of that build that happened.\n\nAnd so all of what Charlie talked about goes into the conversation. And so at this point, we still feel very comfortable with where we are.\n\nKen Usdin -- Jefferies -- Analyst\n\nUnderstood. OK. Thanks, guys.\n\nCharlie Scharf -- Chief Executive Officer\n\nYeah. The only thing I want to just be clear about that is, again, we try and be -- and you have to be forward-looking, and so we're trying to be very realistic about what potential outcomes are. But at the same time, if our view deteriorates on the level of risk out there, that could change. And so getting back to the capital comment, I do think it's kind of weird that this all runs through the income statement.\n\nAnd for that level, it's hard to predict. From our perspective, we do have to -- the way we think about reserving and the way we think about capital are very much the same.\n\nKen Usdin -- Jefferies -- Analyst\n\nGreat. Thanks again.\n\nOperator\n\nThank you. The next question comes from Ebrahim Poonawala of Bank of America. Your line is open.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning. I guess just a quick follow-up around credit. I think from a fundamental standpoint, one, are there any areas in particular? I think you've talked about seeing some weakness in Auto lending in the past.\n\nAre there any areas within the portfolio, seeing any signs of crack on credit or where you're being a little bit more careful in extending new lending? And also, if Charlie or Mike, if you can talk about just your exposure within the C&I book to the financial sponsors, how -- your comfort level around that book, and whether any of that comes back to kind of create some credit volatility over the coming quarters? Thank you.\n\nMike Santomassimo -- Chief Financial Officer\n\nSure. Maybe I'll think I'll start on the last piece. I think you're referring to leverage finance bridge, the bridge book? It's very immaterial in terms of any impact this quarter, so nothing -- no story there in terms of anything significant in the quarter. As it relates a little bit more broadly on credit, for the most part, the portfolios are performing really well, right? And if you go look in the commercial bank, customers are still in really good shape on average, same thing in the corporate investment bank.\n\nOn the consumer side, Charlie pointed out a lot of health indicators still look really good. We're not seeing systematic stress. You're certainly seeing a little bit more stress on the lower end, wealth spectrum, which is in a big part of the portfolio for us. And so overall, so far, so good in terms of the performance to date.\n\nCharlie Scharf -- Chief Executive Officer\n\nI would say, Ebrahim, that we're -- we spend a lot of time on the wholesale side looking at inflation-sensitive industries. As I mentioned in my remarks and just try and get ahead where we can, we don't see problems, but we're just trying to be very forward-looking. And on the consumer side, we're just -- we're digging. We're digging through all of the information that we have to look for signs of stress.\n\nI think if you were to change the scale and like low the scales up significantly, you start to see very, very small impact on some payment rates. But we saw impacts to the lower-end consumers several quarters ago, and those haven't progressed as quickly as we would have thought. So again, it's just -- we don't have our heads in the sand. We sit here and we have listened to the Fed and take them at their word, and what they are doing is extremely powerful.\n\nAnd so things will slow, but we are just -- we are trying to be prudent. And the only -- and the last thing I would just say is some of our products, I would say, we are tightening up on the edges. Again, just to be prudent, some of the higher risk categories that have multiple risk layers to them. Not a big part of our production in any of our products, but just trying to be smart relative to who could be impacted.\n\nBut at the same time, continuing to be in the markets and providing credit.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And just a quick follow-up, Mike, what I was referring to on the C&I book is the disclosures around exposure to financials, except ex-banks. And so when I am thinking about like asset management, real estate finance, anything there that we should worry about in a world where there is some uncertainty around how private equity holds up in this environment of higher rates? That's what I was sort of getting at.\n\nMike Santomassimo -- Chief Financial Officer\n\nSorry. Yes. So we -- if you look at the Q, there is some breakdown of those exposures, and you can see that. And those -- at this point, those are all performing really well, both in the asset-backed finance space as well as the subscription finance space.\n\nAnd so nothing to call out.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThe next question will come from John Pancari of Evercore ISI. Your line is open.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nGood morning. On -- I know you mentioned that you still see substantial opportunity on the efficiency side for improvement. And on that end, can you talk about the gross cost saves? I know you have increased the target from $8 billion to $10 billion this year, early this year in January. Can you talk about the potential that could that number move higher yet again as your -- as you look at all the opportunities in front of you?\n\nMike Santomassimo -- Chief Financial Officer\n\nYeah. John, look, I am sure we will provide more guidance on that or more disclosure on that in January, so I will leave any specific remarks there. But I would just go back to like what we have been saying, we are not done on the efficiency journey. As we execute on the stuff that's in front of us, we continue to find more opportunity really across most parts of the company, and so I think that will continue to evolve.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nOK, Mike. Thanks. And then in terms of the mortgage expectation, I think you indicated that you could see some incremental downside pressure there. Can you maybe help us size up the magnitude that you could see in the fourth quarter in terms of an incremental decline?\n\nMike Santomassimo -- Chief Financial Officer\n\nYeah. Well, I mean if you look at the -- in the consumer banking and lending segment, we have got the mortgage banking income there. It's only a little over a $200 million for the quarter. So even a relatively substantial percentage decline is a pretty small dollar decline these days given the run rate.\n\nBut I think if you look at what happened this quarter, we probably came in a little bit better than what we guided in July. Spreads were a little bit better in August than what we had forecasted, but they came back down in September, and so we would expect that to continue. So while I think there could be some downside there, it's off a pretty low run rate at this point.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nGot it. OK. And then just one more follow-up on the balance sheet, and I am sorry if you had pointed to this already. But in terms of the pressure on the positive balances, can you talk about maybe how we should think about potential incremental declines in deposits as we see the impacts of the rate hikes continue to take hold?\n\nMike Santomassimo -- Chief Financial Officer\n\nWell, I think one, I think you are going to continue to see pricing increase from here, as we have said now for a while. And so you will see pricing go up as rates continue to increase. And then on the deposit side, all of it is somewhat natural, right, given the environment we are in. So as I pointed out in my remarks in the -- we saw the biggest dollar decline in our wealth business, which is clients moving to higher-yielding cash alternatives.\n\nNow, we are also seeing more broadly, clients move into cash there in a couple of areas where we have seen cash alternatives grow substantially, not just as they migrate away from deposits. So that's a piece of it. And then I think on the rest of the book, it's -- what we are seeing on the consumer side is a lot of spending. Not as much people much -- migrating away from us, or maybe there is a little bit of that, but it's really people out there spending.\n\nAnd then on the corporate investment bank, which are going to be some of your most rate-sensitive deposits, we are seeing the activity we expected to see, which is there are some clients moving into the other alternatives, but we still see many clients staying in cash with us as well. So I would expect that there is going to be -- there could be some further declines as we go.\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nGot it. OK. Thanks, Mike. Appreciate the color.\n\nOperator\n\nThe next question comes from Erika Najarian of UBS. Your line is open, miss.\n\nErika Najarian -- UBS -- Analyst\n\nHi. Good morning. Just another question on expenses, if I may. I guess the market -- what the market is telling us today is that so long as the core expenses are as expected, the market seems to be looking through higher op losses.\n\nAnd as we look forward, Charlie and Mike, as you think about the budgeting process for next year, I think the Street expects operating losses to be improving to be a strong contributor to expense improvements going forward, even off of that original $1.3 billion expectation. I am just wondering, as you think about the budgeting, do you continue to contemplate adjustments on the core? Meaning, cutting core --\n\nCharlie Scharf -- Chief Executive Officer\n\nOperating losses or expenses, excluding operating losses, Erika?\n\nErika Najarian -- UBS -- Analyst\n\nI meant expenses, excluding operating losses. I think your investors are expecting op losses to be down meaningfully even from that $1.3 billion original number. I am wondering if you are continuing to contemplate on the core?\n\nCharlie Scharf -- Chief Executive Officer\n\nWell, let me take a shot at it. I would say, again, first of all, I just want to remind you that we said in the prepared comments that we just want to be as transparent as we can, that we would -- that it's quite possible. And we said, I think likely, highly likely that we will have more significant -- potentially significant losses related to some of these historical matters. So we just want that to be on the radar screen.\n\nNo question, excluding that, our ops losses are still high, what I would just encourage people to think about is I personally wouldn't model them coming down until we actually see them coming down. Because again, as we go through and build the control environment, we are going to find things and we need to get that behind us. And I think that should be very much of a show me proposition, because again, we know what you know and we will see it when it happens. And we have done a little bit of advanced notice because we see all the work that we are doing, but we need to work through those things.\n\nAnd on the rest of op expenses, as we said, we are going to provide more specific guidance for that in the fourth quarter relative to next year, and also talk about how it plays into 15% sustainable ROTCE. And our budget, I also want to make the point because I think this is important to everyone. On the one hand, everyone wants -- we all want our expenses to go down because of what it does to earnings. But we are extremely -- I mean, even when we live in these two worlds, which is where we are rectifying these issues from the past, which are both building the risk and control work that's necessary and all the regulatory work and fixing the expense structure.\n\nBut we also very much have no intention of falling behind in our businesses. And so the two paths of conversations that we have through the budget process is what are we investing in and where are we going to see efficiencies. And we obviously have to make sure that we are getting the appropriate amount from each of those categories. Overall, there is no question that our efficiency ratios are not where they want them to be.\n\nSo directionally, that just tells you how we are thinking about how -- where that goes. But when we finish the process, we will provide more clarity, but just know that we are thinking about both sides of that equation. But understand what -- where we should be more long-term.\n\nErika Najarian -- UBS -- Analyst\n\nNo. I think that makes sense. And I think the conversation with investors, Charlie, is sort of the next step for Wells Fargo in terms of accelerated investment spend, right? Efficiencies, obviously, a ratio, so that makes sense. And my follow-up question maybe is for you, Mike.\n\nSo I am squeezing two parts to my second question. The first is, could you tell us what unemployment ratio, your ACL ratio today contemplates? And second, if you could just give a comment on where you see deposit betas trending relative to your previous expectation now that we have added 100 basis points onto the expectation for Fed funds since we have talked to you last in the quarterly earnings setting?\n\nMike Santomassimo -- Chief Financial Officer\n\nYeah. Well, let me take the first one first. So if you look at our Q, we do give you a kind of weighted blend of the economic scenarios and we give you a few data points, unemployment rate is one of them. As of the end of June, the weighted -- actually, not the right one.\n\nThe rated number for the end of this year was 4.1%, growing to 6% at the end of 2023. And we will update that based on the third quarter and the Q when we get there. On the second part of the question, what was the second -- can you just repeat the second part? I am sorry about that.\n\nErika Najarian -- UBS -- Analyst\n\nDeposit betas, has your thinking on cumulative deposit betas changed as we contemplated 2023, given that we added 100 basis points of the Fed's funds outlook since we spoke to you last in this quarterly earnings setting?\n\nMike Santomassimo -- Chief Financial Officer\n\nWell, I think so far, the betas have played out the way we expected them to do at this point in the cycle. And I think as rates continue to go up, we would expect them to increase, and that was part of the playbook and the analysis we had done going into the environment. And so -- and that's to be expected, right. And the if rates are going to go up even higher than we originally thought, then the betas will continue to go up with that.\n\nAnd so I think it's largely at this point playing out the way we thought it would.\n\nErika Najarian -- UBS -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Matt O'Connor of Deutsche Bank. Your line is open, sir.\n\nMatt OConnor -- Deutsche Bank -- Analyst\n\nGood morning. Can you give us an update on your rate positioning, and thoughts on whether you want to lock it in the kind of rate level that we are at here, what's expected, or how you are thinking about protecting yourselves from potentially lower rates, or what your perspective is on that? Thanks.\n\nMike Santomassimo -- Chief Financial Officer\n\nYes. I mean we still have -- we are still asset sensitive as where we stand today, and so that will -- we will continue to get the benefit as rates go up. But as you suggest, I think most banks are thinking about not just about today, but also about the other side of when rates start to peak and come back down. And I think the expectations around them have changed quite substantially.\n\nCertainly since the second quarter, but even throughout the third quarter into where we stand today, those expectations have changed a lot. So I would say at this point, we are spending a lot of time thinking about that question and how we want to protect part of the balance sheet from when rates would start to decline. But we haven't done anything in a material way at this point.\n\nMatt OConnor -- Deutsche Bank -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThe next question will come from Betsy Graseck of Morgan Stanley. Your line is open.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nHi. Good morning.\n\nCharlie Scharf -- Chief Executive Officer\n\nGood morning.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nTwo questions. One, on loans, how should we think about how much more room there is for you to grow loans within the context of the asset cap, realizing that there is a constraint so you can't get to maybe the level as a percentage of total assets or total earning assets that you could before GFC? I know it's a long time ago, but I am just trying to understand what running room you think you have in the loan book to grow that?\n\nMike Santomassimo -- Chief Financial Officer\n\nYeah. Betsy, I think as we have said I think even last quarter, we have got room to continue to grow and be there for clients. And we have got levers to pull if and when we think we need to create more capacity to do that. And so at this point, we are comfortable that we are going to be able to continue to be there for clients.\n\nAnd there is always discretionary stuff that you can do in certain pockets of your loan portfolio, and so I think we have got -- we feel comfortable at this point that we can still be there.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nOK. And then separately on the AOCI pull to part, can you give us a sense as to what we should put in the model for how long that should take?\n\nMike Santomassimo -- Chief Financial Officer\n\nHow long -- what part of that should take?\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nThe underwater AFS book, right? Like if rates were flat with quarter end 3Q, you have got --\n\nMike Santomassimo -- Chief Financial Officer\n\nWhen do you start to accrete back the AOCI?\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nYeah. Yeah. How long does it take to accrete back the AOCI?\n\nMike Santomassimo -- Chief Financial Officer\n\nIt takes a while. So you guys -- I think we have mentioned -- this just came up last quarter and the expectations really haven't sort of changed much, and it will take a while to come back. It will come slowly back year by year as the maturity of the bonds get shorter.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nOK. All right. No. I was just wondering because we have seen some portfolio restructurings at other places and didn't know if you had put hedges on that would have changed the pace, because obviously, it's meaningful to the capital outlook.\n\nSo I am just wondering if there is any color there, but I guess not. All right. Thanks.\n\nOperator\n\nThank you. The next question comes from Charles Peabody of Portales Partners. Your line is open.\n\nCharles Peabody -- Portales Partners -- Analyst\n\nI wanted to follow up on the deposit beta question. As I am sure you are aware, Treasury is talking to the TBAC committee and trying to get some advice on a treasury buyback. I was curious what your thoughts are about how that would affect liquidity flows, potentially out of money market funds into the banking system, and therefore, how that might affect your deposit beta assumptions next year?\n\nMike Santomassimo -- Chief Financial Officer\n\nI think cause an effect and how that will play into deposit betas would be a really hard question to answer. I mean that will -- if that comes to bear, that will be one of like many different factors that will go into what to expect from deposit levels, and therefore, betas over time. So I wouldn't attempt to try to put some math behind that at this point.\n\nCharles Peabody -- Portales Partners -- Analyst\n\nBut at the very least, would you view it as a net positive or in isolation, or is it a non-event in isolation?\n\nMike Santomassimo -- Chief Financial Officer\n\nI mean it really depends on what it is and how big in size, and so I think it could be that full range. It could be a non-event or matter. But I think until you have better clarity, it's hard to say.\n\nCharles Peabody -- Portales Partners -- Analyst\n\nAnd assuming it's a $1 trillion type of treasury buyback, which I think is the capacity they have?\n\nMike Santomassimo -- Chief Financial Officer\n\nYeah. I think it's just a really hard question to try to put math behind at this point.\n\nCharles Peabody -- Portales Partners -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. The next question comes from Vivek Juneja of J.P Morgan. Your line is open, sir.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nThanks. Charlie, Mike -- Charlie, I wanted to just follow-up on your comment earlier about you are seeing declines in deposits before -- below pre-pandemic levels in certain cohorts. Can you talk a little bit about that? What level of balances kind of cohorts are you talking about, and how much have they gone down below pre-pandemic levels?\n\nCharlie Scharf -- Chief Executive Officer\n\nYeah. I will turn it over to Mike. But I just -- this is the same thing that we had talked about in the prior quarter whereas those that entered the pandemic with the lowest of balances to begin with, where they had balances for a period of time that remains above pre-pandemic levels, and we started to see declines ultimately in spend and deposit levels for that group now that are averaging below pre-pandemic levels. But as I said in the prepared remarks, we would have expected that.\n\nI would have expected that to exacerbate and spread, and it hasn't really. It's still a small part of our customer base.\n\nMike Santomassimo -- Chief Financial Officer\n\nYeah. And in fact, these are customers generally that have $500 or $1,000, or $2,000 kind of average balances per month, and there is a percentage of those customers that have seen some declines. And there is also a percentage -- some of those customers that haven't, right. So it is just one of the different cohorts we have looked at.\n\nBut as Charlie said, that hasn't really started to go up in higher wealth cohorts or income cohorts.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nOK. And it sounded like from your comments that start -- that decline has happened this quarter. So I guess for the group that we are seeing, it probably gets worse as inflation remains high?\n\nMike Santomassimo -- Chief Financial Officer\n\nNo. This is a continuation of a trend we saw in second quarter as well. So it's not necessarily accelerating in any way, but it's a continuation of a trend we have seen now for a number of months.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nMike, a little one for you. Card delinquencies, you gave 30 plus. Can you break that down to 30 days to 89 days of the early delinquencies, what those did this quarter?\n\nMike Santomassimo -- Chief Financial Officer\n\nThere will be more in the Q, I think we are back on that.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nOK. You don't -- OK. The suggestion to just have it out at earnings because, obviously, given that we are starting to change environment, it's an important metric to keep an eye on. Thanks.\n\nOperator\n\nThe final question for today will come from Gerard Cassidy of RBC. Sir, your line is open.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nThank you. Good morning, Mike. Good morning, Charlie. Mike, can you share with us the trends you are seeing in the commercial real estate area? You guys had very strong revenue growth, of course, in commercial real estate this quarter year over year.\n\nThe commercial real estate mortgage balances were slightly down. But we are hearing from different folks that the commercial real estate market starting to tighten up, banks aren't as being as aggressive in lending. Can you -- any color on the risk dynamics that you might be seeing and the trends you are seeing in commercial real estate mortgage?\n\nMike Santomassimo -- Chief Financial Officer\n\nSure. Let me start with just what's driving some of the growth you have seen, right. So loan balances are up year to date and year over year. Really driven by two things, growth in multifamily, apartments, and some growth in some industrial properties.\n\nAnd so we still see really strong demand. I think even if you look at new housing, new multifamily housing starts, still growing. Hasn't really turned like single-family homes has over the last number of months, still -- so really strong demand there. I think when you look at the performance of the portfolio, some of the categories that were most impacted by the pandemic hotels, retail.\n\nIn most cases, are back. Good cash flow, values are fine, and we are seeing that hold up pretty well. You still have some forward-looking uncertainty in the office space, just given that hasn't really translated into significant stress yet because you still have long-term leases and other things. You always hear about an anecdotal issue of the property, but it has -- nothing systematic yet rolling through the portfolio.\n\nI can't speak about what others are doing. But I think for us, you have seen good growth this year. And as you go into an uncertain environment, you are just -- you are going to try to be smart about what you put on -- new things you put on your balance sheet, and we continue to do that. But that's in the context of seeing some good growth year to date.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nVery good. Obviously, your guys' CET1 ratio is well above your required level, and I think you pointed out your AOCI mark drew it down by about 21 basis points. Would you guys consider repositioning the available-for-sale portfolio since you are already taking the mark through your CET1 ratio? What kind of dynamics would you need to see if that would make sense for you to do that?\n\nMike Santomassimo -- Chief Financial Officer\n\nYou always look at -- you have different ways to optimize. We did -- we did do a little bit in the second quarter where we traded out some mortgage -- blanking on the name, but some mortgage-backed securities for Ginnie Mae, you get a little better RWA treatment. So you do -- we have done some little bit of repositioning over the time. And it's something we always sort of look at and think at.\n\nBut it's not something that we are contemplating in big size at this point.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nAll right. Thank you.\n\nCharlie Scharf -- Chief Executive Officer\n\nAll right. Thank you very much, everyone. We look forward to talking to you next quarter. Take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Campbell -- Director of Investor Relations\n\nCharlie Scharf -- Chief Executive Officer\n\nMike Santomassimo -- Chief Financial Officer\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nScott Siefers -- Piper Sandler -- Analyst\n\nKen Usdin -- Jefferies -- Analyst\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nJohn Pancari -- Evercore ISI -- Analyst\n\nErika Najarian -- UBS -- Analyst\n\nMatt OConnor -- Deutsche Bank -- Analyst\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nCharles Peabody -- Portales Partners -- Analyst\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nMore WFC analysis\n\nAll earnings call transcripts"
}