{
  "companyName": "Full Truck Alliance Co. Ltd.",
  "companyTicker": "YMM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/full-truck-alliance-co-ltd-ymm-q2-2022-earnings-ca/",
  "content": "Full Truck Alliance Co. Ltd. (YMM -1.96%)\nQ2 2022 Earnings Call\nAug 25, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, good day, and welcome to Full Truck Alliance's second quarter 2022 earnings conference call. [Operator instructions] At this time, I would like to turn the conference over to Mao Mao, head of investor relations. Please go ahead.\n\nMao Mao -- Investor Relations\n\nThank you, operator. Please note that today's discussion will contain forward-looking statements relating to the company's future performance, which are intended to qualify for the safe harbor from liability, as established by the U.S. Private Securities Litigation Reform Act. Such statements are not guarantees of future performance and are subject to certain risks and uncertainties, assumptions and other factors.\n\nSome of these risks are beyond the company's control and could cause actual results to differ materially from those mentioned in today's press release and discussion. A general discussion of the risk factors that could affect FTA's business and financial results is included in certain filings of the company with the SEC. The company does not undertake any obligation to update this forward-looking information, except as required by law. During today's call, management will also discuss certain non-GAAP financial measures for comparison purposes only.\n\nFor a definition of non-GAAP financial measures, and a reconciliation of GAAP to non-GAAP financial results, please see the earnings release issued earlier today. Joining us today on the call from FTA's senior management are Mr. Hui Zhang, our founder, chairman, and CEO; and Mr. Simon Cai, our CFO.\n\nManagement will begin with prepared remarks, and the call will conclude with a Q&A session. As a reminder, this conference is being recorded. In addition, a webcast replay of this call will be available on FTA's investor relations website at ir.fulltruckalliance.com. I will now turn the call over to our founder, chairman, and CEO, Mr.\n\nZhang. Please go ahead, sir.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nHello, everyone. Thank you for joining us today on our second quarter of 2022 earnings conference call.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nBefore I go into our second quarter performance, I would like to first provide an update on the cybersecurity review. As most of you are aware, the Cybersecurity Review Office of the Cybersecurity Administration of China initiated a data security investigation of our Yunmanman and Huochebang apps in July last year to detect any potential data security risks. Throughout the review process, we have fully cooperated with the CRO and taken comprehensive measures to address the issues identified. Although the results of the review have not been officially released, we are pleased to report that the review has made significant progress, as both our Yunmanman and Huochebang apps have resumed new user registration as of end June 29 this year.\n\nGoing forward, we will continue to work closely with the CRO to comply with all the regulatory requirements relating to cybersecurity, data security and protection of personal information. Furthermore, we remain committed to facilitating the establishment of our platform's data protection guidelines and optimization of our cybersecurity system by continuously implementing effective measures. We firmly believe that an optimized regulatory environment is both necessary and beneficial for the long-term healthy development of the industry.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nNow, moving on to our second quarter earnings results. The second quarter of 2022 was a challenging one for FTA and the entire logistics industry. The resurgence of COVID-19 in April led to widespread restrictions in major Chinese cities, further slowing the growth of the overall freight volumes in the logistics industry in the second quarter. While most parts of China have gradually resumed work and production since the end of the second quarter, with sporadic pandemic recurrences continuing to emerge, it is clear that we will still face many external uncertainties in the road transportation industry during the second half of the year.\n\nAgainst this market backdrop, our GTV and the number of fulfilled orders increased by 22.8% and 10.7% quarter over quarter to RMB 65.8 billion and RMB 27.8 million, respectively. Average shipper MAU remained at 1.53 million in the second quarter, up 7.7% quarter over quarter and flat year over year.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nIn terms of financial performance, our total net revenues continued to grow in the second quarter by 49.3% year over year and 25.3% quarter over quarter to RMB 1.67 billion, once again beating the high-end of our revenue guidance. More importantly, as we intensified our focus on monetization enhancement and operational efficiency improvement, our non-GAAP adjusted net income increased by 168.1% year over year to RMB 266.9 million in the second quarter.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nMarket turbulence in the second half of the year, notwithstanding our long-term vision and strategic direction for development, remain firm. As we progress through 2022, we remain committed to making FTA a smart and low-carbon logistics service provider, driving the transformation of the industry and realizing the social value of our platform by leveraging and amplifying our industry-leading strengths in user experience and protection, green operations, and digital innovation, among others. We believe that the resumption of new user registration for our core apps and our strong cash position will support us as we navigate the complex market dynamics.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nWith that, I'll now turn the call over to our CFO, Simon. He will go over our operational and financial results in more detail.\n\nSimon Cai -- Chief Financial Officer\n\nThank you, Mr. Zhang, and hello, everyone. I'll go through the overall performance of our company in more detail. As Mr.\n\nZhang stated before, we delivered solid financial and operational results in the second quarter, amid the challenges stemming from COVID-related restrictions as well as continued suspension of new user registration. Although GTV decreased significantly in Shanghai due to the pandemic, factories in other regions were able to handle some of Shanghai's shipping demands. However, adversely impacted by disrupted network operations and lockdown-related truck shortages in certain areas of China, our average fulfillment rate declined to 20.5% in the quarter. Now, that our core apps have resumed new user registration, we have started to see signs of fulfillment rate recovery in July, and we expect the overall fulfillment rate in the second half of the year to further improve.\n\nIn addition, the median freight matching time in June was approximately 11 minutes, consistently shorter than in the same period last year and the first quarter, again demonstrating the continued improvement in our platform's algo-driven matching efficiency while simultaneously resulting in increased order matching accuracy. For example, before our recommended order function was launched, truckers used to spend an average of five minutes searching for shipping orders by themselves. Now, relying on recommended orders, they need just three minutes to identify appropriate shipments and complete transactions. The iterative upgrading and accurate push of our algo in the second quarter have saved time for truckers and greatly improved matching efficiency.\n\nMoving on to our users. The retention rate of our shippers and truckers remained stable quarter over quarter. In the absence of new user registrations, second quarter growth in our shipper MAU mainly came from the increased contribution of our direct shippers. Furthermore, in the second quarter, largely due to nonmember to member conversion, the number of our entry-level or 688 member MAUs, which includes a large group of direct shippers, increased by over 40% year over year and exceeded that of our second-tier, or 1688 member MAUs, for the first time.\n\nSuch outstanding growth in the absence of new member registration again highlights the core shippers' recognition of the value of our platform. Now that new user registration has resumed, we expect continued growth in the size of both our 688 membership and nonmember cohorts. Speaking of which, we are excited to see rapid growth in the number of newly registered users since the end of the second quarter. Up to now, we have successfully converted about 300,000 new monthly active shippers and nearly 300,000 new monthly active truckers responding to orders.\n\nFollowing the resumption of new user recruitment, we launched a series of online and offline user acquisition initiatives and comprehensively refined our user operation process, including increasing platform exposure through multiple cooperation channels, promoting the conversion of new users into registered users through precise targeting and recommendation, and helping new users successfully complete their first transaction. We have also developed customized marketing strategies for direct shippers and potential paying members. Looking forward to the second half of the year, we remain focused on providing more valuable products and services, optimizing the user experience on both end, and improving engagement level and stickiness of new and existing users, so as to achieve continuous growth of user scale and transaction volume on our platform. Turning now to our business details.\n\nOur online transaction service continued to perform strongly, with revenues increasing by 116.2% year over year to RMB 347.8 million in the second quarter. The increase was primarily driven by higher commission penetration year over year. Given the pandemic's recurrence in the second quarter, we chose not to expand our commission model to additional cities but, instead, implemented a dynamic commission adjustment strategy based on fulfillment time and freight price. Thanks to this inventive approach, our commissioned GTV penetration reached 50% despite the pandemic's impact.\n\nFurthermore, both user activity and volume levels in commissioned regions remained stable. Among them, the next-month retention of commissioned truckers in 195 cities is above 85%, and the next-month retention of our first batch of commissioned truckers in Jiangsu and Zhejiang provinces and in Shanghai city is over 90%. Commission revenues accounted for more than 20% of our overall revenue in the second quarter, and our commission model's contribution to the monetization of our platform continued growth. For us, the nature and success of the commission model hinge on how much value is created for users.\n\nIn the future, while continuously improving the take rate and commission penetration, we will also continue to upgrade product functions and refine our platform's matching efficiency to help shippers deliver goods faster and more conveniently and also support a wider range of truckers to obtain more orders and profit. To that end, user centricity remains our top priority. In the second quarter, each business unit of our platform established a user experience department, focusing on the comprehensive optimization of our product usage process to bring an even better experience to our users. Given our growing investment in user experience enhancement, we expect our user complaint rate to continue to decline.\n\nFurthermore, the shipper rating system we launched at the beginning of this year to improve truckers' experience now covers seven provinces and cities. Our truckers have broadly commended this system, and it has spurred positive changes to the shippers' side as well. For example, shippers with better ratings tend to enjoy comparably higher frequency of page visits and fulfillment rate. We are confident that the shipper rating system will help our most credible shippers find truckers more efficiently.\n\nBenefiting from these improvements to our platform eco-system, both 12-month retention of shippers and next-month retention of truckers who responded to shipping orders on our platform remained high at approximately 85% in the second quarter. Finally, in response to truckers' complaints about low freight rates, in the second quarter, our operation team instituted various reminders and feedback functions for shippers and truckers at each stage of the shipment bidding process to encourage shippers to make more reasonable bids and improve the overall health and fairness in the pricing. For example, shipments with unreasonable, ultra-low bids are blocked early on in the process. We also inform shippers about appropriate pricing and issue markup guidance before allowing them to place low-priced bids to help cultivate fairer bidding habits and increase shipment pricing.\n\nAt the same time, we rolled out a dedicated communication channel for truckers to give direct feedback on low-priced goods or to request price increases on unreasonably priced shipments. Together, these measures have effectively improved our platform's overall freight rate, fulfillment rate, and trucker satisfaction. Before moving on to discuss our financial performance, I would like to highlight our commitment to fulfilling our responsibility to our industry, environment and society, which is at the core of our ongoing success. Since our inception, we have worked to advance a wide range of ESG initiatives within the stakeholder communities we serve.\n\nIn early July, we unveiled our 2019 to 2021 corporate social responsibility report, the first such report issued across China's entire digital transportation industry. In it, we showcased our explorations and achievements in fulfilling our social responsibilities in recent years, focusing on our platform strategy, scientific and technological innovation, credit system construction, public welfare development and green operation. We strive to positively impact our users, employees and the communities in which we live, and we believe that creating and meeting long-term ESG goals will ultimately fuel our sustainable development. Now, I would like to provide a brief overview of our second quarter financial results.\n\nOur total revenues in the second quarter were RMB 1.7 billion, representing an increase of 49.3% year over year, primarily attributable to an increase in revenues from freight matching services. Revenues from freight matching services, including service fees from freight brokerage models, membership fees from listing models, and commissions from online transaction services were RMB1.4 billion in the second quarter, representing an increase of 50.3% year over year, primarily attributable to an increase in revenues from our freight brokerage service as well as rapid growth in transaction commissions. Revenues from freight brokerage service in the second quarter were RMB 850.2 million, representing an increase of 41.4% year over year, primarily driven by significant growth in transaction volume as a result of improved user penetration. Revenues from freight listing service in the second quarter were RMB 211.7 million, up 20.7% year over year, primarily attributable to an increase in total paying members.\n\nRevenues from transaction commissions amounted to RMB 347.8 million in the second quarter, an increase of 116.2% year over year, primarily driven by the continued ramp-up of commissioned GTV penetration, and partially offset by a decrease in GTV due to COVID outbreaks. Revenues from value-added services in the second quarter were RMB 260.4 million, an increase of 43.7% year over year, primarily attributable to increased revenues from credit solutions. Cost of revenues in the second quarter was RMB 925.9 million, compared with RMB 627.0 million in the same period last year. The increase was primarily attributable to an increase in VAT, related tax surcharges and other tax costs, and net of tax refunds from government authorities.\n\nThese tax-related costs net of refunds totaled RMB 845.4 million, representing an increase of 47.7% from RMB 572.4 million in the same period last year, primarily due to an increase in transaction activities involving our freight brokerage service. Sales and marketing expenses in the second quarter were RMB 196.2 million compared with RMB 236.8 million in the same period last year. The decrease was primarily due to a decrease in advertising and marketing expenses during the user registration suspension period, partially offset by an increase in salary and benefit expenses driven by higher sales and marketing headcount. G&A expenses in the second quarter were RMB 344.8 million compared with RMB 2,123 million in the same period last year.\n\nThe decrease was primarily due to lower share-based compensation expenses. R&D expenses in the second quarter were RMB 216.4 million compared with RMB 155.1 million in the same period of 2021. The increase was primarily due to an increase in salary and benefits expenses driven by higher R&D headcount. Loss from operations in the second quarter was RMB 46.4 million compared with RMB 2.0 billion in the same period last year.\n\nNet income in the second quarter was RMB 12.7 million compared with net loss of RMB 2 billion in the same period last year. Under non-GAAP measures, our adjusted operating income in the second quarter was RMB 211.3 million, an increase of 949.9% from RMB 20.1 million in the same period last year. Our adjusted net income in the second quarter was RMB 266.9 million, an increase of 168.1% from RMB 99.5 million in the same period last year. Basic and diluted net income per ADS were RMB 0.01 in the second quarter compared with basic and diluted net loss per ADS of RMB 7.34 in the same period last year.\n\nNon-GAAP adjusted basic and diluted net income per ADS were RMB 0.25 in the second quarter compared with non-GAAP adjusted basic and diluted net loss per ADS of RMB 0.49 in the same period of 2021. As of June 30, this year, the company had cash and cash equivalents, restricted cash, and short-term investments of RMB 26.1 billion in total compared with RMB 26.0 billion as of December last year. For the second quarter of 2022, net cash used in operating activities were RMB 286.4 million. Looking at our business outlook for the third quarter of 2022.\n\nWe expect our total revenues to be between RMB 1.65 billion and RMB 1.73 billion, representing a year-over-year growth of approximately 32.9% to 39.2%. These forecasts reflect the company's current and preliminary views on the market and operational conditions. The COVID outbreaks are associated with substantial uncertainties, including the geographic scope and duration of the outbreaks, the additional restrictive measures that the government authorities may take, and the further impact on the business of shippers, truckers and other ecosystem participants, all of which are subject to change and cannot be predicted with reasonable accuracy as of the date hereof. By further unleashing the synergies of our platform's efficiency and the strength of our nationwide road logistics network, we continue to spur growth momentum across our business units.\n\nGoing forward, we remain focused on offering better products and services for our growing user base to help retain existing shippers and engage new users while ensuring quality growth. As the road transportation industry recovers, we look forward to capitalizing on even more promising growth prospects to reinforce FTA's leading position and amplify the value we bring to all of our stakeholders. That concludes our prepared remarks. We would now like to open the call to Q&A.\n\nOperator, please go ahead.\n\nOperator\n\n[Operator instructions] Our first question comes from Brian Gong with Citi. Please go ahead.\n\nBrian Gong -- Citi -- Analyst\n\n[Foreign language] I will translate myself. Thanks, management, for taking my questions. Congratulations on solid second quarter results. We have seen that the company announced the commission rules and the cap on commission rates at the end of June.\n\nCan management share how will this have any real impact on commission plans in the future? Thank you.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nWe announced that the commission rules may need to increase our pricing mechanisms' transparency and help truckers understand the whole operating process. The publicized commission rules have already taken into account with the company's long-term business plan and future take rates ramp up. So, we don't think this announcement will affect the progress of our monetization. From business perspective, our take rate is the lowest across industry peers, while the value we brought with our matching services between shippers and truckers is obvious.\n\nLooking forward, we will continue to promote a digitalized, standardized, and intelligent transportation industry. As we further grow our business skill and optimize our product functions, we will also remain committed to providing more value to our truckers. Next question, please.\n\nOperator\n\nOur next question comes from Ronald Keung with Goldman Sachs. Please go ahead.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\n[Foreign language] We've seen that the average freight rate GTV versus orders -- divided by orders in the second quarter was nearly RMB 2,400, so that was a 15% year-on-year increase, 10% Q-on-Q. So, what are the main reasons for that and how should we exceed the trend going forward? Thank you.\n\nSimon Cai -- Chief Financial Officer\n\nThanks, Ronald. This is Simon Cai here. I will address your question. So, first of all, in the second quarter, we see an increase in the freight rate on a platform.\n\nAnd this is mainly due to lockdown-related trucker shortages in many parts of China, which led to a rapid freight rate increase in a short period of time. And secondly, high oil prices in the first half of this year also contributed to the rise in the freight rate. Generally speaking, the impact of oil prices on freight rate materializes slowly over time with a certain lag effect. So, it gets difficult to quantify the direct result of oil price changes on the freight rate in the short term.\n\nWith the easing of COVID outbreaks and the resumption of new user registration on our core apps, we see that the past imbalance between supply and demand has gradually begun to equalize. So, as we progress through the second half of the year, we expect the freight rate to slowly trend downwards.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nThank you, Simon.\n\nOperator\n\nOur next question comes from Charlie Chen with China Renaissance. Please go ahead.\n\nCharlie Chen -- China Renaissance Securities -- Analyst\n\n[Foreign language] What are the changes in user composition and the user activity, as well as GTV and order composition in the second quarter amid the COVID-19 resurgence and the weak macro conditions? Thank you.\n\nSimon Cai -- Chief Financial Officer\n\nThank you. Overall, we think the GTV contribution of direct shippers in the second quarter remained stable on a quarterly basis. While the suspension of new user registrations still adversely impact our business in the quarter, the continuous optimization of user experience has actively encouraged the nonmember shippers to upgrade to the membership program. This drives an increase in the number of existing members.\n\nMost of these nonmember shippers upgrade to our 688 membership level, which is predominantly comprised of direct shippers. And such a strong growth, in the absence of new user, new member registration, again, highlights our shippers high dependence on the platform and represents a concrete step forward toward our long-term growth of optimizing our platform's user ecosystem. In terms of user behavior, our users continue to exhibit significant stickiness. For the last four quarters, the rolling 12-month retention rate of our paying shippers and the next month retention rate of truckers who responded to orders, both stayed at around 85%, unaffected by the new user registration suspension.\n\nMoreover, in the second quarter, we continued implementing effective operational strategies, such as increasing existing users' transaction frequency through targeted marketing campaigns and improve our shipper rating system, which partially offset the negative impact of the COVID outbreaks. With respect to order composition, due to the COVID's effects in the second quarter, the freight rate fluctuated substantially. More users tended to undertake price negotiation rather than relying on the tap-and-go model. As a result, the GTV and order contribution of the negotiated model increased slightly during the period.\n\nHowever, as the outbreak abates, we expect our GTV and order contribution from our tap-and-go model to recover gradually. As we move forward with the resumption of new user registration, the market recovery and the continued conversion of direct shippers, we expect direct shippers GTV and order contribution to maintain a steady increase.\n\nCharlie Chen -- China Renaissance Securities -- Analyst\n\n[Foreign language] Thank you very much.\n\nOperator\n\nOur next question comes from Jiulu Li with CICC. Please go ahead.\n\nJiulu Li -- CICC -- Analyst\n\n[Foreign language] The gross margin in the second quarter is 44.6%, slightly lower than in the first quarter. So, what are the main reasons for the quarter-over-quarter decrease? How should we expect the gross margin to trend in the future?\n\nSimon Cai -- Chief Financial Officer\n\nSure. The slight quarter-over-quarter decrease in gross margin was mainly attributable to the fluctuation of gross margin in the freight brokerage business with the timing difference of government refunds. If we exclude this segment, our approximate gross margin for other businesses improved both year over year and quarter over quarter. Looking forward, we expect transaction commission to be the key driver of our future revenue growth and profitability improvements.\n\nAs we continuously scale up our commission model and optimize operational efficiency, we expect our gross margin to improve further.\n\nOperator\n\nOur next question comes from Ivy Ji with Credit Suisse. Please go ahead.\n\nIvy Ji -- Credit Suisse -- Analyst\n\n[Foreign language] Thanks, management, for taking my question. I have a question about our opex trend. So, in the second quarter, we have seen a very disciplined opex spending, especially for sales and marketing, which fell by 17% year over year. So, just wanted to understand what's the key reason for this change.\n\nAnd how should we think about the opex and sales and marketing trend into the second half? Thank you.\n\nSimon Cai -- Chief Financial Officer\n\nThank you. Our sales and marketing expenses mainly consist of salary and benefits related to sales and marketing personnel, as well as marketing and promotion expenses. The year-over-year decrease in sales and marketing expenses in the second quarter was primarily due to a reduction in the advertising and promotion expenses during a period of new user registration suspension. Going forward, we expect sales and marketing expenses to increase in the absolute dollar amount as new user registration resumes and our new businesses continue to expand.\n\nAt the same time, we also expect sales and marketing expenses as a percentage of total net revenues to decline over time as we maintain revenue growth and improve operating leverage.\n\nIvy Ji -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Tian Hou with T.H. Capital. Please go ahead.\n\nTian Hou -- T.H. Capital -- Analyst\n\nYeah. Good morning management. I just have one question. So, there is a lot of discussion about, you know, Chinese authority and the SEC's dialogue regarding the auditing paper -- working paper.\n\nSo, at this point, we know we haven't reached agreements but making progress. So, just wonder what is your view on the potential delisting risk if, you know, the two governments cannot reach agreement for that PCAOB to inspect the working paper on particular company? Thank you.\n\nSimon Cai -- Chief Financial Officer\n\nThank you. There are lots of rumors on the market today. We're also monitoring the situation very closely, and we're considering different options, including the possibility of a due primary listing in Hong Kong. We have finished the preliminary assessment and do not foresee any major technical issues for us to list in Hong Kong.\n\nMeanwhile, we are also working closely with our auditor and regulators on this issue -- on this PCAOB issue. At the moment, everything is still in progress. If there are any further updates, we will inform the market in accordance with all disclosure requirements.\n\nTian Hou -- T.H. Capital -- Analyst\n\nOK. Thank you.\n\nOperator\n\nAnd that concludes the question-and-answer session. I would like to turn the conference back over to Mao Mao for any additional or closing comments.\n\nMao Mao -- Investor Relations\n\nThank you once again for joining us today. If you have any further questions, please feel free to contact us at Full Truck Alliance directly, or TPG investor relations. Our contact information for IR in both China and U.S. can be found in today's press release.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMao Mao -- Investor Relations\n\nHui Zhang -- Founder and Chief Executive Officer\n\nSimon Cai -- Chief Financial Officer\n\nBrian Gong -- Citi -- Analyst\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nCharlie Chen -- China Renaissance Securities -- Analyst\n\nJiulu Li -- CICC -- Analyst\n\nIvy Ji -- Credit Suisse -- Analyst\n\nTian Hou -- T.H. Capital -- Analyst\n\nMore YMM analysis\n\nAll earnings call transcripts"
}