{
  "companyName": "Crocs",
  "companyTicker": "CROX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/crocs-crox-q3-2022-earnings-call-transcript/",
  "content": "Crocs (CROX 0.69%)\nQ3 2022 Earnings Call\nNov 03, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, and welcome to the Crocs, Inc. third quarter 2022 earnings call. [Operator instructions] Please note, today's event is being recorded. I now would like to turn the conference over to your host today, Ms.\n\nCori Lin. Ms. Lin, please go ahead.\n\nCori Lin -- Vice President, Corporate Finance\n\nGood morning, everyone, and thank you for joining us today for the Crocs third quarter 2022 earnings call. Earlier this morning, we announced our latest quarterly results, and a copy of the press release may be found on our website at crocs.com. We would like to remind you that some of the information provided on this call is forward looking and accordingly is subject to the safe harbor provisions of the federal securities laws. These statements include, but are not limited to, statements regarding our supply chain challenges; cost inflation; the acquisition of HEYDUDE and the benefits thereof; Crocs' strategies, plans, objectives, expectations, financial or otherwise, and intentions; future financial results and growth potential; anticipated product portfolio; ability to create and deliver shareholder value; and statements regarding potential impacts to our business related to the COVID-19 pandemic.\n\nThese statements involve known and unknown risks, uncertainties, and other factors which may cause our actual results, performance, or achievements to be materially different from any future results, performance, or achievements expressed or implied by the forward-looking statements. Crocs is not obligated to update these forward-looking statements to reflect the impact of future events, except as required by applicable law. We caution you that all forward-looking statements are subject to risks and uncertainties described in the Risk Factors section of our annual report on Form 10-K and our subsequent filings with the SEC. Accordingly, actual results could differ materially from those described on this call.\n\nPlease refer to the Crocs Annual report on Form 10-K, as well as other documents filed with the SEC for more information relating to these risk factors. Certain financial metrics that we refer to as \"adjusted' or \"non-GAAP\" are non-GAAP measures. A reconciliation of these amounts to their GAAP counterparts is contained in the press release we issued earlier this morning. Joining us on the call today are Andrew Rees, chief executive officer; and Anne Mehlman, executive vice president and chief financial officer.\n\nFollowing their prepared remarks, we will open the call for your questions. At this time, I'll turn the call over to Andrew.\n\nAndrew Rees -- Director and Chief Executive Officer\n\nThank you, Cori, and good morning, everyone. I'm incredibly pleased with the strength of our brands and the third quarter results we released this morning. Consumer demand for both the Crocs and HEYDUDE brands is exceptional and led to strong double-digit revenue growth. As we continue to navigate a dynamic macro environment, our teams remain focused on driving market share gains and executing our long-term growth strategies for sustainable profitable growth.\n\nLooking at the third quarter of 2022, Anne will review our financial results in more detail shortly, but here are a few highlights. Consolidated revenues of $985 million grew 63% on a constant-currency basis. Crocs brand revenues grew 20% in constant currency with growth in all regions, and DTC comparable sales grew 18%. HEYDUDE brand revenues were $269 million, representing revenue growth of 87% versus prior year.\n\nAdjusted operating margins of 28% were best in class. Adjusted diluted EPS increased 20% to $2.90 per share, significant deleveraging within the quarter with net leverage of 2.4 times. Moving to our brand highlights for the quarter, let's begin with the Crocs brand. In Piper Sandler's Fall 2022 Taking Stock with Teens survey, the Crocs brand increased to the No.\n\n5 favorite footwear brand among teens, up from No. 6 in fall of 2021. The brand also continued to strengthen with men's and kids ranking as the No. 5 and No.\n\n4 brands, respectively, within the NPD Retail Tracking Service for fashion footwear in terms of dollar value of sales for September in the United States. These results were achieved as we continue to raise the bar in marketing activations and product innovations. Our partnership with Salehe Bembury continues to be very successful as we release three new colors this quarter, all of which sold out instantly in the U.S. In EMEALA, partnership with high-fashion designer Christian Cowan featured custom Jibbitz charms that can be converted into wearable accessories, such as a necklace and a hair clip, elevating our customization to new heights.\n\nIn China, we teamed up with prominent fashion ambassadors, Fan Chengcheng and Nana to launch our global Crush collection. As a fan-centric brand, we continue to demonstrate our versatility partnering with convenience store 7-Eleven and relaunching our adult Lightning McQueen Clog for the fourth time at fans request. Marketing activations with product innovations is one of our core competencies, and how we continue to build brand relevance. New product introductions include adding height for her in the Crush collection that is now global, a new molded silhouette for him with the Echo Clog.\n\nEarly access events on the Crocs app for the Echo Clog generated significant app downloads, strong DTC sellouts, as well as much excitement with our specialty footwear retailers. In the sandal arena, we elevated comfort with the Miller Slide that targets the recovery segment combining the comfort of LiteRide foam with modern silhouette. Our rapid pace of both product and marketing innovation hit an all-time record in September, and we plan to sustain a high level of innovation and new product introduction through the holiday season and into 2023. From a Crocs brand perspective, Clogs continued to exhibit strong double-digit growth this quarter.\n\nSandals, an important growth pillar for the future, increased nearly 20% in Q3. We're confident that sandals will deliver strong back half growth, as we experienced exceptional growth internationally and see high sandal penetration in markets, such as India, Southeast Asia, and the Middle East. Finally, Jibbitz continues to create excitement and engagement with consumers globally, growing double digits from last year. We continue to drive digital growth, one of our most important initiatives.\n\nWe saw strong 22% constant-currency growth and digital penetration increased to 37.4% with growth across all regions, driven by increases in new customers combined with repeat purchasing from existing customers. We launched more robust technical capabilities to enable enhanced personalization and we expanded new marketplaces, including selling [inaudible] in China. Turning to HEYDUDE, the brand is one of the fastest-growing casual footwear brands in the U.S. market today.\n\nAnd we now expect revenues to exceed $1 billion in 2023, a full year earlier than previously committed. In Piper Sandler's Fall Taking Stock with Teens survey, HEYDUDE ascended to the number seven favorite footwear brand among teens, up from number eight in the Fall of 2021 and number nine in the Spring of 2022. We're also seeing early evidence of success with our marketing campaigns, as the Piper study noted increased HEYDUDE mindshare in the Northeast and the South regions of the United States. We're excited about the rebrand that went live in July.\n\nAnd we've seen consideration increase by 5 percentage points in our recent brand study. The brand was recently featured in The Wall Street Journal article entitled, The Beer Koozie-Like Shoe That Is Selling Out Across America. We're excited to have acquired the rights to HEYDUDE.com this past quarter, which should make it even easier for our fans to purchase directly from our website. HEYDUDE also began its influencer strategy with a portfolio of partners.\n\nGoing forward, we'll continue to implement a successful marketing playbook for the HEYDUDE brand. From a product perspective, the HEYDUDE brand is continuing to expand wearing cases, as we enter colder seasons with products such as the Britt, Denny, and the Scott boots. Additionally, the introduction of the Axel is testing the relevance of the HEYDUDE brand in the sneaker category. Our iconic clog silhouettes to Wally and Wendy continue to grow and be in demand, as we introduce new colors, prints, and elevated products to include [inaudible].\n\nWith the addition of HEYDUDE, we have diversified our product portfolio. For Q3, clog penetration was just over half of our total revenues. The casual silhouettes of HEYDUDE diversified our overall revenue base to constitute 27% total revenues and sandals were approximately 9% of enterprise revenues. In summary, we have tremendous confidence and clear evidence as to the underlying strength and growth potential for both Crocs and the HEYDUDE brands.\n\nBefore turning the call over to Anne, I want to provide an update on what we're seeing in the macro environment. Pressures remain from widespread inflation, elevated interest rates, and the strong U.S. dollar, China's zero COVID strategy, and the war in Ukraine. During the pandemic, inventories were operating at historically lean levels caused by supply chain delays and Vietnam factory closures.\n\nIn recent months, we've seen high levels of promotions in response to elevated inventory levels, particularly in the United States. The combination of these factors are pressuring margins and making near-term performance more difficult to predict. However, even facing an uncertain macro environment, we're raising our guidance for 2022 and remain confident in continuing to gain significant market share and achieving our long-term revenue targets for both brands while generating best-in-class profitability. I will now turn the call over to Anne who will review our third quarter financial results in more detail.\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nThank you, Andrew, and good morning, everyone. I will begin with a short recap of our third quarter results. All revenue growth rates will be cited on a constant-currency basis, unless otherwise stated. For a reconciliation of the non-GAAP amounts mentioned to their equivalent GAAP amounts, please refer to this morning's press release.\n\nAs Andrew outlined, we had an exceptional third quarter with $985 million in consolidated revenues, representing 63% growth. In spite of several headwinds to margins, we delivered another quarter of industry leading adjusted operating margins of 27.9% and adjusted EPS growth of 20.2%. I will now detail our revenue highlights by brand, beginning with the Crocs brand. During the third quarter, we sold 30.3 million pairs of shoes, an increase of 19.2% over Q3 of 2021.\n\nThe Crocs brand average selling price during Q3 was $23.33, which is flat on a constant-currency basis and declined 4.5% on a reported basis due primarily to unfavorable FX. Let's now review a few Crocs brand highlights by region. In North America, the Crocs brand remains strong and gained share. Third quarter revenues increased 1.8% to $445 million.\n\nThe North America DTC channel for the Crocs brand, an indicator of underlying consumer demand, was the key growth driver with DTC comparable sales up 13% on top of 70% comparable sales growth in 2021. Wholesale selling was down 15%. However, wholesale sell-out was at high single digits as we continue to partner with major wholesale accounts to carefully manage market-level inventories. International was the largest growth driver for the Crocs brand in Q3, as we execute on our long-term growth plan to ignite the brand in Asia and EMEALA.\n\nInternational net represents nearly 40% of Crocs brand revenues. Crocs brand revenues in Asia grew 82.3% to $138 million during the quarter. The strong growth was broad-based across India, Southeast Asia, Japan, and South Korea. Additionally, the green shoots in China continued despite headwinds from the continued COVID lockdowns with revenues increasing more than 30% compared to last year.\n\nCrocs brand revenues for EMEALA were $132 million growing 45.6% with distributors, brick-and-mortar wholesale partners, and e-commerce driving the growth. Momentum continued from Q2 with strong growth in our top direct markets, the UK and Germany. Turning to HEYDUDE. Revenues continue to exceed expectations contributing $269 million for our portfolio and growing 87% from Q3 2021 revenues.\n\nThe momentum of the HEYDUDE brand has been exceptional, and we remain confident about realizing the full potential the Crocs playbook will have on the brand. As a reminder, we will continue providing gross margin visibility by brand for the remainder of 2022. Beginning in 2023, gross margin will be reported on a consolidated basis only. Consolidated adjusted gross margins for the quarter were down 910 basis points from last year to 55.1%.\n\nApproximately half of the compression is related to the addition of the HEYDUDE brand. Adjusted gross margin for the Crocs brand was 57.5% or 670 basis points lower to prior year, driven by the impact of inflationary cost pressures of approximately 200 basis points and 270 basis points of higher freight and inventory handling costs, of which we estimate 150 basis points to be transitory. Currency negatively impacted margins by 115 basis points. In addition, we also saw a more normalized promotional environment in our North America business, although that was mostly offset by higher ASPs in Asia and EMEALA.\n\nHEYDUDE adjusted gross margins were 48.8%. This gross margin represents the continued effect of cost from legacy freight contracts that take time to roll through the P&L and higher inventory storage costs in the short term, as we work to expand DC capabilities to support a larger business. To that end, we have signed a lease to open a significantly larger new facility in Las Vegas, which we anticipate will come on stream in Q4 of 2023 to efficiently support our growth aspirations. During the third quarter of 2022, we leveraged consolidated adjusted SG&A 420 basis points improving to 27.2% of revenues versus 31.4% last year.\n\nThis improvement was achieved while still investing in marketing and talent related to HEYDUDE as well as marketing in the Crocs brand. Nonrecurring SG&A expenses for the third quarter were $9 million, primarily related to HEYDUDE integration costs of approximately $7 million. To support the long-term growth of our portfolio, we will continue to invest in key areas like marketing and talent while maintaining our efficient SG&A structure. Our flexible SG&A base, coupled with our ability to leverage shared services across the portfolio, allows us to remain fluid in a dynamic operating environment.\n\nOur third quarter adjusted operating income increased 33.8% to $274 million from last year, including $79 million attributable to HEYDUDE. Consolidated adjusted operating margin declined 490 basis points to 27.9% from 32.8% last year. Our third quarter non-GAAP diluted earnings per share increased $0.50 or 20.2% to $2.97. Our liquidity position remains strong as we ended the third quarter with $143 million of cash and cash equivalents.\n\nThrough strong cash flow generation, we repaid a total of $155 million of debt in the quarter, fully repaying the balance due on our revolver and making our first prepayment on the term loan B, reducing borrowings to $2.62 billion and net leverage to approximately 2.4 times at the end of Q3. Through EBITDA growth and debt repayment, we remain focused on deleveraging to under two times by the middle of 2023. Our inventory balance at September 30, 2022, was $514 million, an increase of $301 million versus last year, inclusive of HEYDUDE. The addition of HEYDUDE added $190 million of inventory with approximately half of the inventory in transit.\n\nThe Crocs brand had $324 million in inventory, an increase of 52.6% over prior year. Our higher inventory reflects revenue growth, higher cost and inventory, and a very low level of inventory last year due to limited availability with the factory closures and elongated transit times related to the pandemic. Looking to close out the year, I would like to share our current outlook for 2022. All numbers will be on a reported basis, unless otherwise stated.\n\nAfter outperforming in Q3, we are raising our full year 2022 revenue guidance for the Crocs brand to be between $2.605 billion and $2.63 billion, representing constant-currency growth of approximately 17%. We continue to expect the strongest growth to occur in Asia and EMEALA as the regions continue to experience high growth and consumer demand. With respect to HEYDUDE, we are maintaining our full year guide and are confident in our revenue expectations of between $850 million to $890 million on a reported basis, implying $940 million to $980 million on a pro forma basis. This translates to consolidated revenues growing 49% to 52% to approximately $3.455 billion to $3.52 billion.\n\nAs always, we are focused on best-in-class profitability and therefore are raising our adjusted operating margins to be approximately 27% for the full year. We are raising the bottom end of our adjusted diluted earnings per share outlook to be between approximately $9.95 to $10.30. This includes the impact of higher interest rates and lower tax rate with our full year non-GAAP tax rate now expected to be 21%. After repaying $350 million of debt year to date, we remain committed to using excess cash flow to repay debt.\n\nThrough consistent debt repayment and EBITDA growth, we will achieve two times gross leverage by mid 2023. In summary, we delivered a strong Q3 and look forward to finishing out another record-setting year. At this time, I'll turn the call back over to Andrew for his final thoughts.\n\nAndrew Rees -- Director and Chief Executive Officer\n\nThank you, Anne. As we close out the year and look forward, we remain incredibly confident in the strength of the Crocs and HEYDUDE brands and our management team that continues to drive strong growth, profitability, and cash flow. Our focus remains squarely on navigating current uncertainties and creating tremendous long-term shareholder value. Operator, please open the call for questions.\n\nOperator\n\nYes. Thank you. At this time, we will begin the question-and-answer session [Operator instructions] And the first question comes from Jonathan Komp with Baird.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nYeah. Hi. Good morning. Thank you.\n\nI want to ask about inventory. Sorry if I missed this. But it looked like the Crocs total inventory might have been down sequentially. So I wanted to just clarify that, both on hand in terms of the inventory Crocs as well as do you have a sense where your wholesale partners sit today? And then related to that gross margin, Anne, I'm wondering if kind of in the 55% range is a safe assumption for fourth quarter? And if you could talk about that promotional level you're embedding in the outlook here.\n\nAndrew Rees -- Director and Chief Executive Officer\n\nWhy don't, Jon, I kind of tackle the wholesale partners, and then Anne will give you the details on our inventory and talk about gross margin. So from a wholesale partner perspective, it's actually something we've been super focused on. We want to maintain healthy inventories in the channel, believe that gives us greatest control over our brand. You probably saw in North America in our prepared remarks, North America was down from a wholesale perspective, but sell-out was up over the same period last year.\n\nTherefore, we destocked in the wholesale environment. And we continue to work closely with our major U.S. wholesale partners and our global distributors to manage their inventory levels very closely. We think that's super important to maintaining brand health.\n\nNow let me pass it up to Anne.\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nYeah. Thank you. Good morning, Jon. Our consolidated inventory balance was 514, and that included -- that was up about $300 million from last year.\n\nThat's inclusive of HEYDUDE. HEYDUDE was about $190 million of inventory. So if you take that out, we're pretty close to flat sequentially, not quite from a Crocs standpoint. The Crocs brand inventory -- Yes, sorry, actually we're down a little bit from Q2.\n\nThe Crocs brand had $324 million in inventory. And really inventory reflects the revenue growth that we've had over last year, higher costs in inventory, and then obviously we had a very low level of inventory last year due to the pandemic. And then from a gross margin standpoint, we are still maintaining our best-in-class gross margins. Last year was obviously a high watermark for gross margins.\n\nWe are starting to see freight rates come down. And we're building out infrastructure for both brands. So we called out -- we think 150 basis points of transitory costs will start to dissipate, but that's probably not going to happen until next year. And then we guided our long-term operating margins.\n\nLong term will be greater than 26%. This year, we guided 27%. But we didn't give a guide for gross margins in Q4. We do anticipate the promotional environment that we saw in Q3 to continue into Q4 and be relatively promotional and especially compared to last year where there was a lot less promotions in the market.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nOK. That's really helpful. And then one follow-up, just broader question, as you look forward to 2023 amid the current macro uncertainty. Any feedback that you're getting in terms of things that might influence your outlook for the Crocs brand, thinking through North America, the potential to hold gains that you've had, as well as the international performance to continue some of the recent strength? Just any color or feedback directionally understanding you're not guiding at this point?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nYeah, yeah. I think what we'd say a couple of things is pace of innovation is super important, right? We've seen us be able to accelerate on the Crocs side, accelerate both product innovation and marketing innovation through the quarter. We think that's had a very positive effect. We showed a lot of new product to our major wholesale customers for next year.\n\nAnd we have, I would say, a very strong pipeline of innovation on the Crocs side and the HEYDUDE side. So we think that's really important in this environment. We think both of our brands are in really good health. They're well-positioned, given the macroeconomic environment, selling at very approachable price points.\n\nAnd the benefits of the strong growth we've seen on Crocs for the last several years is we've acquired a lot of new customers. And we are -- as we look at our analytics, we're able to retain those customers, continue to communicate with them, continue to sell to them. So we're bullish and very positive about the prospects for next year.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nThat's great. Thanks, and best of luck.\n\nOperator\n\nThank you. And the next question comes from Abbie Zvejnieks with Piper Sandler.\n\nAbbie Zvejnieks -- Piper Sandler -- Analyst\n\nHey, guys. Thanks for taking my question. Congrats on the quarter. The EBIT margin control this quarter like despite all of the industry headwinds, like FX and promotion, it's really impressive.\n\nSo can you just talk about the flexibility you have on SG&A that allows you to manage to this level of profitability? And then on the North America wholesale, how much of the reduced selling was intentional versus any changes in demand from your wholesale partners? Thanks.\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nSo I'll talk to SG&A, and then I'll let Andrew talk to wholesale. So yeah, we're really pleased with the EBIT contribution. We continue to generate best-in-class operating margins. From an SG&A standpoint, we did leverage SG&A in the quarter.\n\nWe're really able to, especially with the addition of the HEYDUDE brand, able to leverage our overall shared service and enterprise costs. But we also continue to invest dollars in marketing talent and digital. I think that's really important. So we'll continue to strategically support the growth of both brands while maintaining that efficient SG&A rate and investing in marketing so that we can continue to connect with our consumers.\n\nAndrew Rees -- Director and Chief Executive Officer\n\nYeah. And I think one other thing I'd add to that is the benefit of both brands gives us leverage over shared services, which is particularly important. So from a wholesale perspective, I think the better word is probably discipline versus intentional, Abbie. As we approach our kind of wholesale partner management, we try and be really disciplined in terms of what inventory that they hold and making sure that they're seeing strong sell-throughs.\n\nAs I mentioned, U.S. wholesale sell-out was up high single digits. So that's over the same period last year. So we had actually strong consumer demand and strong sell-out.\n\nBut I think what we're seeing is our wholesale customers are being really prudent in terms of how they manage their business in terms of managing their overall inventory levels. And we're not going to play the game of forcing inventory into them and getting them overstocked. We believe we have greatest control over our brand by managing our inventory ourselves.\n\nAbbie Zvejnieks -- Piper Sandler -- Analyst\n\nGreat. That makes sense. Thank you.\n\nOperator\n\nThank you. And the next question comes from Tom Nikic with Wedbush Securities.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nHey, good morning, everyone. Thanks for taking my question. In regards to the North America inventory destocking in the wholesale channel, do you have any thoughts as to how long that's going to take? I'm assuming that there's kind of more of that coming in Q4, which is why the Crocs brand is expected to have a little bit slower growth in Q4 versus the rest of the year. But do you think it will persist into 2023 as well?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nYeah. Tom, I'd probably say pretty similar to what I said in response to Abbie's question. We're going to continue to be super disciplined. And will that likely result in more sell-out from wholesale than sell-in in Q4? Probably.\n\nThat's the way we're looking at it. In terms of next year, I'm not sure. I think the inventory glut in the industry, the heavy inventories that a lot of our wholesale customers see from a range of brands, I think most people have been pretty clear that they're going to be aggressive in the holiday season. And we've factored that promotional environment into our guidance.\n\nSo I think people will deal with a lot of it this year. So I think we'll have to take next year as it comes. But I think what's important for us is to focus on what we can control. And we know we can control pace of innovation, we can control innovative and pace of marketing, and driving sell out for the brand.\n\nAnd if we continue to drive sell-out for the brand, we know our brand is incredibly profitable for our wholesale partners. And we're very convinced that they will continue to purchase.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nUnderstood. And if I could just follow up on the sandal business, I know you had a tough sandal business in the first half of the year. And it sounds like there was a pretty good inflection in the third quarter. Should we assume that maybe when we get to kind of spring/summer 2023, you've got a little bit more innovation in the pipeline relative to what you had in 1H '22? And thus, we should see kind of a better sandal business year over year in 2023?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nYeah, you should. In short, Tom, the answer to that is yes. We've seen the sandal business inflect, as you pointed out, 20% growth in Q3. That has been largely driven by innovation, introducing new products.\n\nWe also commented, we're also seeing very strong growth in parts of the world that have very strong sandal penetration. So I would call out India, Southeast Asia, and parts of the Middle East. They have much higher sandal penetration and we're seeing strong growth. So part of the weakness we saw earlier was we weren't seeing strong growth in those areas.\n\nAnd as we look to next year, I would say we've gotten very good feedback on the innovation that we're bringing to market. And we anticipate some of those regional impacts continuing to support strong sandal growth.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nSounds good. Thanks, Andrew and team, and best of luck for the holiday season.\n\nAndrew Rees -- Director and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And the next question comes from Sam Poser with Williams Trading.\n\nSam Poser -- Williams Trading -- Analyst\n\nGood morning. Thanks for taking my questions. I've got a handful here. I just want to follow up on next spring.\n\nThe destocking -- would it be OK to say that you pushed a little more than you would have -- the hindsight being 2020, you may be pushed more good into the first half of the year than you wanted to and now you've become more disciplined since then. And then when we look at next spring, I would assume that generally there's going to be a lot more newness and innovation than there was this past spring. So it's not really apples-to-apples from a product perspective. Is that an accurate assessment at all?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nI think the second part of what you said, Sam, is an accurate assessment, a lot of innovation coming. We've shown our customers a lot of new products and across the spectrum, within clogs, within sandals, within personalization. So I think they're pretty excited about that. So the fact that it will not be comparable to last spring from an innovation cadence perspective, I think that's completely accurate, yes.\n\nIn terms of kind of commented on sell-in and sell-out kind of through the year, I think we're focused on looking forward and making sure that our inventories are right-sized and that we're managing the brand effectively, both in this country but also across the globe.\n\nSam Poser -- Williams Trading -- Analyst\n\nOK, cool. I've got a few more. Are you working on any personalization with HEYDUDE down the road, because one of the great things about Crocs is the personalization with the Jibbitz. I don't expect Jibbitz on HEYDUDE, but are you working -- is there personalization coming to that brand in any sense?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nYeah. So I think it shows up differently from HEYDUDE, Sam, but in a way, yes. So I think personalization behavior is more around kind of SMUs and getting short-run special product, either for wholesale customers or for particular consumer segments, that we want to target through our direct to consumer. So we will definitely make product and market it to discrete segments.\n\nThere's not a sensible vehicle to sort of put a divot on. We do think there's opportunities with laces and things like that, but that's a little bit down the road. And then I think the other way that we can create kind of short-term demand for specific styles within HEYDUDE is collaborations, right? And we will have a cadence of collaborations and an opportunity to use the HEYDUDE brand in that fashion over time. That will take a little time to work out.\n\nBut we think there's lots of opportunity to do that. So the broad spectrum of our kind of marketing playbook and the way we can engage with consumers, we think is extremely applicable and you're probably already seeing us starting to utilize that to promote the HEYDUDE brand.\n\nSam Poser -- Williams Trading -- Analyst\n\nI got two more. The growth of either brand, vis-a-vis store expansion versus breadth and depth of product within existing distribution, can you give us some color? I know the regional differences in this, but could you give us some color on that? I'll just give you my last two. One, I heard there's new HEYDUDE stores opened down South somewhere and I wonder what your plans are there? And then, Anne, I want you to answer Jon's question. Is 55% a good number to use for Q4 gross margin?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nAll right. So there's a lot there. I think that was three actually, Sam. So let me just try.\n\nSo I think the core question you're asking is about sort of growth in wholesale distribution, doors versus penetration. For Crocs, what I would say is, look, we continue to look for sensible incremental doors, but we're in a lot of places, and that applies to the U.S. and a lot of our international market. But if there is a new incremental channel we think makes sense and allows us to reach our consumer groups, we will absolutely take it on.\n\nSo the majority of Crocs growth is going to be more driven by share a shelf, so more shelf space and faster sell-through. For HEYDUDE, in the last six months since we've owned it, we've actually expanded distribution quite a lot already. But there is clearly more to come in '23 and beyond, and there is international on top of that plus is also share a shelf. Like the places where we've expanded distribution, we really have minimal shelf presence and we envisage a lot greater shelf presence for the brand in the future.\n\nSo it's both. The HEYDUDE store that we opened, yes, we opened two small clearance stores. And they are simply a vehicle to help release some of the aged inventory in the warehouses we've taken over the brand that's clearly from aged inventory and we're looking to try and clear that out in a sensible fashion. Very much aware that the liquidation channels for the footwear industry are essentially full at this stage.\n\nSo they're clearance stores, they're not a precursor to a store strategy for HEYDUDE at this stage, that is still in the works. And then over to Anne for gross margin.\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nAll right. Thanks, Sam, and good morning. With gross margins for Q4, we're not trying to be coy about not guiding. We're trying to make sure that we have room in order to perform and do what we need to do for the holiday season.\n\nWe've talked a lot about we will participate and keep our share of wallet. We think that's really important, especially when the consumer is shopping during holiday. But we do feel like we're confident and being able to hit our guidance for the year, and we feel like we've actually increased our operating margin guide to approximately 27% for the year, which implies operating margins for Q4 of approximately 21% to 23%. So within there, you can get a range of gross margin guides.\n\nAnd that leaves us enough flexibility to participate in whatever promotion or environment that we think is appropriate.\n\nSam Poser -- Williams Trading -- Analyst\n\nJust one last one for you, Anne, on a follow-up to that. In 2019, you had about a 400-basis-point gap between the Q3 gross margins and the Q4 gross margins being lower. If we look back at these historical differences between the quarters, is that accurate or things just changed so much it's very hard to tell given that in the last two years that's been much tighter than that?\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nYeah. I think it's a really hard read to make. Sam, to your point, I think 2019 was a really long time ago. And the brand is in a much different place, including our product line and the mix of products that we sell.\n\nI don't think that's necessarily a key indicator of performance and how we should look at seasonality going forward.\n\nSam Poser -- Williams Trading -- Analyst\n\nAll right. Thanks very much and continued success.\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nThanks, Sam.\n\nAndrew Rees -- Director and Chief Executive Officer\n\nThank you, Sam.\n\nOperator\n\nThank you. The next question comes from Laura Champine with Loop Capital Markets.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nHi. Thanks for taking my question. I was really impressed with the growth in APAC and EMEA during the quarter. I'm hoping you can talk a little bit more to the drivers of that.\n\nAnd also when we can expect international growth to become a meaningful part of the HEYDUDE story?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nThank you, Laura. Yeah, we were really thrilled about the international growth as well. Obviously, as you know from a long-range plan perspective, particularly APAC growth is a very important driver of that long-range plan. So the drivers were pretty broad-based that really start with brand.\n\nWe saw continued strengthening of the brand and brand perception in all of those major markets. Our own internal brand studies show really good trajectory. And if you kind of look externally, if you follow kind of Google Trends and that kind of stuff by market, you can see that from an external perspective. So the brand is in really great shape and continuing to strengthen.\n\nAnd then I think very specifically, if you remember through the pandemic, we really kept our distributors very lean on inventory. And they're starting to build their inventories again, seeing strong growth and anticipating strong growth. So distributors were important. But we also saw strong growth from major wholesale partners and strong digital growth.\n\nSo it's really very broad-based both across Asia and across EMEA. I think we also called out in our prepared remarks, despite COVID lockdowns and a very difficult environment to operate in China, we continue to see green shoots in the China market, and in fact, have 30% plus growth in Q3 in that market of a small base. And then from a HEYDUDE perspective in terms of international, we're going to sort of put our toe in the water next year with international. We think it's an important part of the long-term growth trajectory for HEYDUDE.\n\nBut we're going to start with some presence in Europe. We're going to focus on really two major countries, the UK and Germany. Those will be direct markets where we'll go direct to two major brick-and-mortar wholesalers. And we will also start a number of major distributors out of our kind of European headquarters.\n\nSo that's really our toe in the water for international. We've been preparing the groundwork doing some research, etc. We're very optimistic about that. But we want to make sure that we set the brand up for success.\n\nAnd we do that in a very disciplined and sequential fashion.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nGot it. Given that a somewhat significant portion of the growth of the Crocs brand specifically came from distributors, and my understanding is that's much lower-margin business, how much did the channel shift negatively impact your gross margin in Q3?\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nYeah. That's a great question, Laura. We did see strong distributor growth. But we also saw strong direct market growth.\n\nAnd our direct-to-consumer growth was very, very strong. So actually, the mix shift was pretty flat overall, just because direct to consumer was so strong in the quarter.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nAwesome. Thank you.\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. And the next question comes from Jim Duffy with Stifel.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nThank you. Good morning. Thanks for taking my questions. A quick question on the HEYDUDE guide, then a couple of questions on average selling prices.\n\nWith respect to HEYDUDE, results very strong in the third quarter, clearly good momentum. I was surprised you didn't increase the guide for the HEYDUDE brand. Is that your typical conservatism, other product inventory flow challenges, or is it seasonality that we're seeing in the implied fourth quarter guide?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nYeah. I think a couple of things I'd say about that, Jim. I think one of the things we did call out as we look into next year when we initially bought the brand, we wanted to make sure that everybody understood. This was a scale business.\n\nAnd we said, look, the brand we think could be more than $1 billion by 2024, when in fact it's sort of pretty obvious that we will achieve that next year. So we'll achieve that kind of $1 billion mark by 2023. And I think if you look across sort of footwear brands, historically, it'd be one of the faster brands in terms of time from kind of zero to $1 billion. So it's obviously a very high-growth brand.\n\nAs we look specifically at the fourth quarter, look, we've never owned this business through the fourth quarter before. We can look at the historical performance, but a lot is different from how it was back then. So we believe it's just sensible to be prudent, I would say, versus conservative. And we'll see how the brand performs through the fourth quarter.\n\nWe don't have great intelligence. And obviously, it's a bit of a different consumer shopping environment. So I think we're just being prudent in terms of how we manage it. And I think the third thing that I call out is we are a little bit infrastructure constrained from a HEYDUDE perspective.\n\nTheir warehouse and facilities that we bought or took over in the Las Vegas area are very small. We've done our best to expand them in the short term. But there will be restricted in terms of how much we can grow the business based on that infrastructure. But we have signed a lease for a substantively bigger facility, which will also be in the Las Vegas area, and that will open likely in the fourth quarter of next year.\n\nSo we've also just got to make sure we kind of manage the business within the constraints that we have.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nThank you. And then, Andy, I get a lot of questions around customer overlap between Crocs and HEYDUDE from your DTC data files. Can you share what you see in terms of Crocs and HEYDUDE brand customer overlap?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nYeah. I think I talked a little bit about this maybe last quarter. As we look at -- if you look at the HEYDUDE consumer, they clearly have Crocs in their closet, right? So there is definitely a customer overlap. But they are buying the shoes for a different purpose, right? They see the wearing occasions as distinct.\n\nSo we don't today see a lot of trade-off between the brands and consumer purchasing. But the customers do own -- the HEYDUDE customers do own Crocs. They have a higher share of their closet than the average consumer. As we look at where we think HEYDUDE is taking share from, because obviously, it's taking a lot of share in the marketplace, there are discrete brands that we can see that are clearly losing share.\n\nAnd then we also think that there is a little bit kind of in lower end athletic when you look at the $60 price point for sort of an athletic shoe, which is really just a casual shoe from the consumers' perspective, we think we're taking share of that. So yes, there is overlap but the consumer is purchasing for different wearing occasions.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nOK. And then last one, if I may, thinking about average selling prices. First, can you give us a simplified or tidy way to think about the timing and amount of price increases in international markets? And then related to average selling prices, maybe speak to key product drivers looking into spring 2023 and the expected product mix influence to ASP?\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nYeah. Hi, Jim. So within the quarter, our ASPs were down and that was basically currency, right, with the majority of that decrease. We also talked about in prepared remarks that North America promotions were up, forcing down ASPs a little bit in the U.S., and that was offset by overseas markets.\n\nAnd that was price increases that we've taken previously as well as just continue to pull back in discounts, especially in Asia, as we see the brand really gained traction there similar to what we saw in North America a few years ago. I think those dynamics are -- we don't have any large price increases that we've announced from a Crocs standpoint. So I would say, right now we look at pricing market, we try to understand where the consumer is going. But overall, we feel like we offer a really compelling value both domestically and internationally at the price points we're at.\n\nAnd then from a mix perspective, I'll let Andrew talk about that and what he anticipates for next year.\n\nAndrew Rees -- Director and Chief Executive Officer\n\nYeah. I think there's probably puts and takes hopefully netting to essentially flat, right? So we are introducing a range of products that are at a higher price point. We've got a number of clogs that are higher price point. We recently introduced the Echo, which is performing extremely well in specialty channels and also on our DTC channels.\n\nAnd that's at a higher price point. But also as we increase sandal penetration, that's at a slightly lower price point. So I think there's puts and takes and we feel like that kind of puts us in a good position.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And the next question comes from Mitch Kummetz with Seaport.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nHi. Thanks for taking my questions. On the margins, Anne, I know you don't really want to commit to your gross margin for Q4. But I guess what jumps out at me is the 21% to 23% op margin, that's down quite a bit from what it's been trending through the first part of the year, also on a year-over-year basis is expected to be down a lot more.\n\nSo if gross margin -- let me ask it this way. Is there anything on the SG&A side that we should be thinking about less leverage, more spending that would create such a big difference in the op margin?\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nYeah. I think it is better to look at full year and long term. Our full year rate is far and away best-in-class adjusted 27. We're really pleased with that.\n\nAnd our long-term rate is still 26 plus. So I wouldn't get too wrapped up in one quarter's dynamic. And I think we're really confident that we're going to continue to take share in Q4 and deliver those 26% plus long-term operating margins.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. And then just a couple of quick questions on HEYDUDE. I'd back into $233 million, $quart273 million for the fourth quarter, and I appreciate that this is your first Q4 owning the business. But I am curious.\n\nI know that Q3 was up 87%. That implied range for Q4. Do you know how much that is up year over year versus pro forma Q4 last year?\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nYeah. It definitely decelerates. I want to say offhand, it's between 20% and 30% around those ranges from a pro forma perspective. But I will just point out, as Andrew mentioned, especially with holiday, that's a very big direct to consumer, right, where we sell directly to the consumer.\n\nAnd as we mentioned, we have logistics constraints with our DC. So we announced that we're opening up a new distribution center in Las Vegas, but that won't be ready until Q3 next year. So we are fighting kind of through logistics as well for Q4.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. And then lastly on HEYDUDE, Andrew, could you talk a bit about the difference in performance men's versus women's? I don't know if you're seeing much difference in how that's doing. And also kids, I talked to some retailers that seemed to be adding kids later in the year that didn't already have it. So could you talk a little bit how that's developing?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nI couldn't get the last part of your question, Mitch. You said, you talked to some retailers --\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nThat seemed to be adding kids in the back half of this year or for holiday that didn't seem to have it before. So it feels to me like maybe that's a newer business on HEYDUDE. Could you talk a little bit about that development?\n\nAndrew Rees -- Director and Chief Executive Officer\n\nYeah. So look, we're learning a tremendous amount about this brand as we go along, right? We are seeing probably greatest strength on the men's side of the business through the summer. We've seen good performance on the women's side of the business. But we've also seen a couple of soft spots [inaudible] very clearly what they were caused by and we think it's essentially around product and some of the textiles and some of the product that go to market.\n\nWe think the brand has tremendous resonance with women, but we need to kind of enhance the product range there a little bit. Our vision is that the HEYDUDE brand will continue to be men's, women's, and kids brand. And we will be merchandizing and generating product to achieve that. But definitely I think historically, we've seen men's business perform a little bit better than women's.\n\nKids has always been a good part of the business. But yes, we are expanding distribution to some key retailers and adding kids to the portfolio. So you've seen that and will continue to see that.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nGreat. All right. Thanks. Good luck.\n\nAndrew Rees -- Director and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And this concludes the question-and-answer session. Now I'd like to turn the floor to management for any closing comments.\n\nAndrew Rees -- Director and Chief Executive Officer\n\nI'd just like to thank everybody for joining us on the call today and their continued interest in our two incredible brands. So thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCori Lin -- Vice President, Corporate Finance\n\nAndrew Rees -- Director and Chief Executive Officer\n\nAnne Mehlman -- Executive Vice President and Chief Financial Officer\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nAbbie Zvejnieks -- Piper Sandler -- Analyst\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nSam Poser -- Williams Trading -- Analyst\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nMore CROX analysis\n\nAll earnings call transcripts"
}