{
  "companyName": "Zoetis",
  "companyTicker": "ZTS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/zoetis-zts-q3-2022-earnings-call-transcript/",
  "content": "Zoetis (ZTS -1.08%)\nQ3 2022 Earnings Call\nNov 03, 2022, 8:30 a.m. ET\n\nOperator\n\nWelcome to the third quarter 2022 financial results conference call and webcast for Zoetis. Hosting the call today is Steve Frank, vice president of investor relations for Zoetis. The presentation materials and additional financial tables are currently posted on the investor relations section of zoetis.com. The presentation slides can be managed by you, the viewer, and will not be forwarded automatically.\n\nIn addition, a replay of this call will be available approximately two hours after the conclusion of this call via dial-in or on the investor relations section of zoetis.com. [Operator instructions] It is now my pleasure to turn the floor over to Steve Frank. Steve, you may begin.\n\nSteve Frank -- Vice President, Investor Relations\n\nThank you, operator. Good morning, everyone, and welcome to the Zoetis third quarter 2022 earnings call. I am joined today by Kristin Peck, our chief executive officer; and Wetteny Joseph, our chief financial officer. Before we begin, I'll remind you that the slides presented on this call are available on the investor relations section of our website and that our remarks today will include forward-looking statements and that actual results could differ materially from those projections.\n\nFor a list and description of certain factors that could cause results to differ, I refer you to the forward-looking statements in today's press release and our SEC filings, including, but not limited to our annual report on Form 10-K and our reports on Form 10-Q. Our remarks today will also include references to certain financial measures, which were not prepared in accordance with generally accepted accounting principles or U.S. GAAP, a reconciliation of these non-GAAP financial measures to the most directly comparable U.S. GAAP measures is included in the financial tables that accompany our earnings press release and the company's 8-K filing dated today, Thursday, November 3, 2022.\n\nWe also cite operational results, which exclude the impact of foreign exchange. With that, I will turn the call over to Kristin.\n\nKristin Peck -- Chief Executive Officer\n\nThank you, Steve, and welcome, everyone, to our third quarter earnings call for 2022. While the world faces a dynamic external environment and uncertainty in the global economy, our business has been tested and continues to perform well based on our diverse durable portfolio and global footprint. In the third quarter, we delivered solid results with 5% operational revenue growth, reflecting steady performance across our innovation-driven companion animal portfolio especially in our international markets. Our international business grew 8% operationally and the U.S.\n\ngrew 2% in the quarter. As we've been saying for some time, supply challenges throughout the year remain a headwind to meeting global demand, and those impacts were more pronounced in the third quarter. Supply has been improving in certain product categories such as parasiticides, and we continue prioritizing supply for key products and markets. However, we do expect constraints in some categories to continue.\n\nOverall, positive pet care trends in terms of increasing spend and pet owner demographics continue to underpin the strength of our business. With 10% operational growth in companion animal products in the third quarter, we continue to see strong demand globally for Simparica Trio and other parasiticides, our key dermatology products, Apoquel and Cytopoint, small animal vaccine and monoclonal antibodies, Librela and Solensia. In the U.S., supply constraints for companion animal products tempered some of our expected growth in the quarter, and we also experienced an impact related to workforce challenges in veterinary clinics. The decline in clinic visits is stabilizing at pre-COVID rates as clinics struggle with capacity issues.\n\nThat being said, average revenues per visit continue to rise in the U.S. as pet owners plays a premium on the care of their pets, a positive long-term trend. This commitment to pet well-being is also demonstrated in the success of our monoclonal antibodies for osteoarthritis pain, Librela and Solensia. They are performing exceptionally well in the EU and Solensia is on track after being launched in the U.S.\n\nat the end of the third quarter. We are investing in building a fee line market for pain treatment and undertreated condition for cats. Outside of the U.S. companion animal products showed strong growth of 17% operationally.\n\nIn some of our largest markets like China and Australia, we're seeing our innovative pet care products contributing more and more to growth in these traditionally live stock-driven markets. Meanwhile, our global livestock business performed largely as expected in the third quarter, with a decline of 3% operationally. We continue to face generic competition for livestock products, especially in cattle and poultry, and we face supply constraints in products such as vaccines. However, we are seeing solid pockets of growth, especially in aquaculture and poultry products and certain markets outside the U.S.\n\nAs we stabilize from the generic competition, and review more consistent supply, we will improve our livestock performance. Looking ahead, we remain confident in the innovation-driven strength of our business especially in areas such as parasiticides, key dermatology products, vaccines and monoclonal antibodies. I am optimistic about the fundamental growth drivers and essential nature of the animal health industry to weather challenging times. However, we are revising our full year guidance to affect lower-than-expected sales in the second half of the year due to supply constraints, veterinary workforce challenges and recent changes to foreign exchange rates.\n\nWe believe it is prudent to take a more cautious view given the increasing uncertainty around supply, inflation and other macroeconomic conditions that have become less predictable. As we look ahead, to our tenth anniversary as an independent company next year and I reflect on all that we've achieved in the last decade. I feel very positive about where we are and the capabilities we have to overcome any challenges we face. Historically, we've always been able to adapt our business to meet evolving customer needs, drive growth faster than the market and achieve our purpose in nurturing the world and human kind by advancing care for animals.\n\nThe human animal bond and people's connection to pets and farm animals is powerful. It's a bond we support with a diverse portfolio that remains the strength of our business, and we see strong global demand for innovative products, especially in companion animal parasiticides, dermatology, vaccines, diagnostics and monoclonal antibodies for pain. Positive pet owner demographics and their willingness to spend on the care of their animals remain long-term sustainable drivers of growth despite some of the workforce challenges in clinics and livestock continues to be an important part of our business, an area where we drive significant value for our customers and shareholders. To sustain our growth, innovation remains our lifeblood, and we continue investing in the industry's leading R&D engine at Zoetis.\n\nOur monoclonal antibody portfolio for OA pain is a game changer. It has been performing exceptionally well as a pet treatment and growth driver in an increasing number of markets, and Librela is expected to be a blockbuster for Zoetis in 2022. In terms of the U.S. approval for Librela, we have confirmed dates for the FDA site inspections outside the U.S., but their timing makes it unlikely to have an approval this year.\n\nGiven our ongoing conversations with the FDA, we are confident in receiving approval in the first half of 2023 with a launch planned for late in the year. In closing, our business continues to perform well in a dynamic market and we are well positioned to advance our strategic growth opportunities in parasiticides, dermatology, pain, diagnostics and emerging markets. Even as we face challenging supply constraints, generic competition and macroeconomic uncertainty, I remain confident in the resilience of our business and colleagues as we finish 2022 and we go into 2023. Given the importance of the companionship and nutrition provided by pets and farm minimals and the power of the human animal bond, the animal health industry has consistently grown in the mid-single digits even in down markets.\n\nAnd as the leader in animal health, we have the pipeline, market leadership positions, global scale and financial strength to continue outpacing the market. Throughout the last 10 years in various market conditions, we have grown the top line an average of about 8%. And even in the last recession, when our business was more livestock than companion animal, we still grew. As we look toward the end of the year and into 2023, I expect us to continue setting the bar on innovation, cultivating a high-performing culture and delivering superior customer experiences.\n\nAll of this will have us growing significantly above the market and building enduring value for shareholders in this dynamic market. Thank you. Now, let me hand things over to Wetteny.\n\nWetteny Joseph -- Chief Financial Officer\n\nThank you, Kristin, and good morning, everyone. As Kristin mentioned, we had a solid quarter with growth across a number of our core franchises, driven by our companion animal performance, especially in international. Today, I will focus my comments on our third quarter financial results. The key drivers contributing to our performance and provide an update on our full year 2022 guidance.\n\nIn the third quarter, we generated revenue of $2 billion, growing 1% on a reported basis and 5% on an operational basis. Adjusted net income of $566 million declined 5% on a reported basis and grew 2% on an operational basis. Of the 5% operational revenue growth, 4% is from volume and 1% from price. Volume growth consisted of 4% from new products, which includes Simparica Trio and monoclonal antibodies, for osteoarthritis pain in dogs and cats, Librela an Solensia and 1% from key dermatology products, while other in-line products declined 1%.\n\nThe decline was largely the result of supply challenges. Companion animal products continue to be the primary driver of growth, growing 10% operationally, with livestock declining 3% on an operational basis in the quarter. Simparica Trio was the largest contributor to growth in the quarter. Trio posted global revenue of $172 million, representing operational growth of 43% versus the comparable period in 2021.\n\nWe expect to continue to grow the addressable market for flea, tick and heartworm globally and see significant room for growth with brands like Simparica Trio, Simparica, ProHeart and Revolution Plus. Meanwhile, our key dermatology products: Apoquel and Cytopoint had solid global growth, especially internationally, with $343 million of revenue, representing 11% operational growth against a robust prior year in which these products grew 26% operationally. Year-to-date revenue is $966 million, representing 18% operational growth. Sales of our monoclonal antibodies for osteoarthritis pain in dogs and cats in international continue to exceed expectations posting $37 million of sales in the quarter.\n\nSwitching to Diagnostics. Our global companion animal diagnostics portfolio recorded $78 million in revenue in Q3, declining 9% operationally. Despite declining revenues, we saw solid new instrument placements in the quarter. The decline in our U.S.\n\ndiagnostics portfolio was partially offset by growth internationally into the quarter. In the U.S., our diagnostics results were also impacted by the vet clinic workforce challenges, and we continue to experience a slowdown in sales as we transition to our new go-to-market model and build out a sizable and new dedicated field force for diagnostics. While disruptive in the short term, this investment is putting the necessary elements in place to position and grow our diagnostics portfolio over the long run. We expect the effectiveness of our new diagnosis field force to improve gradually into 2023.\n\nDiagnostics remains core to our business and a key long-term growth driver for Zoetis. Meanwhile, sales of livestock products declined by 3% operationally in the quarter. Our portfolio continues to be challenged by generics and cheaper alternatives to DRAXXIN in cattle as well as Zoamix in poultry and supply challenges for certain products. Our fish portfolio grew 19% operationally in the quarter and along with the strength of our sheep products in Australia, partially offset the broader decline.\n\nNow, moving on to revenue growth by segment for the quarter. U.S. revenue was $1.1 billion in the quarter, growing 2% with companion animal sales growing 6% and livestock sales declining by 7%. Focusing first on companion animal.\n\nThe effects of our ongoing supply challenges were more pronounced in the third quarter, tempering growth in our parasiticides. In U.S. companion animal, we are also seeing vet clinic workforce challenges limiting appointment availability as visits declined 4% in the quarter. Despite lower visits, parasiticide revenue is growing approximately 5% and as spending per visit remained strong again this quarter, increasing more than 9%.\n\nThe decline in clinic visits is stabilizing at pre-COVID levels as the impact of higher pet ownership growth rates due to COVID normalize and vet practices deal with workforce challenges. However, underlying demand for veterinary care remains robust throughout the country, even as people return to work. While vet clinic workforce challenges do exist, we believe vet clinic revenue will continue to grow at levels above what we were seeing prior to COVID as the standard of veterinary care continues to increase through innovation, better pet ownership demographics, higher compliance and more pets. Even with the robust comparative year, we continue to see volume growth in our companion animal products, driven by our innovative products, such as Trio and our key dermatology products, Apoquel and Cytopoint.\n\nGrowth of Simparica Trio was again strong in the quarter with sales of $157 million in the U.S., growing 43%. Despite the impact of supply constraints and the vet clinic workforce challenges, we continue to take share within individual clinics. These dynamics will provide additional runway for future expansion of both the broader market and revenue growth for Trio. Key dermatology products sales in the U.S.\n\nwere $231 million for the quarter, growing 6% with Apoquel and Cytopoint each contributing to growth. Year to date, our U.S. derm portfolio has grown 12%. Growth is tempered by prior-year COVID-related spikes in derm visits that drove visit growth of 25% in Q3 2021 and help accelerate market expansion.\n\nThis growth was also impacted by the ongoing pet clinic workforce challenges. We expect continued expansion of the market for the foreseeable future. U.S. livestock declined 7% in the quarter as expected, with sold of cattle products impacted by generic competition for DRAXXIN.\n\nMeanwhile, our U.S. poultry portfolio continues to be negatively impacted by the expanded use of lower cost alternatives and generic competition for Zoamix. U.S. swine product sales declined 3% in the quarter, driven primarily by increased competition for vaccines.\n\nMoving on to our international segment, where revenue declined 2% on a reported basis and grew 8% operationally in the quarter. International companion animal revenue grew 17% operationally and livestock revenue was flat operationally. Increased sales of companion animal products resulted from growth of monoclonal antibodies for elevation of osteoarthritis pain, our key dermatology products and Simparica Trio. We remain excited with the long-term prospects of these innovative brands and expect future direct-to-consumer advertising to help drive additional growth.\n\nSales of companion animal vaccines also contributed to growth in the quarter. We continue to be pleased with the performance of our monoclonal antibodies for OA pain with Librela generating $31 million and Solensia delivering $6 million in third quarter sales. Librela remains on track to exceed $100 million in revenue this year, a new blockbuster for Zoetis. As we have mentioned in prior quarters, Librela is the No.\n\n1 pain product in the EU with the underlying performance metrics being very favorable for future growth. Reordering rates remain high. Compliance continues to exceed our initial expectations and we continue to see significant opportunity to expand the pain market with a meaningful percentage of dogs on Librela being new to the market. We saw volume growth in our international companion animal portfolio in the third quarter and we also saw growth across our injectable products, including monoclonal antibodies and vaccines.\n\nMeanwhile, international livestock was flat operationally in the quarter. Our fish portfolio grew 19% operationally and experienced increased demand for vaccines in key salmon markets, including Norway and Chile. Sales of ship products grew as a result of favorable market conditions and new product launches in Australia. Growth was offset by swine sales, which declined due to supply constraints across international and lower sales across Europe due to reduced exports to China and higher input costs for producers.\n\nSales in Brazil also declined as we are seeing supply challenges on cattle products. Additionally, inflationary impacts on consumer spending are driving consumption away from beef to lower-cost animal proteins such as pork and chicken and reducing reducer profitability. Lastly, the Jurox acquisition, which is based in Australia, was completed on September 30 and is not reflected in our Q3 results. Now, moving on to the rest of the P&L for the quarter.\n\nAdjusted gross margins of 69.8% decreased 90 basis points on a comparable basis to the prior year, resulting primarily from unfavorable foreign exchange impacts. Operationally, gross margin slightly declined driven by higher manufacturing, freight and other costs, which were largely offset by favorable mix and price. Adjusted operating expenses increased 3% operationally with SG&A growth of 3% operationally, driven by T&E costs beginning to return to pre-COVID levels as well as freight and logistics. R&D expenses increased 4% operationally due to higher compensation costs and higher operating costs.\n\nThe adjusted effective tax rate for the quarter was 20.9%, an increase of 420 basis points due to unfavorable changes to the jurisdictional mix of earnings, including decreased favorability related to foreign-derived intangible income in the prior-year period. And finally, adjusted net income grew 2% operationally and adjusted diluted EPS grew 4% operationally for the quarter. Capital expenditures in the third quarter were $154 million. In the quarter, we repurchased approximately $375 million vet shares and returned over $0.5 billion to shareholders through a combination of share repurchases and dividends.\n\nYear to date, we have repurchased almost $1.2 billion of Zoetis shares. Now, moving on to our updated guidance for the full year 2022. For operational revenue growth, we are lowering our growth to 7% to 8%, previously 9.5% to 10.5%. We are also lowering our operational growth expectations for adjusted net income to a range of 9% to 11%, previously 11% to 13%.\n\nThis change in guidance is reflective of our Q3 results continued to impact from supply challenges and the ongoing vet clinic workforce challenges. Foreign exchange rates on our updated guidance are as of late October and reflect the continued strengthening of the U.S. dollar. Beginning with revenue for the full year 2022 due to lowering of our guidance and the impact of foreign exchange, we are now projecting revenue of between $8.0 billion and $8.075 billion.\n\nWe lowered our operating expense guidance for the full year, reflecting lower expenses in both Q3 and Q4, which reflects our ability to manage costs. Additionally, it is worth noting that our expected Q4 expense decline is also impacted by an easier comp due to heavy spending in the fourth quarter last year. Additionally, our guidance for adjusted interest expense and OID was changed to reflect favorable changes to interest income. We now expect adjusted net income to be in the range of $2.27 billion to $2.31 billion.\n\nAnd finally, we expect adjusted diluted EPS to be in the range of $4.83 to $4.90 and reported diluted EPS to be in the range of $4.51 to $4.59. While lower -- our full year 2022 guidance once again reflects our value proposition of growing revenue in line with or faster than the market and growing adjusted net income faster than revenue over the long term. Our success will continue to come from our diversified portfolio of enduring brands driven by multiple sources of in-line growth, productive innovation and our infrastructure to develop and expand market globally. We expect to continue to execute across multiple dimensions of our business and capitalize on key growth opportunities for the foreseeable future.\n\nNow, I'll hand things over to the operator to open the line for your questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] We'll take our first question from Erin Wright with Morgan Stanley. Please go ahead. Your line is open.\n\nErin Wright -- Morgan Stanley -- Analyst\n\nGreat. Thank you for taking my question. So when we think about some of these headwinds and tailwinds related to 2022, what is now proving to be more challenging than anticipated? Is it mostly the supply chain issues or is it other factors here? And can you quantify the supply chain constraints, what sales would have been excluding these dynamics? And then how should we think about those broader headwinds and tailwinds from an operational perspective into 2023 as we think about both livestock in companion animal, should low single-digit livestock growth in 2023 be the right way to think about it? And then if that's the case, how do we think about companion animal operational growth in 2023? And I'll stop there. Thanks.\n\nKristin Peck -- Chief Executive Officer\n\nSure. Thanks, Erin. I'll start and I'll let Wetteny build on this one. I mean I think the first thing to start with is fundamentally and structurally the veterinary business and importantly, demand for our products remains stronger than it was before COVID.\n\nI think we've got still a very healthy business. If you look at sort of the headwinds as we looked at the second half of this year, by far, supply was the biggest -- and I'll let Wetteny comment on sort of sizing them I would say that was the significant driver for us in Q3. And as we look into Q4, I mean, certainly, we can talk about vet clinic visits as well. But I think for us, we really believe that the supply issues that we were facing were really the primary driver for us.\n\nAnd as we look into 2023, I think the really good news around that is -- as we look at the ones we faced this year, as we talked about supply from the beginning of the year, we had mAbs issues. We worked through that. We're now in full supply on our mAbs in all the markets that we've launched in. So I think that one is one we've addressed.\n\nWe did have paras challenges in Q2, Q3, honestly, our supply came into late in Q3 and I think if you look at Simparica Trio in particular, our competitors took advantage of stock selves. And so it's taken us a little longer to get back on shelf than we had hoped. But again, I think the paras problem will work itself out as you look into Q4. We have challenges as well in Rev and for Rev and Simparica, Q3 is a really important quarter for us.\n\nAnd so I think you saw that. I think, again, the really good news is demand remains strong for these products, and we've addressed most of those supply issues. There'll be some small ongoing ones, as you know, in our industry, Erin, you followed us a long time. We always have challenges around vaccines.\n\nWhen you supply as many products as we do across as many species globally. There's always some level of it, and some of those will continue into next year. But we're really confident that the biggest challenges we were anticipating this year around mAbs have been addressed. As you look at paras, both Trio and Rev, we'll work through that by the end of this year.\n\nWe have really clear plans in place. I mean, obviously, there'll be some ongoing one in vaccines, but that's more usual course. But Wetteny, do you want to sort of get for second and third questions?\n\nWetteny Joseph -- Chief Financial Officer\n\nYeah, sure. Erin, as we've been saying throughout this year, supply certainly remains a headwind to meeting global demand. And as Kristin mentioned, the timing of recovery on some of these is very important. So as we went throughout the year and face supply constraints, particularly in Trio, despite the fact that Trio has performed really well for us, growing 65% on a year-to-date basis.\n\nThe reality is we had outages throughout the peak parasiticide season for Trio to Q2 and Q3, though we recovered late in Q3, the impact was such that we allowed competitors to be more aggressive about placing products on shelves, which we saw that impact as we exited Q3. But going forward, we do anticipate, continuing to see some impact for Revolution, Revolution Plus, where we are selectively looking at key markets to deliver those products against others. So that is something that we're carrying into the fourth quarter, and we have reflected in the guidance that we have issued today. So while our business faces other impacts outside of supply, whether it's workforce or macro in certain markets.\n\nBy far, the supply constraints are the biggest impact here, looking at how we've seen the year sort of transition versus what we saw earlier. And so if you look at the guidance change here of about $200 million reduction in guidance, I would say, FX and supply account for more than 75% in that with supply being by far the largest majority of that.\n\nOperator\n\nWe'll take our next question from Michael Ryskin with Bank of America. Please go ahead.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. I want to have a quick follow-up on that last point and then touch on something else. So on the supply issues, I think a lot of what you just commented on, Kristin, and Wetteny was that as you guys have these challenges in the quarter, your competitors took advantage of shelves.\n\nHow should we think about that longer term? Is that a temporary switch over? Meaning can you gain that back once you resolve especially some of the older products revolution, but also Trio, whether that happens this quarter or next quarter, are you going to be able to push those competitors out of those positions easily? Or is that something is going to be a little bit more of a challenge to regain your footing there? And then I also want to touch on Librela approval. It seems like that time line has slipped a little bit with the OUS inspection date. I'm just wondering how does that change your launch expectations and ramp expectations in the United States. I mean you talked about second half '23 or later in 2023 launch.\n\nSo just walk us through the dynamics there. Thanks.\n\nKristin Peck -- Chief Executive Officer\n\nSure. I'll start and I'll let Wetteny build on this one. As you think about competitors, yes, I am very confident that we will get our shelf space back, and there's -- this is -- I very much see this as temporary. We're not worried as Wetteny said, this product is really well received by our customers and by pet owners.\n\nIt's growing 65% on the year. So I am very confident we will get that back. So I do see that absolutely as temporary. So I think the other important thing here as we look at Simparica Trio, in particular, is that when it comes to competition, the latest update we have is we are no longer expecting competition early in 2023 based on what we're hearing.\n\nAs always, this is hard as a private company, and no one gives us much information on some of the private companies here and that a lot of them are not public, but our basic intelligence at this point is we don't see something launching against us as well early in the year, and we'll clearly leverage that opportunity to gain share as well. So I think that is also incremental news as we think about Trio. And when it comes to Librela, I mean, obviously, we were hoping for an approval this year, depending on when we get it next year, we just have to -- everything moves based on what that is. So we're still obviously hoping for a launch as we expected.\n\nBut without knowing the exact timing of the approval into next year, it just moves proportionately, as you probably know. So I think that's just the only incremental news there. We're confident well, no matter what, we'll get a launch next year. But the timing of it is just we'll have to update it once we get the final approval on that.\n\nI don't know, Wetteny, did I miss anything there?\n\nWetteny Joseph -- Chief Financial Officer\n\nI'll just add a couple of points on Trio. Look, if you look at combination, flea, tick, heartworm, it's still a relatively new standard of care. And what you continue to see is in this very important part of the market, which is north of $5 billion globally. This expansion going from topicals and all -- topicals and collars into orals.\n\nAnd then now with triple combinations, we'll continue to expand that into the market and grow the market as well. So even with competition, we expect to continue to grow. So this dynamic that we described that occurred as we exited Q3 -- between Q2 and Q3, we see that as a temporary effect, and we'll continue to drive our share here. And particularly since we are not anticipating a delay in terms of competition, though it's hard to say exactly when it will come.\n\nIt could come in '23, but we don't expect it early in the year. With respect to Librela, what I would say is we continue to be extremely pleased and the product continues to perform better than our expectations across Europe. And though we've had capacity constraints that didn't allow us to be able to take full advantage of demand this year. And we've had to actually make trade-offs in terms of delaying launches in other markets.\n\nAs we exit the year, we anticipate next year being able to launch the product in additional markets outside the U.S. and outside of Europe. And the product, again, continues to perform really well for us. So we're very pleased with that.\n\nAnd so this sort of delay in terms of when the actual approval will happen in the U.S. given the dynamics we're seeing in terms of the expansion of 40% of the dogs that have been put on the product and new to the market. The less of time duration of use of the product, etc., all bode well for sort of continued growth in this area and expansion of the pain market beyond the timing of the launch, etc.\n\nOperator\n\nAnd we'll take our next question from Nathan Rich with Goldman Sachs. Please go ahead. \n\nNathan Rich -- Goldman Sachs -- Analyst\n\nGreat. Thanks for the questions. I had a follow-up on the supply constraints as well. Wetteny, it seems like based on your commentary on the second half revenue revision, the supply constraints would be something like a 200 to 300-basis-point impact on second half volumes.\n\nI just wondered to see if that number is in the right ballpark. And as we think about the go forward, will there be a headwind in 4Q? It sounded like those -- a large majority of the constraints that may have been resolved by the end of the third quarter. Just wanted to see what we should expect for the third -- for the fourth quarter, excuse me. And then into 2023, would you anticipate there to be any lingering supply constraints or should everything be resolved at that point? Thank you.\n\nWetteny Joseph -- Chief Financial Officer\n\nYeah. So look, what I would say is supply issue is not unique to us given the wide variety of products and species. It's relatively commonplace in this industry, as I've learned coming in about a year and a half ago. I think the level that we're seeing now is certainly elevated over the last couple of years.\n\nAnd in particular, we saw more of an impact here in Q3 given the timing of our recovery on some of these, right? So I do think we expect to see some continued impact into Q4, but we reflected those in the guidance that we just issued today. I mentioned Revolution, for example, being one of them and quite frankly, throughout the years in the mAbs where we are confident in our ability to fulfill demand next year, not only in Europe but other markets outside of Europe, we've made trade-offs in mAbs even between, for example, Cytopoint and Librela, right? So I do think those impacts have had their effects on this year. But as we go into next year, we're confident in those. I think vaccines is an area that you typically see certain supply constraints in and challenges, and I think we'll continue to see those into 2024 and as we exit the year, we'll continue to make progress on evolution, but it is certainly having an impact on the fourth quarter as well is what I would say.\n\nOf course, we'll have a lot more color to provide on the next call with respect to 2023, but we feel confident on the biggest products that have the greatest impacts. If you look at Trio from a parasiticide perspective, confidence in terms of supply going into next year. And for our mAbs, particularly Librela launches, etc., and for Cytopoint for next year, we feel very confident about that as well. So those are big movers for us going into '23.\n\nOperator\n\nWe'll take our next question from Louise Chen with Cantor. Please go ahead. Your line is open.\n\nLouise Chen -- Cantor Fitzgerald -- Analyst\n\nHi. Thanks for taking my questions here. So I wanted to ask you with the potential competition coming for some of your key products next year. Do you still think you can grow through those if they do come next year? And then second question I had for you is on innovation and livestock.\n\nWhen do you see that next phase of innovation and when will we possibly see growth getting beyond that sort of 3% to 4% that we've seen historically for a while? Thank you.\n\nKristin Peck -- Chief Executive Officer\n\nSure. Louise, in your first question with regards to competition, I think the good news is we're not expecting competition early in the year anymore on Trio. But regardless of when competition arises, I do think we'll continue to grow through this. If you look at this category, even when I thought Vaselines were introduced and you saw one then two then three this category grew we launched a triple combination, and we grew incredibly well.\n\nI think there was plenty of space here. Wetteny mentioned earlier, there's still movement from topicals and collars and this is a really innovative category. So I do believe you'll continue to see growth. As you look at dermatology, I would say the same thing.\n\nI think a competitor can help us continue to grow this market. There are still six million untreated dogs. The usage of this product in international is still significantly below that of the U.S. when you have the same number of dogs with the conditions.\n\nSo we continue to believe there is growth across these. Obviously, growth may decelerate in derm with a competitor, but I still think these are going to be growing markets. I think the innovation. And don't forget, we continue to look at life cycle enhancements for all of these products.\n\nWe are not stopping with what we have. So I think there's a lot of visibility into a competitor might come, but not necessarily some of the innovations in these key product categories that we'll continue to do. With regards to innovation and livestock, Wetteny, did you want to take that one with regards to growth rates?\n\nWetteny Joseph -- Chief Financial Officer\n\nYeah, sure. Look, I think if you look at livestock, as we said, this is a segment that has grown in the sort of 3% to 4% range historically. And given the impact that we're seeing from generic competition for DRAXXIN, Zoamix, etc., we've been performing below that. But as we sit here, if we, for example, were to pro forma out the DRAXXIN impact, you would see growth in our livestock business even in the quarter that we delivered a negative 3% on Q3, which is similar to last quarter.\n\nAnd so I think as we look to exit this year, I think livestock will be slightly below the performance you saw in Q3 given the intensification of some of the generic competition. But beyond that, as we look beyond out exiting '23 into '24, etc., we'll have to take a look at what the macro is. I think if you look at cattle in key markets across Brazil, and elsewhere in the U.S., we'll have to really continue to look at what the macro is. But in terms of innovation, we continue to make innovation that, quite frankly, you're not seeing the impact of them in the current year because of the impact of generic competition.\n\nSo if you look at innovation in terms of poultry with vector vaccines that we're starting to launch in the U.S. If you look at some of our slide vaccines that we're launching elsewhere, though, we've had some supply constraints in those as well. So you're not seeing the full effect of those. But beyond this year and beyond the generic competition is that sort of the supply, totally you'll start to see growth coming out of our livestock business.\n\nI just want to make one more point going back to derm. We don't -- last earnings, we said we don't see competition for derm in the first half of next year. Now three months later, there's still no new news, right? And so I think, as you know, in the space, it's not that we have specific data on what folks have. And so it's about a six-month time frame that we look ahead.\n\nAnd three months later, we still don't see anything. So it's not to say that we expect competition next year, it's just we don't have any data that says there will be any in the first half. So I just want to make that clarifying point as you asked the question around competition next year.\n\nOperator\n\nAnd we'll take our next question from Jon Block with Stifel. Please go ahead. Your line is open.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nThanks, guys. Good morning. I'll ask both upfront. I think the 2022 out margin was, I believe, largely unchanged despite the lower revenue.\n\nAnd Wetteny, you mentioned managing opex but I think you guys also wanted to invest, you've got some notable new opportunities in front of you. So how do we think about that? In other words, is this an opex push on the investment into 2023? Or should we still expect the bottom line growing decently above the top line next year 2023? And then Kristin, just to shift gears, can you just maybe elaborate a little bit on call it the company's line of sight into these supply constraints fully resolving in 2023. At least for me, it seemed like the Trio issue came as a little bit of a surprise. And maybe just a tack on to that, do we think of these sales has lost, fully lost or at least a portion push? Because I would think from a consumer to go from to a triple and then back to a duo, is there something where some of these can be recouped in the early part of '23? Thanks, guys.\n\nWetteny Joseph -- Chief Financial Officer\n\nYeah. So I'll take the first part of the question in terms of how we see margins and investments, etc. We've made a number of investments across the business, whether you look at what we're doing in R&D, where we've done with respect to our field force, and we'll continue to do across the diagnostics in our pet care field force, for example, in the U.S. We're making investments across our supply chain and manufacturing, obviously, given the demand we're seeing across our products and anticipated launches of other products out into the future.\n\nSo we'll continue to make those investments but we do have the ability to manage discretionary spend and you see that play out in the third quarter. Where opex was below top-line growth, and in fact, other than the tax rate difference to last year, if you look at our earnings before taxes, those grew at 8% on a 5% top-line growth. So you see that leverage playing out in the P&L. And we have the ability to continue to do that.\n\nAnd I think we'll continue to use price to drive margins. The mix is favorable to us, given companion animal continues to grow faster than livestock. So companion animal grew 10% in the quarter where livestock declined 3%. So that mix is favorable to us although we see some offset with respect to inflation and so on, but you continue to see those drivers, and we can anticipate those going into next year.\n\nSo we'll continue to make investments in select areas, again, prioritizing R&D prioritizing manufacturing and supply chain, for example, but we'll manage discretionary spend elsewhere to still deliver a leveraged P&L, which is what we've said. Now there may be quarters where that doesn't play out exactly. But I think if you look at a year, you will see us continue to do that. And that margin between top-line growth and bottom-line growth may be less than what the business naturally can do, but that's because we're making investments where we see the need, but we will still manage to deliver annually leverage P&L is our target.\n\nKristin Peck -- Chief Executive Officer\n\nAnd sure, I'll take your second question around visibility into supply resolution. When we started the year, like many companies across many different sectors, we knew supply challenges would be there waiting on things. As you look at ones where -- to your point, were we a little surprised by what happened with specifically Trio and Rev. I mean the honest answer is yes, we thought they would resolve faster.\n\nIt's not that we weren't aware this was a capacity issue. We needed to build capacity and specifically some of this at a third party. And honestly, getting that third party on took us a little longer than we expected. We set really an opex team over there to try to work on it and the timing of the resolution took us longer than we expected on that one.\n\nWhy am I have visibility to, why I say it's better because we're having a weekly call, I'm looking at their output on a weekly basis for both Revolution and Trio, and they're doing really well. I think they're delivering consistently. They're up and running. And so I have visibility, and that's why I have strong confidence.\n\nAnd also Wetteny has strong confidence that as we look in to resolve through Q4, we're managing through back orders right now. So we just got to get product out to market, and we're prioritizing the markets at -- biggest ones and right now, and we'll get it to everyone by the end of this year, early next year. But when you're back, a few months on a product like Rev Plus, for example, in markets where that's a huge product, it takes a little while to get them fully back in supply. And that's why we have full confidence we knew what the issue was.\n\nIt was capacity there. With Librela and Solensia, it was component parts, and we knew we were competing as well. That's why Wetteny was talking about, we were making trade-offs between products there. We have that in full supply.\n\nA lot of these were some were COVID-related. Some of these were capacity related and some were component parts related. It's been challenging for many companies to work through this. But we are as a leadership team managing this very carefully as Wetteny and I've said in the first and second quarter calls, constantly working with GMS, we have full visibility into what is happening for each of these products, and that's why we have confidence as to when they will resolve and when we'll get into full supply in key markets.\n\nSo hopefully, anything else, Wetteny?\n\nWetteny Joseph -- Chief Financial Officer\n\nYeah. Look, I just think one of the things that I've really learned in the last 18 months being in this space is it's not if you recover from a supply constraint is when you recover really matters. So we talk about that already in parasiticides from a season perspective. But that's true too across livestock.\n\nIf you look at gaining supply in time for fall cattle run in the U.S. is important. And so if you missed that window, you have a greater impact than you thought. So if you were planning to and executing toward the timing of that, and you cover a little bit later, that's where you start to see the impact.\n\nAnd I think that's what's played out here as we exit Q3 and why some of this might appear as a little bit of a surprise to you.\n\nOperator\n\nWe'll take our next question from Brandon Vazquez with William Blair. Please go ahead. Your line is open.\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nHi, everyone. Thanks for taking my question. I wanted to focus on, when you talked about 75% of the lowered guide was FX and some of the supply constraints. Maybe that smaller portion, the 25% that's left I think, was vet staffing issues.\n\nSo maybe can you talk a little bit about what kind of changed what incrementally maybe got worse in the vet staffing issues, how that's trending into the fourth quarter so we can kind of frame up how that might be a headwind as we go into '23? And really how -- what kind of confidence you have that it's not maybe a demand issue as macro conditions worse and it's really just a vet staffing issue? Thanks.\n\nKristin Peck -- Chief Executive Officer\n\nSure. I mean, look, I'll go back to where I started. If you look at demand at the vet clinic, there's no question that it is fundamentally remaining strong. Current staffing and vet visits is ahead of where it was pre-COVID.\n\nSo this is not like, Oh My God, everything went down, where are we going. It is a realignment. And I think what -- why are we confident in demand? Well, there are more pets I mean why we have a capacity problem is not actually that there are fewer visits, it's there are more pets than we had before as we saw the sort of pandemic boom. The pet parents are more millennials.\n\nThey spend more time on their pets, spend more money on their pets. They're more invested in the preventative care of their pets, which increases demand. So we remain very confident that demand is very strong. It has proved resilient through other challenging macroeconomic times.\n\nSo what we need to work with vets on is how to better leverage the techs and other ways to make sure that they can see as many pets as they possibly can. So we remain very confident this is not a demand issue. It is a capacity issue. We have to create more capacity than they had pre-COVID.\n\nThere's ways of doing this by helping them improve their productivity across the different spaces. But I mean just putting that in numbers, why are we confident? there --we're fine -- if you look overall right now, the spend per visit is up 9%, clinic revenues are up 5% in the quarter. We did see a 4% decline in vet visits, but that was over a quarter at unprecedented levels, if you look back to last Q3. So the veterinary industry is structurally and fundamentally in good shape.\n\nWe have to help them create additional capacity for all the new pets we have, but I think demand remains strong.\n\nWetteny Joseph -- Chief Financial Officer\n\nI would just say -- look, as I said earlier, there are other factors that impact our business. I mean you do see some macro in some select markets. So if I look at Brazil, for example, you see a trade down from beef to poultry and swine. If you look at China, we continue to see lockdowns impact consumption, particularly on the livestock side.\n\nBut if you look at companion animal performance, even in those markets, despite the significant lockdowns in China, you see strong double-digit growth in companion animal. We saw double-digit growth in companion animal even in Brazil despite the macro. So I do think this speaks to the resiliency of particularly on the companion animal side of the space, even in challenging macro areas. And then the other thing I'll say with respect to a very strong comp is, if you look at derm, our third quarter last year, derm grew 26% globally.\n\nIt was north of 20% in the U.S. And so when you have labor capacity constraints at the vet clinic being able to perform above that level of growth from a prior-year perspective becomes a challenge. So again, supply is by far the biggest challenge we faced all year and certainly in the third quarter. But the macro continues to be largely from a demand perspective, remaining strong.\n\nOperator\n\nAnd we'll take our next question from Chris Schott With J.P. Morgan. Please go ahead.\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks so much. Just a couple of quick ones here for me. I just want to come back to Trio.\n\nWith this competitor delay that you're talking about for early next year. I just want to make sure I'm clear. Is there going to be any supply issues as a rate limiter for growth of Trio in 2023 or was this more of a onetime issue in '22. So I guess can you fully take advantage of that delay in competition as we think about the spring season next year? And my second question was on the ongoing supply issues.\n\nI know this is -- in the near term, you can't do much about this. Is there an ability to either hold higher inventories or just think about supply differently kind of going forward to ensure that I guess, these issues don't happen again in the future and again, I know you can't deal with that in the 3Q, but just as we think about kind of 2023 and beyond? Or do you view this because in a moment in time where there's not much of an ability to manage this? Thanks so much.\n\nKristin Peck -- Chief Executive Officer\n\nSure. As you look at Trio for 2023, yes, we will be able to leverage the opportunity. Again, the challenge we had this year was getting new capacity online with a third party that took us longer than we expected. That is online and performing well.\n\nSo we remain confident going into next year that we can leverage that opportunity and certainly have plans in place to do so. And your second question was around -- what was your second question?\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nThe ability to manage inventory and so on to.\n\nKristin Peck -- Chief Executive Officer\n\nYeah. I mean, look, we're holding -- by the way, we have tried to do that already. If you look -- focusing on resilience and managing inventory better. If you look at our inventory, we've invested a lot in making sure that we have component parts as we see in our industry being out of stock has a significant cost for the company.\n\nSo we're certainly looking at how we can invest in that. But prudently, a lot of the buildup you're seeing right now is in raw materials and things like that to make sure we have on hand what we need to make it, and we're focusing that on our most important products. So you can manage a lot of this through inventory assuming you have capacity. But if you look at the biggest challenges we faced this year, it was getting on board capacity in key products and getting some of the component parts for things like mAbs.\n\nAnd we have figured that out, but -- in the sense of the mAbs, and we do have the capacity online. So you do -- you can definitely leverage inventory in certain cases, except when your challenge is capacity or a component part. But I don't know if you want to comment...\n\nWetteny Joseph -- Chief Financial Officer\n\nThe only thing I would say is, look, the actions we've taken this year will continue to execute against give us confidence in our ability to capitalize on the opportunity here with a delay from a competition standpoint. But what we've learned over the last two-plus years is things happen in this world, whether it's geopolitical and so on. So barring any sort of major events, we do feel confident with our ability to capitalize on this and execute to meet the demand for the product. And we anticipate, we'll continue to see demand beyond when a competitor comes into place as well for the reasons we've already stated.\n\nOperator\n\nWe'll take our next question from David Westenberg with Piper Sandler. Please go ahead.\n\nDave Westenberg -- Piper Sandler -- Analyst\n\nHi. Thank you for taking my question. Most on the supply chain have already been answered. So I'll start with Librela, I think you mentioned it's a blockbuster.\n\nIt's only outside of the U.S. I think we typically think of animal health as being or companion animal being kind of half in the U.S., half outside the U.S. Is there something specific about outside the U.S. that's made it resonate so well? Or should we still think of this as maybe a $200 million product if it was available in the U.S.? And then a question for Wetteny, you mentioned a lot more, I think, on competition in livestock and I've heard commentary even in the past.\n\nI mean, I think you said poultry vaccines and DRAXXIN, of course, has been the ongoing issue. Can you talk about -- is there a way to quantify how much more this quarter or what we're seeing now is competition versus just dynamics across livestock because, of course, dynamics across livestock have been a little bit on the weaker side. And I just want to see how much is transitory and how much of this might be permanent. Thank you for the questions.\n\nKristin Peck -- Chief Executive Officer\n\nSure. So I'll take your first question, and I'll let Wetteny take the second question. As we think about Librela, we are proud that it is a blockbuster in its first full year in launch outside the U.S. I would note that it hasn't even been launched in every market outside the U.S.\n\nI wouldn't even say it's everywhere there. And if you just take a slight step back here, as you look at the pain category globally in dogs, traditionally, it's been about a $400 million market. We believe with this product, we can double the size of that market. And we've talked about this before, taking a $400 million market to an $800 million market.\n\nWe believe we can do this because we think this product's efficacy is really, really strong. And so if you think about that, we think we can get more dogs to be cared for. It doesn't have some of the safety profile issues of other products. We're seeing that people are staying on it longer.\n\nIt is already in Europe, the No. 1 pain product as you think about it. So we are -- we believe very strongly, If you look at this 40% customers to Librela are new to the category. This really speaks to the power of this product that's excitement with us.\n\nAnd we're seeing a 90% reorder rate. So I think you're going to see significant potential for this product as you look at growing it outside to other markets as Wetteny mentioned earlier, beyond the ones that's already launched in international. And then certainly, when you add to the U.S. We've seen in some of these really advanced technology products, the U.S.\n\nis often bigger than international on most of these products. So we remain very optimistic for the success of this product just based on so far, it's -- we've talked about this on previous calls, it's done incredibly well and where we've even been upside surprise is how many months many customers are staying on it. So we'll continue to see how that evolves over time, but we're very optimistic about this product, not just in international, but as we bring it into the U.S. and as we expanded across international.\n\nBut Wetteny, do you want to take the second question on livestock?\n\nWetteny Joseph -- Chief Financial Officer\n\nYeah, sure. Look, the first thing I would say is there is no structural change with respect to the competitive nature of livestock. It's always been competitive and it remains so. So our commentary here today and what we've been talking about over the last couple of years isn't necessarily different.\n\nWhat is that generic competition has had an impact on us over the last couple of years as we anticipated, as we said. So DRAXXIN, if you look at DRAXXIN prior to LOE, was roughly in the mid-$300 million, let's call it, $350 million in revenue. That by far, the largest sort of individual product within lives' first year and another 20% in the second year. The first year was a little bit better than that.\n\nIt was south of 20%, but the second year was above that. And so still in the neighborhood, maybe a little bit worse than what we thought initially with respect to DRAXXIN, but there's no other large product like that. I would say, in the portfolio, though Zoamix also has seen some competition, but it was nowhere near the size of a DRAXXIN. So short story is no change in terms of what we're seeing in terms of the competitiveness of livestock is just a little bit more intensification in terms of products that have become generic if they are sizable.\n\nOperator\n\nAnd we'll take our next question from Steve Scala with Cowen. Please go ahead. \n\nSteve Scala -- Cowen and Company -- Analyst\n\nMany thanks. First, just to clarify, in the prepared remarks, it was stated that supply challenges were more pronounced in Q3 and that there is increased uncertainty. Can you clarify why supply challenges peaked in Q3 and why there is now more uncertainty as opposed to what was seen in Q2 or apparently what is anticipated in Q4? And then secondly, China lockdowns were mentioned. Can you quantify the impact? And then lastly, what is the capacity of Lincoln to manufacture the pain monoclonal antibodies? I thought at one point, some small-scale manufacturing was done there.\n\nIs that a possibility to be expanded? Thank you.\n\nWetteny Joseph -- Chief Financial Officer\n\nSo I'll start and see if Kristin wants to add anything. With respect to the supply challenges, I think we've described in a fair amount of detail what we saw happen and why the impact was more noticeable in the third quarter, though we also made significant progress as we exited the quarter. So the impact that we're seeing in the third quarter, if we double-click on parasiticides, for example, particularly with Trio, I mean, from Q1, we have -- we've had outages on Trio across certain constraints, etc. And we continue to run with constraints throughout the year.\n\nBut in particular, in Q2 and Q3, those outages really left more space across vet clinics for competitors to fill those shelves. And so as we got into Q3, again, continuing to be in the parasiticide season, we saw switchovers with respect to new patients coming off of collars and topicals, for example, going into orals rather than coming into our product, going into some of our competitors because our competitors filled shelves when we had gaps. So that's why we saw a bigger impact in that in terms of what we saw, particularly for Trio, the Revolution has been an issue, quite frankly, throughout the year and remains. So even as we've gotten into Q4 here, which is why we say we continue to see uncertainty in certain products here.\n\nVaccines, I would say, a relatively commonplace across the industry in terms of having supply issues. And again, we've seen a little bit more of those this year. And again, particularly in Q3, given the cattle run in the U.S. in the fall, etc.\n\nSo we saw some of that, the impact of those outages more pronounced in the quarter. So hopefully, that gives you plenty, if there's a follow-up, I'm sure you can take it up with Steve off-line as well. But that's the detail that we've shared. With respect to capacity for mAbs, these are long lead time areas, right? If you take the time to manufacture, it's long lead time, the time to add capacity in monoclonal antibodies is also relatively long.\n\nSo we've been working on those for some time, which is why, as we've gone through this year, and we express confidence into next year being able to not only capitalize on demand that we see across Europe, but we'll be able to launch in other products outside of Europe across our international segment with confidence because we have been able to expand in various areas. I won't go into a specific site in terms of what their capacity is. But suffice it to say, our monoclonal antibody manufacturing is more than just one location in terms of where we do there. And you've seen us take an uptick as well in terms of capex going from last year to this year, we've talked about that all year.\n\nAnd you continue to see an uptick in capex as we go into the next year or two as well because we continue to make investments in capacity and monoclonal antibodies are an important platform for us, not only with respect to derm with saddle point with the pain franchise, but other products that we're working on in our pipeline we require those. So we'll continue to make investments with respect to mAbs capacity.\n\nKristin Peck -- Chief Executive Officer\n\nA few follow-ups there. I mean, as far as, the comment on uncertainty had to do with the macroeconomic environment. The question is we're still seeing very strong consumer demand, but there's still a belief that we'll have potentially a recession in Q1, Q2, Q3. It was not about increased uncertainty to be clear in supply.\n\nIt was uncertainty as to what the macroeconomic environment and what we'll be looking at into 2023 or even in Q4. So let me be clear, the uncertainty comment that was not related to supply. The only -- the comment I'll make is with regards to the China question. I mean, look, in Q3, China grew 35% even with these lockdowns again, underlying what we've been saying, the demand for our products remains very strong.\n\nWhat's important there is if you look like four or five years ago, it was a majority livestock business. It became about 50-50 last year between livestock and companion animal. And if you look at it right now, the lockdowns are clearly impacting livestock but companion animal, and given its close to 50-50, grew almost double what you see as China growth that. So even with the lockdowns, we really see China remaining a strong market for us and growing quite well.\n\nSo I think we can weather those lockdowns. I mean, look, if we -- the lockdown stop, which does not appear based on the news in the last 24 hours, to be something that's going to be happening in the near term, you might see livestock recover a little faster than what it is. But again, even in this environment, even with lockdowns, you saw 35% growth in Q3 in China. So I would just underscore that.\n\nOperator\n\nWe'll take our next question from Elliot Wilbur with Raymond James. Please go ahead.\n\nMichael Parolari -- Raymond James -- Analyst\n\nHi, guys. This is actually Michael Parolari on for Elliot. Thanks for taking my questions. So first one from me, you guys might have touched on this earlier, so apologies if I missed that commentary, but any early commentary on how we should be thinking about currency impacts on top line and margin trends into 2023? And then second question is growth contribution from price this quarter.\n\nI believe you said was 1% compared to 3% over the past two quarters. Most of the industry seems to be moving in the other direction, given the current macro environment. So just wondering, if you guys contribution in the period and how to be thinking about that moving forward? Thank you.\n\nWetteny Joseph -- Chief Financial Officer\n\nYeah, I'll start. And see, what Kristin will add. First of all, with respect to currency, if you look at this year, top-line impact from FX given the strength of the U.S. dollar is about 4%.\n\nSo on the year, 4% which is roughly $309 million headwind versus prior-year rates. If you look at the impact all the way down to the bottom line, it's about 8%. And so from an EPS standpoint, that's about $0.36 of headwind. It's about $0.07 worse than our prior guidance given the continued strength of the U.S.\n\ndollar. So that's where we are. We're not going to forecast what FX might do. But our guidance is based on where the rates were at the end of October here.\n\nAnd we'll continue to update, but we'll focus on commentary around operational growth given FX's impact, but that's the impact that we're seeing this year. But if I didn't go into price here, on a year-to-date basis, if you look at our companion animal product sales and revenues, we've taken about 5% price on a year-to-date basis. And so what is offsetting that largely is what we've been talking about here today, which is the generic competition, particularly on DRAXXIN, that's offsetting that growth where you see a net of 1% in the quarter. But on a year-to-date basis, our price is about 2%.\n\nIf you include the impact of generic competition and higher than that without but companion animal is where we have innovative products, we continue to see strong demand, and we're taking price to the tune of about 5%. And if you look at our margins, roughly 90 basis points down year over year, FX is by far the biggest contributor to that. So if you take FX out, you've got about 20 basis points. So essentially, our price is offsetting increases in manufacturing costs, etc., within price and mix and so on is what we're seeing.\n\nSo that's where the offset is. We're right about where you might see across elsewhere in the industry, our vet practices, given the strong demand we continue to see are actually taking price at or above what we're taking in that 5% on companion animal as well.\n\nOperator\n\nAnd we'll go next to Balaji Prasad with Barclays. Please go ahead. \n\nUnknown speaker\n\nHi. This is actually Nikila on for Balaji. Thanks for taking my question. Just on Trio, just wondering what the penetration has been for corporate accounts and just how much room is left for further expansion? Thank you.\n\nWetteny Joseph -- Chief Financial Officer\n\nYeah, so we've been very pleased with the penetration across large corporate accounts. We're about 90%, but we still see more room even within those large corporate accounts to increase utilization of Trio. And we continue to work on those, and that's part of where our expanded field force in the U.S. is focused in addition to, obviously, with the launches of other products, etc., and across Europe to continue to penetrate and so on.\n\nSo we've been very pleased with the overall penetration across large corporates. We continue to work on smaller and midsized accounts as well and we see more room within those penetrated clinics to get better utilization on Trio. I don't know if you would add anything to that, Kristin.\n\nKristin Peck -- Chief Executive Officer\n\nNo.\n\nOperator\n\nThere are no further questions at this time. I'll turn the call back over to Kristin Peck for any closing remarks.\n\nKristin Peck -- Chief Executive Officer\n\nGreat. Look, thanks, everybody, for your questions today and for your continued interest in Zoetis. Just to summarize, we continue to see strength across our diverse global portfolio, especially in our products for pet care and the fundamental drivers of animal health, as I've said throughout this call, remained fundamentally and structurally very strong. We continue to invest in talent and innovation certainly in manufacturing expansions as we've talked to you today that can support this future growth while adapting and optimizing our business for the increasingly dynamic macroeconomic environment that we all operate in.\n\nWe look forward to keeping you updated on future calls. Thanks so much for joining us today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteve Frank -- Vice President, Investor Relations\n\nKristin Peck -- Chief Executive Officer\n\nWetteny Joseph -- Chief Financial Officer\n\nErin Wright -- Morgan Stanley -- Analyst\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nLouise Chen -- Cantor Fitzgerald -- Analyst\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nDave Westenberg -- Piper Sandler -- Analyst\n\nSteve Scala -- Cowen and Company -- Analyst\n\nMichael Parolari -- Raymond James -- Analyst\n\nUnknown speaker\n\nMore ZTS analysis\n\nAll earnings call transcripts"
}