{
  "companyName": "Intuit",
  "companyTicker": "INTU",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/29/intuit-intu-q1-2023-earnings-call-transcript/",
  "content": "Intuit (INTU -0.42%)\nQ1 2023 Earnings Call\nNov 29, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Regina, and I will be your conference operator today. At this time, I would like to welcome everyone to Intuit's first quarter fiscal year 2023 conference call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speakers' remarks, there will be a question-and-answer period. [Operator instructions] With that, I'll turn the call over to Kim Watkins, Intuit's vice president of investor relations. Ms. Watkins?\n\nKim Watkins -- Vice President, Investor Relations\n\nThanks, Regina. Good afternoon, and welcome to Intuit's first quarter fiscal 2023 conference call. I'm here with Intuit's CEO, Sasan Goodarzi; and Michelle Clatterbuck, our CFO. Before we start, I'd like to remind everyone that our remarks will include forward-looking statements.\n\nThere are a number of factors that could cause Intuit's results to differ materially from our expectations. You can learn more about these risks in the press release we issued earlier this afternoon, our Form 10-K for fiscal 2022, and our other SEC filings. All of those documents are available on the Investor Relations page of Intuit's website at intuit.com. We assume no obligation to update any forward-looking statement.\n\nSome of the numbers in these remarks are presented on a non-GAAP basis. We've reconciled the comparable GAAP and non-GAAP numbers in today's press release. Unless otherwise noted, all growth rates refer to the current period versus the comparable prior-year period, and the business metrics and associated growth rates refer to worldwide business metrics. A copy of our prepared remarks and supplemental financial information will be available on our website after this call ends.\n\nWith that, I'll turn the call over to Sasan.\n\nSasan Goodarzi -- Chief Executive Officer\n\nGreat. Thank you, Kim, and thanks to all of you for joining us today. We had a strong first quarter as we executed on our strategy to be the global AI-driven expert platform powering prosperity for consumers and small businesses. We continue to feel bullish about our momentum and execution across small business and tax.\n\nWe're innovating at a high velocity using the power of our platform and modern technology capabilities to deliver new offerings at scale focusing on breakthrough adoption. We continue to be focused on putting more money in our customers' pockets, saving them time, and ensuring complete confidence in every financial decision they make. This is more important than ever in the current uncertain economic environment and helps us penetrate our large total addressable market of over $300 billion. Now, let's turn to our first-quarter results.\n\nRevenue grew 29%, including 13 points from the addition of Mailchimp. Total revenue growth was fueled by the Small Business and Self-Employed Group revenue growth of 38%, or 19% excluding Mailchimp, and 25% revenue growth in the Consumer Group driven by a strong October peak with new customers and extension filers. The scale of our platform, along with our rich data, gives us the unique ability to see charge volume growth, the number of employees paid, the hours worked per small business, and cash reserves. These measures remain strong for those on our platform and inform our perspective on the health of small businesses.\n\nTurboTax had a robust finish to the tax season with a record number of innovations launched and tested in the October peak. I'm excited about this coming -- upcoming season, particularly our strategy to transform the assisted category, including the launch of Business Tax and TurboTax and Credit Karma platform integrations. Now, turning to Credit Karma. At Investor Day and on our fourth-quarter call earnings call, we shared that all Credit Karma verticals had been negatively impacted by the macro uncertainty.\n\nIn the last few weeks of the quarter and into November, we saw further deterioration in all verticals. Consumer default rates remain relatively low by historical standards, reflecting strong consumer cash balances coming out of the pandemic. However, we continue to see partners pull back from extending credit, reflecting the uncertainty in the economic environment and the risk of deterioration in credit performance. Given this context, Credit Karma revenue came in lower than expected for the quarter.\n\nWe are lowering our fiscal year 2023 revenue guidance for Credit Karma to a decline of 15% to 10% versus our previous guidance of 10% to 15% growth. At the same time, we are reiterating our fiscal year 2023 revenue guidance for all other segments and reiterating our fiscal 2023 GAAP and non-GAAP operating income and earnings per share guidance. Our ability to maintain earnings power despite the lower Credit Karma revenue guidance shows the power of our diversified platform and our ability to balance platform and product investments for the future while delivering on our commitments. Regardless of the near-term macro volatility, we remain confident in our long-term revenue growth expectations of 20% to 25% for Credit Karma driven by our vision and innovation to become the self-driving financial platform fueling prosperity for all consumers.\n\nAt Investor Day, we shared how our AI-driven expert platform strategy is accelerating our innovation and how our five Big Bets are solving the largest problems our customers face. We continue to deliver strong proof points that demonstrate our success and are well-positioned for durable growth in the future. As a reminder, our five Big Bets are: revolutionize speed to benefit, connect people to experts, unlock smart money decisions, be the center of small business growth and disrupt the small business mid-market. Today, I'd like to highlight examples of our recent progress across three of these Big Bets.\n\nOur first Big Bet is to revolutionize speed to benefit. Our platform enables us to innovate for our customers with speed and at scale, which is foundational to all of our Big Bets. Our evolution from a siloed technology stack to a platform leveraging shared capabilities is well underway. Our development environment enables speed and innovation.\n\nEngineers now have 6x the velocity of deploying code, resulting in accelerated innovation compared to fiscal year 2020. Our AI and fintech capabilities are well positioned to solve our customers' biggest problems, such as our money innovations across payments and payroll, advancements in TurboTax Live, QuickBooks Live, and QuickBooks Advance, just to name a few. And we're doing that today with over 730 million AI-driven customer interactions per year, 2 million AI models in production, 58 billion machine learning predictions per day, and over $465 billion in money moved during fiscal year 2022. Our second Big Bet is to connect people to experts.\n\nWe're solving one of the largest problems our customer face, lack of confidence, by connecting people to experts virtually. During the October tax peak, our team launched a record 50 innovations to test and learn. Our learnings can help us transform our go-to-market campaign for the assisted segment; revamp the end-to-end TurboTax Live platform experiences with faster access to money via Credit Karma; and better serve the investor, Latino, and self-employed segments. We are looking forward to the upcoming tax season.\n\nOur fourth Big Bet is to become the center of small business growth by helping our customers get customers, get paid fast, manage capital, pay employees with confidence, and grow in an omnichannel world. With Mailchimp, we're well on our way to becoming the source of truth for our customers to help them grow and run their business. We have three acceleration priorities with Mailchimp: first, delivering our vision of an end-to-end customer growth platform; second, disrupting the mid-market by developing a full marketing automation, CRM, and e-commerce suite; and third, accelerating global growth with a holistic go-to-market approach. This quarter, we launched a new brand campaign, refreshed our website, and launched an improved first-time-use experience for new customers that help them more quickly find and use the feature that aligns with their unique business needs.\n\nWe also launched a one-hour assisted onboarding process for our high-value Mailchimp customers with the goal of guiding them to more advanced features to increase awareness and usage. This program was launched in a record four weeks by leveraging components of our virtual expert platform, another example of the power of the Intuit platform capabilities. As a result of these enhancements and others, we're seeing a positive impact on customer growth and expansion and a lift in customers converting to pay. Turning to our money portfolio.\n\nWe've made a tremendous investment over the last few years to expand our suite of money offerings to help small businesses get paid, pay others, and access capital and manage their money. We continue to see strength in our charge volume driven by easier discovery, auto-enabled payments, instant deposit, and getting paid upfront. This quarter, we made it even easier for more customers to access their cash quickly by removing friction and opening the funnel to more customers. We're also rolling out a new invoicing experience with a more streamlined workflow and improved design, which is driving an increase in the percentage of companies that send payment-enabled invoices.\n\nLooking ahead, we're tackling another big challenge for our small business customers, B2B payments. More than $2 trillion of invoices were managed in QuickBooks in fiscal year 2022. As we shared at Investor Day, we are launching the QuickBooks Business Network, which connects small business customers to each other, making it easier for them to do business. It's currently in beta testing, and we expect to launch more broadly later this fiscal year.\n\nWe're also building our own bill pay functionality in QuickBooks and plan to launch this capability in the future. We're excited about our opportunities for growth with Mailchimp and payments becoming the center of small business growth. Wrapping up, we feel confident in our long-term business strategy and the power of our platform. In an uncertain macro environment, the benefits of our global financial technology platform are more important and more mission-critical than ever for our customers.\n\nWe have a large TAM with low penetration, secular shifts working in our favor, a diversified large-scale platform where we continue to invest heavily in innovation across our five Big Bets to deliver benefits for our customers, resulting in top-line growth and margin expansion. We're proud to be an employer of choice, as well as the financial technology platform of choice for over 100 million customers around the world who rely on Intuit to prosper. Now, let me hand it over to Michelle.\n\nMichelle Clatterbuck -- Chief Financial Officer\n\nThanks, Sasan. For the first quarter of fiscal 2023, we delivered revenue of $2.6 billion, GAAP operating income of $76 million versus $195 million last year, non-GAAP operating income of $662 million versus $555 million last year, GAAP diluted earnings per share of $0.14 versus $0.82 a year ago, and non-GAAP diluted earnings per share of $1.66 versus $1.53 last year. Turning to the business segments. In the Small Business and Self-Employed Group, revenue grew 38% during the quarter and 19% on an organic basis, excluding $264 million in Mailchimp revenue.\n\nOnline Ecosystem revenue grew 60% in Q1 or 28% excluding Mailchimp. With the goal of being the source of truth for small businesses, our strategic focus within the Small Business and Self-Employed Group is threefold: grow the core, connect the ecosystem, and expand globally. First, we continue to focus on growing the core. QuickBooks Online accounting revenue grew 29% in Q1, driven mainly by customer growth, higher effective prices, and mix shift.\n\nSecond, we continue to focus on connecting the ecosystem. Online services revenue, which includes Mailchimp, Payroll, Payments, Capital, and Time Tracking, grew 109% in Q1. Excluding Mailchimp, online services revenue grew 28%. Mailchimp revenue included in online services was $264 million, up low teens versus a year ago, in line with our expectations.\n\nWithin Payroll, revenue growth in the quarter reflects an increase in payroll customers and a mix shift to higher-end offerings. Within Payments, revenue growth reflects an increase in charge volume per customer and ongoing customer growth. Third, we continue to make progress expanding globally, and we began to execute our refreshed international strategy, which includes leading with Mailchimp. On a constant-currency basis, total international Online Ecosystem revenue grew 172% in Q1 and 19% on an organic basis, excluding Mailchimp.\n\nDesktop Ecosystem revenue grew 7% in the first quarter. As a reminder, the subscription model for our desktop accounting solution makes this revenue more predictable, and we raised our desktop prices for several products in September to more closely align with QBO pricing. QuickBooks Desktop Enterprise revenue grew mid-single digits during the quarter. We continue to expect the Online Ecosystem to be our growth catalyst going forward.\n\nMoving on to Credit Karma. Revenue grew 2% to $425 million in Q1. This was below our expectations of mid-single-digit growth we shared at Investor Day due to further deterioration in all verticals the last few weeks of the quarter. On a product basis, revenue growth was driven primarily by credit cards, offset by headwinds in personal loans, home loans, auto insurance, and auto loans.\n\nAs the macro environment continues to remain uncertain, we're seeing an impact across all verticals. Sasan touched on this briefly earlier, but let me unpack what we're seeing. In credit cards, many financial institution partners have tightened eligibility, particularly in riskier segments. In personal loans, we saw continued pressure with many partners tightening eligibility further while increasing APRs.\n\nWe continue to expect personal loan revenue to decline this year after very strong growth in fiscal 2022. As a result, we are reducing our fiscal 2023 Credit Karma revenue guidance to a decline of 15% to 10%. This embeds the current trends we're seeing and additional conservatism in the remainder of the year despite the expected continued rollout of several new innovations. Consumer Group revenue was $150 million, reflecting a strong finish to the tax season.\n\nWe remain focused on transforming the assisted category in the tax prep market as we head into the next tax season. We're focused on making TurboTax a compelling destination for filers who prefer assistance to complete their taxes accurately and quickly. Turning to the ProTax Group. Revenue of $34 million was in line with our expectations.\n\nOur financial principles guide our decisions remain our long-term commitment and are unchanged. We finished the quarter with approximately $2.7 billion in cash and investments and $7 billion in debt on our balance sheet. We repurchased $519 million of stock during the first quarter. Depending on market conditions and other factors, our aim is to be in the market each quarter.\n\nThe board approved a quarterly dividend of $0.78 per share payable January 18, 2023. This represents a 15% increase versus last year. As I shared last quarter, we have an operating system we use to run the company, and this includes a proven playbook for operating in both good and difficult economic times. Our first priority is to do the right thing for customers giving them access to the tools and offerings they need most.\n\nWe manage for the short and long term and control discretionary spend to deliver strong results while investing in what is most important for future growth. The scale of our platform, along with our rich data, gives us the unique ability to see leading indicators that allow us to be forward-looking and adjust quickly. As Sasan shared earlier, we are reiterating our operating income and earnings per share expectation for fiscal year 2023 despite our lower revenue expectations for Credit Karma. We're able to do this by reducing spend in areas where we expect to see lower returns near term.\n\nLast quarter, I mentioned we identified several levers we can pull to deliver against our financial principles in a variety of scenarios, and the adjustments we have made are an example. Given the breadth of our offerings and the power of our diversified platform, we have the ability to maintain earnings power despite our expectation for lower Credit Karma revenue. At the same time, we have the ability to make the necessary platform and product investments for the future while delivering on our short- and long-term commitments. We also have a strong balance sheet that enables us to play offense.\n\nWe will continue to accelerate our innovation, and our goal remains for Intuit to emerge from this period of macro uncertainty in a position of strength. Moving on to guidance. For fiscal 2023, we are lowering our revenue guidance for Credit Karma as trends in all verticals further deteriorated in the last few weeks of the quarter and into November. We now expect revenue to decline 15% to 10% versus our previous guidance range of 10% to 15% revenue growth.\n\nWe are reiterating our revenue expectations for all other segments and now expect total company revenue growth of 10% to 12% versus the previous range of 14% to 16%. For the Small Business and Self-Employed Group, we continue to expect 19% to 20% revenue growth. And for the Consumer Group, we continue to expect 9% to 10% revenue growth. In both businesses, we expect the majority of our growth this year to come from customer growth and mix.\n\nWe are reiterating our GAAP and non-GAAP operating income and earnings per share guidance for fiscal 2023. This demonstrates the resiliency of our diversified platform and business model. So, to recap, for fiscal year 2023, we expect total company revenue growth of 10% to 12%, GAAP operating income growth of 9% to 13%, non-GAAP operating income growth of 17% to 19%, GAAP diluted earnings per share to decline approximately 5% to 1%, and non-GAAP diluted earnings-per-share growth of 15% to 17%. Our guidance for the second quarter of fiscal 2023 includes revenue growth of 8% to 9%, GAAP loss per share of $0.29 to $0.23, and non-GAAP earnings per share of $1.41 to $1.45.\n\nYou can also find our full fiscal 2023 and Q2 guidance details in our press release and on our fact sheet. And with that, I'll turn it back over to Sasan.\n\nSasan Goodarzi -- Chief Executive Officer\n\nGreat. Thank you, Michelle. As you all heard from Michelle and I, we're seeing continued momentum as a result of our strategy of being a global AI-driven expert platform, growing Intuit double digits with margin expansion. With our accelerated organic innovation and the addition of Credit Karma and Mailchimp, we are the leading global financial technology platform that powers prosperity for people and communities.\n\nAnd with that, let me turn it over to your questions.\n\nOperator\n\n[Operator instructions] Our first question will come from the line of Siti Panigrahi with Mizuho. Please go ahead.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nThank you. Sasan, you lowered your Credit Karma growth now from 10% to 15% growth to decline now 15% to 10%. Just want to dig a little bit into your assumption for the remaining quarters in this fiscal year. Where do you see -- how conservative is this guidance? And I know that the Karma guarantee will be rolled out sometime later this year.\n\nWhere can we see some kind of upside surprise if macro stays at the current level?\n\nSasan Goodarzi -- Chief Executive Officer\n\nYes. Thanks for your question, Siti. So, a couple of things. One, as you heard from Michelle, we took the current sort of trends that we were seeing in sort of end of October into November into account.\n\nBut we also very intentionally included further conservatism, deterioration just to be prudent. And so, when we look at things around delinquency rates and unemployment, which is really what financial institutions look at to make future decisions, although they are at historical lows, the assumption is that they're going to deteriorate. And so, we just assumed that they will significantly deteriorate, and we wanted to include that in our go-forward guidance. We take a lot of pride in the commitments that we make at the company level, and we want to make sure that we're very prudent in terms of the assumptions that we made with the guidance going forward.\n\nWith that said, I think what I would amplify is our innovation that we talked about at Investor Day. Beyond things like Karma Guarantee, we are actually -- we have launched, it's almost at full scale, something called the Marketplace, where we're giving more exposure to personalized experiences around cards and personal loans to our members. And now with the integration of Mint and Credit Karma, which was part of our refreshed Big Bet 3 vision that we talked about at Investor Day, we expect in the future to have additional sort of capabilities and innovations for our prime customers, which has not been our sweet spot in -- on the Credit Karma platform. So, we are leaning into our innovation and those possibilities.\n\nWe are not counting on any of that impacting the growth rate that you just heard from Michelle and I for the fiscal year, and we just simply believe that's the right thing to do.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nGreat. And then a quick follow-up on the small business side. That's pretty impressive quarter, and it grew 19% organically. And if I look at your guidance for remaining three quarters, you just have to grow 14% to hit your guidance.\n\nYou already -- like you talked about price mix shift and -- or you already raised pricing 10% to 25%. So, what are you seeing in the small business side? And what are your assumptions for the remaining of the, you know, year?\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah. Sure. Absolutely. First of all, I would start by saying we have a lot of visibility into things around consumer spending, which is charge volume.\n\nWe see the number of employees, whether they're going up and down. We see a number of hours worked. We see cash reserves. And of course, there's our metrics around acquisition, retention, payments, and payroll volume and also what we see across Mailchimp.\n\nAnd what we're seeing across the board is a continued flight to digitization. If you use our payments capability, you get paid faster, and cash flow is more critical in this environment. If you use our payroll capabilities, you're actually able to reduce errors and pay your employees and have money moved from your bank account to their bank account same day versus two weeks in advance. With the use -- innovation that you've heard from us on Mailchimp, we're actually starting to see customer growth tick up.\n\nAnd so, those are just illustrative examples are -- we're just continuing to see based on our innovation a flight to digitization, which is the strength that you heard from us in the first quarter. And we expect that momentum to continue the rest of the year. And we remain steadfast on our guidance until we see more quarters, but it is not at all about our sentiment about small business. We actually feel very good about what we're seeing across the board in small business.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nGreat. Thanks for the color, Sasan.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYep. You're very welcome.\n\nOperator\n\nYour next question will come from the line of Brad Sills with Bank of America Securities. Please go ahead.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nWonderful. Thanks for taking my question. Just a question on the reiterated operating income guide. You lowered top line by, it looks like, about $700 million, yet you're able to sustain your operating income guidance, which is impressive, and it speaks to the flexibility in your model.\n\nMichelle, you alluded to some adjustments that were made. If you could just provide a little bit of color as to where those adjustments were made in the business. Thank you.\n\nMichelle Clatterbuck -- Chief Financial Officer\n\nYeah. Brad --\n\nSasan Goodarzi -- Chief Executive Officer\n\nSorry, Michelle, go ahead. I was going to ask who the question was for. But, Michelle, please go ahead.\n\nMichelle Clatterbuck -- Chief Financial Officer\n\nNo worries. No worries. Thank you, Brad. Yes, it is one of the things that we feel very good about.\n\nAs I talked about on a previous call, when we were going through our planning for this year, we were really looking at making sure we had identified areas that we could take action on, the levers we could pull if we did see the macro environment get worse. Those things look like marketing expenses, things that we just don't think are going to pay off in the near term, other areas like travel, discretionary spend. But we are protecting R&D and our innovation. And we are continuing to invest.\n\nOur investments and our head count continue to go up across the company. And yes, Credit Karma, we have taken the revenue down with a revenue hit there. But when we look at really being able to manage our expenses, it is looking across the company holistically and really focusing on the areas where we think we're not going to see as much return in the short term so that we can continue to focus longer term and drive the innovation.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nExcellent. Thanks. Thanks, Michelle. And, Sasan, one for you if I may, please.\n\nLast year, we saw a little bit of moderation in TurboTax ASP growth. You talked a little bit about that at the Analyst Day. I think it was 4% on paid ARPU versus, I think, 8% in prior years. If you could elaborate a bit on what went on there.\n\nAnd should we see some acceleration here? Now that you're getting into more experience with TT Live and full service, might we actually see some acceleration in TurboTax ARPU? Thank you.\n\nSasan Goodarzi -- Chief Executive Officer\n\nSure. Absolutely. I think the way to think about it is, you know, in the long term and from a trajectory perspective, we should see ARPU go up. And now every year, strategically, we make decisions in terms of where we may expand our free offering or where we may increase price based on the leverage that we see in the marketplace, which is primarily in our assisted offerings.\n\nAnd those were some of the adjustments that we made last year. And as we look into this year, we actually feel very good about our do-it-yourself platform lineup. And really, our biggest leverage is going to come from accelerating what we're seeing across the TurboTax Live platform, which is really where the growth is coming from. It's really where the ARPU comes from, and it's where our biggest opportunity is with a $20 billion TAM in front of us.\n\nAnd of course, over time, opening up an additional $10 billion TAM with business taxes. So, that was really the intent and the logic behind why ARPU was probably a little bit slower growth last year versus prior years. And I think the way to think about it is we're going to continue to see ARPU growth into the future, and a lot of it will come from the assisted segment. And that's really part of our plan that we're executing against this coming year.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat to hear. Thanks, Sasan.\n\nOperator\n\nYour next question will come from the line of Brad Zelnick with Deutsche Bank. Please go ahead. Brad, you may be on mute.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nHi. Thank you very much. Can you guys hear me?\n\nSasan Goodarzi -- Chief Executive Officer\n\nYes. Perfect.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGreat. Really appreciate you taking my question. Sasan, you guys are always very transparent, great disclosure. And my question is maybe a little bit bigger picture.\n\nCan you talk about the opportunity to open up and externalize into its platform services to third parties for developing their own apps with live expert functionality, rich data services, money movement perhaps, and the things that are making you so successful? Thank you.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYes, absolutely. Great question. This was actually, at Investor Day, one of our, what we call, Horizon 3 ideas that we have invested in, which is around externalizing services. So, first and foremost, we do see a big problem space out there where developers and partners and firms look to access and have a need for things like around our virtual expert platform services to connect people to experts or had a use for our identity services and have a use for our fraud and risk capabilities.\n\nSo, there's a lot of services that we have across our platform that you heard Mariana talk about of which there is a need for those services externally. Now, we want to be very choiceful and intentional what we choose to externalize and what we choose not to externalize and what problems we choose to solve and which ones we intentionally choose not to solve. But we do believe it as an opportunity. It's actually something that we funded about a little bit over 15 months ago, and we have a mission-based team that is working on it.\n\nAnd when we have more to share in terms of launches and anything that we think over time will be material for all of you to be aware, we'll be the first to share with you. But we do see it as an exciting Horizon 3 idea that's been funded and are excited about the prospects of it.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGreat. Thank you so much.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYou're very welcome.\n\nOperator\n\nYour next question will come from the line of Raimo Lenschow with Barclays. Please go ahead.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you. I wanted to ask on Mailchimp. So, last quarter, you pointed out that you were kind of working on go-to-market a little bit. You wanted to adjust that.\n\nThis sound -- this quarter, you sounded better, and it looks like you're using Mailchimp like the lead to go -- to attack the international markets more broadly. Can you speak a little bit about what you do there, the progress that you're making, where you are in that journey, please? Thank you.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah, absolutely. You know, first of all, I'll just state that I'm really excited about Rania that we just put into the business and the leadership team that she is building in. It is the result of that leadership team where we are seeing accelerated innovation. And as I mentioned a moment ago, there's been a lot of innovation just in the last sort of three to four months in Mailchimp from an entirely new brand campaign where we communicate the benefit to how you can grow your business to SMBs, both on air and on -- through digital assets.\n\nWe've redesigned our website. So, when you come to us, you're very clear about the benefits that we offer, the choices that you have, and why it can help fuel the success of your business, to then revamping the first-time use experience, along with what we have just implemented for, I would say, higher-value, larger Mailchimp customers and new customers that we want to pursue, which is a one-hour assisted onboarding to help you get on to the platform, to help you understand the benefits of the platform. And in context of what we've shared around international and Mailchimp as sort of the lead internationally, we are right now focused on localizing the language. Where we have localized language versus not, we have more than 13 points conversion variants.\n\nAnd so, of course, localized language is one of our largest levers internationally, along with having a playbook that we're putting in place around go-to-market to raise awareness. So, a lot of those things we have already launched that I mentioned, and the localizing languages we're working on as we speak. And a lot of what we -- what I just shared, we're starting to see a real impact from customer uptick, expansion revenue. And we're excited about the possibilities and the momentum that the leadership team is building on.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you. Congrats.\n\nOperator\n\nYour next question will come from the line of Kirk Materne with Evercore. Please go ahead.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nYeah. Thanks very much, and congrats on a good quarter. Sasan, you all are in a somewhat unique position that you get to see demand -- sort of demand on both the front-office side, as well as sort of the back-office side with Mailchimp and then QuickBooks. I was wondering if you could give us any when you look at the demand indicators from a front-office perspective or a back-office perspective.\n\nAre they similar? Are they different? Is there anything you've noticed now that you get to have some insight into sort of that other part of the -- of essentially the operating ecosystem of your customers? Obviously, there's just a lot of discussion in the market right now between front-office and back-office demand. So, I was wondering if you can enlighten us, I guess, with any of your thoughts on that. Thanks.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah. Sure, Kirk. And let me try to be descriptive about it, so I'm not overly generic. I think our customers that we serve, the small businesses between zero to 100 employees, don't as much think about back office, front office.\n\nThey just really look to have a platform to be able to grow their business and to be able to manage their cash flow. So, if you think about our QuickBooks platform, let me start there, and I'll get to Mailchimp in a moment. Really, QuickBooks helps you manage your cash flow, all your money coming in and money going out. And the notion of digitization is really important for customers, which is why we're enjoying the growth that we just shared.\n\nAnd that really comes down to customers can use QuickBooks to be organized. They can get paid much faster with -- using our payments capabilities. They can get access to capital. They can have instant money flow from their bank to their employees' banks by using our payroll.\n\nIf they're out in the field, they can use our time tracking so everything is automated. All those things are about digitization. And the way small businesses think about it is it actually helps them with their cash flow because we also -- with all those capabilities, project your cash flow. So, that's the real big value sort of QuickBooks.\n\nAnd then you add to that Mailchimp. The real value of Mailchimp is don't think about it as these are not enterprise customers. These are smaller -- small businesses that where their sort of lifeline comes from being able to reach out and manage their existing customers, but also effectively be able to grow their customer base. And so, the reason we're continuing to see an uptick based on our innovation and based on just good execution.\n\nAnd I think the best is yet ahead of us in Mailchimp, is that is separate and distinct from do I spend more money on advertising dollars. When you use Mailchimp, you have the ability to use our tools with a subscription that you pay on a monthly basis to be able to, in an automated way, reach out to your customers, market to new customers. And we're seeing sort of equal demand if I go back to your frame of front office versus back office. I think where there is slower spend and declining is spending money on advertising dollars.\n\nThat is not what Mailchimp is. Mailchimp is not impacted by advertising dollars. It's actually a -- it's a platform that you use to be able to manage your customers even if you choose to spend less advertising dollars. You can still use Mailchimp very effectively to be able to manage your customers.\n\nSo, that's why the demand is strong with Mailchimp and QuickBooks, and that's really what we see across the platform.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nYour next question will come from the line of Keith Weiss with Morgan Stanley. Please go ahead.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nExcellent. Thank you, guys, for taking the question. And nice quarter in Q1. The question that we're all going to get tomorrow from investors is, is the outlook derisked? So, I wanted to dig into kind of like your, guys, thought process.\n\nWhen you're talking about Credit Karma, you told us that -- you looked at sort of the trends that happened in -- at the end of the quarter in the last couple of weeks, and you assume that those trends deteriorate a little bit further on a go-forward basis to get a conservative Credit Karma guide. Can you talk to us about -- like you didn't change any of the other numbers. All the other sort of business lines are kind of intact with your prior expectations. But is there any similar kind of derisking then? Like are you assuming any degradation in the underlying business for QBO or Mailchimp or like any of the other businesses in a similar way you are Credit Karma?\n\nSasan Goodarzi -- Chief Executive Officer\n\nYes. Keith, thank you for your question. And I just want to acknowledge that you and others were pushing us on our Credit Karma guide at Investor Day. And let me just start at the top level to share sort of what we've learned and what we've adjusted, and then I'll answer your question.\n\nWhen we look across tax, which is 35% of the company; and then when you look at across small business, which is over 50% of the company, so that's like 86% of the company, we have sort of -- which includes Mailchimp, we have proven and tried KPIs that allows us to see things well into sort of the future not only to ensure that we're investing in all the right things but also be able to be very intentional and thoughtful about how we guide because we take our guidance very seriously. One of the things that we learned with Credit Karma is there are two factors that we look at but we did not take into account. One is unemployment. The other is delinquency rate.\n\nAnd what I mean by that, not taking it into account as we view it, we look at it, and they're at historical lows. And the one thing that we learned from this process, what we are adjusting and have adjusted our KPIs is just looking at where they are today but also projecting where they could be a year from now. And ultimately, projecting what could happen if we were sitting in the shoes of some of the partners that are on our platform. So, that is a very important shift, which actually gets at the point you made around our Credit Karma guidance.\n\nWe feel that it is absolutely derisked. We -- as you heard from Michelle and I, we have built a deterioration and conservatism in the back half of the year because we have taken into account uptick in both unemployment and delinquency rates, and therefore, have put out a guidance that we believe is derisked. To go to the second part of your question, tax, which is 35% of the company, that is really economically resilient. So, let me focus my answer on Small Business.\n\nBecause of our KPIs and the rich data that we have access to and what we see within Small Business, we actually feel like our guidance in Small Business is derisked because we make certain assumptions around how things will potentially play out the remainder of the year that we took into account when we set the initial guidance, and we still feel very good about the guidance. And you can see based on what we delivered in Q1, we can just do the math and see what it means for the rest of the year. So, we feel very good about the way we set guidance in those two businesses. We feel very good about the guidance in those areas for the rest of the year.\n\nAnd hopefully, my explanation made sense around Credit Karma.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nGot it. Yeah. That's super helpful. And then just one clarification question.\n\nOn Mailchimp, it looks like the revenues was basically flat, maybe down a little bit sequentially. I'm assuming there is a currency impact in there. Can you -- is there like a constant-currency number that we could see kind of like how it grew sequentially?\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah. It's actually -- it is in constant currency. I mean, maybe, Michelle, I'll let you chime in here in a moment. But I think what I would say is we -- when you look at our innovation and when you look at our customer uptick and the expansion revenue that we're starting to see, it's actually very much in line with what we would have expected because a lot of our innovation that is in place is actually now accelerating the growth of the business.\n\nBecause remember, this business was run for cash flow and profitability, and now we're running it for growth. And we're actually quite pleased with the impact that we're starting to see, and we would expect that to accelerate in the upcoming quarters. But, Michelle, do you want to chime in on the currency version?\n\nMichelle Clatterbuck -- Chief Financial Officer\n\nYeah. The only thing I would clarify is that Mailchimp actually sold at U.S. dollars, and so there isn't a currency impact there for the international, even though 50% of their sales are outside the U.S.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nGot it. Very helpful. Thank you.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYou're very welcome.\n\nOperator\n\nYour next question will come from the line of Kash Rangan with Goldman Sachs. Please go ahead.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nThank you very much. Congrats on the results. Sasan and Michelle, curious to get your perspective. We don't like recessions, but this is a recession -- maybe it's a recession that we've all been anticipating.\n\nIt's the most widely anticipated one. So, what are the assumptions that you have incorporated in your forecasting for the foreseeable future? I mean, is it an uptick in attrition or maybe the expansion rates come down a little bit? I'm just curious to get your thoughts on what you've dialed in with your current round of projections. And also, Sasan, if you could talk about payments. You clearly demoed at the analyst event, very, very impressive.\n\nClearly, it's got a lot of potential. What should we be expecting? What are you expecting in your payments business in the medium term to long term? What are your goals? Thank you so much. Congrats.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah. Thanks for the question, Kash. Just in terms of your question around assumptions, I think on Credit Karma, hopefully, what I just shared a moment ago resonated in that. We are assuming sort of further deterioration and conservatism in the back half of the year -- or the remainder of the year, I should say, despite a lot of innovation that is still coming to market because we're just -- we're making assumptions around unemployment going up, delinquency rates getting worse, which means that financial institutions, although we're one of the last platforms they pull off of that they will be conservative in terms of their investment levels.\n\nSo, those are the assumptions that we've made for the remainder of the fiscal year for Credit Karma. And for Small Business, a lot of the strength that we're continuing to see is just -- it's a shift to digitization from folks that are already on our platform. So, we have a lot of customers that are on our platform. If you remember, we used the figure out there -- there's $2 trillion of invoices being managed on our platform, and we have over $100 million that as part of our -- well over $100 million as part of our payments charge volume, which means we have a huge opportunity to penetrate that within our existing base.\n\nAnd I use that just as an illustrative example, Kash. To answer your question, we're not making any assumptions around payments uptick because the macro environment will get better in the second half of the year. We're actually assuming that a lot of the growth that we are seeing is just continuing shift to digitization from those that are on our platform. And so, we make customer acquisition assumptions.\n\nWe make attrition assumptions. We'll look at assumptions around payments and payroll that are really in the context of how we feel about the environment going forward. Although we're not seeing it within our SMB segment, we are assuming a level of conservatism as we think about the remainder of the year. And those are the assumptions that we've made for both Small Business and Credit Karma.\n\nAnd tax, again, tax is economically resilient. We pretty much make assumptions based on our penetration in the assisted segment. And that's really -- that and the total number of IRS returns is where our assumptions come from. And again, those are -- that's economically resilient.\n\nSo, that's how we think about the guide going forward as we just reiterated. In terms of payments, listen, payments is one of the areas that we're the most excited about. If I had to pick a couple of areas, it's Mailchimp. It's payments, and it's what we're doing to go upmarket and with QuickBooks Advanced and mid-market.\n\nAnd with payments, we spent four or five years building out all of our fraud and risk capabilities, all of our AI capabilities, and we're just innovating very fast with that team. And a lot of the future around what we can do to digitize B2B around what's possible with bill pay, that -- those are yet to come and not even in our forecast going forward. We just believe that there's so much room for penetration attached going forward. So, hopefully, our [Inaudible] area of payments, you know, has been to your liking, but we think our best is yet ahead of us.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nWonderful. Thank you very much.\n\nOperator\n\nYour next question will come from the line of Scott Schneeberger with Oppenheimer. Please go ahead.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nThanks very much. Good afternoon. Sasan, I'm curious. I'm kind of honing in on Credit Karma and credit cards, which I believe is about half of the revenue.\n\nAnd please correct me if that's changed, perhaps gone up, based on what personal loans has done. But just how are you looking at credit cards? What are you seeing with consumers there? I understand it was the strength in that segment of the quarter versus personal loans, home loans, auto loans, auto insurance. What -- specifically in the credit cards, is that strengthening -- or maybe not strengthening, but weakening a lot less? Just honing in on that specific segment, what are you seeing from the consumer? Thanks.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah. Sure, Scott. First of all, it is -- as you said, it's a large part of the overall Credit Karma platform. With that said, I'll start with context that when you look at the 129 million customers or members that we serve on Credit Karma, the majority of our focus has been sub-prime and near-prime customers.\n\nAnd that's really a lot of our personalized experiences are for those cohorts. And one of the things that we're very excited about that we have shared at Investor Day is we're also building out capabilities and innovation for prime customers. And that's why we shifted Mint over, and we're combining the Mint and Credit Karma platform. So, that context is important because as you hear my answer, just hear it from the lens of the majority of where our business comes from is sub-prime and near-prime.\n\nIn the future, we'll also have capabilities, innovation, and ultimately, revenue that will come up front and prime as well, which positions us really well in the marketplace. And with all of that said, in essence, yes, we're continuing to see growth in credit cards, but we're actually assuming that that will really deteriorate the rest of the year based on unemployment going up and delinquency rates going up. And as you heard from both Michelle and I, we have built conservatism into the remainder of the year. And so, there's -- which will ultimately result in declining growth rate.\n\nBut what we saw in Q1 and the growth rate of the 2%, a lot of the headwinds in other verticals was offset by credit cards. But we have assumed that that will get worse over time.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nOK. Thank you. Appreciate that. Thanks.\n\nAnd then following on -- it's kind of more on the tax side, but overall, the guidance for the second quarter seems to be the most derisked with EPS down year over year. And that's an uncommon sequential change. But it sounds like the levers Michelle is pulling, it sounded like marketing and advertising was one of them. I infer that it's more in the small business side.\n\nBut just curious on the tax side, are you doing anything differently now that we may have a more normal tax season versus the past few with regard to advertising timing or overall? Thank you.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah, sure. I'm actually glad you asked about our second quarter guide of 8% to 9%. First of all, our momentum in Small Business continues into Q2. There are two elements that drive our guide of 8% to 9% revenue growth in second quarter.\n\nOne is we always make assumptions for tax. As you know, tax is tricky between second quarter and third quarter. And we make assumptions around when the IRS will open, forms availability, and those assumptions drive what we assume will happen in our tax business. And in some cases, we have elements of our tax business that actually we've assumed may decline in the second quarter.\n\nSo, that drives our guidance overall at the company level for Q2. And then Q2 generally has been seasonally the weakest quarter for Credit Karma because of the month of November, December, and January and then just the number of holidays. It's seasonally the weakest quarter. So, when you combine our assumptions with tax and you combine our assumptions with Credit Karma, that's where you get Q2 where it is.\n\nAnd hopefully, that answers your question.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nIt does. Thanks very much.\n\nOperator\n\nYour next question will come from the line of Alex Zukin with Wolfe Research. Please go ahead.\n\nAllan Verkhovski -- Wolfe Research -- Analyst\n\nHey there. This is Allan Verkhovski on for Alex Zukin. I think more people are warming up to your ability in hitting your SMB guide for the year despite the challenging macro. But I want to dig further into what you're seeing in the SMB segment today.\n\nCan you talk about what you saw around ARPC growth in the quarter, excluding the benefit you observed from the pricing increases that went into effect? It'd be helpful to get how much of a tailwind the pricing increase was in the quarter for QBO accounting and better understand the quarter how your growth levers, such as customer growth, upselling and cross-selling, were impacted from the macro, if at all? Thanks.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah, sure. Absolutely. The majority of our, you know, guide for the year and what we also saw in Q1 actually came from customer growth and mix, and mix includes things like QuickBooks Advanced. And, you know, you saw from our online services growth of 28%, we're seeing really sort of good growth from Payroll, Payments, Time Tracking.\n\nAnd that, of course, excludes Mailchimp, and we talked about Mailchimp separately. So, I think the short answer to your question is we are seeing the type of balance that we would want, which is our growth coming from customer growth and mix, and price will play an element -- a smaller element, but it plays an important element as we look at not only what we saw in Q1 but what we expect for the remainder of the year.\n\nAllan Verkhovski -- Wolfe Research -- Analyst\n\nGot it. And just as a quick follow-up if I may, on the Mailchimp front, I want to follow up to Keith's earlier point around Mailchimp revenues being sequentially relatively flat. Could you share maybe something more about maybe conversion rates? Or just a follow-up on the acceleration comment you made through the full year, just anything that could give us more color for how we think about potential revenue growth of Mailchimp for the full year? Thank you.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah. Yeah. Absolutely. I mean, if you go back to when we closed the deal almost a year ago, one of the things that we were very clear about, in addition to our excitement around the asset and the fact that now combined with QuickBooks, we can have one growth platform that can be the source of truth for -- and the source of growth for a small business, one of the things that we reiterated was that, you know, this was really a business that was run for profitability and it was run for cash flow.\n\nAnd even particularly in COVID times, where you saw a lot of front-office company accelerate, Mailchimp really didn't because, again, it was more run for cash flow and profitability. And so, we worked very hard in the last year to put a playbook in place in context of the priorities that we've shared to accelerate growth. And those priorities, they always take time to shift the business from being run for profitability and cash flow, to being run for a growth business, typically, takes a couple of years. And we're actually starting to see a trajectory change, you know, within the first year.\n\nAnd we're quite demanding of ourselves in terms of the velocity that we would like to see. So, really, what's happened there last year is we were taking a business that was, again, run for profitability, cash flow to revamping the website, coming up with a new campaign, revamping the product. And when I say revamp, it's not done. We've not reached the destination.\n\nIt's just the beginning of what's possible to really focus on high-value customers to position ourselves to go after mid-market to start ramping up what we can do internationally. All of these things, we're starting to now see indicators where in the quarter, although it was sequentially flat from a revenue perspective, we're seeing conversion from free to pay is up. We're seeing customer growth tick up. We're actually seeing expansion revenue, which means our customers are growing and they're upgrading what SKU they use.\n\nWe're starting to see these, and these things really become future indicators of growth. And that's why the comment that I made earlier and Michelle made earlier around, we expect that the growth in Mailchimp to accelerate in the coming quarters because we're seeing the KPIs around customer growth, expansion retention, these things are starting to improve. So, hopefully, that helps to answer your question.\n\nAllan Verkhovski -- Wolfe Research -- Analyst\n\nThank you very much.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYou're very welcome.\n\nOperator\n\nYour next question will come from the line of Steve Enders with Citi. Please go ahead.\n\nSteve Enders -- Citi -- Analyst\n\nHey. Great. Thanks for taking the question. I guess I just want to clarify a little bit on what you're seeing on the Credit Karma side and what you talked about historically on that front and what you're expecting for the guide here.\n\nI think before, you talked about expecting an acceleration kind of in the back half of the year as you kind of combine the cross-sell with TurboTax here. I guess, how are you thinking about that opportunity now given kind of where the macro is and what you're assuming versus the cross-sell that could potentially come here?\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah. You know, we have taken -- thank you for the question. You know, we have taken sort of a firewall approach here. One is we're very excited about the innovations that we talked about at Investor Day.\n\nAnd in fact, the only thing that's changed is we've added a few more innovations that we've launched within Credit Karma. The Marketplace that I shared earlier is one of them, where -- and it's almost at full scale where our customers see an additional tablet, a marketplace of all the products that are right for them in one place that brings more visibility and brings to the forefront products that are right for a specific cohort of customers. So, in terms of the integration with TurboTax, you're going to see a far more robust experience this year with Credit Karma being integrated into TurboTax and vice versa. Credit Karma Guarantee continues to be on track in terms of a rollout to customer -- to members and financial institutions.\n\nAll the innovations that we talked about, plus a few more are all on track, and we're equally as excited about the impact that it will have. And very consistent with what we shared at Investor Day, what we talked about then was that these innovations were not reliant on a macro pickup. They're just -- they're going to deliver more benefits, and therefore, more monetization. Back to the word firewall, we're not counting on those innovations in our results when we think about the rest of the year.\n\nWe're assuming current trends. We're assuming further conservatism for the remainder of the year. We're making assumptions around unemployment going up, delinquency rates going up. And so, therefore, that's informed our guide of minus 15% to minus 10%.\n\nAnd that's sort of separate and distinct from the innovation that we continue to be excited and focused on and are on track for the rollout.\n\nSteve Enders -- Citi -- Analyst\n\nOK. Gotcha. That's helpful. And I guess just to clarify again on Mailchimp.\n\nI know that last quarter, you were putting some changes in place to kind of improve conversion rates and really kind of rightsize or kind of build out some of the structure of that business. Like where are those changes you're making kind of at, at this point? And how should we kind of think about, you know, the level that so this kind of go in there to kind of more kind of rightsize that business?\n\nSasan Goodarzi -- Chief Executive Officer\n\nSure. Let me answer your question. I'm not sure what you mean by rightsize where -- is this -- we are very focused on investing in Mailchimp and accelerating the growth combined with the QuickBooks platform. And I would say a couple of big things that we have put in place and are continuing to implement.\n\nOne is really strengthening the leadership team at all levels. We're very excited about leaders that we -- had joined the Mailchimp family and with Rania's addition to the Mailchimp team, with additional changes that we are making to continue to strengthen the team, very excited about the impact there because that's having a direct impact on innovation, which is the second point I want to make. I really like the velocity, particularly what I've seen in the last 90 days. And I actually hope to see Mailchimp being one of the highest-velocity innovative teams across the company with the team that we have in place.\n\nAnd I think everything that I mentioned earlier that we have launched is a result of the impact of that team. And lastly, it's about impact. And we're starting to see the key performance indicators that I mentioned earlier uptick in the right direction, which means that almost a year in, it's not been quite a year, but almost a year in, I feel very good about sort of Year 2 because we've put a lot of foundational things in place in Year 1. We have a lot of work still ahead of us.\n\nBut a lot of the work is about turning this into a sort of a strong growth business and fueling the success of small businesses, and I feel like we are on that trajectory given what I've seen, particularly in the last 90 to 100 days.\n\nSteve Enders -- Citi -- Analyst\n\nOK. Perfect. Appreciate the color there.\n\nOperator\n\nOur final question will come from the line of Daniel Jester with BMO Capital Markets. Please go ahead.\n\nDaniel Jester -- BMO Capital Markets -- Analyst\n\nHey, thanks for squeezing me in. I appreciate it. Two quick ones. A lot of talk about the macro with regards to Credit Karma.\n\nI'd love to hear about how you're overlaying that macro on QuickBooks Capital and anything you might be doing differently there as the year progresses, given the uncertainty. And then secondarily, Sasan, you talked about some of the economic indicators you track for small business. Are you seeing consistency in the U.S. and international? Or is maybe one geography stronger than the other right now? Thank you.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYeah. Absolutely. Let me start with your macro question and QuickBooks Capital. We have built incredible machine learning capabilities, where we literally can control the dial of which customers --capacity for customers on a daily basis.\n\nAnd QuickBooks Capital is very important for our customers, and it is not a material sort of revenue driver for the company. It is, however, essential as part of our overall platform. So, I think that what I would say is we're very good and have been very good. I think it's been proven, especially during the COVID times, to be able to adjust the doubt so that we offer capital only to those that we can see can pay it back.\n\nAnd remember, the loans that we typically give could be from 30 days to six months. And there's a ceiling for all of these loans. So, we feel very good about the macro environment impact and how we manage our QuickBooks Capital within that context, and I think we've proven that during COVID. The second element of your question, I would love to sort of parse it out in two ways.\n\nOne is even in the U.S., there are sectors within small business. Remember, we're very diversified in the small businesses that we serve. But there are segments within small businesses that have gotten hit hard. Those that focus on auto sales, those that focus on financial services, those that focus on real estate.\n\nSome of their revenues are down 10% to 15%, but you don't really see that in our results because we're very, very diversified. We're not -- no one sector can really impact our overall results. So, that's in context of the globe, but it's also in context of the U.S. Not every sector is created equal.\n\nSome sectors are hit hard, the ones that I just mentioned. I would say U.S. has been the strongest, followed by Canada. And the ones that have been hit the hardest has been U.K., Australia, and France.\n\nAnd again, our -- we're not -- we've not assumed any of this in our guidance, but our hope is those will, over time, begin to bounce back. We've not seen the bounce back yet, but they've been hit harder than the U.S.\n\nDaniel Jester -- BMO Capital Markets -- Analyst\n\nThank you very much.\n\nSasan Goodarzi -- Chief Executive Officer\n\nYou're very welcome. And I think that was the last question. And so, maybe I can bring us to a close by saying thank you for all of your wonderful questions. And be safe, and we look forward to seeing all of you for our second quarter earnings results.\n\nUntil then, be safe. Thank you, everybody. Bye-bye.\n\nOperator\n\n[Operator instructions]\n\nDuration: 0 minutes\n\nKim Watkins -- Vice President, Investor Relations\n\nSasan Goodarzi -- Chief Executive Officer\n\nMichelle Clatterbuck -- Chief Financial Officer\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nKirk Materne -- Evercore ISI -- Analyst\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nAllan Verkhovski -- Wolfe Research -- Analyst\n\nSteve Enders -- Citi -- Analyst\n\nDaniel Jester -- BMO Capital Markets -- Analyst\n\nMore INTU analysis\n\nAll earnings call transcripts"
}