{
  "companyName": "Walt Disney",
  "companyTicker": "DIS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/walt-disney-dis-q3-2022-earnings-call-transcript/",
  "content": "Walt Disney (DIS -0.34%)\nQ3 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to The Walt Disney Company's third quarter 2022 financial results conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Alexia Quadrani, senior VP of investor relations. Please go ahead.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nGood afternoon. It's my pleasure to welcome everybody to The Walt Disney Company's third quarter 2022 earnings call. Our press release was issued about 25 minutes ago and is available on our website at www.disney.com/investors. Today's call is being webcast, and a replay and transcript will also be available on our website.\n\nJoining me for today's call are Bob Chapek, Disney's chief executive officer, and Christine McCarthy, senior executive vice president and chief financial officer. Following comments from Bob and Christine, we will be happy to take some of your questions. So with that, let me turn the call over to Bob to get started.\n\nBob Chapek -- Chief Executive Officer\n\nThank you, Alexia, and good afternoon, everyone. We had an excellent quarter powered by world-class storytelling, outstanding performance at our domestic theme parks, increases in live sports viewership across our linear channels and ESPN+ and significant subscriber growth at our streaming services which added 15.5 million subscriptions in the quarter, including 14.4 million Disney+ subscribers, of which 6 million were core Disney+ and 8 million were Hotstar. As of the close of Q3, we now have 221 million total subscriptions across our streaming offering. Our results showcased the ability of the Walt Disney Company's uniquely diversified businesses to power our ecosystem and explore growth opportunities across industries and distribution channels.\n\nI'll expand on all this and more, and then Christine will go through the details of our results and provide additional insight into our fiscal 2024 expectations for Disney+. Creative excellence in storytelling that build deep emotional connections with audiences is at the root of our success. And I am pleased to say that our creative engines are firing on all cylinders across franchise, general entertainment and sports. In a testament to the depth, breadth and quality of our creative teams, we received 147 Primetime Emmy Award nominations this year, including 92 for our streaming platforms and 21 for best program in a genre.\n\nRecognition across formats and distribution channels with 47 different shows receiving nominations, including titles like Only Murders in the Building, Abbott Elementary, What We Do in the Shadows and The Dropout right alongside shows from Disney, Marvel and Star Wars. And most recently, we received an additional 71 news and documentary Emmy nominations across ABC News, National Geographic, FX, Hulu, and ESPN. In addition to critical and industry recognition, we are thrilled by the audience response to our general entertainment offerings, response that is enhanced by a distribution strategy that maximizes reach by taking advantage of the strength of both our linear and streaming channels. Given the multiple ways we bring our content to audiences, we take a thoughtful approach to each distribution decision to determine the best strategy for each of our many high-quality titles and platforms.\n\nSome like the buzz-generating Candy, the Kardashians, and The Bear may be best served as Hulu Originals. Others like Abbott Elementary and The Old Man have become multi-platform hits by reaching different audience demographics across both linear and streaming. And when it comes to our key franchise content, I could not be more proud of the teams at Disney, Pixar, Marvel, and Star Wars. The hugely successful Doctor Strange in the Multiverse of Madness has earned nearly $1 billion at the global box office.\n\nAnd Thor: Love and Thunder, which premiered on July 8, has grossed over $700 million at the global box office and is the highest domestic grossing film of the Thor franchise. Pixar's Lightyear marked the studios return to the big screen and the film debuted on Disney+ last week. Speaking of Disney+, which is now available in 155 markets after recently launching in 53 new territories, we released content with appeal across demographic groups, including Obi-wan Kenobi and Ms. Marvel, as well as feature films like Disney's Chip n' Dale Rescue Rangers and Disneynature's Polar Bear.\n\nAs you know, Disney+ is still a young business and we are learning more every day about the services ability to attract new fans to our powerhouse franchises. For example, in addition to driving engagement among tens of millions of existing Marvel fans, we have seen each new Disney+ original Marvel series attract incremental viewership and new subscribers that hadn't previously engaged with Marvel content on the service, thanks to the episodic format that enables us to explore new characters and genres. The value of expanding the fan base is tremendous, and this new audience can then experience Marvel across our other offerings from consumer products to games to theme parks. Looking ahead, Q4 will feature a fantastic Disney+ content slate with a steady flow of key releases including Marvel's She-Hulk: Attorney at Law, Lucasfilm's Andor, and Disney's Hocus Pocus 2, and we look forward to celebrating the second annual Disney+ Day on September 8 with activations across our synergy machine.\n\nGiven the global nature of Disney+, we are thrilled to bring international music sensation BTS to the service with an exclusive cinematic concert film and docuseries following the band's incredible journey. BTS and the K-pop genre at large carry massive global appeal and affinity, which will further extend our reach into that global fan base. And we continue to step up our investment in international local originals across formats including bringing the seventh season of Koffee With Karan, one of India's most popular talk shows exclusively to Disney+ Hotstar. On the theatrical side, we have a robust slate debuting later this year, including the highly anticipated Avatar: The Way of Water, our newest animated film Strange World, and the final film in Marvel's Phase Four, Black Panther: Wakanda Forever.\n\nExcitement for this film is amazing, and the trailer received more than 170 million views in its first 24 hours. Turning to sports. Our industry-leading run of rights acquisitions positions us extremely well for the future. We will continue to focus on audience expansion and long-term profitability by being disciplined in our acquisition approach and making deliberate distribution decisions for each sport in the portfolio.\n\nThe results of this approach were fantastic last quarter as The Walt Disney Company was responsible for 47% of sports hours watched by the 18 to 49 demo in fiscal Q3. Our innovative NHL deal has been a difference maker across platforms with the Stanley Cup playoff viewership up 60% over 2021 across cable and broadcast, including significant year-over-year increases in younger demos and female viewers. We also secured exclusive TV rights for the upcoming 2023 to 2027 IPL season following a competitive process where we made disciplined bids with a focus on long-term value. We are excited to continue offering IPL to our linear customers in India where growth potential exists for our portfolio of more than 70 channels that reaches 90% of pay cable and satellite TV homes in the region.\n\nPay TV distribution in India continues to be a robust business with projected GDP growth expected to drive advertising and consumer spending. In fact, India is one of the only markets in which we are launching new linear channels. Finally, given the results of our recently completed upfront, it is clear that our unmatched portfolio continues to be highly sought after by advertisers. Combined with our deep expertise in ad tech, we are in a position of strength with record upfront advertiser commitment leading into the launch of our ad-supported Disney+ tier.\n\nSince the launch of Disney+, advertisers have been asking for the opportunity to connect with audiences alongside the most premium brands in content and streaming. As we shared earlier today, the Disney+ ad tier goes live on December 8, and we are taking a thoughtful approach by launching with a lower ad load and frequency to ensure a great experience for viewers. This approach, coupled with strong advertiser demand, translated into Disney+ earning industry-leading CPM rates at the most recent upfront. Turning to our parks.\n\nThis quarter featured new magic around the world and strong operating performance. All of our theme parks are now open, and we continue to bring back more of the great experience that guests love that includes Character Meet and Greet, Nighttime Spectacular at Disneyland, and Theatrical Performances. These offerings are not only big hits with guests, but also enable us to welcome more people into our parks each day. We continue to see strong revenue and profit growth at our domestic parks and experience businesses.\n\nEven as our cruise ships and international visitation have yet to fully recover. Domestic demand at our theme parks continues to be strong, and we are seeing continued progress in those businesses still recovering from the pandemic. At the same time, the business model transformation we have achieved over the past few years have driven substantial increases in per capita spending and give us the flexibility to adapt should economic conditions change. We celebrated three major milestones for our parks and experience business this quarter, each of which were priorities I said when I had the opportunity to lead our parks team.\n\nFirst, the innovative and immersive new roller coaster, Guardians of the Galaxy: Cosmic Rewind, opened in Epcot as part of the park's ongoing transformation to a place that is more family, more timeless and more Disney. Second, we expanded the Disney Cruise Line fleet with a Disney Wish which sailed its maiden voyage on July 14. This is the first of three new ships and is infused with Disney storytelling, one-of-a-kind entertainment and a modern interior aesthetic. It is powered by liquefied natural gas, one of the cleanest burning fuels available.\n\nAnd finally, Disneyland Paris opened Avengers Campus on July 20, completing the first phase of our ambitious expansion plan. The new immersive area features two new attractions, five action stunts, encounters with Marvel superheroes and themed restaurants. I had the opportunity to help open this new land with stars from the Marvel Cinematic Universe and our cast, and I could not be more proud of the resort's ongoing transformation. Guests are responding in a big way to our enhanced offering at Disneyland Paris' per capita spending in Q3 was up over 30% versus 2019, a great sign of the site's potential for growth.\n\nI am incredibly pleased with our performance this quarter, our competitive position and the unique collection of assets and capabilities that sets us apart. Going forward, The Walt Disney Company's incredible employees, cast members and creative teams will continue to transform entertainment by combining extraordinary storytelling with innovative technology to create an even larger, more connected and magical Disney universe for families and fans around the world. With that, I'll hand it over to Christine.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nThanks, Bob, and good afternoon, everyone. We are pleased with our strong financial results this quarter with diluted earnings per share, excluding certain items increasing to $1.09 versus $0.80 in the prior year quarter. At parks, experiences, and products, third quarter revenues increased by more than $3 billion and operating income increased by $1.8 billion versus the prior year, reflecting improvements across both domestic and international parks and experiences. Demand at our domestic parks continues to exceed expectations with attendance on many days tracking ahead of 2019 levels.\n\nAnd our continued focus on improving the guest experience through the use of our reservation system to purposely manage capacity versus simply increasing volume has the added benefit of improving yield and optimizing overall economics. So even while the average daily attendance at our domestic parks across the first three quarters of this fiscal year was slightly below 2019, we have delivered significantly higher revenue and operating income over that same time period. This approach also provides flexibility with levers we can adjust if demand were to shift. Per capita spending at our domestic parks also remained strong, increasing 10% versus Q3 of fiscal 2021 and over 40% versus fiscal 2019.\n\nAnd in another sign of the robust demand we have seen at our parks and resorts, occupancy at our domestic hotels in the third quarter was 90%. Looking ahead, domestic demand at our theme parks continues to look robust with current forward-looking hotel bookings and intent to visit roughly in line with pre-pandemic trends. Improvement at our international parks in the third quarter was driven by Disneyland Paris, where both revenue and operating income exceeded 2019 levels. And we are seeing the same momentum well into Q4 as we continue to celebrate the 30th anniversary and the opening of Avengers Campus in July.\n\nDisneyland Paris' strong performance in the third quarter was partially offset by closure-related impacts at Shanghai Disney Resort, where the theme park was closed for all but the last three days of the quarter. At the media and entertainment distribution segment, third quarter revenues increased by over $1.4 billion versus the prior year, and operating income decreased by $645 million as an increase at linear networks was more than offset by declines at direct-to-consumer and content sales, licensing and other. Linear Networks operating income in the quarter increased 13% to approximately $2.5 billion, driven primarily by growth at our domestic channels. The increase at domestic channels reflects double-digit percentage operating income growth at both cable and broadcasting.\n\nGrowth at cable was largely driven by higher advertising revenue and to a lesser extent, a decrease in marketing costs and an increase in affiliate revenue. Advertising revenue at cable benefited from the timing of the NBA Finals, which represented six of the top seven telecasts among the coveted P18 to 49 demo across all networks this quarter. Note that the final aired in the third quarter this year versus the fourth quarter of the prior year. This timing impact, in addition to the benefit of adding the NHL to our portfolio and strong pricing from the continued strength of live sports, drove ESPN advertising revenue growth of nearly 40% year over year.\n\nDemand for live sports remains strong. However, due to the NBA Finals' timing impact, fourth quarter-to-date domestic cash advertising sales at ESPN are currently pacing down. Moving on to Broadcasting. Operating income increased versus the prior year due to higher results at both ABC and our owned television stations.\n\nTotal domestic affiliate revenue increased by 2% in the quarter. This was driven by six points of growth from higher rates, partially offset by a three-point decrease from fewer subscribers. International channels' operating income was comparable to the prior year, reflecting increased sports programming costs, partially offset by advertising revenue growth. Both of these trends were driven by the airing of 35 additional IPL cricket matches in the third quarter versus the prior year.\n\nNote that results also benefited from the closure of certain channels over the past year. At direct to consumer, lower operating results across Disney+, Hulu and ESPN+ reflect increased programming and production costs, in line with the guidance we gave last quarter as we continue to strategically invest in our streaming businesses. At Disney+, we crossed the 150 million subscriber milestone and ended the third quarter with more than 152 million global paid subscribers, a net addition of more than 14 million subs versus Q2. Strong Disney+ core net subscriber additions of 6 million reflect growth in existing markets, as well as launches in over 50 new markets during the quarter, and we currently expect Disney+ core net additions in the fourth quarter to accelerate modestly versus Q3 and particularly in the domestic market.\n\nAt Disney+ Hotstar, subscribers increased by over 8 million as the IPO concluded its 15th season in the quarter. Hulu added more than 600,000 subs during the quarter and ended the third quarter with 46.2 million paid subscribers and ESPN+ ended Q3 with 22.8 million paid subscribers, a net increase of about 0.5 million versus Q2. At content sales, licensing, and other, operating results decreased in line with our expectations by about $160 million versus the prior year quarter reflecting an unfavorable foreign exchange impact and lower TV/SVOD and home entertainment distribution results, partially offset by higher stage play and theatrical results. As it relates to foreign exchange, note that the overall impact to the company's segment operating income was only modestly negative in the quarter, as our FX hedging program continued to be effective in mitigating the impact that changes exchange rates have on our businesses.\n\nAs we continue to scale back on third-party content licensing, we believe content sales, licensing and other results will continue to face headwinds and expect fourth quarter operating results will decrease versus the prior year by close to $100 million. Cash content spend across the company is now expected to total approximately $30 billion for fiscal 2022. This estimate is slightly lower than our previous guidance, largely due to timing changes and we expect annual cash content spend over the next couple of years to be roughly in the low $30 billion range as well. We are also revising our full year forecast for capital expenditures to $5 billion compared to fiscal 2021 capex of $3.6 billion.\n\nOur new expectation for 2022 is roughly $500 million lower than our previous guide, in part reflecting timing shifts of various projects across the company. Finally, before we move to Q&A, I want to spend some time sharing a few updates on our fiscal 2024 guidance for Disney+. We are providing more detail on subscriber targets by separating our guidance into two categories: core Disney+ and Disney+ Hotstar. Excluding the impact of any significant future macro headwinds, our core Disney+ subscriber target range is 135 million to 165 million by the end of fiscal 2024, largely consistent with previously provided guidance that non-Hotstar Disney+ subscribers in 2024 would approximate 60% to 70% of the expected 230 million to 260 million total subscriber base.\n\nWe are, however, updating subscriber guidance for Disney+ Hotstar to up to 80 million subscribers by the end of fiscal 2024. We intend to refine this target over time as subscriber visibility in India will be clearer once the ICC and BCCI cricket rights sales processes are completed. As you may know, we recently made the disciplined decision to not proceed with the Indian Premier League digital rights, and we'll evaluate these rights with that same discipline. As we sit here today, we remain confident that Disney+ will achieve profitability in fiscal 2024 and look forward to several upcoming catalysts, including reaching a steady state of tent pole original content releases, delivery of premium general entertainment and international local originals and the upcoming launch of our ad-supported tier, alongside the new pricing structure announced earlier today.\n\nAnd with that, I'll turn it back to Alexia, and we would be happy to take your questions.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nThanks, Christine. [Operator instructions] And with that, operator, we're ready for the first question.\n\nOperator\n\n[Operator instructions] And the first question will be from Doug Mitchelson from Credit Suisse. Please go ahead.\n\nDoug Mitchelson -- Credit Suisse -- Analyst\n\nThanks so much. One question, there was so much to ask about. Why don't I go with this, and I do appreciate you separating out the guidance between Hotstar and core Disney, but parks were impressive this quarter. And as you talked about levers if demand were to shift, is the company satisfied pent-up demand from the pandemic at the parks' point? Should we look at the go-forward basis is relatively normal trends? And I'm guessing you have a different answer for domestic versus international.\n\nAnd Christine, I'd be curious if you'd put any meat on the bone regarding the levers if demand were to shift at the parks.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nSure. Thanks, Doug. Our parks certainly did have a fantastic quarter. And I just want to say that the parks team is the same team led by Josh D'Amaro that was able to manage through the COVID crisis that impacted the business significantly.\n\nThey also were able to ramp back in on a very phased basis back to the recovery phase, and they're now positioned for growth. So I just want to acknowledge that team for being sort of a triple threat when it comes to being able to manage from very, very different vantage points based on the environment. As it relates to levers of demand, some of the things we could do, Doug, we had limited the number of annual passes that we have across some of our businesses -- some of the parks. And all of those come with some -- with the exception of the highest tiered priced annual passes.\n\nThey all come with some blackout dates. So to the extent to which perhaps you had lightened demand, you could loosen up some of those to bring more people in the park and just enjoy the park and spend money while they're there. And also, as it relates to demand, we have not yet seen demand abate at all. And we still have many days when people cannot get reservations.\n\nSo we're still seeing demand in excess of the reservations that we are making available for our guests.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nThank you. Next question.\n\nOperator\n\nThank you. And the next question will be from Ben Swinburne from Morgan Stanley. Please go ahead.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nBob, can you talk a little bit about sort of the research and insight you have into your streaming customer base that sort of informs the decision to take these price increases, which, on a percentage basis are pretty large without really reducing net adds with from churn spiking as you implement these price increases? And maybe talk a little bit about how the product that consumers will be paying for next year at these higher prices will compare to this year. And I'm just wondering, are you planning to take similar pricing moves at least directionally outside the US over time.\n\nBob Chapek -- Chief Executive Officer\n\nWell, as you know, we launched at an extraordinarily compelling price across all the platforms that we have for streaming. I think it was easy to say that we're probably the best value in streaming. And since that initial launch, we've continued to invest handsomely in our content, as you know. We believe because the increase in the investment over the past two and a half years relative to a very good price point that we have plenty of room on price value.\n\nAnd we do not believe that there's going to be any meaningful long-term impact on our churn as a result. I mean, one only needs to look at our recent significant increase on ESPN+, which had the exact same impact of really no meaningful impact at all on our churn. And we believe that we've got plenty of price value room left to go.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nThank you. Next question.\n\nOperator\n\nThank you. And the next question will come from Steven Cahall from Wells Fargo. Please go ahead.\n\nSteven Cahall -- Wells Fargo Securities -- Analyst\n\nThanks. So the DPEP margins were really spectacular. I'm just wondering what kind of trends you're seeing from international visitations. Were those strong in the quarter, or is that a tailwind to either per caps or hotel occupancy as you get into the back half of the year and you see more international traffic?\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nI'll take that one, Steve. The DPEP margins were indeed very strong. One of the things that we've seen is during the pandemic, international visitation to our domestic park primarily Walt Disney World was basically nonexistent. That has proceeded come back, and it has come back very nicely, but it is still below the traditional range that we've given you, which is around 17%, 18% up to the low 20s.\n\nBut it's made significant progress, and we expect the international visitation, when it is fully back, to actually be additive to margins because those guests tend to stay longer at the parks, and they spend more money when they're there as well.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nThank you. Next question.\n\nOperator\n\nThe next question is from Michael Nathanson from MoffettNathanson. Please go ahead.\n\nMichael Nathanson -- MoffettNathanson -- Analyst\n\nThank you. I just wanted to dig a bit on the ad product at Disney+. What's your expectation for ad load or monetization per sub, given there's a $3 difference between the premium with no ads and the ad product and maybe what you've learned from Hulu over the years that informs your expectations on monetization.\n\nBob Chapek -- Chief Executive Officer\n\nAs you know, we've had a lot of experience with this on Hulu and a lot of success with this on Hulu. And we are walking before we run in terms of seeing what the market will bear in terms of an ad load. So we're going in very conservative upfront. But we believe that there's probably going to be some more ultimate elasticity in that, as well as we go forward.\n\nAnd we're just really thrilled that we're able to launch the Disney+ ad tier and expand our audience access through all these multiple price points that we're going to have. And as Christine had alluded to, the advertising demand since the launch of Disney+ is great. And we think that by taking a conservative approach in terms of that ad load upfront, it will give us the ability to expand if we need to and not have to go the other way, which I think would be a much bigger deal.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nAnd the only other thing I'd add to that, Michael, is based on our Hulu experience that even current subscribers who have ad-free may choose to stay at the same price point with ads. But the Hulu ad-supported tier has more subscribers than the ad-free. In fact, it's well over about -- it's about two-thirds. And that's something that we can't anticipate that we'd have exactly the same behavior because it's a different demo that has Disney+ versus Hulu, but that's the best indication that we have.\n\nBut we expect the ad tier to be popular, and we also expect some people to want to stay with ad-free.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nThank you. Next question.\n\nOperator\n\nAnd that question will come from Jessica Reif Ehrlich from Bank of America. Please go ahead.\n\nJessica Reif -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Maybe switching gears a little bit to sports. Can you give us your thoughts on what the structure of an NBA renewal might look like? Would it be different? And in the past, you've mentioned participating in sports betting. You have the best brand name.\n\nCan you maybe elaborate a little bit on timing of what you're thinking? And then just a follow-up to some of the comments. You launched a new cruise ship; can you talk about what you're seeing in terms of cruise demand overall?\n\nBob Chapek -- Chief Executive Officer\n\nI think you want to divide yourself. OK. I'll talk about the MBA first. As you know, we've had a great history with the NBA.\n\nReally proud of our partnership there. And the past season and the ratings for the finals have been absolutely extraordinary. So we're interested in a renewal with the NBA. But like all of our decisions that we make in terms of content, we'll only do it if it's accretive to shareholder value.\n\nAnd I think that remains the overall guidance, whether you're talking about India with IPL, whether you're talking about college sports, whether you're talking about Formula One racing or you're talking about NBA. So we have an interest to do that. We're really happy with our portfolio of sports rights that we have. But of course, the continued relationship with the NBA would be something that would be very attractive to us.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nDo you want to take sports betting?\n\nBob Chapek -- Chief Executive Officer\n\nYeah. Well, in terms of sports betting, we have been in conversations for quite a long time now with a number of different platforms to add some utility to sports betting and take away some friction for that for our guests. We have found that basically our sports fans that are under 30 absolutely require this type of utility in the overall portfolio of what ESPN offers. So we think it's important.\n\nWe're working hard on it and we hope to have something to announce in the future in terms of a partnership there that will allow us to access that revenue stream and also make sure that our guests are being -- having their needs met.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nSo Jessica, on cruise. As you know, we welcomed our fifth ship to our four-ship fleet, so we now have five. The new ship goes by the name of Wish, as Bob mentioned, and it's quite an extraordinary vessel. But we've always said that that business has been the most severely impacted by COVID in terms of duration of disruption to the business.\n\nSo we're still coming out of that, but we are focused on the business recovering. Historically, the cruise line has been terrific with really attractive ROICs for us, and it's generated double-digit returns on the investment. And we expect that business to come back to the similarly attractive returns that we had previously experienced. And a couple of things.\n\nThe Wish is our newest ship, and that has gone with very, very high capacity. And that one, it's just very well received. But we have a competitive position overall in the cruise business, especially the family cruise market. So we generate pricing that's well above the industry average.\n\nAnd our cruise ships deliver for us one of the highest rated guest experiences across all of our parks and experiences offerings. And this is a really interesting comment that we received from our cruise passengers. 40% of them say that they would not have chosen to go on a cruise vacation if it weren't a Disney Cruise. So we're a unique product, and we're still a relatively small share of the cruise market and we're positioned for growth.\n\nAnd the other four ships are all sailing and their occupancy is improving week by week.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nThank you. Next question please.\n\nOperator\n\nNext question is from Kutgun Maral from RBC Capital Markets. Please go ahead.\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for taking the questions. One on the parks and then a follow-up on FX, if I could. First, the parks are going through a particularly innovative and transformative period given your investments in technology, digital tools and improvements in the guest experience.\n\nSo from the outside, it seems that the business is as well positioned as it's ever been in the face of a potential recession. But I'd love to get your views on the various sensitivities associated with what the consumer is seeing and how you'd characterize the resiliency of the business. I know you talked about different levers at your disposal, but perhaps there's been a structural change in the business compared to prior recessionary periods that you could speak to? And then, Christine, if I could follow up on your foreign exchange commentary. Can you share a bit more on how you manage your FX risk? And what was the impact of FX on DTC ARPU?\n\nBob Chapek -- Chief Executive Officer\n\nYeah. I think a lot of onlookers look at our park business and try to sum up our success recently and say that it has something to do with pent-up demand. And certainly, there is pent-up demand. But what we're seeing is far more resilient, far more long lasting in terms of increase in the affinity for our parks, both from the willingness to come to our parks and its attendance, but also in terms of what guests are willing to spend when they get there in order to personalize their experience.\n\nAs you know, everything we do in our parks is all about improving the guest experience. And part of that has to do with limiting capacity but also about personalizing those experiences. So we believe we do have a lot of flexibility to shift if our demand changes. Remember, we have a reservation system, which now enables us essentially real time on the fly to change whatever factors we need in terms of our ticket packaging that we want, where years ago, we didn't have that.\n\nWe published our prices by the quarter and that was essentially all the flexibility we had. But as you know, our business looks very strong with forward-looking bookings and intent at pre-pandemic levels, and we see nothing in the future that's indicating anything to the contrary of what we've seen. So we're very pleased with that. I should also remind you that our reservation system really does a great job at spreading demand.\n\nSo if we see any spikiness, we can actually smooth that in a way that we couldn't before. And we're real pleased with that because even our Genie product, which, as you know, we released just a little bit short of a year ago, now about 50% of the people that come through the gate actually buy up to that Genie product, which I think you can see the result of in our yields.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nAnd I'll take the question on foreign exchange and the way we hedge. So we do have a hedging policy that is well established and has really served the company well over very volatile foreign exchange markets. So just level set, we have a program, and the goal of it is to reduce the impact that changes in foreign exchange rates have on our current and future earnings. So we really have an objective of trying to attain earnings and cash flow stability and predictability.\n\nSo we try to take out the ups and the downs. So the hedging program, it has significantly reduced the negative earnings impact of the strong dollar that we've seen, both in the third quarter, as well as the fiscal year-to-date. And so, despite being economically hedged as it relates to ARPU, we do not allocate the hedge gains or losses specifically to ARPU in the various markets. So therefore, the reported ARPU for international Disney+ was impacted by the unfavorable exchange rates in the quarter.\n\nAnother thing is when you look at content sales and licensing, especially if you go back and look at the transcript, you'll note that there was a reference to that also being impacted by negative foreign exchange. That was just a balance sheet ineffectiveness. We also hedge the balance sheet. And that had to do more with we based our hedging on forecasted plans.\n\nAnd if the plans come in stronger and were under-hedged or over-hedged, in this case, we were -- it did not benefit us because we were hedged the right way for the dollar strengthening, but that is a one-timer that should not be repeated. But as it relates to ARPU, if you have some volatility, you will see it in the ARPU, but it nets out as a company overall. As I mentioned in my other comments, that this is not a material item for us on a consolidated basis. You just saw it spike out, especially in DMED.\n\nAnd the other thing is we do hedging on a multiyear basis. So we layer in our hedges over a period of time, which has really served us well in the current environment.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nThank you. Next question.\n\nOperator\n\nAnd the next question is from in Kannan Venkateshwar from Barclays. Please go ahead.\n\nKannan Venkateshwar -- Barclays -- Analyst\n\nThank you. So maybe, Bob, from a strategic perspective, when you think about sports, it does seem like that there are a lot of new entrants. I mean, Apple seems to be interested in more and more sports rights. And from your perspective, you obviously walked away from the cricket rights in India and it looks like Big Ten may also be going in a different direction.\n\nSo when you think about sports strategically, given that cord cutting is structural, how do you think about this business longer term? Do you really have to own ESPN or get into sports streaming in a much bigger way or invest a lot more? I mean directionally, they are opposite obviously, from a decision perspective. So it would be great to get a sense for how you're thinking about sports more broadly. And then, on the advertising side, if I could just ask a bigger picture question around Disney+. From a subscriber base perspective, Disney+ is comparable domestically to Hulu and US is the biggest ad market when it comes to the television opportunity.\n\nSo when we think about the scale of advertising for Disney+, is Hulu the kind of benchmark we should be thinking about, or can Disney+ be much bigger because it is international in scale, all those CPMs are much lower outside the US So if you could just help us scale that opportunity, that would be great.\n\nBob Chapek -- Chief Executive Officer\n\nOK. In terms of the strategy on sports, we're continually enamored by the power sports in terms of viewership and what it adds to our overall portfolio, particularly in an advertising type world. As you know, we get strong cash flows on linear, and it helps to pay some of the bills in the companies we make some of our significant investments in content, and we also like the proposition of growth and expansion on our DTC. In terms of the rights, if you look at the college rights, we've got the SEC, we've got the ACC, we've got the Pac-12.\n\nWe've got the Big 12. We've got the play off. We've got the most comprehensive programming. So if we don't get rights in every single conference, we don't believe that's in any way limiting for us.\n\nBut what we're all preparing for is the future of what ESPN would look like in a direct to consumer -- in a true direct-to-consumer fashion. And I think the way that we're looking at this is that we want to proactively prepare for that future without prematurely disrupting the cash flow that we get from the linear networks right now. And as you know, we've negotiated flexibility into our rights agreements across the board for any new rights that we have acquired over the last several years. But we're still bullish on sports.\n\nWe believe there's tremendous degrees of freedom in terms of what ESPN DTC ultimately looks like. I think we're very proud of what we've done to date on ESPN+, but that no way limits how we envision what true ESPN DTC proposition would look like going into the future.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nKannan, thank you for asking this question about advertising. I know there's been a lot written recently about ad trends. But I just want to start off by saying pacing in our scatter market continues to be solid across streaming, sports, as well as our broadcast network, Now, to get to your question about Disney+ AVOD and the scale, first of all, we are going to launch later this year, as Bob said, December 8. And we're taking an intentionally limited approach to it, meaning we're launching with a lower ad load and a lower frequency than say, Hulu.\n\nAnd so, this will ensure a great experience for viewers and these viewers are different then because a lot of them are families and you have a lot of adults at Hulu, but it's a different viewing experience. But because of that disciplined lower ad load, lower frequency and the strong advertising demand that we've had, that translates into some of the industry-leading CPM rates at the most recent upfront for Disney+. And then, we look at beyond domestic, what we can do internationally. And we plan to go international sometime next year.\n\nAnd we've built these strong advertising relationships around the world with our previously existing and currently existing linear footprint. So we're confident in our ability to navigate the international advertising marketplace given our depth of knowledge and experience with the traditional linear business. So we really feel well suited to deliver both domestically on Disney+ AVOD, as well as international.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nThank you. Next question.\n\nOperator\n\nAnd next question is from Phil Cusick from J.P. Morgan. Please go ahead.\n\nPhil Cusick -- J.P. Morgan -- Analyst\n\nThank you. One and a follow-up on DTC. First, Christine, there were higher DTC and Disney+ programming costs than we expected this quarter. Can you give us some direction of where to go in the fourth quarter? And when should we expect those Disney+ operating income losses to peak? And then second, if you could dig into the guidance to acceleration of subs in the fourth quarter, I think that's an acceleration in the total subs and then you set a higher mix of growth toward domestic?\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nOK. Let me start first with the acceleration of subs. I did mention that that we expect acceleration of subs to be -- especially in the domestic market to be modestly above where we are now. But you will see growth in Q4, and we feel good about that because of the content releases we have and just the existing shows that are on.\n\nPeak losses, we expect peak losses -- as of today, we expect Disney+ to reach peak losses in this current fiscal year '22. So that is something that is consistent with what we've previously said.  As it relates to higher costs of content and programming. We have said that we have -- this is a peak year of losses, which includes those costs.\n\nBut also, we expect, as we go into developing our full slate that the next quarter, you will see a similar increase year over year that you saw this quarter.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nThank you. Next question.\n\nOperator\n\nAnd that question is from Brett Feldman from Goldman Sachs. Please go ahead.\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nThank you. And if you don't mind, I'd like to follow up with the question about the ad experience on Disney+. And it's only two things I was hoping you could comment on. The first is would you expect to potentially display ads alongside any of the content? Some of that content, including some of the kids' content, I think, historically in a linear world didn't necessarily have ads alongside of it.\n\nSo I'm just thinking about that element of it. And then, secondly, you have a competitor that's looking to layer advertising into their product, they're suggesting that they're going to somehow do it differently. And I'm just curious, as you think about the experience you've had in streaming advertising. Are you mostly going to look to leverage the formats you've used very successfully with Hulu, or do you actually think there may be an opportunity to use some innovative new formats on Disney+ for ads?\n\nBob Chapek -- Chief Executive Officer\n\nI should say that the technology for Disney+ is a completely different platform than the Hulu platform. So while we certainly have tremendous learnings over the years in terms of how to do addressable advertising and we've done that at the advantage of our shareholders' result, I will have to say that we are not encumbered by that or in any way limited by what we've done in the past. Therefore, we could have an ad proposition as good as the one that we've had on Hulu, but it could actually be better because of that different technology platform. So it has the ability to evolve over time much more on the new platform than it does in the old platform.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nAnd as it relates to the ad experience, Brett, it's not all content on Disney+ being treated equally. There will be no ads in kid's profiles or preschool at least at the launch. And so, this is going to be done very thoughtfully and looking at the content and also making sure that the advertiser is consistent with the content. Thank you.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nOperator, I think we have time for one more question.\n\nOperator\n\nSure. And that question is from Bryan Kraft from Deutsche Bank. Please go ahead.\n\nBryan Kraft -- Deutsche Bank -- Analyst\n\nHi, good afternoon. Christine, there's been a heavy working capital use year-to-date in fiscal '22, both from cash content cost, as well as what we traditionally think about as working capital. Can you just talk about your outlook for the rest of the year and the prospects for some of that reversing in 4Q and to next year? And then I was wondering if you could also comment briefly just on tax. I think you've had an elevated tax rate this year.\n\nYou talked about it last quarter. Is that something that's going to extend into 2023? And if you could just provide any color around what some of the factors are driving that?\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nSure. So on working capital, we have seen net working capital outflows as our businesses are getting back up and running and going back to more normalized operations after they were kind of turned down during the pandemic. And you'll see in this quarter, we did generate positive free cash flow of $187 million in the quarter. On taxes, our effective -- annual effective tax rate has generally been correlated with the US statutory rate.\n\nBut there are a lot of things on a quarterly basis. We call them puts and takes in any given period. And these can lead to these quarterly variances. But we still expect our full year '22 tax rate is going to be somewhat elevated above the US statutory rate, similar to what you saw.\n\nAnd for Q4, it could even be slightly above Q3. As it relates to fiscal '23, we're just working now through our annual operating plan. And I don't want to get too specific today, but it's one of the factors we keep a close eye on as it relates to our ability to utilize foreign tax credits. And that ability to utilize foreign tax credits has been the source of some volatility that you've seen, especially in Q2 tax rate.\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nOK. Thanks for the question. I want to thank everybody for joining us as well. And for your convenience, we will be posting the pricing schedule and updated content slate on our website.\n\nNote that a reconciliation of non-GAAP measures that were referred to on this call to equivalent GAAP measures can be found on our investor relations website. Let me also remind you that certain statements on this call including financial estimates or statements about our plans, guidance, expectations, beliefs or business prospects and other statements that are not historical in nature may constitute forward-looking statements under the securities laws. We make these statements on the basis of our views and assumptions regarding future events and business performance at the time we make them, and we do not undertake any obligation to update these statements. Forward-looking statements are subject to a number of risks and uncertainties and actual results may differ materially from results expressed or implied in light of a variety of factors, including macroeconomic or industry factors and execution risks.\n\nFor more information about key risks, please refer to our investor relations website, the press release issued today and the risks and uncertainties described in our Form 10-K, Form 10-Q and other filings with the Securities and Exchange Commission. We want to thank you all for joining us and wish everyone a good rest of the day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlexia Quadrani -- Senior Vice President of Investor Relations\n\nBob Chapek -- Chief Executive Officer\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nDoug Mitchelson -- Credit Suisse -- Analyst\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nSteven Cahall -- Wells Fargo Securities -- Analyst\n\nMichael Nathanson -- MoffettNathanson -- Analyst\n\nJessica Reif -- Bank of America Merrill Lynch -- Analyst\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nKannan Venkateshwar -- Barclays -- Analyst\n\nPhil Cusick -- J.P. Morgan -- Analyst\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nBryan Kraft -- Deutsche Bank -- Analyst\n\nMore DIS analysis\n\nAll earnings call transcripts"
}