{
  "companyName": "TransDigm Group",
  "companyTicker": "TDG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/transdigm-group-tdg-q3-2022-earnings-call-transcri/",
  "content": "TransDigm Group (TDG 0.20%)\nQ3 2022 Earnings Call\nAug 09, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the TransDigm Q3 fiscal 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Jaimie Stemen, director of investor relations.\n\nPlease go ahead.\n\nJaimie Stemen -- Director, Investor Relations\n\nThank you, and welcome to TransDigm's fiscal 2022 third quarter earnings conference call. Presenting on the call this morning are TransDigm's president and chief executive officer, Kevin Stein; Chief Operating Officer Jorge Valladares, and Chief Financial Officer Mike Lisman. Please visit our website at transdigm.com to obtain a supplemental slide deck and call replay information. Before we begin, the company would like to remind you that statements made during this call which are not historical in fact are forward-looking statements.\n\nFor further information about important factors that could cause actual results to differ materially from those expressed or implied in the forward-looking statements, please refer to the company's latest filings with the SEC available through the Investors section of our website or at sec.gov. The company would also like to advise you that during the course of the call, we will be referencing -- referring to EBITDA, specifically EBITDA as defined, adjusted net income and adjusted earnings per share, all of which are non-GAAP financial measures. Please see the tables and related footnotes in the earnings release for a presentation of the most directly comparable GAAP measures and applicable reconciliations. I will now turn the call over to Kevin.\n\nKevin Stein -- President and Chief Executive Officer\n\nGood morning. Thanks for calling in today. First, I'll start off with the usual quick overview of our strategy, a few comments about the quarter and discussion of our outlook for the remainder of fiscal 2022. Then Jorge and Mike will give additional color on the quarter.\n\nTo reiterate, we are unique in the industry in both the consistency of our strategy in good times and bad as, well as our steady focus on intrinsic shareholder value creation through all phases of the aerospace cycle. To summarize, here are some of the reasons why we believe this. About 90% of our net sales are generated by unique proprietary products. Most of our EBITDA comes from aftermarket revenues, which generally have significantly higher margins and over any extended period have typically provided relative stability in the downturns.\n\nWe follow a consistent long-term strategy. Specifically, we own and operate proprietary aerospace businesses with significant aftermarket content. We utilize a simple, well-proven, value-based operating methodology. We have a decentralized organizational structure and unique compensation system closely aligned with shareholders.\n\nWe acquire businesses that fit this strategy and where we see a clear path to PE-like returns. Our capital structure and allocations are a key part of our value creation methodology. Our long-standing goal is to give our shareholders private equity-like returns with the liquidity of a public market. To do this, we stay focused on both the details of value creation, as well as careful allocation of our capital.\n\nAs you saw from our earnings release, we had another good quarter considering the market environment. We remain encouraged by the positive trends in air traffic and the recovery we continue to see in the commercial aerospace market. Our Q3 results show positive growth in comparison to the same period in 2021 as we are lapping the third fiscal quarter of '21, which was heavily impacted by the pandemic. Although our results have improved over the prior-year quarter, they continue to be unfavorably affected in comparison to pre-pandemic levels as the demand for air travel remains depressed.\n\nHowever, we are happy to see the continued steady improvement in global air traffic. Domestic air traffic remains the leader in the air traffic recovery, and international air traffic improved these past few months as more passengers return to long-haul travel. With softened or fully lifted travel restrictions in majority of countries and the summer travel season upon us, passenger travel demand has been strong. China domestic air traffic remains low but is making progress from its most recent sharp drop-off due to strict Zero-COVID policies limiting travel.\n\nInternational traffic in China is finally starting to improve off of COVID lows. In our business, we saw another quarter of robust growth in our commercial aftermarket revenues and bookings. I am very pleased that despite the challenging commercial environment, our EBITDA as defined margin was 49.8% in the quarter. Contributing to the strong margin is the continued recovery in our commercial aftermarket revenues, as well as the careful management of our cost structure and focus on our operating strategy.\n\nAdditionally, we had good operating cash flow generation in Q3 of over $300 million and closed the quarter with a little over $3.8 billion of cash. We expect to continue generating additional cash in our final quarter of fiscal 2022. Next, an update on our busy quarter for capital allocation activities. I am happy to report that during Q3, we opportunistically deployed $245 million of capital via open market repurchases of our common stock.\n\nThis equates to approximately 444,000 of our shares at an average price of $554 per share. Although the price remained attractive, we were limited this quarter on the quantum we could purchase after the completion of the DART acquisition. These repurchases are in addition to the approximately 1 million shares we repurchased in our Q2 for a total of over $900 million deployed this year on share repurchases. We view these repurchases like any other capital investment and expect this will meet or exceed our long-term objectives.\n\nAlso with respect to capital allocation and as we mentioned in our press release, we've decided to pay a special dividend of $18.50 per share. The dividend will be paid on August 26. Mike will address this and our buybacks more later. As for acquisitions during the quarter, we completed the DART Aerospace acquisition for approximately $360 million in cash.\n\nDART is a leading provider of highly engineered unique helicopter solutions that mainly service civilian aircraft and fits well with our proprietary and aftermarket-focused value generation strategy. Although we are not providing formal revenue guidance, we expect the DART acquisition to contribute approximately $30 million to our FY '22 revenue. Regarding the current M&A pipeline, we are actively looking for M&A opportunities that fit our model. Acquisition opportunities continue, and we have a decent pipeline of possibilities, as usual, mostly in the small and midsize range.\n\nAlthough I cannot predict or comment on possible closings, we remain confident that there is a long runway for acquisitions that fit our portfolio. In aggregate, we have allocated about $2.4 billion of capital this year for value-generating activities. Pro forma for the special dividend payout in late August, we still expect to have a sizable cash balance of close to $3 billion. These capital allocation actions will still leave us with significant liquidity and financial flexibility to meet any likely range of capital requirements or other opportunities in the readily foreseeable future.\n\nNow moving to our outlook for the remainder of 2022. Consistent with our commentary on the last earnings call, at this time, we expect to reinitiate guidance on the November 2022 earnings call for our new fiscal year, assuming prevailing conditions continue to evolve. We remain encouraged by the recovery we have seen in our commercial OEM and aftermarket revenues and the strong bookings received for both thus far in fiscal 2022. We continue to expect COVID-19 to have an adverse impact on our financial results compared to pre-pandemic levels in our final quarter of fiscal 2022 under the assumption that both our commercial OEM and aftermarket customer demand will remain depressed due to lower worldwide air travel, although recent positive trends in commercial air traffic could impact us favorably.\n\nAs for the defense market, we're revising our defense revenue growth to flat for fiscal 2022 versus prior year. We have lowered our defense revenue expectations for fiscal 2022, primarily due to shipment delays as a result of limited supply chain shortages and delays in U.S. government defense spending outlays. As you know, bookings and shipments in this end market can often be quite lumpy.\n\nJorge will provide more color on this topic in his section. We expect full year fiscal 2022 EBITDA margin to now surpass 48% due to the rate of commercial aftermarket recovery. As a final note, this margin guidance includes the unfavorable headwind of our Cobham acquisition and DART acquisition of about 1.5% this year. We believe we are well-positioned for the last quarter of our fiscal 2022.\n\nAs usual, we'll closely watch how the aerospace and capital markets develop, and we'll react accordingly. Mike will provide details on other fiscal 2022 financial assumptions and updates. Let me conclude by stating that I'm pleased with the company's performance in this period of recovery for the commercial aerospace industry. We remain focused on executing our operating strategy and managing our cost structure.\n\nNow let me hand it over to Jorge to review our recent performance and a few other items.\n\nJorge Valladares -- Chief Operating Officer\n\nThanks, Kevin, and good morning, everyone. I'll start with our typical review of results by key market category. For the remainder of the call, I'll provide color commentary on a pro forma basis compared to the prior-year period in 2021, that is assuming we own the same mix of businesses in both periods. The market discussion now includes the recent acquisition of DART Aerospace in both periods and the impact of any divestitures completed in fiscal 2021 are removed in both periods.\n\nIn the commercial market, which typically makes up close to 65% of our revenue, we'll split our discussion into OEM and aftermarket. Our total commercial OEM revenue increased approximately 23% in Q3 compared with the prior-year period. Bookings in the quarter were up significantly compared to the same prior-year period and again strongly outpaced sales. Sequentially, total commercial OEM sales improved almost 5% compared to Q2.\n\nWe're encouraged by build rates steadily progressing at the commercial OEMs. However, there have been overall downward revisions in expected future production rates by the commercial OEMs, primarily due to labor shortages and supply chain issues. Our expectation remains that in the short term, the demand for our commercial OEM products will continue to be reduced. Now moving on to our commercial aftermarket business discussion.\n\nTotal commercial aftermarket revenue increased by approximately 44% in Q3 when compared with prior-year period. Growth in commercial aftermarket revenue was primarily driven by robust demand in our passenger submarket, which is our largest submarket, although all of our commercial aftermarket submarkets were up significantly compared to prior-year Q3. Sequentially, total commercial aftermarket revenues grew by approximately 7%. Commercial aftermarket bookings were up significantly this quarter compared to the same prior-year period, and Q3 bookings strongly outpaced sales.\n\nTo touch on a few key points of consideration, global revenue passenger miles are still depressed compared to pre-pandemic levels. However, revenue passenger miles have continued to trend upwards over the past months after the slight pullback in January that was primarily due to the Omicron variant. The continued recovery in air travel, especially the progress we have recently seen in international travel, confirms the pent-up demand to travel. Commentary from airlines in recent months has also been positive regarding robust passenger demand.\n\nEven with airline ticket prices higher than historical levels, passenger demand has remained strong in the summer season. The recovery in domestic travel continues to be stronger than international travel. In the most recently reported IATA traffic data for June, domestic air traffic was only down 19% compared to pre-pandemic. The U.S.\n\nand Europe continue to lead, showing strong demand for domestic travel. U.S. domestic travel is only off about 8% from pre-pandemic levels. China domestic travel is still down about 50% but is beginning to show signs of recovery from its most recent steep drop-off in air travel due to its Zero-COVID policies.\n\nThe international air traffic recovery has made strides over these past few months. With many of the government-imposed travel restrictions lifted, passengers have been returning to long-haul travel. In March, international travel was still down about 50%. But in the most recently reported IATA traffic data for June, international travel was only down about 35% compared to pre-pandemic levels.\n\nFor both the U.S. and Europe, international traffic is within 20% or better of pre-pandemic levels. Asia Pacific international travel is improving but continues to unfavorably impact the overall international air traffic recovery with RPKs still down about 70%. Global air cargo demand has tempered over the past few months.\n\nAs of IATA's most recent data, June was another month of year-over-year decline in air cargo volumes, though they remain above pre-pandemic levels. There's optimism for improvement in air cargo as COVID lockdown measures eased in Asia, particularly in China. Business jet utilization still remains well above pre-pandemic levels. Commentary from business jet OEMs and operators reflects confidence in the demand outlook.\n\nIt's possible that the pandemic brought a positive structural change to biz jet demand, but that will take some time to prove out. Now let me speak about our defense market, which traditionally is at or below 35% of our total revenue. The defense market revenue, which includes both OEM and aftermarket revenues, was about flat in Q3 when compared with the prior-year period. As we've said many times, defense sales and bookings can be lumpy.\n\nSimilar to the first half of 2022, our teams continue to experience delays in fulfilling orders due to supply chain shortages. The supply chain issues mainly surround the lack of availability of electronic components. Our operating units continue to implement mitigating actions to overcome these challenging issues. Also impacting our defense market revenue are the delays in the U.S.\n\ngovernment defense spend outlays. There's often a lag between U.S. government defense spend authorizations and outlays and the lag is hard to predict, but these delays are longer than typical. As Kevin mentioned earlier and for the reasons I just discussed, we're revising down the expectation for our defense market revenue growth to about flat for fiscal 2022.\n\nWe were previously expecting low single-digit percent range growth. I'd like to wrap up by expressing how extremely pleased I am with our strong operational performance this quarter. Our teams have continued to put forth significant efforts in overcoming the negative impacts of the pandemic and supply chain disruptions. We remain focused on our value drivers and executing with operational excellence.\n\nWith that, I'd like to turn it over to our chief financial officer, Mike Lisman.\n\nMike Lisman -- Chief Financial Officer\n\nGood morning, everyone. I'm going to quickly hit on some additional financial matters for the quarter and also our expectations for the full fiscal year. First, in regard to profitability for our third quarter. EBITDA as defined of about $696 million for Q3 was up 25% versus prior-year Q3.\n\nEBITDA as defined margin in the quarter was 49.8%. This represents year-over-year improvement of about 390 basis points. Sequentially, EBITDA as defined margin, increased by 210 basis points. Next, a few quick comments on select financial metrics for the quarter and also year.\n\nOrganic growth was 17% for the quarter, driven by the growth in our commercial OEM and aftermarket end markets. On taxes, we still expect our GAAP and cash rates to be in the 21% to 23% range and our adjusted tax rate to be in the 24% to 26% range for the year. Moving to cash and liquidity. We had another quarter of positive free cash flow.\n\nFree cash flow, which we traditionally define at TransDigm as EBITDA as defined less cash interest payments, capex, and cash taxes, was roughly $400 million. For the full fiscal year, we now expect to generate free cash flow in excess of the $1 billion target previously provided. During the quarter, we used $245 million of cash to repurchase shares at a weighted average purchase price of about $554 per share and ended the quarter with $3.8 billion of cash on hand. We view these share repurchases just like any other capital investment, such as the acquisition of a new business, and expect a similar rate of return.\n\nWith regard to the dividend, the $18.15 per share payment announced this morning represents a gross payout amount of about $1.070 billion. The record date for the dividend is August 19, and the payout date is expected to be August 26. Additionally, in the 10-Q that is filed later today, you'll see that our strong sales growth resulted in net working capital being a $119 million use of cash this quarter. As mentioned previously, we have the cash to fund this investment and are glad to see our primary commercial end markets rebounding and therefore driving this need.\n\nAs we continue to recover from COVID's impact on air travel and rebound to 2019 global activity levels, we'd expect an additional $100 million to $175 million of cash to go back into net working capital. The time line over which this will happen remains uncertain but should generally track the recovery. Moving on to leverage levels. Our net debt-to-EBITDA ratio is currently at 6.3 times.\n\nPro forma for the dividend, our leverage level will be just over 6.7 times net debt to EBITDA. We expect to continue running free cash flow-positive during our fourth quarter, and this ratio will therefore come down from the 6.7 times level by the end of the fiscal year, barring any additional capital market transactions or shareholder distributions. We are watching the rising interest rate environment closely, and we remain 85% hedged on our total $20 billion gross debt balance through a combination of interest rate caps and swaps through calendar year 2025. This provides us adequate cushion against any rise in rates for the time being.\n\nFinally, as Kevin mentioned, we are pleased to have allocated $2.4 billion of capital thus far this year across the range of options available to us: acquisitions, buybacks, and dividends. Consistent with our past practices, we'll continue to evaluate this full range of options with regard to all of our future capital deployment actions. The priorities are unchanged: first, reinvesting in our own businesses; second, acquisitions; third, returning capital to shareholders via dividends or share repurchases; and finally, paying down debt, which seems unlikely at this time but remains an option. From an overall cash liquidity and balance sheet standpoint, we believe we remain in a strong and good position going forward.\n\nWith that, I'll turn it back to the operator to kick off the Q&A.\n\nOperator\n\n[Operator instructions] And our first question comes from David Strauss with Barclays. Your line is now open.\n\nDavid Strauss -- Barclays -- Analyst\n\nThanks. Good morning.\n\nKevin Stein -- President and Chief Executive Officer\n\nGood morning.\n\nMike Lisman -- Chief Financial Officer\n\nGood morning.\n\nJorge Valladares -- Chief Operating Officer\n\nGood morning.\n\nDavid Strauss -- Barclays -- Analyst\n\nKevin, it looks like the air transport aftermarket is now back to around 10% of pre-pandemic levels? Is that about right? And when do you -- when would you expect us to -- your business to get back to pre-pandemic levels at this point?\n\nKevin Stein -- President and Chief Executive Officer\n\nYeah. I think you're -- that's directionally accurate. I don't really have a prediction. It depends on flight activity.\n\nWe continue to follow that closely and think that takeoffs and landings are the best indicator for aftermarket activity.\n\nDavid Strauss -- Barclays -- Analyst\n\nOK. And from a headcount perspective, can you maybe baseline us where you are to, I guess, adjusting for acquisitions and divestitures. What your headcount looks like today relative to pre-pandemic levels as much as you can on an apples-to-apples basis?\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. I'll take that one. I don't have the exact numbers to pre-pandemic levels accounting for the acquisitions. I'd say we've held on to the bulk of the restructuring that we did as a result of the COVID crisis, and the teams have done a nice job managing the resources.\n\nDavid Strauss -- Barclays -- Analyst\n\nOK. Thanks very much.\n\nOperator\n\nThank you. And our next question comes from Ken Herbert with RBC Capital Markets. Your line is now open.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nHi. Good morning, Kevin and Jorge and Mike.\n\nKevin Stein -- President and Chief Executive Officer\n\nGood morning.\n\nMike Lisman -- Chief Financial Officer\n\nGood morning.\n\nJorge Valladares -- Chief Operating Officer\n\nGood morning.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nMaybe on the commercial transport, aftermarket up over -- were up 56% in the quarter. Can you provide any detail or any further segmentation on that by sort of what you're seeing in the market? And was there any maybe one-time items in terms of shipments to distributors or inventory corrections or anything else in the quarter?\n\nKevin Stein -- President and Chief Executive Officer\n\nI'll let Jorge handle that. I don't think there were any one-time items, though.\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. Working backwards, I concur with Kevin. There were no unique one-time items this last quarter that drove any of the performance. As I mentioned, we're seeing strong performance in our passenger submarket, but I would say all of our aftermarket submarkets are seeing pretty good strength.\n\nSo we're seeing continued recovery. It's, as I mentioned, the domestic markets in the U.S. and Europe. And then the international has been a little bit slower, but we are seeing some recoveries there.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nOK, helpful. And if I could on that, I know, obviously, pricing has been a tailwind. With some of the commentary from airlines about maybe some slower capacity growth into next year just on sort of broader concerns, are you seeing any of that slowdown to any incremental pressure on pricing or your ability to get price in the aftermarket?\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. I think our pricing philosophy remains unchanged. We look to get some level of real price increase above inflation. And the teams are doing a good job trying to pass on some of the inflationary costs that we're seeing.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you. And our next question comes from Noah Poponak with Goldman Sachs. Your line is now open.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nHi. Good morning, everyone.\n\nKevin Stein -- President and Chief Executive Officer\n\nGood morning.\n\nMike Lisman -- Chief Financial Officer\n\nGood morning.\n\nJorge Valladares -- Chief Operating Officer\n\nGood morning.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nI wondered if you could spend a little more time just diving into the margin performance in the quarter. It stands out. Is there anything unusual in there? Can we use that as a starting point sequentially going forward? Or is that aggressive? I know you've mixed up, but I don't know if that changes soon. And then obviously, the price/cost dynamic has been favorable but also probably doesn't change.\n\nSo any thoughts on how you progress moving forward from here?\n\nKevin Stein -- President and Chief Executive Officer\n\nI think we're going to -- we're benefiting tremendously from the mix right now. We have an aftermarket that is expanding. And right now, OEM is well behind where we would expect it to be or where it was. So there's going to be a mix blend that has to come back.\n\nSo we'll have to see how the OEMs come up the curve in terms of their build rates. Right now, as Jorge alluded to, we're still seeing limitations in OEM build rate request for product, even though the order book is building.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nDo you have margin seasonality through the year organically if we strip out acquisitions?\n\nMike Lisman -- Chief Financial Officer\n\nI'm not sure exactly what you mean by margin seasonality, Noah, but I think you know from the past, there's a quarterly step-up as you go from Q1 through Q4.\n\nKevin Stein -- President and Chief Executive Officer\n\nQ1 as always.\n\nMike Lisman -- Chief Financial Officer\n\nYou're seeing that going forward.\n\nKevin Stein -- President and Chief Executive Officer\n\nYeah. Q1 is always a poor quarter, generally speaking, for us. End of year, OEMs focused on inventory and the like. It's always one of our weakest quarters is Q1.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nOK.\n\nMike Lisman -- Chief Financial Officer\n\nBut there were no -- to go back to one of your original questions, Noah, there were no unusual accounting items or anything else during the quarter. And with regard to where we go from here, I think we'll give the FY '23 guidance on the November call. And -- but at this point, we don't want to comment on where we could go from here from a margin standpoint until we do that.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nOK. And Kevin, could you just spend another minute on the acquisition pipeline and what's maybe holding things back from closing right now? What's unusual? When can it change? Just any other color you could give there?\n\nKevin Stein -- President and Chief Executive Officer\n\nYeah. This is the biggest question. As we pay a dividend, sometimes people will then reflect that the pipeline may not be full. We believe we have enough cash and access to cash as we look forward that we can handle the acquisition pipeline that we see coming at us.\n\nI always comment on this that it's difficult to predict when things will close. I know the team is very busy. We're looking at a lot of businesses. The unfortunate piece is sometimes in our very disciplined acquisition approach, things fall out.\n\nAnd we're not interested in taking flyers on not great companies. So we take our time. We're very disciplined and structured in our approach.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. And our next question comes from Robert Spingarn with Melius Research. Your line is now open.\n\nRobert Spingarn -- Melius Research -- Analyst\n\nHey, good morning.\n\nKevin Stein -- President and Chief Executive Officer\n\nGood morning \n\nMike Lisman -- Chief Financial Officer\n\nGood morning.\n\nRobert Spingarn -- Melius Research -- Analyst\n\nKevin, in the past, you've talked about commercial OE being a bit more labor-intensive than the aftermarket. And I believe you've been investing in automation. With that activity, if OE build rates get back to pre-COVID levels, could you accommodate that with less labor than you needed pre-COVID? And would OE margins be higher as a result?\n\nKevin Stein -- President and Chief Executive Officer\n\nI think we always focus on productivity in this business. We have historically focused on it. It's reasonable to expect that with years of productivity under our belt since the OEMs were shipping at high volume that we'd be able to do some things better than we could before. But this is always part of our ongoing productivity ramp as we try to overcome the, as you realize, dramatic inflationary pressures that we're seeing really across the board.\n\nWhether it's labor or materials, there's a lot of inflation pressure on the business. We have a model that allows us and helps us pass along those inflationary pressures, but productivity is something that we're always laser-focused on. And I believe we will be in a slightly better position, but it is hard to quantify that, and you have to offset that against the inflationary pressures that we're seeing.\n\nRobert Spingarn -- Melius Research -- Analyst\n\nAnd just on that, while you're clearly pricing above inflation, what are you seeing in terms of wage inflation?\n\nKevin Stein -- President and Chief Executive Officer\n\nWell, it's different by region. You can't really pick on any. I think, Jorge, what are you seeing in California and some of the regions for direct labor?\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. I mean, we've seen it more toward the entry-level labor pool, where we've seen regional increases. So we've seen anywhere probably between 5% and 7%. But that might be a little bit of a lagging indicator, right? The inflationary pressures continue in the current job market, a little bit on the technical side as well, probably higher than the entry-level labor side.\n\nBut again, the teams -- as Kevin mentioned, productivity is near and dear to our hearts. So they continue to find opportunities to do their best to offset those increases.\n\nRobert Spingarn -- Melius Research -- Analyst\n\nAnd Jorge, are you getting the people you need or are you behind?\n\nJorge Valladares -- Chief Operating Officer\n\nNo. So far, the teams have been able to support the resource needs. There's some timing hiring takes a little bit longer. But we're not seeing any significant or material impacts due to labor issues.\n\nRobert Spingarn -- Melius Research -- Analyst\n\nOK, great. Thanks so much.\n\nJorge Valladares -- Chief Operating Officer\n\nSure.\n\nOperator\n\nThank you. Our next question comes from Robert Stallard with Vertical Research. Your line is now open.\n\nRobert Stallard -- Vertical Research Partners -- Analyst\n\nThanks so much. Good morning.\n\nKevin Stein -- President and Chief Executive Officer\n\nGood morning.\n\nMike Lisman -- Chief Financial Officer\n\nGood morning.\n\nJorge Valladares -- Chief Operating Officer\n\nGood morning.\n\nRobert Stallard -- Vertical Research Partners -- Analyst\n\nKevin, on the M&A topic again, what's your latest sort of feeling on what the prices are out there? Because we've clearly seen some pretty high multiples being paid, particularly on the aerospace side recently. I was wondering if you can still make things work under your calculations?\n\nKevin Stein -- President and Chief Executive Officer\n\nYeah. We can still make things work. I think some of the prices have come under pressure recently as there's been some corrections. But I think we can still make it work in our LBO model that we run through.\n\nOur goal is -- we're not focused on certain products. As long as it sits in the aerospace world, is proprietary and has aftermarket, we will find a way to drive the returns we look for, and those are the types of businesses we continue to stay very disciplined in our approach to find.\n\nRobert Stallard -- Vertical Research Partners -- Analyst\n\nRight. And then on the supply chain issue, particularly in defense, are you seeing any sign of this getting any better? Or in the sort of medium term, you expect the same -- remain pretty much the same?\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. I think the -- I'll take that one. I think the situation is somewhat stable, but still challenged. So that's probably going to continue for the foreseeable future, primarily on those electronic components, the issues with semiconductors, etc.\n\nBut the teams are doing good jobs trying to mitigate those issues.\n\nRobert Stallard -- Vertical Research Partners -- Analyst\n\nThat's great. Thank you.\n\nOperator\n\nThank you. And our next question comes from Gautam Khanna with Cowen. Your line is now open.\n\nGautam Khanna -- Cowen and Company -- Analyst\n\nYes. Thank you. Good morning, guys.\n\nKevin Stein -- President and Chief Executive Officer\n\nGood morning.\n\nMike Lisman -- Chief Financial Officer\n\nGood morning.\n\nGautam Khanna -- Cowen and Company -- Analyst\n\nI just wanted to ask on -- just following up on Rob's question. Is this a -- the guidance reduction there, was that -- is that a function of bookings or is it supply chain? Or is it both? And if so, could you parse out how much it was to each? And then just --\n\nKevin Stein -- President and Chief Executive Officer\n\nThere's a little bit of impact. Let me -- before you move on, there's a little bit of impact to both. In our minds, the -- we're not a bellwether of the defense industry. We follow what everyone else sees.\n\nAnd we're seeing a larger slowdown in defense outlays and a slowdown in the defense industry. That's -- we just react to what we see. It's not necessarily a bookings problem. It's when are things due and when do they want product.\n\nGautam Khanna -- Cowen and Company -- Analyst\n\nOK. And is there any chance you can quantify how much the supply chain has dragged your ability to deliver and if there's any line of sight to improvement there?\n\nKevin Stein -- President and Chief Executive Officer\n\nI don't think it's a major driver because we find ways to work around it. But -- so I'm not necessarily seeing it as a drag on our business. I see it as a drag on the defense industry as a whole, and that's slowing down. So it's hard for me to put a quantum on that.\n\nGautam Khanna -- Cowen and Company -- Analyst\n\nFair enough. And last question, just by region in the aftermarket, any discernible differences from where you sit? I don't know, China is getting better. Was it particularly soft in the quarter? Anything you could speak regionally on aftermarket?\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. I think as you know, we don't track the aftermarket specific by region. I think, generally, we're seeing what some of the larger macro-level trends with the U.S. and Europe, domestic travel being stronger and international travel showing a little bit of recovery.\n\nObviously, Asia seems to be the laggard right now in terms of international travel. But we don't track specific regional activity.\n\nGautam Khanna -- Cowen and Company -- Analyst\n\nThank you.\n\nJorge Valladares -- Chief Operating Officer\n\nSure.\n\nOperator\n\nThank you. And our next question comes from Peter Arment with Baird. Your line is now open.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nYeah. Thanks. Kevin, Mike, Jorge. Thanks so much.\n\nKevin Stein -- President and Chief Executive Officer\n\nGood morning.\n\nMike Lisman -- Chief Financial Officer\n\nGood morning.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nGood morning. You -- there was some commentary around biz jets being back to kind of their post -- well above pre-pandemic levels and the structural shift. Maybe you could just talk about, are you -- what are you seeing there in the ability to take rates up even further on biz jet side? Thanks.\n\nKevin Stein -- President and Chief Executive Officer\n\nI think there's room for them to take rates up as their order book seems to support it. This is a special time for the business jet world market. It is very busy. So we're seeing it both on OEM and aftermarket that this is a much busier time for business jet market.\n\nJorge, anything else to add on that?\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. I think -- and the only thing I'd add is we're seeing some good performance on the larger cabins. There's obviously increased demand for the larger cabin aircraft.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nOK. And then just related to aftermarket. I know you don't break it out versus -- narrowbody versus widebody. But as widebody starts to reengage, is it still, still a smaller portion just compared to how levered you are in narrowbody? How should we think about the widebody recovery there?\n\nJorge Valladares -- Chief Operating Officer\n\nI think, generally, we're market-weighted based on the fleet between narrowbody and widebody. You might have some noise on any particular operating unit. But generally, we seem to be market-weighted between the two.\n\nKevin Stein -- President and Chief Executive Officer\n\nAnd we -- yeah. We don't care if it's narrowbody or widebody. We are profitable with both segments.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nAppreciate the color. Thanks, guys.\n\nOperator\n\nThank you. Our next question comes from Seth Seifman with J.P. Morgan. Your line is now open.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nHey. Thanks very much, and good morning, everyone.\n\nKevin Stein -- President and Chief Executive Officer\n\nGood morning.\n\nMike Lisman -- Chief Financial Officer\n\nGood morning.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nI think I asked you this probably about a year ago or so. But I was wondering how you're thinking about M&A in the current anti-shop landscape. And now we see reports that the FTC is poking around the deal that Northrop closed four years ago. The Department of Justice is trying to prevent Booz Allen from doing a relatively small $400 million deal.\n\nSo as a company that's kind of traditionally been focused on M&A, how do you think about what may be changing in the landscape?\n\nKevin Stein -- President and Chief Executive Officer\n\nWell, we're still active in M&A. It's certainly something that we're cognizant of. And I tend not to speculate on things that haven't impacted us or provide that kind of color. It is something that we're cognizant of.\n\nWe're watching it closely. And that's probably all I can say on it. It hasn't derailed our activity.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's helpful. And then just as a follow-up also on capital deployment. I think you mentioned that the DART deal limited the potential for share repurchases this quarter.\n\nI guess, can you give us an update with this dividend? First of all, were you limited on the size of the dividend that you could pay out? And second of all, with this move to 6.7 pro forma, probably something more like 6.3 by the end of the fiscal year, what are the options for capital deployment? Is it pretty much M&A at this point? Or in the first half of '23, if you wanted to buy stock or pay another dividend, is that an option?\n\nMike Lisman -- Chief Financial Officer\n\nWell, the priorities are unchanged, as we mentioned in the comments, just in terms of what we'd like to spend our capital on with acquisitions coming ahead of dividends and share repurchases. So that's the same as it has always been. On the dividend, we do have a restricted payments basket cap in our credit agreement that I think you guys are familiar with. So that did play into our thinking on the size there.\n\nBut we should nicely continue to tick down here over the course of the fourth quarter, and we'll end the year down closer to where we ended this quarter. So we'll have more than enough buyer power to go do M&A deals, and if things don't materialize there, pay dividends, or repurchase shares, we continuously evaluate all those options every month, every quarter just to decide what the best use of capital is for us.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks very much.\n\nOperator\n\nThank you. Our next question comes from Kristine Liwag with Morgan Stanley. Your line is now open.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nHey. Good morning, guys.\n\nKevin Stein -- President and Chief Executive Officer\n\nGood morning.\n\nMike Lisman -- Chief Financial Officer\n\nGood morning.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nKevin, Jorge, with the tightness in the supply chain, breadth of the TransDigm portfolio, are there opportunities for you to step in some struggling suppliers and gain additional market share?\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. I mean, I think our teams are always looking for good new business opportunities and opportunities to improve their portfolio and products. I think the teams are very engaged with our airline customers, as well as the OEs. They've done a nice job navigating the current supply chain issues.\n\nAnd hopefully, we'll get some opportunities. But I think that's part of our standard focus on new business and profitable new business.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nI see. And maybe following up on Noah's question earlier on margins. I mean, margins continue to trend up, and you're pretty much just shy a percent in the quarter. With mix getting better or as OEM volumes shift to the right and aftermarket still got a ways to go to get to pre-COVID levels, I mean, do you need to see margin step up and stay at 50% and above sustainably?\n\nMike Lisman -- Chief Financial Officer\n\nWell, I think --\n\nKevin Stein -- President and Chief Executive Officer\n\nYeah. Go ahead, Mike.\n\nMike Lisman -- Chief Financial Officer\n\nI think it's hard to say where margins go from here just given the uncertainty in the market and the way the mix plays out going forward on a quarter-by-quarter basis. So we're hesitant to give any guidance on where we go going forward in this environment. And I think we'll give just some more in terms of expectations there for our next fiscal year on the November call when we give the formal guidance.\n\nKevin Stein -- President and Chief Executive Officer\n\nYeah. Guidance comes on when we review next call, as Mike said. But let's keep in mind that there is a favorable mix environment that we're experiencing right now. And until OEM shipments come back, you'll see some balancing higher margins that will come back the other way when OEMs ship more.\n\nWe just have to know that that's going to happen.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nGreat. Thanks, guys.\n\nOperator\n\nThank you. Our next question comes from Peter Skibitski with Alembic Global. Your line is now open.\n\nPeter Skibitski -- Alembic Global -- Analyst\n\nHey. Good morning, everyone. Just one left for me on the defense side. Kevin, I'm wondering if all of this surge in European defense spending does come to pass, maybe in the next couple of years.\n\nIs that something you guys expect to kind of directly benefit from? Or on the defense side, are you a bit more -- or generally speaking, are you much more domestically exposed versus internationally?\n\nKevin Stein -- President and Chief Executive Officer\n\nYeah. We're nicely exposed to international defense as well. I think, yes, some of this business you might expect would come our way at some point, but it's difficult to predict or understand. I think we all have to recognize that some of this production will happen locally in -- or within the European Union possibly.\n\nWe do have production there, so we will be part of it. But we should all keep that in mind that some of this may be domestic consumption, as well as international orders. But we would expect that this is a favorable environment for TransDigm as we look forward. The degree of favorability, well, we'll have to see.\n\nI think there's also concern whether some of this additional spending maybe loses steam if social issues overcome the military desires right now. Again, we'll have to see how this all unpacks in the future.\n\nPeter Skibitski -- Alembic Global -- Analyst\n\nYeah, makes sense. Thank you.\n\nOperator\n\nThank you. And our next question comes from Michael Ciarmoli with Truist Securities. Your line is now open.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nHey. Good morning, guys. Thanks for taking the questions.\n\nKevin Stein -- President and Chief Executive Officer\n\nSure.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nJust to stay on defense, are you guys seeing any noticeable difference between aftermarket or OEM? And then I'm assuming you're probably -- it's probably your Data Device Corp. that's probably seeing the outsized impact of kind of the semiconductor shortages. But any color there?\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. I think the defense aftermarket is hanging in there a little bit better than the defense OEMs. And some of that could just be timing of the outlays, as we noted. In terms of the electronic components, I think it's fair to look across the portfolio and those businesses that are more electronics-based naturally are seeing more of that impact.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nOK. I know you're not going to talk to '23 yet, but assuming we get some level of supply chain improvement, I mean, you're going to start the year with some pretty easy defense comps. Do you think supply chain kind of is a headwind in first half of '23? Or do you think we can get some nice growth there just based off the comps and maybe some alleviation of the tightness we're seeing?\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. I don't think we're in a position to comment on the FY '23 guidance or any specific comparisons, as Mike and Kevin have mentioned. I think the supply chain continues to be strained. We don't see this going away anytime soon or overnight.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nOK, perfect. Thanks, guys.\n\nJorge Valladares -- Chief Operating Officer\n\nSure.\n\nOperator\n\nThank you. And our next question comes from Nicholas Zhang with Credit Suisse. Your line is now open.\n\nNicholas Zhang -- Credit Suisse -- Analyst\n\nHi, folks. Can you hear me all right?\n\nKevin Stein -- President and Chief Executive Officer\n\nYes.\n\nJorge Valladares -- Chief Operating Officer\n\nYes.\n\nNicholas Zhang -- Credit Suisse -- Analyst\n\nHi. So you're seeing strong recovery in commercial aftermarket, you're seeing some supply chain issues in defense, and you're also seeing like order book build up. So what does expansion of existing operations look like? And will there be more capex going forward?\n\nKevin Stein -- President and Chief Executive Officer\n\nI'll comment on capex. I think there's always opportunity for internal investment in our businesses, and we're constantly looking for those. We are looking at some select -- additional investment in some of our businesses. But again, these things all pay back.\n\nWe have the same payback standards as before. So maybe there'll be some selectively, but I don't see any major trend of additional spending.\n\nJorge Valladares -- Chief Operating Officer\n\nYeah. I think, in general, the operating units come to us with different ideas, and they've been very focused in automation over the last two to three years. But we don't expect any significant shift in the overall capex that we've traditionally run at. In terms of capacity, we're looking to leverage some of the restructuring activities that we did over the past couple of years and the process improvements to support additional demand.\n\nBut that's something that each team looks at individually and something that we're constantly talking about in this environment.\n\nKevin Stein -- President and Chief Executive Officer\n\nI think one area that we are doing some selective investment is solar at some of our facilities help with our greenhouse gas footprint. So we are looking for investments of that nature as well. And that's something that we are spending a little more money on as those opportunities now have a reasonable payback across our businesses.\n\nNicholas Zhang -- Credit Suisse -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. I would now like to turn the conference back to Jaimie Stemen for closing remarks.\n\nJaimie Stemen -- Director, Investor Relations\n\nThank you, all, for joining us today. This concludes today's call. We appreciate your time, and have a good rest of your day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJaimie Stemen -- Director, Investor Relations\n\nKevin Stein -- President and Chief Executive Officer\n\nJorge Valladares -- Chief Operating Officer\n\nMike Lisman -- Chief Financial Officer\n\nDavid Strauss -- Barclays -- Analyst\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nRobert Spingarn -- Melius Research -- Analyst\n\nRobert Stallard -- Vertical Research Partners -- Analyst\n\nGautam Khanna -- Cowen and Company -- Analyst\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nPeter Skibitski -- Alembic Global -- Analyst\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nNicholas Zhang -- Credit Suisse -- Analyst\n\nMore TDG analysis\n\nAll earnings call transcripts"
}