{
  "companyName": "Cosan S.A.",
  "companyTicker": "CSAN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/cosan-sa-csan-q2-2022-earnings-call-transcript/",
  "content": "Cosan S.A. (CSAN -0.23%)\nQ2 2022 Earnings Call\nAug 15, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and thank you for waiting. Welcome to the Cosan conference call to discuss the results of the second quarter of 2022. Today with us, we have Mr. Luis Henrique Guimaraes, CEO; Mr.\n\nRicardo Lewin, CFO and IRO; and Mrs. Ana Luisa Perina, IR manager. We would like to inform you that this event is being recorded and has simultaneous translation to English. During this event, all participants will be able to listen to the presentation.\n\nAfterwards, we will begin the question-and-answer session when further instructions will be given. Before proceeding, let me mention that forward-looking statements that may be made during this presentation regarding the company's business projects, operating and financial projections, and goals are based on beliefs and assumptions of the Cosan management, as well as an information currently available to the company. Forward-looking statements are not guarantees of performance. They involve risks, uncertainties, and assumptions as they relate to future events and therefore depend on circumstances that may or may not occur.\n\nGeneral economic conditions, industry conditions, and other operating factors may affect the company's future results and may lead to results to differ materially from those expressed in such forward-looking statements. Now, I would like to turn the conference over to Mr. Ricardo Lewin. Please, Ricardo Lewin, you may proceed.\n\nRicardo Lewin -- Chief Financial Officer and Investor Relations Officer\n\nGood morning everyone and thank you for participating in Cosan's earnings conference call for the second quarter 2022. With me today, I have Luis Henrique Guimaraes, our CEO; and Ana Perina, our IR manager. Before starting the presentation, I would like to point out that we achieved the strong results this quarter consistent with our strategy. Let's now go through the main financial and operational highlights of each business.\n\nLet's start on the Slide 4 with Raizen. This quarter, that marks the start of 2022 to 2023 Raizen crop year, delivered strong operational performance and significant growth in adjusted EBITDA in line with our guidance. In renewables, the quarter was leveraged by the combination of higher sales volumes and better pricing. In the sugar segment, EBITDA also grew in the quarter, supported by greater sales of third-party products and by the better average price, reflecting the effective pricing strategy and the higher share of direct sales to destination.\n\nMeanwhile, the marketing and service segment delivered very robust EBITDA growth. In Brazil, Raizen quickly adjusted its supply and sales strategy to ensure the sourcing and competitiveness of its clients. In the latter operations, the record result in the quarter was driven by stronger demand, operating efficiency gains, and a recovery in profitability at the pump. In addition, Raizen continued to advance in new businesses, such as the incorporation of Shell's lubricant business and leveraged its renewable agenda, delivering a record E2G production.\n\nLet's turn now to Slide 5, which shows Rumo figures. The better EBITDA's performance was due to transported volumes growth in the north operation, which was neutralized by adverse effects of soybean crops setback on the South operation. Rumo also captured market share and grain exports from the Port of Santos, reflecting competitiveness gains and the ramp-up in volumes in the Central network. Fixed costs and expenses lagged inflation in the period, attesting the company's commitment to cost-control discipline.\n\nMargins improved compared to the first quarter 2022 but still show retraction year on year due to the higher fuel prices that were not fully offset by tariffs increase. In July, therefore, in the event after the reporting period, Rumo announced a divestment of port assets as part of its portfolio management process. Let's turn to Slide 6, which shows the highlights of Compass. In Compass, Comgas and Sulgas, our natural gas distribution operations, posted higher volumes in the residential, commercial, and automotive segments, which offset the decline in the industrial segment due to scheduled maintenance stoppages that were already expected and lower activity.\n\nOnce again, we recorded EBITDA expansion leveraged by higher margins as a result of the adjustment by inflation, as well as the continued efficiency gains and the consolidation of Sulgas results. In July, after the end of the quarter, we had another great achievement with the closing of the acquisition of 51% of Commit Gas, the current name of Gaspetro. Considering this, we revised our EBIDTA guidance for the year, raising our expectations. Capex projections remain unchanged.\n\nAlso in July, Commit concluded the sale of minority interest held in certain distributors as a result of the exercise of pre-emptive rights of other shareholders. We remain confident in our journey of building an increasingly free gas market. Moving on with Slide 7, shows the result of Moove. Moove delivered record-high EBITDA in the quarter driven by higher sales volume and profitability increase.\n\nIt's worth noting that, in June, we consolidated the results from the acquisition of PetroChoice in the United States and of Tirreno in Brazil. These moves were in line with the portfolio expansion strategy. Moove's performance continues to demonstrate the success and excellent execution of its supply and operational strategies. Turning to Slide 8, you can see the consolidated results of Cosan.\n\nAt Cosan Investimentos, the highest contribution to EBITDA came from Radar, which, in this quarter, was occasionally leveraged by the mark-to-market adjustment of further price appreciation of its agricultural properties. At Cosan Corporate, G&A expenses fell, but we had a gain when compared to the second quarter 2021 due to the exclusion of ICMS tax from the calculation base of PIS/COFINS taxes on imports for lubricant operations from that period. We posted record-high pro forma adjusted EBITDA, driven by the excellent operational performance of all companies in the portfolio, led by Raizen. The adjusted net income was affected by the additional noncash financial expenses at Cosan Corporate and the higher debt cost at all companies in the group, following the cumulative increase in interest rates.\n\nRegarding Cosan's consolidation investments, we continued to refine our usual capital discipline. We had the capex increase compared to the prior period, which is mainly explained by Raizen, with the incorporation of Biosev and construction of a new E2G plant, which offsets the lower capex at Rumo already forecasted by the guidance. Let's go to Slide 9, where we present the group's financial highlights. We continue to carry out our usual liability management actions in the quarter.\n\nThe increase in gross debt is expanded by the new debt issuance arising by the funding transaction at Moove for the PetroChoice acquisition and by the new debentures issued at Cosan Corporate, as well as by the effect of exchange variation due to the weaker Brazilian real in relation to the U.S. dollar. The free cash flow through equity can be explained mostly by seasonal effects on Raizen's working capital and by greater investments that were partially offset by the higher operational cash generation at the other businesses. Leverage ratio fell to 2.4 times within the ideal range for the group and reflecting the significant EBITDA growth in the last 12 months.\n\nAlthough it's not related to the quarter, I want to highlight that, as part of our capital management process, we redeemed all of the 2023 bonds at the beginning of this month. Before closing, I want to go over some recent developments in our EESG agenda, which are advancing every day. Let's please turn to Slide 10. In May, we reelected the members of our Strategy and Sustainability Committee, which is chaired by a woman independent member.\n\nWe also published the sustainability reports of Rumo, Moove, and Raizen, reporting achievements such as Rumo's inclusion in the portfolio of the 2022 Corporate Sustainability Index of the B3, Moove becoming a signatory of the UN Global Compact, and Raizen figure [Inaudible] CDT. In June, Comgas and Raizen were recognized by the Exame Guide, Best in ESG 2022. Comgas was recognized for its excellence on valuing people, increasing its consumption of clean energy, and expanding its infrastructure. And Raizen was featured for promoting the decarbonization of various sectors in Brazil and the world.\n\nLastly, Cosan was once again selected for the FTSE4GOOD portfolio, an important international sustainability index. That concludes my presentation, and we can now move on to the Q&A session. Thank you very much.\n\nOperator\n\n[Operator instructions] Our first question comes from Ms. Isabella Simonato from Bank of America.\n\nIsabella Simonato -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, Lewin. Good morning, Luis. Can you hear me?\n\nRicardo Lewin -- Chief Financial Officer and Investor Relations Officer\n\nYes. Hi. Good morning.\n\nIsabella Simonato -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you. Good morning. My question is about the company's cash.\n\nAs Lewin mentioned, there was an increase in financial expenses due to interest rates. And there was some derivative issues. And at the same time, I think there are prospects for results improving this year compared to last year based on the guidance of the companies and their performance so far. So, could you talk a little bit about the cash equation for the year? I know you're restricting your allocation given the increase in interest rates.\n\nBut how about dividends, buybacks, and financial expenses in this equation for 2022?\n\nRicardo Lewin -- Chief Financial Officer and Investor Relations Officer\n\nHi, Isa. Good morning, and thanks for your question. I'll start by answering, and Luis can help me out. We have lots of options to use our cash, as you said yourself.\n\nWe have buybacks. We also have our usual commitments, G&A. We also have an installment of Radar's payments, which is 300 million in November. And there are other options in other businesses as well.\n\nAnd we can also prepay some of that. You saw that as a subsequent effect. We bought back the bond '23 ahead of time. So, there are many, many options for us to use our cash.\n\nAs we said in the previous call, this is a conservative year in terms of cash consumption. So, that's what we're doing. Cooperatively speaking, we consider that we have to have a minimum cash level, and we use what's left over to do everything I mentioned. And then we'd do the math of what's in our portfolio, how we can use cash, and then would decide on what we would prefer to do.\n\nSo, as a subsequent effect, we'll be paying for the bond '23. We also can have an open share buyback program, including 110 million shares. We've bought back 80 million already. So, there's still some room for use if there are any interesting opportunities when the time is right.\n\nAnd there are also some potential opportunities where we may use our cash. But there's nothing specific in addition to payment Radar's installment. That's 300 million November this year. And in the second quarter, as we disclosed, there was some additional cash consumption at Raizen.\n\nBut that's due to the period. As was explained during Raizen's call, there was greater sales to destination, higher sugar inventories, and better payment terms for suppliers. So, financial cost, market opportunities, and better profitability. But when you look at the end of the fiscal year and the end of the crop year for Raizen, whatever was EBITDA turning into cash is being maintained in line with Compass' guidance as well.\n\nAnd I didn't talk about dividends. We've paid out 800 million in dividends this year. And there is no plan to pay out any new dividends this year in 2022. All right, Isa, did we answer your questions?\n\nIsabella Simonato -- Bank of America Merrill Lynch -- Analyst\n\nYes. Sorry, I forgot to unmute myself. Yeah, that's very clear. May I ask a follow-up question.\n\nFollowing the same rationale, we're talking about numbers that won't deleverage the controlling company that much. So, there's no great deleveraging going on. Are you considering reducing your share in some things, or going in the opposite direction of what you've been doing the last few years to offset that? Or is that not part of the debates you've been having?\n\nRicardo Lewin -- Chief Financial Officer and Investor Relations Officer\n\nNo. No. We're not discussing that. We've just done a few important things at Moove and Compass that was also a subsequent effect to the acquisition of Gaspetro assets and turning that into Commit.\n\nWe're very happy with our portfolio position and everything we've been doing. These are things that have been coming a long time. You know, we've been talking about it internally acquiring PetroChoice, everything we've done in gas, preparing to expand Rumo's North network, the divestment we carried out at Rumo that will start as soon as CADE approves that in the Port of Santos warehouse. So, we're very comfortable with our current levels.\n\nAs we know, capex has been adjusted more conservatively at the companies. But our main strategic initiatives that have value over time are continued very, very steady. And as for deleveraging, as Luis said, we're not deleveraging, but our leverage piggybacks on everything we did last year, especially Rumo, which had a poor second half of the year. With the improvements we've seen.\n\nAs you can see our results covered the last 12 months. And naturally, there should be some subsequent deleveraging.\n\nIsabella Simonato -- Bank of America Merrill Lynch -- Analyst\n\nFantastic. Thank you.\n\nOperator\n\nOur next question comes from Thiago Duarte from BTG Pactual.\n\nThiago Duarte -- BTG Pactual -- Analyst\n\nHello. Good morning, Luis. Good morning, Lewin. Good morning, everyone.\n\nSo, a couple of questions, please. First, at Radar, I just want to try and understand things a little bit better. Radar's EBITDA includes two components, right? So, you've accrued your land portfolio, figures, and your lease receivables, right? Could you break down those two figures, please? Because they're very different in nature, so it would be interesting to understand them independently considering the EBITDA for this quarter and the following quarters. And my second question is, you've already announced the subsequent result of the shareholders' pre-emptive right in the distribution companies at Commit.\n\nSo, Lewin, you mentioned that there's still an installment to be paid by Radar. So, in addition to the 726 billion of the shares that already have an MOU either signed or to be signed, could you mention what is expected additionally? How much more will Compass receive once Commit's portfolio has been equalized? So, those are my two questions. Thank you.\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nThanks, Thiago. So, very simple. At Radar, we have a result recurrence of lease between 40 million and 50 million per quarter. And so, the difference this quarter is considerable in terms of land appreciation.\n\nAs for Compass, our estimates are that once we've made the investments of the 12 listed ones, the total will be 900 million, which will be raised by those sales.\n\nThiago Duarte -- BTG Pactual -- Analyst\n\nFantastic. That's very clear. Thanks, Luis.\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nNo worries.\n\nOperator\n\nNext question comes from Vicente Neto from Bradesco BBI.\n\nVicente Falanga -- Bradesco Corretora -- Analyst\n\nThank you, Luis. Thank you, Ana. Thank you, Lewin. I also have a couple of questions.\n\nCould you talk a little bit about your strategy in terms of gas distribution across Brazil? What is your order of priority? Which states within Commit will you be prioritizing for development? Is there any regulatory work to be carried out? We're also coming closer to a new tariff review round by Comgas. Are you already talking to the regulatory agency about that? So, you have a lot on your plate as usual. Could you talk a little bit about your strategy moving forward? And secondly, how do you see, generally speaking, the drop in fuel prices again for the distribution segment, obviously, considering quality parity? Do you think that's a good thing, a positive thing? And cheaper fuel prices will also reduce pressure on margin and will also release some working capital will impact demand, but parity is coming back, so maybe there will be some competition with imported products. Could you give us some color on the pros and cons? That would be great.\n\nThank you.\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nThanks. Thank you for the questions. I'll start with Compass. Obviously, our priority right now is Sao Paulo because it's disproportionally stronger.\n\nWe have Comgas, and we'll continue to focus on that. So, we incorporated Sulgas and will be looking after the portfolio. Obviously, we have distribution companies where we have a diverse budget. So they are our responsibility.\n\nAnd there are still some processes to go through. So, as soon as we can disclose the portfolio to you which ones we'll be keeping, we will. So, I think it's important to understand that since the beginning, we went from 19 to seven, precisely because we want to keep our focus. And we will continue to keep our focus.\n\nObviously, Sao Paulo, because of its relevance in terms of portfolio, we'll have our main focus. But we're very happy about going into other companies. We have some really good people. There are fantastic opportunities to be shared and achieved.\n\nWe have know-how sharing from Comgas, market approach, construction methods, marketing agenda, partnerships with construction, civil construction companies with fantastic know-how, which has a great impact on the residential market. So, there are lots of opportunities. And in a few weeks we'll be with the new companies. And we've been in Sulgas for over six months, and we reiterate that our thesis will work and now with full focus on execution.\n\nYou said we have a lot on our plate. That is true. But, you know, all the M&A, and the need to build that, to construct that. We are now at that stage.\n\nWe do have the divestment sale, but we have a fantastic team fully focused. We are concluding the TRSP in Santos, very important. First quarter of next year, we'll conclude construction over the next few months, and then execution and distribution which will bring about a lot of transformation ability in the States. We will remain, and new players that will come in, looking forward.\n\nSo, that's it about Compass. As for fuel, well, you know, it's a volatile world right now. And I cannot affirm that this drop trend will continue. There are so many geopolitical political variables, and there may be an increase in demand coming from China after full lockdown, although despite the market signals.\n\nBut, you know, China might come back very quickly. And there's the war which is still going on. The winter is coming. So, before the winter, there may be a pickup.\n\nDiesel is very short still all over the world. And we believe that Petrobras will continue to make adjustments so that parity remains. You have very valid points. On the one hand, we have price reduction that helps consumption, reduces pressure on working capital, especially in the resale chain links.\n\nBut on the other hand, I'm still -- we're still not convinced that this is a structural price-drop scenario. There's still a lot of volatility to come. And Raizen has also stood out in terms of being able to deal with volatility, working on supply and making sure that our resellers and clients who have contracts with us get what they need so that we can keep our competitiveness in the market.\n\nVicente Falanga -- Bradesco Corretora -- Analyst\n\nThank you, Luis.\n\nOperator\n\nOur next question comes from Luiz Carvalho from UBS.\n\nLuiz Carvalho -- UBS -- Analyst\n\nHi, Luis. Hi, Ana. Hi, Lewin. Thanks for taking my question.\n\nLuis, still on Compass/Commit. Looking at what you mentioned, you know, that was quite a relevant acquisition in Rio Grande do Sul with Sulgas, Gas Brasiliano, an important asset. Would it make sense -- considering recent events, considering the pre-emptive rights of states, would it make sense to consider a spinoff with assets in a specific region, like the north or the northeast, and to focus in the center south region? Could that be the objective? And also, on capital allocation, there is a debate. You know, there have been some news that Raizen has taken part or looking at BP's assets more closely.\n\nSo, from the holdings side, how do you see that capital allocation? I know that's part of the company's decision-making process. But I would like to hear from you how you see some additional movement in the sugar and ethanol business. And also, if you could comment, a few quarters ago, in our view, you did the right thing. You know, interest rates have gone up and you decided to lock a few things.\n\nYou canceled that deal you had with Puerto Seguro. And basically, you were trying to protect the company's cash. So, leverage is still above two times. And as Isa said, we shouldn't be seeing any quick deleveraging.\n\nSo, how do you see the interest rate scenario vis-a-vis the company's leveraging level looking forward. Thank you.\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nThank you, Luiz. Yes, you have credit with us. You're allowed three questions.\n\nLuiz Carvalho -- UBS -- Analyst\n\nThank you.\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nYou said two questions, but one of them included two questions anyway. Compass, we will be concentrating, but I can't tell you yet because we're still concluding negotiations, actually, pre-emptive rights and the whole process. But at the end of it, we'll have the number of distributors. We have disclosed to you, seven are out.\n\nGas Brasiliano belongs to Commit 100%. And now, with Compass share at 51%, and then we'll have [Inaudible] and Sulgas. But at the end, our geographical position will completely make sense, in our opinion, in terms of effort, potential growth, and our ability to generate results. So, nothing's changed since we spoke last time to today.\n\nBut there's a ritual to be followed, which is part of the process. As for the investments, as I said to Thiago, it's about 900 million reais to be raised. And we will be deleveraging Compass' balance sheet and, as a consequence, Cosan's balance sheet. In terms of sugar and ethanol, we talked -- we heard a lot about that during Rumo's call on Friday.\n\nWe'll be filling the gap with Raizen, we have a BP Bunge inside Raizen, and we're working hard to deliver on that. Obviously, in whatever segment we are, we are affected. So, it's our obligation to look at it. But we are still focusing on our priority, which are people, capital allocation, and delivering on our ability to execute.\n\nAnd all the great results we've been getting with first-cut, second-cut sugar cane, there's still some things to be corrected with the older sugar cane. But we should get to 90 million to 100 million tonnes. And the third question concerning capital discipline and interest rates and conservative position, we will continue to do the same. Apparently, everything points to the fact that interest rates will no longer go up.\n\nBut considering inflation, cost, pressure and global volatility, that's still happening. So, we will continue to be conservative. And the first question about deleveraging, there's not a lot of room for that. Let's remember that there is seasonality in the second half of the year.\n\nAnd our leveraging is at 2.4. But as Lewin said, we do have results coming in. We have stronger prospects for the second half, so we will continue with our guidance up to 2.5, and maybe reducing that in the next quarter. We feel comfortable with that.\n\nThat's where we want to operate. As you see, results are still strong, and prospects for the second half of the year are no different. But we will continue to be conservative given the global scenario and also the scenario in Brazil.\n\nLuiz Carvalho -- UBS -- Analyst\n\nGreat. That's very clear. Thanks. During the next call, I'll ask one question.\n\nOK?\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nThanks, Luiz.\n\nOperator\n\nNext question is from Bruno Montanari from Morgan Stanley.\n\nBruno Montanari -- Morgan Stanley -- Analyst\n\nGood morning, everyone. Thanks for taking my questions. My first question is about the TRSP construction. Could you give us an update on that? How did it go during this quarter? And considering 2023, we know the size of each company within the holding company, each one has its own relevance.\n\nBut which part of the business is more sensitive. Next year, which one will be -- will the holding be looking more closely to?\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nSo, TRSP on time, on budget, progressing satisfactorily. Obviously, there are always engineering challenges, but nothing that will compromise our objective to commission for the first half of next year. Everything's on track and as expected. As for our focus, well, it's always important to reiterate that each company has its own management team focusing on its specific priorities.\n\nSo, the holding company doesn't need to follow each company's results so closely. [Inaudible] everybody is responsible for their own results. They all have what they need to make results happen, so we will continue to monitor things closely and to provide whatever support is needed or required and wherever we can add more value. They're all achieving great results.\n\nMooves International expansion continues to be the priority, incorporating the distribution companies, divestment, delivering E2G, at raising and consolidating our business and marketing and services, and expanding Rumo's North network and consolidating our market share gains and operating gains and the Central network, and starting discussions on renewing South network. So, those are all important topics. And there's a great opportunity that goes on investments. There's a carbon opportunity.\n\nWe think there's a great opportunity to create carbon credit at Radar. So, you'll be hearing more about that as things develop and to consolidate the final studies and divestments at the San Luis support. So, that's our agenda. We're executing on it.\n\nAnd they all generate considerable value for the company, all driven by people. Our main challenge in terms of growth right now is to make sure we have high-quality resources, high-performing teams in all the businesses we have been building. For each of these new businesses, when you need new talent or new skills, we have the TRSP coming in as a new challenge for us. It requires qualified skills.\n\nAnd there's also Mooves International expansion. We're always looking for synergies in our portfolio, especially in terms of acquiring resources and material. The group's companies have been working together to tackle cost increases and to rationalize everything in terms of investments and controlling the capex and investments we're making.\n\nBruno Montanari -- Morgan Stanley -- Analyst\n\nOK. That's great. Thank you, Luis.\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nThanks.\n\nOperator\n\nNext question is from Gabriel Barra from Citi.\n\nGabriel Barra -- Citi -- Analyst\n\nHi, Luis. Hi, Lewin. Hi, Ana. I'll try to focus on campus because we've heard a lot about the other businesses during their calls.\n\nThere are two main points I'd like to discuss with you about Compass, please. The first one is, considering the IPO, I may be wrong, but we have gas market and the free market is the cherry on the cake and this new gas market segment. So, when we looked at companies prospects at the time with the approval of gas, we saw that the market moved forward, but not as much as we would have expected for this new gas market, and probably mainly due to regulation. So, my first question is, how have you been dealing with the government and regulatory agencies about state regulations for free consumers in this context of the new gas market? And as a follow-up question, I don't know if you've touched on this, I think it's interesting.\n\nWe heard some recent news that that you might be near a contract, ANP [Inaudible]? Could you update us on how things are going? How do things look for Compass right now? And if I may ask another question, sorry, in terms of the TRSP, do you see any opportunity to have a similar project to that in other places in Brazil? Because there is a gas undersupply potentially in Brazil. And I think LNG would be key for that in Brazil. So, my question is, would it be possible to consider other TRSP in other places in Brazil and perhaps in places where you have gas distribution? Thank you.\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nOK. I'll start by the last one because I think it will be helpful when we talked about -- we'll talk about the other items. So, in our opinion, Brazil has significant reserves to increase gas supply in Brazil. The pre-salt, you know, the level of rejection is quite high.\n\nObviously, Brazil's challenge is to create demand. So, that is the thesis Compass has always based itself on. And that's why we focus on distribution and gas sales, which, obviously, has its challenges. So, 60% of the market -- the gas market in Brazil is already regulated for free consumers.\n\nSo, 60% of the volume could be free clients if everyone were to migrate to that mode. So, Compass is making a huge effort as we did in Comgas' region. But now, we would be replicating the same thing in the distribution companies we're working with so that clients can, if they so wish, migrate to the free market. It's not a simple thing.\n\nThere are challenges. When you change, you do take on new risks, but there are also benefits. Anyway, that is the direction. And that is Compass' advocacy with its clients, with the regulatory agency, and other stakeholders.\n\nAny consumer who wishes to migrate to the free market should be able to do so and to buy its gas directly from producers. Brazil has a great deal of gas, but it needs to migrate to the coasts, so we need infrastructure. Some of it has been concluded right now, but some of it is being designed and should be concluded in the near future. Hopefully, that will take off and -- especially now that there's this geopolitical change in the world, there's an opportunity for the national industrial sector to expand its capacity and fill that redistribution gap.\n\nNear shoring, friendly shoring, that's happening all over the world, given the geopolitical issues, war, China versus the States, Taiwan. So, to our mind, there are plenty of opportunities for gas to flow from national production in the pre-salt region, which is abundant. And TRSP, to your other question, plays a key role. It's at the core of Brazil's consumption and the Southeast.\n\nIn our opinion, this is a structural investment for Brazil because it provides flexibility and optionality. We talk a lot about that. So, any new terminal along the coast will be a matter of optionality and opportunity. And it doesn't have to be done by Compass.\n\nIt could be a partnership with some of the businesses that have been looking into those projects. But I'd like to reiterate the fact that Brazil has plenty of gas that can be brought to land and can be used to leverage the growth of the gas market in Brazil. And Compass will always be close by, whether it be through direct investments, investments with partners, or sales agreements so that this can be feasible so that there are more optionalities and more supply choices, which are essential to grow that market in Brazil. And the connection with the free market is also an effort on Compass' side.\n\nThese things are moving forward as the market develops. And the last point about going up the hill, you know, these issues are being discussed by Sao Paulo state regulators, ANP. That's a regulatory matter. So, we're waiting for the decision.\n\nAnd whatever comes to pass, we'll continue to do our homework following whatever has been approved, whatever has been established within the regulatory framework and continuing with investment and construction work. But that's something that is up to the decision of the regulatory agencies, [Inaudible] and ANP.\n\nGabriel Barra -- Citi -- Analyst\n\nGreat. Great. That's great. Thank you.\n\nOperator\n\nOur next question comes from Mr. Regis Cardoso from Credit Suisse.\n\nRegis Cardoso -- Credit Suisse -- Analyst\n\nGood morning, Luis. Hello, Lewin. Can you hear me?\n\nRicardo Lewin -- Chief Financial Officer and Investor Relations Officer\n\nYes.\n\nRegis Cardoso -- Credit Suisse -- Analyst\n\nJust a couple of follow up questions, please. You mentioned that, you expected 900 million to come in from Commit's divestments. If you could clarify, please. Those 900 million, is that Cosan's stake or is that the overall amount for Commit? And is that before or after any income tax from the sale of those assets and the capital? And another follow-up question is about the corporate debt.\n\nI know that your intent is not to deleverage the consolidated company. But considering where that debt is, it leads to fiscal inefficiencies at the holding level. So, since the debt is bigger and interest rates are higher, the size of the opportunity or the tax shield that you could potentially benefit from is harder because your chance to make the most of the whole tax shield at the holding level is smaller. Are you considering reducing the debt at the holding level, or perhaps redistributing it across the companies? Thank you.\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nThanks to your first question, Regis, the 900 is the overall amount. That's what we'll be getting cash for the payment of the share we're selling at the two distribution companies, which already have a signed sale agreement, considering prior conditions, pre-emptive rights, and others. But that is the total amount we'll be receiving. Levin, would you like to take the second one?\n\nRicardo Lewin -- Chief Financial Officer and Investor Relations Officer\n\nYes. Well, we need to separate the company debt and the holdings debt. The holdings debt comes from investments in new businesses. Our idea is to have both things quite separate.\n\nAnd the debt we're taking on first is the debentures. The debentures went to liability management. And if we'll require, we'll do it for new investments to be made, not at the holdings level, but at the companies level. I answered that question during Cosan day.\n\nYou, as analysts, should be looking at the fact that we're making the most -- 100% of our tax losses in the last five or six years. And our fiscal -- our tax department is extremely skillful selling assets. We shape our loss so that we can make the most of it. And we're doing the same analysis for the next few years.\n\nSo, in your models, it's important that you consider the way we've been using that. Whenever we take on new debt, that's what we do. So, from making the most of it and tax inefficiency, that is not the case. Obviously, if we had the opportunity to do it, we would do it.\n\nBut it's not that simple given the company structures. And from a net position, on the investor side, there is no inefficiency. Obviously, the future will depend on our accumulated tax losses and other operations that we can deploy to make sure we continue that way. But we're consistently paying attention to that.\n\nWe won't leave any money on the table if there's any chance to generate benefit for the companies and their shareholders in terms of acquiring debt. At our invested companies and the leverage -- the holding, I mean, that's just business as usual.\n\nRegis Cardoso -- Credit Suisse -- Analyst\n\nThat's great. Very clear. Thank you, Luis. May I ask a quick follow up question?\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nYes, sure.\n\nRegis Cardoso -- Credit Suisse -- Analyst\n\nAs always, there's a lot going on in the company's portfolio, but there are some catalyst events coming forward, it seems to me. Could you help me understand your timeline? So, considering Compass, you have the TRSP will go into operation. And are you expecting to consolidate your controlling share in other companies? Or will you be having an investor day to talk a little bit more about Compass' plans? Or was Cosan Day it? And if I think of Cosan Investments, you have the mining JV. What would the timeline be considering new milestones? And Rumo and Raizen, we heard enough about that during their own earnings release calls.\n\nI don't know if I was clear. I'd like to hear about milestones that investors can expect in terms of catalyst events and other assets in the group's portfolio.\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nYeah, it's clear. Well, Compass is focusing completely on delivering the TRSP and the new distribution companies and how we're going to do it, the culture together with Mitsui, our partner. So, backstage, there has been a lot of work into building Commit. And we were very happy to start day one with an established company, which is the result of all the prepping we did.\n\nObviously, Compass, when the time is right, will be talking to the market, as it always does on Cosan day. And if we need to disclose any additional information, we'll do that. The team will be doing that. But we have been able to do everything we wanted to.\n\nAll the milestones we wanted, renewing our contract with Comgas, speed up the construction of TRSP, turned Gaspetro into Commit. That's what the group had been focusing on. And I will be focusing on an ever more diligent execution. And the only thing we're missing is the divestment.\n\nBut that is an ongoing process. We're going to be consuming some resources, but we're taking care of that, too. As for Cosan Investments, especially mining, well, next year, we'll be confirming the reserves. Our partners' reserves, our asset's support, it's 100% under our control.\n\nAnd we're focusing on developing executive projects for the port to get it ready for when the time is right. So, the port is a very important asset. We're very happy with the progress the team has been making there and everything to do with planning the port's capacity because the port meets all the requirements we could possibly want in terms of capacity, future capacity, and considering the different construction phases, expansion phases, the berths. And that's what we're focusing on.\n\nDeveloping the executive project, that's our side. And our partner is focusing on the pilot plant, which has been performing extremely well. And all the negotiations that are ongoing in terms of future logistics, transportation and the confirmation of mining resources according to the schedule.\n\nRegis Cardoso -- Credit Suisse -- Analyst\n\nThanks, Luis. That's very clear.\n\nOperator\n\nNext question comes from Lucas Ferreira from J.P. Morgan.\n\nLucas Ferreira -- JPMorgan Chase and Company -- Analyst\n\nHi, everyone. Thanks. Luis, as you said, things are still quite volatile, right? My question is about capital allocation. What [Audio gap] in terms of using your capex? Do you think capex at the subsidiary slow down investments and looking at other opportunities? Or do you think there's still value in buyback? Could it be Cosan's shares or the group's shares? And also, could you talk a little bit about how the IPO of maybe Compass and Moove? What does that come in terms of your priorities?\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nWell, even with a more conservative position. You know, since we spoke to last quarter, last year, we haven't stopped doing anything that is important for the companies. These are -- there are opportunities for growth that generate value. We're doing all that.\n\nWe're expanding the North network in phases. We have acquired PetroChoice. And we've turned Gaspetro into Commit. TRSP, we've announced three new E2G plants, a new biogas plant.\n\nSo, all the projects that generate value in our pipeline will be implemented. They are being implemented. It's important to mention that. So, there won't be any change in that sense.\n\nIf the interest rate curve slows down, we won't change our discipline. All of these plans are based on market positions, contracts or demands that allow them to be taken place and to be giving return on the investments that we expected. That's not going to change. Things will continue along those lines.\n\nAnd so, we don't see any change taking place in the short term. As for opportunities, you've mentioned them. You know, as Lewin said, we have an open buyback program and both at the holding level and at the subsidiary level. And we will be exercising it whenever there's value generation, whenever it makes sense to do so.\n\nSo, we're very happy with the different opportunities in each of the portfolio. Cosan investment, Raizen, Moove, Rumo, and Compass. Compass and Moove will always be looking at the opportunity of an IPO when the time is right, when investments are mature. Of course, there has to be a market window.\n\nWe always try to find the right time to do it. You know how we operate. That's the same thing we've been we've been doing for the past 15 years. So we try to make the most of the best market windows.\n\nAnd in order to do that, we have to be ready. So, in your assumptions, you can always consider that we are ready to do what's right when there is an opportunity in the market, when it generates value to shareholders, and whenever there's an opportunity to grow our companies.\n\nLucas Ferreira -- JPMorgan Chase and Company -- Analyst\n\nThank you, Louise.\n\nOperator\n\nThank you. This concludes the question-and-answer session. I will now turn the floor to Mr. Luis Henrique for his closing remarks.\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nThank you, everyone, for joining us. Thank you for your questions. It's always wonderful to hear what you have to say, to hear your questions because it's food for thought. It makes us think about new opportunities that we can make the most of.\n\nAs you can see, it's been a great quarter for all companies and quarter results, most of all, important to reiterate our conviction about what we're doing, and many structural things have been concluded. So, we are keeping our agenda for growth, consolidation, and execution. And that's what drives us forward. We continue to be bullish considering the world's geopolitical changes.\n\nOur portfolio does have the competitive advantages because we're in Brazil. And not only in our current portfolio, but portfolios we're bringing in as well. And we do have the ability to execute on those projects, on time, on budget, with more efficiency, less cost, and ensuring our penetration in various segments. You saw that we have reiterated the guidance for the rest of the year.\n\nIt's not an easy year. It's quite volatile. We're going into elections now. You know, as of tomorrow, campaigns will be taking place.\n\nSo, there will be volatility, but we will be monitoring things closely to make sure that we don't only look at opportunities, manage risks, but also continue with our purpose to generate opportunities and driving an energy transition that will continue to accelerate the decarbonization of the companies in our portfolios, our clients, and our partners. Thank you so much. For the last few months for being there with us. And we'll definitely have the 2022 we promise to the market with some positive surprises to come.\n\nThanks, and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRicardo Lewin -- Chief Financial Officer and Investor Relations Officer\n\nIsabella Simonato -- Bank of America Merrill Lynch -- Analyst\n\nThiago Duarte -- BTG Pactual -- Analyst\n\nLuis Henrique Guimaraes -- Chief Executive Officer and Director\n\nVicente Falanga -- Bradesco Corretora -- Analyst\n\nLuiz Carvalho -- UBS -- Analyst\n\nBruno Montanari -- Morgan Stanley -- Analyst\n\nGabriel Barra -- Citi -- Analyst\n\nRegis Cardoso -- Credit Suisse -- Analyst\n\nLucas Ferreira -- JPMorgan Chase and Company -- Analyst\n\nMore CSAN analysis\n\nAll earnings call transcripts"
}