{
  "companyName": "New Oriental Education & Technology Group",
  "companyTicker": "EDU",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/new-oriental-education-technology-group-edu-q1-202/",
  "content": "New Oriental Education & Technology Group (EDU -3.38%)\nQ1 2023 Earnings Call\nOct 26, 2022, 8:00 a.m. ET\n\nOperator\n\nGood evening, and thank you for standing by for New Oriental's FY 2023 first-quarter results earnings conference call. [Operator instructions] Today's conference is being recorded. If you have any objections, you may disconnect at this time. I'd now like to turn the meeting over to your host for today's conference, Ms.\n\nSisi Zhao.\n\nSisi Zhao -- Director, Investor Relations\n\nThank you. Hello, everyone, and welcome to New Oriental's first fiscal quarter 2023 earnings conference call. Our financial results for the period were released earlier today and are available on the company's website as well as on Newswire services. Today, you will hear from Stephen Yang, executive president and chief financial officer.\n\nAfter his prepared remarks, Stephen and I will be available to answer your questions. Before we continue, please note that this session today will contain forward-looking statements. made under the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995.\n\nForward-looking statements involve inherent risks and uncertainties. As such, our results may be materially different from the views expressed today. A number of potential risks and uncertainties are outlined in our public filings with the SEC. New Oriental does not undertake any obligation to update any forward-looking statements, except as required under applicable law.\n\nAs a reminder, this conference is being recorded. In addition, a webcast of this conference call will be available on New Oriental's Investor Relations website at investor.neworiental.org. I will now turn the call over to Mr. Yang.\n\nStephen, please go ahead. \n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nThank you, Sisi. Hello, everyone, and thank you for joining us on the call. This first quarter has not only marked a fresh beginning of our 2023 fiscal year, but also a new page to New Oriental. Before going into detail of our financial performance for this quarter, I would like to take this opportunity to extend our gratitude to those who have been believing and supporting New Oriental along the way.\n\nI'm delighted to share with you that the restructuring process has been largely completed, and New Oriental has successfully derived a new business model, combined with a certain existing business and a new innovative business opportunity. Our new business ventures have been performing well and starting to generate positive results to New Oriental. Furthermore, it's even more encouraging to see that we have achieved the turnaround in profitability and better-than-we-expect margin this quarter. Our non-GAAP operating margin for the quarter was 13%, and non-GAAP net margin for the quarter was 11.2%, both higher than last year same period.\n\nWe believe the company has embarked on a fresh journey that strives to encourage overall development of students and customers and foster the betterment of the society, and at the same time, generate profit and fruitful returns for our shareholders. Now I would like to spend some time to talk about this quarter's performance across our remaining business lines and new initiatives to you in detail. Our key remaining business have shown remarkable resilience and achieved promising trends. Breaking it down.\n\nThe overseas test side business recorded a revenue increase of 2% in dollar terms year over year for the first quarter 2023 fiscal year. The adult university students business recorded revenue growth of about 2% in dollar terms year over year for the quarter. The overseas study consulting business recorded a revenue increase of about 21% in dollar terms year-over-year for the quarter. As for our new business initiatives, as mentioned in the past quarter, we have launched several new initiatives, which mostly revolve around facilitating students all around development.\n\nI'm glad to share with you that these new initiatives have shown positive momentum and have started to generate revenue to the group. Firstly, the non-academic tutoring business, which we have rolled out in over 60 existing cities focused on cultivating students' innovative ability and comprehensive quality. We're happy to see increased market penetration in those markets we have tapped into with 297,000 enrollments in the first quarter. The top 10 cities in China had to contribute about 60% of the revenue of this business.\n\nSecondly, the intelligent learning system and device business is a service designed to provide a tailored digital learning experience for students. It utilizes our past teaching experience, data and technology to provide personalized targeted learning and exercise content. Together with our teachers monitoring and accessing the learning curve of the students and the back-end system, the new education service not only greatly improve students' learning efficiency, but also cultivate students' proactive learning habits. We have tested in adoption in around 60 existing cities with 131,000 active pay users in this quarter and are delighted to see improved customer retention rates and scalability of these new initiatives.\n\nThe revenue contribution of this business from the top 10 cities in China is over 60%. Meanwhile, the study tour and the research camp business is an initiative that aims at offering students of K-12 and university students the opportunity to fully leverage their free time holidays to broaden the scope of knowledge and cultivate subject interest. We have conducted the study tour and research camp business in over 50 cities across the country. The revenue contribution of this initiative from the top 10 cities in China is over 55%.\n\nLast but not least, our smart education business, which comprises smart teaching, smart hardware, sense technology, innovation, education, and other services serves local governments, education authorities, schools, and kindergartens. Our educational material and digitalized smart study solution, a self-learning system which leverages advanced technology enables students to have complete control over the pace and the flexibility of the learning age where remote learning becomes increasingly mainstream. We also offer exam prep courses designed for students with junior college diplomas to obtain bachelor's degrees. The abovementioned businesses have been gaining the traction and contribute the overall growth of the company.\n\nOur OMO system has continued to be instrumental post our restructuring process. We continued our efforts in revamping and maintaining the OMO teaching platform and kept leveraging our education infrastructure and technology strength across key remaining business and new initiatives to provide more advanced and diversified education service to our customers in all ages. We have invested $31 million in the quarter on our OMO teaching platform to ensure that we continue to offer high-quality service and flexibility to our students. In response to an evolving industry landscape in China, we have implemented structural changes to our pure online education platform, Koolearn, as previously mentioned.\n\nWhile Koolearn continue to expand its online education offerings to adults and university students, it has also actively solved business opportunities in new areas. Leveraging on the technology developed for broadcast classrooms with our existing teams of talents, Koolearn has established an e-commerce platform under the brand name Dongfang Zhenxuan for the sale of agriculture and other products and offer premium service for tens of millions of followers through its tight supply chain ecosystem, innovative live streaming marketing, and diversify cooperation with the suppliers and producers to maximize the full potential and social values of this new business. Koolearn has placed a strategic focus to develop a high-quality and cost-effective e-commerce platform offering agriculture products and data necessities so as to bring better quality of life and promote healthy lifestyles to its customers. During the reporting period, Dongfang Zhenxuan has broadened its product selection and SKUs, thereby continuously improving shopping experience of its customers.\n\nThe platform does not only serve as alternate online for farmers and local companies to sell their high-quality farmed goods and other products to a broader customer base, but also provide a platform which offers a range of topnotch products with transparency in pricing to customers. Leveraging the well-developed production capacity and commercial infrastructure, such as logistics centers and communication networks in China, Koolearn has also successfully launched its own private label products and establish a high-quality supply chain management system within a short period of time. On a variety of the product selection and product quality continued to grow, Dongfang Zhenxuan has earned a prominent position within the industry and gained a strong traction and brand loyalty from its customers. Looking forward, Koolearn will strengthen its team of talents to continuously create positive, unique, interesting content to attract user to this platform and promote traditional Chinese culture.\n\nKoolearn will also place additional investments with the products and technology upgrades so as to concentrate on selecting and launching top-quality products from different origins in China through the third-party cooperation and private labels to create value for customers, partners, and wider society. With regards to the company's latest financial position, I'm confident to share with you that the company is in a healthy financial status with cash and cash equivalent term deposits and short-term investments totaling approximately $4.3 billion. On July 26, 2022, the company's Board of Directors authorized a share repurchase plan of up to $400 million of the company ADS or common shares during the period from July 28, 2022 through May 31, 2023. As of the October 26, 2025, the company cumulatively repurchased aggregate approximately 1.6 million ADS for approximately $39.6 million from the open market under the share repurchase program.\n\nNow I will turn the call over to Sisi to share with you about the key financials. Sisi, please go ahead. \n\nSisi Zhao -- Director, Investor Relations\n\nNow I'd like to walk you through the other key financial details for this quarter. Operating cost and expenses for the quarter were $666.8 million representing a 47.8% decrease year-over-year. Non-GAAP operating costs and expenses for the quarter, which excludes share-based compensation expenses, were $647.8 million representing a 47.5% decrease year-over-year. The decrease was primarily due to the reduction of facilities and numbers of staff as a result of the restructuring in fiscal year '22.\n\nCost of revenues decreased by 51.4% year over year to $312.1 million. Selling and marketing expenses decreased by 40.2% year over year to $98.7 million. G&A expenses for the quarter decreased by 45.4% year-over-year to $256 million. Non-GAAP G&A expenses, which excludes share-based compensation expenses, were $237.4 million representing a 44.5% decrease year over year.\n\nTotal share-based compensation expenses, which were allocated to related operating costs and expenses, decreased by 55.9% to $19.1 million in the fiscal -- first fiscal quarter of 2023. Operating income were $78 million representing a 14.5% increase year over year. Non-GAAP income from operations for the quarter was $97 million representing a 28.3% increase year over year. Net income attributable to New Oriental for the quarter were $66 million representing a 9% increase year over year.\n\nBasic and diluted net income per ADS attributable to New Oriental were $0.39 and $0.38, respectively. Non-GAAP net income attributable to New Oriental for the quarter was $83.7 million representing a 24.7% decrease year over year. Non-GAAP basic and diluted net loss per ADS attributable to New Oriental -- net income attributable to New Oriental were $0.49 and $0.48, respectively. Net operating cash flow for the first fiscal quarter of 2023 was approximately $185.2 million, and capital expenditure for the quarter were $14 million.\n\nTurning to the balance sheet. As of August 31, 2022, New Oriental has cash and cash equivalents of $1,103.9 million. In addition, the company had $1,054.7 million in term deposits and $2,092.3 million in short-term investments. New Oriental's deferred revenue balance, which is primarily cash collected from registered students for courses and recognized proportionally as revenue as the instructions are delivered at the end of the first quarter of fiscal year 2023 was $1,012.5 million, a decrease of 30.3% as compared to $1,453.3 million at the end of the first quarter of fiscal year 2022.\n\nThe decrease is primarily due to the succession of K-9 academic after-school tutoring services in compliance with the government's policies in China. Now I'll hand over back to Stephen to go through our outlook and guidance.\n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nThank you, Sisi. Looking into the second quarter of fiscal year 2023. With the restructuring process now largely completed, we expect that our school network and geographic coverage to become stabilized. The company has now entered a stage of starting a fresh page, exploring new opportunity with greater flexibility and strong cash flows.\n\nWe're confident in the sustainable profitability of all our remaining key business as well as the growth and prospects of our new initiatives. For our new businesses, as we observed in this quarter, the encouraging performance that these businesses have achieved proof that we are heading toward the right direction, and we're confident that the business will be able to contribute meaningful revenue to the company this fiscal year 2023. As for the continued pandemic development in China, thanks to our OMO system, we believe that overall impact that would cost to our business and financial will be limited. We have -- also have measures in place to control and handle lockdown situations should it may arise.\n\nHowever, due to the seasonality of some of our business, such as test price courses and overseas study consulting services, new Oriental generally recorded lower revenue in the second quarter of the fiscal year with the revenue typically below those of the first quarter. Hence, we expect total net revenue in the second quarter of the fiscal year 2023, September 1, 2022 to November 30, 2022, to be in the range of $601.4 million to $619.2 million representing a year-over-year decline in the range of 9% to 6%. The project increase of the revenue in our functional currency, RMB, is expected to be in the range of 1% to 4%. This is the increase for the second quarter of the fiscal year 2023.\n\nBottom line-wise, we're confident that we will achieve operating profit in the full year of fiscal year '23. To conclude, we are now taking all kinds of operational actions to promote our key remaining business while we cautiously invest in new initiatives, which will be new growth engines that accelerates our recovery and pursue the profitable growth in the future. At the same time, we will continue to seek guidance on the coverage from and cooperate with government authorities in various provinces in China in alignment with the efforts to comply with the relevant policies, guidelines, and relative implementations, regulations, and measures, as well as to further adjust our business operation as required. I'd like to say that this forecast reflects our considerations of latest regulatory measure, as well as our current and preliminary view, which is subject to change.\n\nThis is the end of our fiscal year 2023 Q1 summary. At this point, I would like to open the floor for questions. Operator, please open the call for this. \n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Mark Li from Citi. Please ask your question.\n\nMark Li -- Citi -- Analyst\n\nHi, Stephen. Congratulations on the profitable status for this quarter. May I ask -- I noticed that we have disclosed the 297,000 non-academic enrollment. I think it's the first time we disclosed.\n\nMay I know how was the number for last quarter or for last financial year? And do you have any target for this new financial year for the enrollment? \n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nThank you, Mark. So we just launched the non-academic courses. This is a pure new product since the second quarter of last year. So the last year's numbers was very small, very small.\n\nSo that means this quarter, our non-academic course business performed very well. And the revenue growth, it was neat. So -- and we expect the non-academic courses business will grow at the -- very fast in the future. Mark? \n\nOperator\n\nMark, can you press star one one again? Go ahead, Mark.\n\nMark Li -- Citi -- Analyst\n\nCan you you hear me?\n\nOperator\n\nYes, we can.\n\nMark Li -- Citi -- Analyst\n\nI just want to follow up for the Q1 number. Like would we have any seasonality for the full year? Like can we just multiply the numbers for the Q1 for the full year for the non-academic enrollment? Or could you share a bit more color on this year? Thank you.\n\nSisi Zhao -- Director, Investor Relations\n\nYeah. For non-academic courses, specifically, actually, the seasonality should not be very apparent. It's not like other businesses like overseas test prep and domestic test prep business, which is quite seasonal. So I think this will be similar to other K-9, K-12 business, so it should be pretty smooth throughout the whole year.\n\nBut actually now, this year is the beginning of this new initiatives, so we should start to see each quarter start to contribute more and more revenue, overall revenue from these new businesses. \n\nOperator\n\nAll right. Thank you. Our next question comes from the line of Felix Liu from UBS. Felix, please ask your question. \n\nFelix Liu -- UBS -- Analyst\n\nHi. Good evening, management. Thank you for taking my question, and congratulations for the very strong results. And it's very impressive against macro weakness and considering the magnitude of the restructuring that you have just completed.\n\nSo my question is on margins. We noticed that the GP margin of this quarter is very strong. May I know the driver behind? Is it due to mix or any particular cost savings that we have achieved? And is there any margin seasonality that we should keep in mind for the rest of this year? Thank you.\n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nOkay. Thank you, Felix. As for the margins, yeah, as you saw in this quarter, the gross margin operating margin has increased both. The increase was mainly driven by four reasons.\n\nNumber one, the downsizing of the learning centers and the employee layoff led to the lower fixed cost. We did a lot of the learning center closed down and the employee layoff last fiscal year. And it makes the -- it drives the margin up for learning centers and the whole group. So this is the first reason.\n\nSecondly, the revenue from the Koolearn from the Dongfang Zhenxuan grew since this quarter, and then it helps the margin up for the whole group. And lastly, we didn't do the summer promotion classes this quarter. In last year, the summer quarter, we did some of the summer promotion. And this year, we didn't do that.\n\nSo it helps the margin up. And so those abovementioned three reasons drive the whole margin up. And as I said, we have entered the stage of starting a fresh pace of New Oriental. And so as for the remaining business, we keep it there and to keep the profitability of that.\n\nAnd as for the new initiatives, as I said, we will invest very costly. So the good news for us is the new business is grown very fast and will be profitable very quickly. And so going forward, I think the margin -- I suppose margin-wise, the bottom line-wise, we're confident that we will be profitable in the full year of the 2023. I want to give the guidance of the next quarter Q2 guidance on the margins.\n\nFelix. \n\nOperator\n\nThank you. Our next question comes from Tian Hou from T.H. Capital. Please ask your question, Tian. \n\nTian Hou -- T.H. Capital -- Analyst\n\nHi, Stephen, Sisi. Congratulations. So each one of the business growth is cost nearly positive. What's the outlook for each line of the business to grow -- the growth outlook for each line of the business going forward? So that is number one.\n\nAnd also, I'm not sure I know the composition of your revenue. With each line of the business, how much should it contribute to the total revenue? Is it possible, Stephen, for you to give some detail on that part? That's the question. \n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nYeah. Looking at the -- looking ahead in the second quarter or even the quarters after the Q3 and Q4. And I think as I said, this restructuring process, now largely completed. And going forward, I think the remaining business, such as the overseas-related business and domestic test prep, college students business, will grow, especially for the overseas-related business will grow faster.\n\nAnd because in this quarter, we have seen the strong enrollment growth for the overseas-related business. And the new business, like the learning device and like the summer camp also and the other new businesses is growing very fast. We started the business the last year. But this year, we will start to bear fruit of this business.\n\nSo the growth will be extremely high in the -- in this -- the whole year. And the Koolearn, Dongfang Zhenxuan, I'm afraid I can't share the numbers of the Koolearn. But I can say is Dongfang Zhenxuan has developed an innovative plan like a broadcasting model of the knowledge sharing and the selling agriculture and other products. And this quarter, Dongfang Zhenxuan achieved remarkable the official results and start to contribute notable revenue and profit to the group.\n\nAnd going forward, I think Dongfang Zhenxuan will do better because look at the trend and the very good response from the customers. And yeah, this is the trends of the different business lines. As for the revenue contribution for the whole year -- for the new year, the -- I mean there will be the revenue contribution, I think the overseas-related business will contribute 30% of the total revenue. And K-12 include the traditional business, and the new business will contribute 45% of total revenue.\n\nAnd the college students, the test prep business will contribute 5% of the revenue. And all the others, including the Koolearn and the others, will contribute be more than 30% of total revenue because Koolearn grows very fast, and the other small business grow is OK. So this is the breakdown of revenue contribution of the -- from different business lines. Yeah.\n\nOperator\n\n[Operator instructions] All right. So let me tell next question from Candis Chan from Daiwa. Please ask your question.\n\nCandis Chan -- Daiwa Capital Markets -- Analyst\n\nHello? Hi, Stephen and Sisi. Thank you for taking my question, and congratulations on the very strong set of results. My question is related to the new business intelligence learning system and devices. And may I know who are our target customers? And the 130,000 active users, are they mainly charged by subscription? And I just want to see whether this part of revenue will be recurring.\n\nAnd how significant will the revenue contribution could be for this new business? Thank you.\n\nSisi Zhao -- Director, Investor Relations\n\nYeah. The intelligent learning device system actually is something new after we comply with the government policy terminated the academic training for K-9 students. But we realized that we still got some students have the demand for studying the academic subjects. So we use -- actually, we have the content strength and targeted those students who have the demand for academic study, and we use our technology and content strength to embed our existing, like, digitalized content into the hardware and hand over to students and let students to use the study machine to do the self-study.\n\nAnd it can actually help students to enhance their academic results and also to help them to drive them to enhance their proactive study habits. So this is something -- this is a new business model. And nowadays, we are mostly using the rent the device to students and let customers subscribe the content from the platform. And we believe that this revenue -- this business should be -- generate recurring revenue because if they think the machine is helpful and they can use it to do the efficient self-study, then they can resubscribe, continue to subscribe new content from the platform.\n\nYeah. \n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nYeah. And sorry, let me clarify the revenue contribution for the new year. So the other -- the revenue from others will contribute 20% of the total revenue. So yeah, sorry.\n\nOperator\n\nThank you. Our next question comes from the line of Hongi Tau from CICC. Please ask your question, Hongi.\n\nUnknown speaker\n\nThanks. Good evening, Stephen and Sisi. Thank you for taking my questions. First, congratulations on the strong performance for the first quarter.\n\nSo I will -- I have a follow-up question. You mentioned the revenue breakdown before. And I wonder, can you share the number contributed by the non-academic tutoring? Maybe could you share more color on what kind of courses you see it has the most strong performance? Thank you.\n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nThe numbers -- I think Sisi will give you the numbers of the non-academic courses. You ask the revenue contribution for Q1 or the full year?\n\nUnknown speaker\n\nFor Q1.\n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nFor Q1.\n\nSisi Zhao -- Director, Investor Relations\n\nAll the new business together are contributing roughly about -- yeah. For -- sorry, let me check the detailed numbers. For all new business together are contributing roughly about 16% of total revenue. And all the new businesses, non-academic tutoring is the biggest one, has the biggest contribution, and next to it is the learning device business.\n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nYeah. And I think the non-academic tutoring focus on the help the students to improve their innovative ability and comprehensive quality, and we do have a lot of subject like the reading, programming or robot design, presentation skill, arts, or sports. Now the reading and programming contribute a little bit more revenue within the all products.\n\nUnknown speaker\n\nOkay. Thank you.\n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question will come from the line of Lucy Yu from Bank of America. Please ask your question, Lucy.\n\nLucy Yu -- Bank of America Merrill Lynch -- Analyst\n\nThank you, Stephen. Thank you, Sisi, for taking my question. Two questions. First is the first quarter revenue breakdown.\n\nYou just mentioned the new business is 16%. How about the rest, like test prep, consulting, etc? Second question is on the second quarter revenue guidance. What is the breakdown of different business in the second quarter? Thank you.\n\nSisi Zhao -- Director, Investor Relations\n\nYeah. For Q1, I can give you a rough contribution. So for overseas-related business, like test prep and consulting together, contributing roughly about 24%, 25% of total revenue. And we have a new business roughly about 16%, and all the adult university students business, tutoring, and new business together contributing roughly like 55%, 55%, 57% of total revenue.\n\nAnd the remaining others mostly the online platform and some other businesses like book, content, etc. Okay. \n\nLucy Yu -- Bank of America Merrill Lynch -- Analyst\n\nAnd also...\n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nOkay. The Q2, our Q2 revenue guidance breakdown. The overseas-related business will contribute 20% of total revenue. And college and university students business contributed 6% of total revenue.\n\nAnd the K-12, and the traditional, and new businesses will contribute 40% of the revenue. Others, 30 -- roughly 25%, 30% of total revenue, included the Koolearn and Dongfang Zhenxuan.\n\nLucy Yu -- Bank of America Merrill Lynch -- Analyst\n\nOthers?\n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nOthers.\n\nOperator\n\nRight. Thank you. Next follow-up question comes from the line of Tian Hou from TH Capital. Please ask your question, Tian.\n\nTian Hou -- T.H. Capital -- Analyst\n\nHi, Stephen. Just another question. So for the -- is the business really totally new? So what's for your different lines seasonality? Do they have a different seasonality?\n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nMost of the new business don't have the seasonality impact. But I think the only one new business, the summer camp and the research camp business do have the seasonality. Summer and winter, the revenue contributed more. But as you know, while launching some weekends, the study camp during the weekend, so the seasonality impact becomes less than before.\n\nYes.\n\nTian Hou -- T.H. Capital -- Analyst\n\nGot it. That's it. Thank you. \n\nOperator\n\nWe are now approaching the end of the conference call. I will now turn the call over to New Oriental's executive president and CFO, Mr. Stephen Yang, for his closing remarks. \n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nAgain, thank you for joining us today. If you have any further questions, please do not hesitate to contact me or any of our Investor Relations representatives. Thank you. [Operator signoff]\n\nDuration: 0 minutes\n\nSisi Zhao -- Director, Investor Relations\n\nStephen Yang -- Executive Vice President and Chief Financial Officer\n\nMark Li -- Citi -- Analyst\n\nFelix Liu -- UBS -- Analyst\n\nTian Hou -- T.H. Capital -- Analyst\n\nCandis Chan -- Daiwa Capital Markets -- Analyst\n\nUnknown speaker\n\nLucy Yu -- Bank of America Merrill Lynch -- Analyst\n\nMore EDU analysis\n\nAll earnings call transcripts"
}