{
  "companyName": "XPeng Inc.",
  "companyTicker": "XPEV",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/xpeng-inc-xpev-q2-2022-earnings-call-transcript/",
  "content": "XPeng Inc. (XPEV 0.61%)\nQ2 2022 Earnings Call\nAug 23, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by for the second quarter 2022 earnings conference call of XPeng Inc. [Operator instructions] Today's conference call is being recorded. I would now like to turn the call over to your host, Mr.\n\nAlex Xie, head of investor relations of the company. Please go ahead, Alex.\n\nAlex Xie -- Head of Investor Relations\n\nThank you. Hello, everyone, and welcome to XPeng's second quarter 2022 earnings conference call. Our financial and operating results were issued by our newswire services earlier today and are available online. You can also view the earnings press release by visiting the IR section of our website at ir.xiaopeng.com.\n\nParticipants on today's call from our management will include co-founder, chairman, and CEO; Mr. He Xiaopeng; vice chairman and president; Dr. Brian Gu; vice president of finance, Mr. Dennis Lu; vice president of corporate finance and investment, Mr.\n\nCharles Zhang; and myself. Management will begin with the prepared remarks, and the call will conclude with the Q&A session. A webcast replay of this conference call will be available on the IR section of our website. Before we continue, please note that today's discussion will contain forward-looking statements made under the safe harbor provisions of the U.S.\n\nPrivate Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties. As such, the company's results may be materially different from the views expressed today. Further information regarding these and other risks and uncertainties included in the relevant public filings of the company as filed with the U.S.\n\nSecurities and Exchange Commission. The company does not assume any obligation to update any forward-looking statements except as required under applicable law. Please also note that XPeng's earnings press release and this conference call include the disclosure of unaudited GAAP and financial measures as well as unaudited non-GAAP financial measures. XPeng's earnings press release contains a reconciliation of the unaudited non-GAAP measures to the unaudited GAAP measures.\n\nI will now turn the call over to our co-founder, chairman, and CEO, Mr. Xiaopeng. Please go ahead.\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Hi, everyone. In the second quarter of 2022, XPeng delivered 34,422 vehicles, representing 98% growth year over year. For the fourth consecutive quarter, we ranked No. 1 among emerging EV makers in China as measured by vehicle insurance registration volume.\n\nStarting from the second half of this year, we'll launch a suite of industry-leading products and technologies developed in-house as well as next-generation smart EV models equipped with these state-of-the-art technologies. These upcoming product launches will bring our customers an unparalleled driving experience through innovation in both electrification and smart technologies. On August 10th, we unveiled interior design of our new flagship G9 SUV and began accepting reservations. The preorders of G9 exceeded 22,000 within 24 hours, and this has exceeded the model that we launched previously, which were the P7 and G9 that were launched in the same period, and orders of G9 keeps increasing, which shows the strong demand from our customers.\n\nOn August 26th, the G9 will join us at the Chengdu Auto. We plan to announce the G9 price during its official launch in September and commenced deliveries in October. With a stylist design, superior control and driving performance, leverage comfort and other luxury features that benchmark against luxury SUVs priced nearly RMB 1 million, the G9 has already proven itself a veritable flagship model in the SUV segment. The G9 also showcases our leadership position in electrification, technology, innovation as the first model to offer our groundbreaking end-to-end high-voltage charging technology which is comprised of an onboard 800-volt high-voltage platform and 480-kilowatt supercharging station, bringing the ultimate charging experience to our customers.\n\nWith respect to smart technology configurations based on our industry-leading CD navigation guided pilots, or CD NGP, G9 will provide our next-generation full scenario advanced driving assistance system to market. The G9 will significantly expand the coverage of advanced-level driving assistance system, making driving easier and savor. I believe that G9 will be the market's best SUV under RMB 500,000 and become one of the best sellers among them to large-size SUVs. I believe that based on our technological innovation in our platform systems architecture, we will actually innovate and accelerate the pace of our new product launches to round out our offering with vehicles priced between RMB 150,000 to RMB 500,000.\n\nIn 2023, we plan to launch a new B-class model, which will help us expand our market share in this segment. We'll also roll out a new C-class model next year to bring a compelling product to customers in need of additional cabin space with greater comfort. These two new models, in addition to the G9, will bolster our strong sales growth momentum to carry through next year. Meanwhile, leveraging our top match electrification and smart technologies in our platform development system, developing health to constantly upgrade product performance, the average selling price of our products will rise accordingly as our products superior features boost their competitiveness among same class and even higher class models.\n\nWith our concerted efforts to advance our platform-based vehicle architecture and multiple technological improvement in manufacturing, such as integrated dye-casting techniques, we expect a meaningful vehicle margin expansion for the G9 as well as our new models come next year. Starting from G9, XPeng's commitment to long-term investment in proprietary electrification technologies has bolstered our leading edge in this area, while significantly enhancing our customers' experience. The G9 has leveled up XPeng's electrification technologies to the next generation. Whilst more, the G9 and subsequent new models will be fully compatible with high-power supercharging system and we will consistently enhance charging efficiency for customers through upgrades.\n\nOur new models can not only achieve the best charging speed on XPeng's self-operated high-power supercharging networks but also allow our customers to have better-charging experience in third-party charging stations. Benefits from our leading high-voltage platform, XPeng new models will be able to obtain a higher power allocation and longer-lasting peak power at third-party charging that are the EV models -- than other EV models. Besides, we have built our in-house capabilities in both the development and production of electrical motors, where we also have been accelerating technology innovations. Looking ahead, we'll continue to approach our unique approach to reincorporate powertrain designs into one cohesive vehicle architecture, leveraging a growing suite of electrification technology innovation to provide consumers with smart EVs supporting longer-range, faster charging, and lower cost.\n\nXPeng's self-operated supercharging network will further compound our advantages in electrification, technologies, and establish competitive values. Our well-established self-operated supercharging network already features one of the broadest coverage and the best customer experience among China's independent EV brands. As of early August, the number of XPeng's self-operated supercharging stations reached 1,000, which is a new milestone. To need to fully support the mass delivery of our vehicle models featuring 800-voltage high-power charging, we in-house developed 480-kilowatt supercharging stations surpassing the industry's benchmarks in terms of performance and costs.\n\nThrough technology innovations, our new generation supercharging station not only achieved the power higher than the industry's mainstream 120-kilowatt supercharging station but also make the cost at the same level of the previous generation supercharging stations. XPeng's supercharging system can charge up to 200 kilometers range in five minutes. This outstanding charging performance demonstrates our end-to-end high-power fast-charging capability constituted by EV battery, capable of fast charging, onboard high-voltage platform, and supercharging station underlying the best charging efficiency in our industry. We began building our self-operated 480-kilowatt supercharging stations in August, and will soon step up our development in major cities and along main highways nationwide.\n\nBy 2025, we hope to build another 2,000 high-power supercharging stations to provide the best-in-class charging experience for our consumers and customers. In the upcoming years, XPeng's customers charging experience will be completely revolutionalized across all scenarios, including vacation trips, returning to their hometowns for the Chinese New Year, or long-distance travels. The scenario of using EV to drive in the city and ICE, the cross-country driving, will be completely changed very soon. Moving on to our smart technology advancement.\n\nWe are very excited to see that customers' acceptance of our advanced driver system is growing at a steady pace, as is the positive influence of word of mouth among customers. As a result, our highway and GP mileage penetration rate in the second quarter reached over 65%. Beginning in early May, we integrated our XPILOT software as standard configurations on mid-to-high-end versions of our models, allowing a broader customer base to experience our industry-leading, best-in-class more advanced driver-assistance functions at an affordable price. It has helped us cultivate trust in XPILOT, reshaping driver habits toward a human machine co-pilot patent, and provide hardware platform support for more innovative intelligent functions in the future.\n\nAmong orders received from early May through the end of July, the proportion of buyers who chose mid and high-end versions of our models equipped with XPILOT grew significantly to over 50%. We're also expanding the boundaries of smart driving at an accelerated pace as we roll our next-generation products that create greater value for customers. For instance, we have completed the development and testing process for city and GPs in the second quarter during an array of tests throughout challenging driving situations such as crowded downtown streets and rainy, our P5 model equipped with only 30 tops of computing power in combination with its sensor hardware to achieve the industry's highest safety and driving efficiency levels among similar scenarios. By taking the lead in exploring urban driving scenarios, we have amassed a tremendous amount of experience and developed deep insights into complex city row scenarios.\n\nNotably, the autonomous driving computing center, we co-developed with Alibaba Cloud, commenced operations in early August. computing power can reach 600 per swaps making it the largest domestic autonomous driving computing center in China. It will provide the requisite foundation of computing power for deep learning training, which empowers our full scenario advanced driver assistance system and will facilitate the future development of level four autonomous driving algorithms. All of these advancements will greatly enhance our competitive advantages in smart technology.\n\nSince this year, we have been very happy and excited to see the development of smart driving technology has been received -- has received active support from governments at all levels. The Ministry of Natural Resources recently announced a pilot project that high-definition maps applicate in smart driving vehicles in six cities, including Beijing, Shanghai, and Guangzhou. On this basis, we look forward to the public beta test of the and GP in the near future. The launch of City NGP showcases our capabilities as a pioneer in smart technology.\n\nWe will reach our competitive edges in talent, data, and system efficiency to further cement our leadership position in autonomous driving technologies, broadening our advantages in coverage, over experience, safety performance, and costs. I believe that the revolution of driving habits and car decision-making driven by technology has begun. So our next-generation technology to be unveiled next year will upgrade the architecture in all fronts, paving a way for facts and widespread adoption of full scenario ADAS-enabled driving nationwide and making safe and convenient intelligent driving software a reliable partner for users. I firmly believe that a full scenario ADAS will become a core deciding factor in consumers' car and that consumer adoption of ADAS software will become mainstream after the adoption increase of both scenario ADAS in the future.\n\nAdditionally, we have already commenced R&D for our robotaxi software based on a full scenario ADAS in an effort to utilize lower-cost, must-produce smart EV models and algorithms with strong generalization capabilities to lead the innovation. Moreover, I would like to share recent developments of portfolio companies in our ecosystem. XPeng Robotics completed over $100 million in Series A fundraising. Upon completion of the fundraising, XPeng Robotics will accelerate its R&D of Bionic robots while pursuing synergies with Smart EV technologies to create greater value.\n\nAlso, expand [Inaudible] first manufacturing factory for production trials, flying cars officially came into service in July, marking a significant milestone in the development of XPeng's flying cars. cars. According to China passenger vehicle insurance registration data, BEV penetration rate reached nearly 20% in the second quarter of 2022, while BEV penetration rate, excluding A0 class and A00 class was only 14%, thoroughly indicating a vast market potential with long-term disruptive opportunities for us. Although market competition is becoming increasingly intense, I believe we will reap the rewards of XPeng's long-term investment in electrification and core smart technologies for years to come as we bring more highly competitive new products to market.\n\nWith the G9, we have taken electrification, smart technology, and platform development architecture to new heights. We will continue to propel innovations across software and hardware products, bringing consumers, smart EV featuring, an unparalleled combination of advanced technology, building and design, and an exceptional smart driving experience. With the continuous advancement of our advantages in longer driving range, higher charging efficiency, and broader charging network coverage, XPeng will accelerate the transformation from and PHEVs in mid-to-high-end market toward BEVs. In the third quarter, we will work to overcome the impact of COVID-19 as well as seasonal factors.\n\nWe expect to deliver a total of 29,000 to 31,000 vehicles in the third quarter of 2022 with estimated revenue of RMB 6.8 billion to RMB 7.2 billion. Thank you, everyone. With that, I'll now turn the call over to our VP of finance, Mr. Dennis Lu, to discuss our financial performance for the second quarter of 2022.\n\nDennis Lu -- Vice President of Finance\n\nThank you, Mr. He, and hello, everyone. Now I would like to provide a brief overview of our financial results for the second quarter of 2022. I will reference RMB only in my discussion today unless otherwise stated.\n\nOur total revenues were RMB 7.4 billion for the second quarter of 2022, an increase of 98% year over year and equivalent to the level of the last quarter. Revenues from vehicle sales were RMB 6.9 billion for the second quarter of 2022, an increase of 94% year over year and a decrease of 0.9% from the last quarter. The year-over-year increase was mainly attributable to higher vehicle deliveries, especially for the P7 and P5. Gross margin was 10.9% for the second quarter of 2022, compared with 11.9% for the same period of 2021 and 12.2% for the last quarter.\n\nVehicle margin reached 9.1% for the second quarter of 2022, compared with 11% for the same period of 2021 and 10.4% for the last quarter. The quarter-over-quarter decrease was mainly attributable to battery cost increase, offset partially by the revenue increase as a result of selling price adjustment. Our R&D expenses were RMB 1.3 billion for the second quarter of 2022 and increased 46.5% year over year and an increase of 3.6% quarter over quarter. The year-over-year and quarter-over-quarter increase were mainly due to, number one, the increase in employee compensation as a result of expanded research and development staff; and number two, higher expenses relating to the development of new vehicles to support our future growth.\n\nSG&A expenses were RMB 1.7 billion for the second quarter of 2022, an increase of 61.5% year over year and equivalent to the level of the last quarter. The year-over-year increase was mainly due to: number one, higher marketing, promotional, and advertising expenses to support vehicle sales; and number two, the expansion of our sales network and the associated personnel costs and commission for the franchise store sales. As a result of foregoing, loss from operations was RMB 2.1 billion for the second quarter of 2022, compared with RMB 1.4 billion for the same period of 2021 and RMB 1.9 billion for the last quarter. A change in loss from foreign currency transaction was RMB 0.9 billion for the second quarter of 2022, primarily resulting from the revaluation impact of RMB-dominated assets held in the U.S.\n\nfunctional currency subsidiaries and rapid depreciation of the RMB against the U.S. dollar in the second quarter of 2022. Net loans were RMB 2.7 billion for the second quarter, compared with RMB 1.2 billion for the same period a year ago and RMB 1.7 billion for the last quarter. As of June 30th, 2022, our company had cash, cash equivalent, restricted cash, short-term deposits, short-term investment, and long-term deposits in total RMB 41.3 billion.\n\nTo be mindful of the length of our earnings call, I will encourage listeners to refer to our earnings press release for more details on our second quarter financial results. This concludes our prepared remarks. We will now open the call to questions. Operator, please go ahead.\n\nOperator\n\nThank you. [Operator instructions] Today's first question is from Tim Hsiao with Morgan Stanley. Please go ahead.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] So my first question is about the technology innovation and how we are going to translate that into our legal sales because XPeng is the leader in server technology domains, for example, like a CT NGP and A100-volt supercharging. So how could we maximize the traction of the technological innovation, especially in the premium mass market, where we notice consumers might be less tech-savvy and care more about their pricing performance ratio and how we expect? So that's my first question.\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you for the question. Actually, we do not talk about performance over price ratio that much. Rather, we put more emphasis on the configuration versus pricing more. If the configuration for a particular pricing is good of our vehicle, then the sales will naturally increase.\n\nHowever, if you look at the sales performance for the subsequent six months and 18 months after the launch of a particular product, you actually have to rely on the branding, the aftersale services, the product quality, and the unique competitiveness of our products themselves. Let's take P7, for example. If you look at the first six months of sales performance of that particular product after its first launch, the sales wasn't that great. However, ever since we launched the NGP function as well as other high-quality configurations in accordance with the P7 model, we definitely see a huge increase in the sales.\n\nFor the past four years, we have been able to attract a large quantity of customers that are interested in the configuration versus price ratio or that kind of balance in new energy vehicles. And ever since last year, we noticed that customers begin to pay more and more attention to the driving range of new entry vehicles, and also the safety of driving and the charging experience, etc. And as a result, because of our efforts and commitment into boosting our performance in those areas for the past four years, we are -- we are also able to gain a lot of trust and love and support from our loyal customers as well. And in the future, especially going forward as we continue to develop our smart technologies and electrification in different aspects in terms of expanding the driving range, driving safety as well as the charging network and the convenience of charging, we will be able to enjoy the economies of scale benefiting from our previous R&D efforts.\n\nAnd as a result, we believe that we can gradually converge those customers that we're not so happy with, for example, charging experience for new and vehicles as well as other aspects of the performance of new engine vehicles and slowly transitioning them into adopting more and more new energy vehicle, especially these. And going forward, especially since the launch of G9, we believe that of scenarios ADAS technology, we will be able to boost our performance of our products to a whole new level. And ever since that, we will be able to attract more and more users and that would translate into our sales performance. In addition to that, I would also like to mention that actually, with our commitment and investment in our R&D technology, we are able to further decrease our cost of manufacturing and R&D in the future with the adoption of our platform-based vehicle architecture as well as our new generation of smartification and electrification technologies.\n\nLet's see P9, for example. This is our first flagship products that actually adopt the mature level of these three areas of the technologies, which as a result, are able to bring down our manufacturing costs as well as our R&D costs as well. Because for the past years, we've seen every single product that we launched have been focusing on advancing technologies and next-generation technologies. But in the future, we will begin to reap the rewards of our previous investment in the R&D.\n\nAnd as a result, that would translate into a lot of reduction in our R&D costs as well as manufacturing costs and that will also contribute to the enhancement of our overall quality of the products that we are going to launch in the future as well as enhancing the manufacturing efficiency and R&D efficiency as well. And since 2019, we've been investing in improving our manufacturing craftsmanship as well. As a result in the upcoming two to three years, we believe that we will also welcome a new generation of quality boost in terms of the overall use a few of our -- both the interior and exterior of our vehicles in the future as well as the adoption of more and more integrated direct costing technologies that will allow and achieve future upgrade of our product quality. And as a result, as I mentioned earlier, we will be able to actually lower our R&D and manufacturing costs as well as enhancing our overall product.\n\nAnd so in the future, we believe that we will be able to actually witness better sales performance as a result.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] My second question is about the platform strategy. So following the launch of the G9 platform, I think XPeng is going to launch new models next year based on two platforms. So in light of faster iteration and more intense competition, what would be the reasonable life cycle of our next-generation platform and how many models we plan to build on each of the platform throughout their life cycle? So that's my second question. Thank you.\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you for your question. Indeed, in 2023, we aim to launch two new platforms to develop in total six new vehicles in the future that's based on our current platforms in total. And in -- we do estimate an average of three years life cycle for each single platforms or any system upgrades for those platforms. And we also have been discussing internally a lot of possibilities to upgrade our current platforms to allow them to empower a next generation of smartification and electrification technologies in the future as well.\n\nAnd so in future, we estimate that actually, our products have already entered into a very good cycle of developing base on our platform-based vehicle architecture technology of using at least three to six years of life cycle for those platforms, which will continue to fuel our future product development.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] So thank you very much for sharing all the insight. Thank you.\n\nOperator\n\nAnd our next question today comes from Jeff Chung with Citi. Please go ahead.\n\nJeff Chung -- Citi -- Analyst\n\n[Foreign language] So my first question is about the strong motorcycle ahead in '22,'23. We are going to launch our four new brand-new products, the P7 and the G9, the midterm face lift P7. So could you give us some insight on that, whether we can challenge the annual sales run rate at about 300,000 unit level? And if yes, could you break down the portion between the old products and the new products and whether the current old product, P7, matured sustainable monthly run rate can be maintained at 12,000 units? Thank you.\n\nBrian Gu -- Vice Chairman and President\n\nHey, Jeff. This is Brian. Let me answer your question. First of all, as you know that we don't give guidance that far out, so I cannot give you a number.\n\nBut I can give you some color regarding how do we see the new models going to position and compete in our lineup. First of all, I think we still see continued growth in our core product, for example, P7. With the update next year, we believe P7 will renew and continued strong performance. We have hoped that G9 next year will exceed the monthly delivery of P7, so you can actually do a little bit of calculation of what number that will represent.\n\nThe next year's new models, the first half will launch a B-class based product, that's actually going to target even larger market segment. It could probably consider that to be of strong competitors to the current model wide in the market. So we believe that will actually also be a model that can generate substantial numbers of delivery and sales. Obviously, the fourth new product, the C-class product will be launched in the second half.\n\nAnd given the premium and large format positioning, the number may be limited in terms of contribution. But again, it's still going to be targeting a brand-new segment that we did not cover before. So with that, you can get a sense of what the likely sort of peak level monthly delivery next year will look like. And we're very confident about our strong growth.\n\nJeff Chung -- Citi -- Analyst\n\n[Foreign language] So my second question is about the GP margin in the second quarter. So I think it's a little bit better than consensus. And on the negative side, we had the P7 sales volume declined by 3,500 unit Q-on-Q, and this was a high-margin product. And also after factoring the battery cost hike Q-on-Q, it seems that the GP margin was still quite resilient.\n\nSo could you break down the details a bit on the second quarter? And also, how about going to the third quarter, how do we see the margin trend? Thank you.\n\nDennis Lu -- Vice President of Finance\n\nJeff, let me answer your questions and Brian or Charles can supplement later. You're right. In the first quarter, our vehicle margin was 10.4%. In the second quarter, the vehicle margin was 9.1%.\n\nSo we dropped about 1.3 points. This was better than our original expectation because we were able to price the battery cost increase. However, due to some accumulating the orders, so the new price order was delivered until late May. So we could not fully recover the better cost through the price adjustment, that's one difference.\n\nAnd the other one would be, as you mentioned, the P7 mix in the second quarter was lower than 50%, so that has some mix impact. I can be detailed numbers to you. But basically, the margin reduction was primarily due to, number one, the cost increase, which were not recovered second quarter, and then the mix changes. Looking forward to the third quarter, I think we will be able to deliver the new price holders starting from July.\n\nSo that's good news compared with the second quarter. And more importantly, we will have better product mix in terms of the P7 as a percent of the total deliveries compared with second quarter. So we are anticipating the margin in the third quarter will improve compared with the second quarter will be equivalent or very close to the first quarter level for the moment. That's all I can tell you for the moment.\n\nBrian Gu -- Vice Chairman and President\n\nYeah. And then, Jeff, let me comment on your sort of point about our product cycle and also the current sort of weather both from a margin as well as from growth rate, how do we see the current situation? As Dennis mentioned, on margin because of the mix change as well as stabilization of battery. And also, our orders are now reflective of the fuel price changes as well as our sort of incentive mix change, we see third quarter margin should be stabilized and protect better than the second quarter. And also because we are starting to launch new products, obviously, G9 being delivered in October will be the first of the few new products that we can launch, we start to see growth being sort of generated from these new product launches as well as going to fourth quarter, we feel like the seasonality is in our favor.\n\nSo we do think there is a strong chance and strong confidence that we are going to a growth cycle, led by our new product launches this -- end of this year as well as throughout the next year as well as I think with these new models, also representing better margin due to the platform design as well as higher price points compared to our ASP. So those are the observations I can make at the moment.\n\nJeff Chung -- Citi -- Analyst\n\n[Foreign language]\n\nOperator\n\nAnd our next question today comes from Bin Wang with Credit Suisse. Please go ahead.\n\nBin Wang -- Credit Suisse -- Analyst\n\n[Foreign language] My question is all about there was a promotion in the start from mid of July. So what's the low in terms of both the volume guidance in the third quarter? So basically, if you have a bigger promotion, you should have a better volume. So did it mean you have a little bit conservative on the guidance is that you already plan to cancel the promotion of this month or this month? Meanwhile, you also give a pretty positive guidance about the margin in the third quarter, which will be returned to the level of the last quarter. Could you also assume your promotion will disappear start from, say, with obviously, this month and next month? Thank you.\n\nBrian Gu -- Vice Chairman and President\n\nSo Bin, this is Brian. To answer your question, first of all, the third quarter delivery guidance is considered all the information to date. So it will include the -- obviously, all of the promotion and price adjustments that we made in the past. The -- I think the guidance sort reflected the fact that we are entering to a relatively slow season.\n\nAnd also, we can see that some of the traffic in the stores are less than what we've seen before because post-COVID situation. And also, I think there's a part also due to that before the new model launch and deliveries, there are a little bit of people waiting to compare to existing purchases. So all that, I think you will see both from our experience as well as from peers performance as well. On the margin front, I think what I would say is that the promotions that we offer to the models actually is less than the price increases that we made in the second quarter.\n\nSo net, actually, the margin products is actually slightly better in this current sort of pricing environment or pricing mix. So we are seeing improvement in third quarter or stabilization in third quarter margins. I don't think we have actually guided to -- back to the first quarter level yet, but I think we see stabilization in the third quarter versus second quarter.\n\nBin Wang -- Credit Suisse -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question today comes from Ming Lee at BoA. Please go ahead.\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] So my question is regarding the battery technology. Because you just mentioned that the charging speed is much faster than the current battery. So do you own the patent and the technology or your supplier on it? And can they supply such kind of battery to other OEMs? And also, what is the reason for you to manufacture the on yourself?\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you for your question. In regards to supercharging, now there are several aspects of the consideration in the technologies behind the supercharging. First of all, you have to look at the battery themselves and the management of battery, the battery pack as well as the whole vehicle manufacturing and design as well as the charging piles. Now we do conduct collaboration in terms of the R&D of the development of the batteries with our suppliers and our partners.\n\nAnd so we share some of those patents in those areas. However, we have in-house R&D capabilities, and we own the patent of our management of the batteries as well as the design and manufacturing of the whole vehicle and the charging pilots as well. So to the first part of your question. In regards to the second part of your question, which is about the reasons behind or rationale behind the in-house development and research of our motors.\n\nIt is because it's very important for us to control the quality for the development of motors to uphold the highest standards of the, for example, quality of our products as well as to maintain the level of technology level that we aim to achieve. And so in order to achieve that, we have to do the R&D in-house. Thank you.\n\nBrian Gu -- Vice Chairman and President\n\nLet me just add, to answer your second question, the reason is better performance. Because our self-designed or actually has a very compact design and also efficiency that allows us to prolong the range of the vehicles better than what we can get on the market.\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\nThank you, Brian. Sorry, a quick follow-up question. Regarding the new model in 2023, Brian just mentioned that the product could be comparative product of models. So can I say it will be slightly smaller than G9 and price-wise, will be slightly lower.\n\nSo it has a large addressable market. Thank you.\n\nBrian Gu -- Vice Chairman and President\n\nYes. That's what will likely to be positioned.\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nAnd our next question today comes from Paul Gong with UBS. Please go ahead.\n\nPaul Gong -- UBS -- Analyst\n\nYes. Hi. Thank you for taking my question. Just two questions.\n\nThe first one still want to discuss a little bit more on the Q3 guidance. Do you see it is more like a supply side constraint or demand-side constraint? So is it like the supply chain? Or do you see the -- really it's a demand side temporary due to the seasonality? And the second question is regarding the potential cannibalization. So you're going to have B-segment SUV as well as the C-segment model next year. Given you already have the medium-sized sedan and SUV, P7 and G9, how do you see the cannibalization versus each other? [Foreign language]\n\nBrian Gu -- Vice Chairman and President\n\nHey, Paul. So on the first question, I think I mentioned earlier that we see the weakness mostly due to seasonal weakness, but also post-COVID control measures, there's lack of traffic. And also ahead of the new model launches, there is a little bit of a comparison and wait-and-see attitude which you saw, I think, in other models or other peers as well. But from our own perspective, also, there is a lot of orders not pairing with the supply chain because the mismatch in some of the older models.\n\nSo those are the reasons that I think we have currently provided such a delivery estimate view. So that's -- to answer your first question. Second question you had on the new models versus our current lineup. We feel like, first of all, there's very minimal overlap in cannibalization.\n\nWhat I answered before this question, the new B class model product in terms of size and in terms of price points will be different compared to G9. It will be positioned also very differently and competing with a very different segment. And also next year, the new models are not sedan models. So it does not compete with P7 as well.\n\nSo there's minimal cannibalization from our model positioning and lineup.\n\nPaul Gong -- UBS -- Analyst\n\nOK. Thank you so much.\n\nOperator\n\nOur next question today comes from Nick Lai with J.P. Morgan. Please go ahead.\n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\n[Foreign language] Let me quickly translate my question. The first question is really an update on chip condition as well as any production impact from partial currently in China? That's the first question related to production and supply question. And second question is really on second quarter half. We booked about RMB 890 million FSOs.Can we explain a little bit more on that? Thank you.\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Let me address your questions. First of all, in regards to the chip and battery shortage, definitely since last year, we have been greatly challenged by these two problems in the supply chain. However, since we believe that the problem -- the shortage in these two raw materials will be greatly released by the beginning of next year. Now for the first half of this year, there were a total of about 10 types of chips that were in high risk of supply shortage.\n\nAnd so far, we have seen a reduction in the number of the types of shortage that face high risk of supply shortage. And as I mentioned, previously, there is a total of 5,000 different types of chips included in every single vehicle. And so definitely, chip shortage will still be a big problem. But however, we are very excited and glad to see that the supply shortage is being relieved, and definitely by the beginning of next year, the problem will be much less stress and dire for us.\n\nNow in regards to the second part of your question, because of very early measures and communications, we are not being challenged or troubled or concerned with the power shortage or a power supply shortage in, for example, provinces such as. Thank you.\n\nDennis Lu -- Vice President of Finance\n\nHey, Nick. This is Dennis. Let me further explain the so-called the currency law exchange loss from the foreign currency transaction. Because when we had the U.S.\n\nIPO and the Hong Kong IPO, major money was raised and kept in the U.S. subsidiaries. So the functional currency is U.S. dollar.\n\nAnd through kind of intercompany lending, the U.S. subsidiary lend money to the domestic -- I mean, the company, the subsidiaries in China through the kind of intercompany lending. So this is kind of the RMB-dominated assets held by the U.S. subsidiaries.\n\nSo in the future, the money should be returned back to the U.S. So to convert back to the U.S. dollar. So when RMB has the appreciation, we will get the revaluation benefits.\n\nAnd in the second quarter due to the rapid RMB depreciation against the U.S. dollar, there is a revaluation impact, negative depreciation impact held in the second quarter. So in the future, if the currency change, we will do that on a monthly basis. So if RMB appreciates against the U.S.\n\ndollar, that will have the positive gain on the foreign currency transaction. So you're right, that's the trend.\n\nBrian Gu -- Vice Chairman and President\n\nNick, just to make clear. First of all, it's noncash. It's not -- doesn't mean that we have converted the cash. It's just the valuation because of the currency exchange rate differences result in such sort of swings.\n\nObviously, every quarter, we have to value the assets using our functional currency, and that's why there is differences resulting from that. Because the RMB exchange rate reacted pretty, I would say, significantly in the last quarter.\n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\nYeah. I understand. Xiaopeng, Dennis, and Brian, thank you.\n\nOperator\n\nAnd our next question today comes from Jing Chang with CICC. Please go ahead.\n\nJing Chang -- CICC -- Analyst\n\n[Foreign language] This is my first question. How do we look at the competition, patent and consumer preference of the market pressed at RMB 200,000 compared with peer model? Can you share what we think are our major advantages and disadvantages, whether there would be a new version of defined next year? And how should we expect the monthly sales volume at?\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you. Thank you for your question. Now in regards to the competitive landscape within the price range of RMB 200,000, we believe the competition will continue to be very intense for this year and the coming year as well. And there are two types of competition out there, really.\n\nThe first type is regarding the driving range as well as the performance over pricing ratio. And the other is about the overall design and the smartification features for those kind of products. And for P5, its advantages is definitely in regards to the -- it's very outstanding in terms of overall is as well as immersive and their immense sort of cabin space as well. And we have observed a very steady sales performance for P5.\n\nIn regards to P5 sales performance guidance for 2023, we'd you argue about guidance with that kind of level of details in terms of quantity of sales expectation, but because there are some -- some new updates for P7, we definitely believe that maybe it will have a small impact on the sales performance of P5. But overall, we expect to see very good performance in terms of the sales for P5 overall. And also with the -- as we observe for P7 with the newly launched NGP, we observed a boost in sales performance, and we expect to see the same situation happened for P5 as well, which means that the -- with the launch of a higher level of smart features such as city-level NGP, the performance for P5 will grow. Thank you.\n\nJing Chang -- CICC -- Analyst\n\n[Foreign language] My second question is how you think about the timing of the mass usage of supercharging. Will it be popularized quickly? Or will it need to gradually penetrate over a few years? In addition, how should the high-voltage platform increase the purchase of manufacturing cost of the vehicle? Can it achieve record -- can it be penetrated to a lower price model?\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Now in regards to the construction and the adoption of our supercharging network, definitely, it's developing quicker than expected. This quarter, we started the aggressive construction of our network. And by Q4 this year, we believe that we will have another one of new stations equipped with the supercharging facilities. And by 2023, our supercharging network will be constructed even at a higher space -- at a higher pace.\n\nNow, for example, G9 with its highest configuration model, fully compatible with the supercharging facility, all the configurations, and other models actually G9 -- other versions of G9 actually support three supercharging function. And in the future, because our platforms right now will support this high-voltage and high-power supercharging facility, we believe that our future models will all be equipped with this kind of functionality, which means that we can be able to do better supply chain control our future products with this kind of facility and allow us to achieve better economies of scale as well as cost controlled effects. Now there are two things that we need to focus on when we talk about the supercharging network construction. One is development and the design of our vehicle products to support this kind of high voltage supercharging function.\n\nAnd the other is the construction of our supercharging network and the charging piles. And by the second half of 2023, we believe that you will -- we expect to see a very well-established supercharging network that can fully promote the adoption of our supercharging -- quick charging facility. Thank you.\n\nJing Chang -- CICC -- Analyst\n\n[Foreign language]\n\nOperator\n\nAnd ladies and gentlemen, this concludes our question-and-answer session. I'd like to turn the conference back over to the company for closing remarks.\n\nAlex Xie -- Head of Investor Relations\n\nThank you once again for joining us today. If you have further questions, please feel free to contact us one's investor relations through the contact relation provided on our website or the KSM Group Investor Relations.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlex Xie -- Head of Investor Relations\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\nDennis Lu -- Vice President of Finance\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nJeff Chung -- Citi -- Analyst\n\nBrian Gu -- Vice Chairman and President\n\nBin Wang -- Credit Suisse -- Analyst\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\nPaul Gong -- UBS -- Analyst\n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\nJing Chang -- CICC -- Analyst\n\nMore XPEV analysis\n\nAll earnings call transcripts"
}