{
  "companyName": "Kohl's",
  "companyTicker": "KSS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/18/kohls-kss-q2-2022-earnings-call-transcript/",
  "content": "Kohl's (KSS 0.68%)\nQ2 2022 Earnings Call\nAug 18, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day. My name is Chantelle, and I'll be your conference operator today. At this time, I would like to welcome everyone to the Kohl's Corporation Q2 2022 earnings conference call. As a reminder, today's conference call is being recorded and all lines have been placed on mute to prevent any background noise.\n\nAfter the speakers remarks, there will be a question-and-answer session. [Operator instructions] Thank you. Mark Rupe, you may begin your conference.\n\nMark Rupe -- Vice President, Investor Relations\n\nThank you. Certain statements made on this call, including projected financial results and the company's future initiatives, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Kohl's intends forward-looking terminology such as believes, expects, may, will, should, anticipates plans or similar expressions to identify forward-looking statements. Such statements are subject to certain risks and uncertainties, which could cause Kohl's actual results to differ materially from those projected in such forward-looking statements.\n\nSuch risks and uncertainties include, but are not limited to, those that are described in Item 1A in Kohl's most recent annual report on Form 10-K and Form 10-Q for the first quarter of fiscal 2022 and as may be supplemented from time to time in Kohl's other filings with the SEC, all of which are expressly incorporated herein by reference. Forward-looking statements relate to the date initially made and Kohl's undertakes no obligation to update them. In addition, during this call, we will make reference to non-GAAP financial measures. Information necessary to reconcile these non-GAAP financial measures can be found in the investor presentation filed as an exhibit to our Form 8-K filed with the SEC and is available on the company's investor relations website.\n\nPlease note that this call will be recorded. However, replays of this call will not be updated. So if you're listening to a replay of this call, it is possible that the information discussed is no longer current, and Kohl's undertakes no obligation to update such information. With me today are Michelle Gass, our chief executive officer; and Jill Timm, our chief financial officer.\n\nI will now turn the call over to Michelle.\n\nMichelle Gass -- Chief Executive Officer\n\nThank you, Mark. Good morning and welcome to Kohl's second quarter earnings conference call. Since our last earnings call in May, as all of you know, a weakening macro environment, high inflation, and dampened consumer spending are having broad implications across much of retail, especially in discretionary categories like apparel. Given our penetration in these categories, this is disproportionately impacting Kohl's.\n\nOur second quarter results reflect a middle income customer that has become more cost conscious and is feeling greater pressure on their budgets. Therefore, we are seeing customers make fewer shopping trips, spend less per transaction, and shift toward our value-oriented private brands. We have responded to this dynamic environment, taking action to adjust our plans and adapt to a softer demand outlook. With increased promotions, we are being aggressive on clearing excess inventory.\n\nWe are pulling back on receipts and we are managing expenses diligently. We acknowledge that many others are taking similar actions, which will likely make for a more promotional environment in the near term. Our updated full year guidance contemplates lower sales and margin pressure from a more difficult economic backdrop and a more competitive landscape. We have navigated difficult retail environments in the past and I am confident that we will successfully manage through the current uncertainty.\n\nWe have the right long-term strategy and initiatives and a formidable foundation featuring a differentiated brand portfolio, strong value position, and a convenient and broad reaching omnichannel platform. We are also continuing to make progress in our strategic transformation and now have nearly 600 of our stores recently refreshed and reflecting our forward vision as the leading destination for the active and casual lifestyle with Sephora as a key cornerstone. We are seeing outsized performance in these stores relative to the balance of the chain. And we are looking forward to continuing the rollout to reach 850 Sephora at Kohl's shops in 2023.\n\nKohl's is a financially strong company with a proven history of prudent balance sheet management and significant cash flow generation. Our $500 million accelerated share repurchase underscores our steadfast confidence in Kohl's future and focus on creating shareholder value, especially given the current valuation of our company. As Jill will discuss in more detail, we remain firmly committed to the health of our balance sheet and we will plan our capital allocation decisions going forward to continue to reflect this priority. With that perspective, let me turn to our comments on the quarter.\n\nSecond quarter comparable sales declined 7.7%. We saw a benefit early in the quarter from spring seasonal selling, though, as we progressed through May and into June, it became increasingly clear that inflationary pressures were beginning to impact our customer spending, especially our middle income customers. June was the most challenging month in the quarter. In July, we took actions to drive demand, which improved the trend.\n\nFrom a channel perspective, digital sales were flat to last year benefiting from higher conversion rates, driven largely by our implementation of a lower free shipping threshold to be more competitive. The Kohl's app accounted for 40% of digital sales in the second quarter, doubling in penetration in recent years. In total, digital sales accounted for 28% of net sales, up from 26% last year. Store sales declined 10%, resulting from less traffic and smaller basket sizes, primarily driven by the overall macro pressures I mentioned earlier.\n\nStores fulfilled 37% of digital sales in Q2. Our private brands outperformed national brands for the second consecutive quarter with sales growth achieved in many of our key brands. This is another indication of our ability to fill the needs of our customers looking for greater value during this time. It's clear that there has been a significant shift with the consumer over the past few months, and we expect this to persist for this foreseeable future.\n\nAs an organization, we are focused on ensuring we can navigate this period successfully. This includes our inventory management efforts, clearing out excess goods while also pulling back on receipts and being expense disciplined. And while we do this, it's important that we continue to execute on our transformation strategy. Even amid a very challenging backdrop, our transform stores with Sephora are outperforming the balance of the chain.\n\nSo now let me give you a little more color on Sephora. Our game-changing partnership with Sephora continues to deliver on its promise of transforming Kohl's into a leading beauty destination. We have successfully opened nearly 600 Sephora shops during the past year, including 400 in 2022. In the 200 stores opened last year.\n\nWe have maintained a high single digit percent lift relative to the balance of the chain. And in the nearly 400 stores opened this year, we are seeing a mid-single digit percent sales lift, which is consistent with the initial performance in the first 200 stores. As these Sephora openings follow the curve of last year's openings, we would expect sales to accelerate in the months to come. From a product perspective in Q2, we saw strength across all beauty categories, including skin care, makeup, and fragrance.\n\nTop selling brands have been the Sephora Collection, Fenty, Charlotte Tilbury, NARS, and Too Faced. We have acquired more than 1 million new customers since launching last August, which is encouraging given that this occurred in less than half of our fleet, many of which have just been opened for a very short period of time. The new customers are younger and more diverse and shop more frequently than our average customer. I am especially proud of the strength of our partnership with Sephora.\n\nOur collective teams work very closely together with the common goal of driving the business for both the short and long term. What we have achieved together in less than one year is remarkable and we're just getting started. We see a long runway of growth ahead. As planned, we will open another 250 shops in 2023, taking our total to 850 2,500 square feet shops.\n\nGiven the success of the partnership we are seeing today, we are working with Sephora to design a smaller footprint concept for our remaining 300 stores, creating a Sephora presence across our entire store base. We are in the early stages of this concept and we'll keep you posted on this exciting development. We are also innovating and experimenting together to drive productivity and improve the overall customer experience even further. We're currently testing cross-company BOPIS, where purchases made on Sephora's website, sephora.com, can be picked up at Kohl's stores, creating an incredibly seamless and convenient experience for our customers.\n\nAnd next month, Kohl's will begin to accept any support gift card regardless of where customers bought it. Later this year, we will significantly expand our holiday gifting assortment and increase our marketing investment, setting us up well in the 600 stores and digitally for a big traffic driver during holiday. We are excited about all that is ahead for Sephora and the impact this partnership will have on our business. And as a reminder, we are just completing the buildout of this year's 400 stores, so the vast majority of Sephora's business impact is still in front of us.\n\nLet me now provide some more color on how other categories performed in the quarter, starting with Active. Active is an important category for calls, and it is a key component of our overall active and casual lifestyle vision. In recent years, we have invested significantly in strengthening our product offering, elevating our merchandizing and expanding dedicated space to Active in our stores. These efforts drove strong growth and Active sales, including more than 40% growth in 2021 and increasing it to 24% of our total sales, up from just 14% five years ago.\n\nDuring the second quarter while Active apparel performed better than the company with strong growth in our athleisure and outdoor offerings, total Active sales underperformed the company due in part to supply chain related challenges in athletic footwear and the strong growth achieved last year. Turning to our women's business, sales slightly outpaced the company with underlying strength in areas where we invested over the past 18 months. We saw continued momentum in dresses, driven by a greater emphasis both in-store and digitally, as well as in our more elevated casual offerings such as Wear to Work with growth in our key private brands of Nine West, Simply Vera Vera Wang, Lauren Conrad and Sonoma. Offsetting the strength was weakness in our juniors business, which accounted for a majority of the women's decline in Q2.\n\nWe attribute the junior's underperformance to a portion of our juniors fashion assortment, not resonating with our customer, which we, of course corrected, and to the temporary disruption in the nearly 400 stores refreshed in 2022, where juniors were repositioned within the store. On this latter point, we are expecting the impact to improve as customers get more comfortable with the new layout as well as enhance navigation signage we are adding to these stores. Turning to men's, it also slightly outperformed the company in Q2, driven by the successful new brand introductions over the past year, including Tommy Hilfiger, Hurley, and Calvin Klein. We also saw solid result in young men's tailored dress and big and tall.\n\nOutdoor continues to be a strong growth contributor in men's with momentum in our key national brands Eddie Bauer and Columbia. Given this success, we are expanding our outdoor brands to more stores this fall, including Eddie Bauer, Under Armor Outdoor, and Columbia's PFG collection. And lastly, our home and children's business underperformed. The home category continues to normalize following strong demand during the pandemic, and our children's business experienced declines in the tweens, boys, and girls departments due to softness in seasonal classifications and basics, as well as in toys and sleepwear, which were up against strong growth comparisons.\n\nFrom a profitability perspective, as Jill will discuss in more detail, the lower earnings relative to last year were primarily driven by the decline in sales and gross margin, and the significant step up in investments in our strategic growth initiatives of Sephora store openings and store refreshes. As it relates to the back to-school season, we are focused on delivering compelling value across key categories and we are supporting this with promotional events and more targeted offers. To date, overall back-to-school trends are in line with our expectations. Before I turn it over to Jill, let me touch on the actions we are taking to drive shareholder value.\n\nAs announced this morning, we entered into a $500 million accelerated share repurchase agreement. This underscores our confidence in Kohl's future and our focus on creating shareholder value. In addition, we remain firmly committed to our current dividend. With that, I want to close by saying that 2022 has turned out to be very different than we anticipated.\n\nThe weakening economic backdrop and inflationary pressures have created headwinds for our customers, our industry, and our business. We are leveraging our agility and responding with the customer at the center of our focus. Kohl's has navigated many difficult periods in the past, and I'm confident we will successfully manage through this dynamic period as well. I want to thank our incredible associates around the country for all you do.\n\nWe have been challenged in many ways over the past couple of years, and this team continues to step up to meet every challenge with tremendous agility and commitment. I can't thank you enough for your dedication to Kohl's and for providing excellent service to our customers every day. With that, let me turn it over to Jill, who will give you more details on our financial results.\n\nJill Timm -- Chief Financial Officer\n\nThank you, Michelle, and good morning, everyone. For today's call, I'm going to review our second quarter results, discuss our capital allocation actions, and then provide details on our updated 2022 guidance outlook. Starting with the second quarter results. Comparable sales declined 7.7% and net sales were down 8.5%.\n\nLower store traffic and smaller basket sizes were the primary drivers of the decline. Although we did see an increase in average ticket, it was less than historical as our customers shifted toward our opening price point private brands. Other revenue, which is primarily credit revenue, was flat to last year. Turning to gross margin.\n\nQ2 gross margin was 39.6%, down 290 basis points from last year, driven primarily by elevated freight expenses, product cost inflation, and increased promotional activity. SGA expenses increased 3.4% to $1.3 billion, driven largely by investments in our key strategic initiatives. During the quarter, we invested an incremental $36 million to last year to support the Sephora store openings, store refreshes, and reflows. In addition, we incurred $9 million of expense related to the strategic review process.\n\nWe also experienced increases in wages and transportation costs that led to additional expense deleverage. Depreciation expense of $206 million was $4 million lower than last year due to reduced technology capital spend. In total, our Q2 operating margin was 6.5%. Net income for the quarter was $143 million, and earnings per diluted share was $1.11.\n\nTo summarize, the lower earnings per share relative to last year was primarily driven by the lower sales and gross margin and the significant step-up in investments and our strategic growth initiatives of Sephora store openings and store refreshes. Turning to the balance sheet, our inventory at quarter end increased 48% compared to Q2 2021. This increase was driven by lower-than-expected sales in Q2, along with three unique factors. First, $269 million of the increase was due to elevated in-transit inventory as we built an additional order lead times to ensure we met customer demand, given the supply chain disruption.\n\nSecond, $220 million of the increase was related to our investment in beauty inventory to support the 400 Sephora shops opening in 2022. And third, we continue to leverage, pack-and-hold for late holiday receipts, such as sleepwear and fleece, which added $82 million of inventory. This merchandise will be set in Q3 ahead of the holiday season. Excluding these three unique factors, our inventory would have increased 27% to 2021 and decreased 8% to 2019 levels.\n\nWe have taken action to address inventory, including increasing promotions, being aggressive on clearing excess inventory, and pulling back on receipts. Given our updated business outlook, we now expect inventory to end the year up high teens as compared to 2021. Turning to cash flow, operating cash flow was a use of $86 million in second quarter due to lower sales and higher inventory levels. Capital expenditures for the quarter were $327 million, driven mainly by Sephora buildouts and related store refreshes.\n\nWe are now planning for approximately $825 million of capital expenditures in 2022. Now let me give you an update on our capital allocation strategy and plans. We are focused on our strong balance sheet with the long-term objective of maintaining an investment grade rating. We also remain committed to our current dividend.\n\nWe will balance these overarching objectives while also capitalizing on unique opportunities to repurchase our shares at an attractive valuation as is evident in today's announcement of a $500 million ASR. We expect our balance sheet and cash flow metrics to be more challenging in 2022 and most notably at the end of Q3 as we build receipts ahead of the holiday. Importantly, we fully intend to return our balance sheet to a position of historical strength with an objective of leverage of 2.5 times. We will continue to focus our shareholder returns by prioritizing the dividend while also employing liability management to retire our 2023 bond maturities next year totaling $275 million.\n\nIn addition, we are assessing the current retail environment and leveraging a competitive process to determine potential opportunities to monetize a select portion of our real estate assets. As we have done in the past, we will focus on opportunities that will enhance our financial flexibility and maintain our healthy balance sheet. During the second quarter, we paid $64 million or $0.50 per share in dividends to shareholders. In addition, as previously disclosed, on August 9th, the board declared a quarterly cash dividend of $0.50 per share payable to shareholders on September 21st.\n\nWe did not repurchase any shares in the second quarter, given the strategic review process. For the full year 2022, we plan to return approximately $900 million in capital to shareholders through our dividend and share repurchase activity. Now let me provide details on our updated outlook for 2022. We are updating our annual guidance to reflect our year-to-date performance and incorporate continued uncertainty in the macro environment.\n\nWe now expect net sales to decline in the range of negative 5% to negative 6% versus 2021. We expect sales to remain soft given the challenging economic backdrop. However, we do expect our partnership with Sephora to further contribute incrementally to our business with 600 shops open during the key holiday season. For operating margin, we expect it to be in the range of 4.2% to 4.5%.\n\nWe expect gross margin in the second half of the year to contract similarly to our Q2 gross margin performance, driven by product cost inflation and increased promotional environment and elevated freight costs. Our guidance also assumes SG&A expense in the second half of the year to benefit from lapping last year's Sephora rollout expenses and the lack of holiday-based retention incentives this year. For the year, we expect SG&A expense to increase approximately 1.5%. And for EPS, we expect it to be in the range of $2.80 to $3.20.\n\nIn summary, while 2022 has turned up quite differently than we planned, we are confident in our ability to navigate the uncertainty and continue to position the business for future sales and earnings growth. With that, we are happy to take your questions at this time.\n\nOperator\n\n[Operator instructions] Our first question comes on line of Mark Altschwager with Baird. Your line is open.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nGood morning. Thanks for taking my question. To start out, can you can you talk about your confidence in the 7% to 8% longer term operating margin goal? Just the environment and the 2022 outlook has changed quite a bit since you outlined those goals. Maybe help us understand the pieces that need to come together both internally and with the external environment to make that possible.\n\nJill Timm -- Chief Financial Officer\n\n[Inaudible] We still have strong conviction in our long-term financial framework. We think it's the right framework that will run the company from [Inaudible] there's a lot of macro environment, sense -- and negative sentiment around the consumer that's weighing down on our structure. But I think 78% is actually where we're going to run this. Right now, obviously, working through the inventories is important and get ourselves back in line from a sales perspective.\n\nI think the strategies we have in front of us with Sephora, and we'll talk more about as you heard from Michelle on the call, that continues to be a positive for us. We still feel great with the active performance that we're seeing, especially as we reflow that to the front of store. And then I think, as you see, our SG&A expenses only being up 1.5%. We're really working through that despite the big investment we made this year to roll out the Sephora shops to over 400 stores.\n\nSo I think both Michelle and I and the leadership team all feel very convicted at running at 78% long term despite, I think, the momentum that we're working through right now. But I think the health of the financial framework that we've established, that's really helping us successfully navigate these uncertain times.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nThank you. And maybe just one more. From a capital allocation perspective, just given the reduced sort of free cash flow outlook, why is the $500 million ASR still the right move today? And then your capex, it looks like you tightened up the plans a little bit for this year. Is $2.5 billion over the next three years still the right way to think about it? Or have you made any adjustments to those plans, given the change in the outlook? Thank you.\n\nJill Timm -- Chief Financial Officer\n\nCertainly. I think always our capital allocation starts with cutbacks. And this year, we did tighten a little bit but obviously the big portion of our capex is the investment back in our stores really to support the Sephora shops. And that was happening early spring.\n\nIt is part of the long-term framework we just spoke about. That's why we continue to lean into that. We'll continue that into next year. And as Michelle alluded to, we're looking for and working with Sephora on that solution to all of our stores.\n\nSo I think obviously we'll manage that capex based on the returns that we see, but Sephora being a big one for us as we look out is always our first and foremost. We also stand very convicted to the dividend and you saw that and heard that both Michelle and I today that the dividend becomes our second investment. In terms of the share buyback, we've always said this would be opportunistic and we view that in the context of that framework. And I think looking today at our valuation, we feel this is a very opportunistic time for us to buy back shares and really return that value to our shareholders.\n\nSo obviously, given the tightened cash position, you could say, well, is it opportunistic? I think want to buy low, Mark, and we feel like this is a big time for us to do that, which is why we were pretty aggressive at the $500 million ASR. We feel very confident that we're going to build back to a normal cash position back into 2023. So really just accelerating some of those repurchases in 2022 and taking advantage of the current environment.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nGreat. Thank you. And best of luck.\n\nJill Timm -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Bob Drbul with Guggenheim. Your line is open.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nHi. Good morning. Just picking up on the capital allocation. You made some comments on the real estate, what you're seeing out there.\n\nJust wanted to be give us a little more color in terms of what you've learned from the process and in terms of the value of either sale leaseback of your stores, or the FCs, or the DCs, and sort of how you might use that capital. Is -- would it largely be more share repurchase? Would you consider special dividend? Can you just maybe talk about that a little bit? And then the second question, just focused on Sephora. On the Sephora rollout, can you give us some comments on maybe how the earliest stores are doing? If you have any numbers on new customers and/or cross-shopping, that would be great. Thank you.\n\nJill Timm -- Chief Financial Officer\n\nSo Bob, I'll start with capital allocation. Really, I mean, we're always focused on opportunities that are going to enhance our financial flexibility and really help us maintain the balance sheet. So when we talk about looking at potential opportunities to monetize the real estate assets, I mean, obviously the market is quite volatile right now. So we're doing a competitive analysis of that, really helping understand what we can get.\n\nI would say right now with the industrials. In terms of the DCs, EFCs have a better rate than what we're seeing from a store perspective. But also key to that is understanding what that means from lease terms and the long-term components of those contracts. I think as that money comes in, does it get utilized for a share buyback or a special dividend? I would say most likely we would want to return it back to shareholders.\n\nTypically, we've seen that as an opportunistic opportunity with a share buyback, but that would be something that we continue to evaluate based on what we would see as a deal that again maintains our financial flexibility and the health of our balance sheet.\n\nMichelle Gass -- Chief Executive Officer\n\nGreat. Bob, Michelle here. I'll answer your question on Sephora. We continue to be really pleased with the partnership and how the overall concept is doing both in our stores and digitally.\n\nI think to your question on the first wave of doors we opened, so those first 200 doors, those are generating about a high single digit lift relative to stores that don't have Sephora. I'll call it balance of chain or that half of the chain that doesn't have it. So high single digits, very pleased with that. We're seeing that clearly come from beauty purchases, but we're also seeing it come from other purchases that the customer is making.\n\nOur baskets are attaching close to about 50%. And so they're putting women's, they're putting accessories and active into the basket, and we think that will only grow. I also think what's encouraging, so this latest wave of stores, the 400 doors, which they're just opening as we speak, as we had expected. But they're starting out just as those first 200 doors did.\n\nSo they're in the mid single digit lift range against balance of chain or the non-Sephora doors. That's where the first 200 started. So like anything, as the customer gets to know Sephora there, gets used to the concept, we expect that to grow and ramp, not unlike if you are building a new store and you have that comp growth over a couple of years. I think contributing to that in those first 200 doors, again, the ramp we're seeing is frequency.\n\nSo customers who are shopping Sephora are shopping more frequently than, call it, the average shopper. So I think that's really encouraging. And then the other data point around new customers. So we've quantified in the doors we've opened, again, the first 200 were up roughly close to a year and then these 400 just opened.\n\nBut we've calculated about a million new customers, which we're really encouraged. They're significantly younger. They are more diverse. So really in the spirit of the partnership, we could not be more pleased.\n\nI think it's important to set the expectations in terms of the results. The majority of the stores are just opening, so the opportunity is all ahead of us. While we're at a year anniversary of the partnership, truly, in terms of the business impact, we're in the very, very early days and like I said, the upside is ahead of us.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nGreat. Thank you very much.\n\nMichelle Gass -- Chief Executive Officer\n\nThanks, Bob.\n\nOperator\n\nOur next question comes from Gabby Carbone with Deutsche Bank. Your line is open.\n\nGabby Carbone -- Deutsche Bank -- Analyst\n\nHi. Good morning. Thanks for taking my question. So on a three-year basis, your updated sales guidance doesn't really assume any improvement for the remainder of the year.\n\nJust wondered if you could maybe dig into the trends you saw exiting the quarter. You mentioned you took actions in July to improve demand and then on back-to-school, you said it's trending in line with your expectations. Just wondered if you could provide a bit more color there on the early read. Thank you.\n\nMichelle Gass -- Chief Executive Officer\n\nSure. Gabby, Michelle here. Thanks for the question. So first to start with the quarter, I think as I said in my remarks, we actually did see July show some improvement from the earlier part of the quarter.\n\nJune was our toughest month. So we started with seeing some encouraging spring seasonal selling. Things really fell off in that kind of late May and into June as we looked at the correlation to the inflationary pressures that was having a massive impact to our business. We took a number of actions in July in terms of driving value.\n\nThat's clearly what the customer wants, and the customer was responding. So that was encouraging. And we recognize that the environment is going to be promotional. It's going to be very value driven, and so that is reflected in our guide.\n\nIn terms of the back half of the year, our guidance would suggest that we'll be in that mid-single digit range. So we're showing a, call it, modest improvement from the first half. And that is Sephora. I mean, we are seeing the impact by Sephora, as I was just speaking to in the prior question.\n\nAnd so as those stores ramp up, as they open, I mean, this will be our first holiday with 600 doors open. We're really excited about that. We have a lot of things planned but we're also being very prudent. I mean, we're in the discretionary category business largely.\n\nBeauty has proven to be quite resilient, but besides that, I mean, all the unpacking we've done with the customer is they're feeling tremendous pressure on their budgets as inflation has taken hold in more essential categories like food and gas, and they're spending less on apparel. So it's an industry challenge. It's also a big challenge for Kohl's. That being said, we're not going to sit still.\n\nWe're going to show up. We're going to be relevant. Like I said, value will be a key, overarching message both for back-to-school and we get to holiday. We have great private brands that stand for value.\n\nA number of those outperformed and we're showing positive comp brands like Sonoma or Jumping Beans and kids. So the customers going there and this is our second quarter where our private brands actually outperformed our national brands. So all of those things, again, point to a customer that is under a lot of financial pressure. And so we have to make sure we're showing up in a relevant way.\n\nThere, clearly, and what we saw saw in the second quarter is fewer trips and less in their basket. It's important to note, as we make comments in the remarks that we're seeing this largely in our middle income customers. Interestingly, in our higher income customers, we're actually seeing more customers and they're spending more. So it correlates again to where the economy is creating, like I said, pressure.\n\nWe're really seeing in our middle income customers. So we're just being really thoughtful and prudent as we look at the balance of year and not expecting to see a massive shift in the environment. If that happens, great. But we want to make sure that we can be relevant.\n\nAs it relates to your question on back-to-school, as I said, it's about in line with our expectations. We're still relatively early in the season. We're seeing strength in categories like backpacks, kids footwear in those younger kids sizes. I'd say where we have not yet seen the pickup in our business is in areas like denim, kids uniforms or those older kids sizes.\n\nSo again, a little bit of mixed results here in line with our expectations. But I think most importantly, we're doing a lot to drive that value message during the back-to-school season.\n\nGabby Carbone -- Deutsche Bank -- Analyst\n\nGreat. Thank you so much for all the color.\n\nMichelle Gass -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nYour next question comes from Oliver Chen with Cowen and Company. Your line is open.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, Michelle and Jill. On the juniors front, you spoke about an opportunity there. Approximately what percentage of mix and what do you see ahead for the opportunities to improve that as well as timing? And then, Jill, on the inventory situation and the promotions and what you'll do to proactively clear, what should we know about timing and guardrails? And there could be a customer that requires more promotions than you than you expect as well, given the dynamic nature of the environment. Thank you very much.\n\nMichelle Gass -- Chief Executive Officer\n\nSure. So, Oliver, I'll take your question on juniors first. I think there's two things going on. One is in our Sephora doors, we made a lot of changes and moved a lot of things around.\n\nI mean, all thoughtful. We had piloted it. Juniors was one of the areas that got a significant move. So, and again, to set context, the stores are doing very well.\n\nSo the net effect of all the changes, beauty, moving active to the front, etc., that's working. Juniors in particular, it moved off of the right front pad of the store into a new location. And so we are seeing a disruption there. The team is on it.\n\nThey're adding incremental signage. We're doing some things around mannequins and the customer is, you know, going to get used to that new destination for juniors. It takes some time when you move things around in a store for the customer to get more acclimated to that. So that was one.\n\nSecond and operating with great urgency is that we didn't have the assortment right. There was too much fashion, not enough of the basics. Some of the fashion choices were a little too young, I would say. That's been, of course, corrected.\n\nI'd say, Oliver, one of the things that has hurt us is with all of the supply chain disruption that's happened, we were not able to get in and out of some of those items. So, as we look ahead on supply chain, we're already seeing that today where the time is coming back. But over the last a couple of years, 18 months, those timelines have gotten long and as you well know, as it relates to young women and juniors, those cycles can change pretty rapidly. So we bought too much of some of the more fashion trend product and the customer wasn't going there.\n\nI also think, relative to some of the inflationary pressures, one of the things we're seeing broadly about women's is this desire to have more of the basics or staples and things they can get a lot of use out of and flexibility as opposed to those fashion pieces. So we've got to rebalance and the team's on it.\n\nJill Timm -- Chief Financial Officer\n\nAnd then in terms of inventory and promotions, Oliver, we're actively working down inventory. We've done that through cutting receipts. We've been aggressive on clearance as well as promotions. Obviously, as we go into the important holiday period, we want to make sure we're still flowing freshness and we have those gifting opportunities for our customers.\n\nSo we'll continue to watch that move into the holiday period. But we do expect to be up high teens as we end the year, which actually puts us right back in line with where we were in 2019. And that's even with funding 600 additional Sephora doors. So I feel good with the metrics and the moves we're making in terms of getting inventory back in balance, in terms of promotional environment.\n\nWe are expecting a heightened promotional environment. I mean, holiday is always promotional. I think given everything we're seeing, as Michelle mentioned around value, that's something Kohl's has always stood for. We've always been promotional.\n\nSo we really know how to lean in here. And so as you see the guide on the margin, you'll see we don't expect it to get any better than what we saw in Q2. And that was really being aggressive through promotions in both July and promotions in July. As we go to the back half of the year, we will start lapping some of the freight costs, as we had mentioned in Q4.\n\nSo great today, although a dynamic environment, we are seeing some of those costs come down. They're still higher than last year. But then in Q4, we start lapping some of those higher costs. So although the margin isn't improving, it's going to change buckets really from being more freight pressured into more of those promotions and clearance activities to make sure that we can move into 2023 feeling good with the inventory composition.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nVery helpful. Best regards.\n\nJill Timm -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Chuck Grom with Gordon Haskett. Your line is open.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey, thanks. Thanks very much. Good morning. Just a couple of housekeeping things.\n\nJill, can you hold our hands on how you're thinking about the comps in both the third and fourth quarter? And then also in the second quarter, your credit revenue, I believe, was flat year over year, which is a big change from the first quarter. Can you just walk us through, I guess, why and then how you're thinking about that line item in the back half of the year?\n\nJill Timm -- Chief Financial Officer\n\nSure. Chuck, I'm sorry, can you repeat the first Q3, Q4? I didn't hear what you were referencing.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nJust the comp, how you're thinking about the comp cadence in the back half.\n\nJill Timm -- Chief Financial Officer\n\nYeah. I would say we expect that Q4 should be a little better than Q3. If you remember last year, we had lacked inventory. I think we quantified about $250 million of a sales liability because we were out of stock and we couldn't flow the inventory, given the supply chain disruption that we were experiencing.\n\nThis year, obviously, we feel much better suited. We're flowing those receipts. We've written in time to ensure that we are going to bring the receipts in timely. We've actually made a lot of proactive moves on how those goods were coming in, so we feel very set on bringing those in.\n\nIn fact, you saw in-transit being up because we did write those orders earlier to make sure that we were flowing goods both for back-to-school and holiday on time. So I'd say that's going to outsized benefit Q4 as well as the ramp up of Sephora. So as Michelle said, the longer time they're open, the better we're seeing that performance. So as we now have all 600 doors open, we continue to see that benefit.\n\nSo I think you'll see a little bit better benefit in Q4 for those two reasons in terms of that. Some of the credit revenue, I think over time, our credit customer has stayed incredibly healthy. And so we're seeing despite sales down a really flat credit customer, we've proactively managed the risk of this portfolio. We've done this in the past.\n\nIn fact, Chuck, I've spent a lot of time studying back to the last recession. And we've managed through this with a pretty healthy portfolio because we manage the risk pretty proactively. So as we've seen things move, we've been able to make those moves as well. So I would expect that our credit revenue should stay relatively flat throughout the year.\n\nObviously, we'll continue to monitor that environment and the consumer, but at this point in time, we feel very good with that health of the credit customer.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Great, thanks. And then on the inventory front, the slide that you guys provide is helpful. On the 27% that you call out as core, how are you feeling about the currency of that balance right now, given some of the changing consumer preferences that we're seeing in apparel over the past few months?\n\nJill Timm -- Chief Financial Officer\n\nYeah. What I would say the two biggest components of that increase are women's, which is you remember last year, women's was in a huge transition. We call that the fact that they were lacking inventory. So we weren't able to really keep up with that trend that we're seeing from a women's perspective.\n\nIf I actually look at it versus '19, it's still down double digit. So although we're up relative to last year, it's actually down in that low double digits to 2019. The second big piece of that inventory increase is Active. You know, obviously Active, the core strategy.\n\nWe've made a big investment, especially as we move that Active to the front of the store. We've expanded the space that we've given Active. And quite honestly, Active is pretty seasonless. So when I look at markdown liability, it's not a huge fashion business.\n\nSo it definitely has a longer life cycle. So it doesn't give me as much pause in terms of getting through that excess inventory. So those two pieces are two-thirds of the increase, and then the rest of it is really through the balance of the store.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Great. Thanks a lot, Jill.\n\nOperator\n\nOur next question comes from Blake Anderson with Jefferies. Your line is open.\n\nBlake Anderson -- Jefferies -- Analyst\n\nHey, good morning. Wanted to ask a follow up on that previous inventory question you just talked about the categories. Are you talk -- are you anticipating a continued ramp in private label in the second half? Just curious how you're planning for private label versus national branded buys for the second half.\n\nJill Timm -- Chief Financial Officer\n\nYeah. I would say we've seen proprietary brands outperform our national brands for two quarters. We know the customer's really looking for value. So obviously we want to make sure that we're going to deliver on that and that is going to be through a lot of our proprietary brands.\n\nWe continue to see outperformance in brands like Jumping Beans, Sonoma, and Lauren Conrad. So those are the places that you'll see our store will continue to balance into. But that's not to forgo the fact that we are seeing great performance out of our new brands like Tommy Hilfiger, Calvin Klein. So it'll be a balance.\n\nBut obviously the merchants would move to where they saw the trend going. And so you will see that we'll have that proprietary brand, especially in that women's side of the business, obviously, is much more proprietary driven. So we can feed into the value-oriented customer.\n\nBlake Anderson -- Jefferies -- Analyst\n\nGot it. That's really helpful. And then I was wondering if you could provide just directionally at least maybe the different factors in gross margin between supply chain, promotions, and cost inflation. Didn't know if you can size those up maybe in Q2.\n\nAnd then how you think about those three different factors, how big each one is in the second half?\n\nJill Timm -- Chief Financial Officer\n\nYeah. I would say that rates and promotions were probably the biggest two pieces in Q2. Freight being a big portion and then obviously in July becoming much more promotional to ensure that we were delivering value. And those were targeted offers to really look at and address the seasonal inventory that we had to ensure that we could continue to minimize the markdown liability as we moved into Q3, which is the normal time that you would clear that out.\n\nAs we move into Q3 and Q4, freight will still stay a little elevated in Q3, although as I mentioned, we are seeing costs come down there, but it's a pretty dynamic environment and they are still higher than last year. In Q4, we start lapping freight, so it'll be less of a component of our headwind. We do expect promotions to remain heightened through the Q3 and especially into Q4. I think holiday is always outside of our promotional environment.\n\nAnd then the last piece is just the cost inflation. And we had mentioned to you that we expected cost inflation to start impacting us really Q3 and then into Q4. So I think Q3 will be pressured off of cost freight. And then as we move into Q4, I would say it's going to be more about cost and promotions.\n\nBlake Anderson -- Jefferies -- Analyst\n\nGot it. Really helpful breakdown. Thank you.\n\nOperator\n\nOur next question comes from Paul Lejuez with Citigroup. Your line is open.\n\nTracy Kogan -- Citi -- Analyst\n\nThanks. It's Tracy Kogan filling in for Paul. First, I was wondering if you guys could kind of compare the conversion you're seeing at Sephora with the conversion you've been seeing over the years from the Amazon Returns. Are you I think you expected to get a better conversion from those Sephora shoppers, but just wondering if that's turned out to be true? And then my second question is, I was wondering if you were changing your strategy.\n\nI think you'd said you were expecting to open 100 smaller format stores over the next couple of years. And just wondering if you're rethinking that. Thanks.\n\nMichelle Gass -- Chief Executive Officer\n\nSure. Thanks, Tracy. Michelle here. I can actually answer both of those.\n\nSo in terms of Sephora, I don't know if the right comparison is Amazon Returns. Since you brought that up, I'd say we continue to be pleased with that partnership. We're actually seeing conversion continue to do well with those customers and it's a great source of new customers for us. So that continues.\n\nIn our Sephora stores, what we do look at is how those support stores are doing relative to non-Sephora stores. And as I mentioned earlier, we are seeing really all the stores outperform the chain. Those first 200 are even higher. They're in that high single digit range and then the newer stores, the 400 are in that kind of mid-single digit range.\n\nAnd related, we are seeing new customers, we're seeing traffic and we are seeing increased conversion. So to your question, we're seeing better overall conversion with the traffic we have coming into those stores as they're buying beauty with Sephora and as they're adding other things to their basket. So really on on all levels. As we've said all along, Sephora is a game changer for us.\n\nIt's our No. 1 initiative and I think in the spirit of the partnership as we look forward, Jill was talking about the capital investment. This is a moment in time as it relates to the headwinds we're facing. The good news is we have a healthy balance sheet, we're financially strong, we can make those investments, and really continue to have an unwavering conviction around our strategy go forward.\n\nHence, why we're building out the 850 doors because yes, Sephora is a cornerstone to that, but it's also about the entire transformation and how we're elevating merchandizing and how we're moving things around the store and refreshing the store. So we are going forward kind of full tilt on that. And then as we announced today, we're working with Sephora in creating a concept that will then will add to the remainder of the stores about 300 the balance of fleet. So we'll get -- we'll have a Sephora presence across our entire store base and digital.\n\nAnd that is very powerful because we'll be able to say at any Kohl's you can come in and have a Sephora experience. So that is news we're sharing for the first time this morning and it's really exciting on our go-forward path.\n\nJill Timm -- Chief Financial Officer\n\nAnd then in terms of the small-store strategy, Tracy, we're still convicted on those small stores. We've done a lot of testing. We feel good with where they are. We're also being balanced in our approach.\n\nSo we're looking for those markets that make sense. We're also taking into consideration the current market conditions. I would say we are still planning to open 100 stores over the next several years, but it will be paced and I think more of a ramp up toward those latter years versus in the beginning part as we kind of learn more and how to merchandise them, putting a fulfillment store, which is going to look very different than any store that we've opened, much more locally relevant. So you're going to walk in and it's going to feel different than when you walk into a Kohl's store.\n\nSo really understanding how the customer reacts to those type of changes so that we can take those learnings and apply it when we start opening those more in mass.\n\nTracy Kogan -- Citi -- Analyst\n\nGreat. Thanks very much, guys.\n\nJill Timm -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nOur next question comes from Omar Saad with Evercore Partners. Your line is open.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThanks for taking my question. Most of them answered already. I was hoping you could give a little bit more color on the category performance. It sounds like home underperformed.\n\nI know it sounds like you're middle income consumer, that color on the income strategy is great, but maybe across categories, are you seeing some of those in  winning categories significantly underperform? Are there categories where you're seeing outperforming? And then I also wanted to ask, Michelle, maybe you could talk about as we enter this kind of elevated promotional environment, across the industry, do you think that down the road, do you think the industry and Kohl's can return to a lower promotional level that we've enjoyed over the last year or two? Or are we kind of back to that pre-COVID norm, lots of promotion, highly hyper competitive marketplace as we just think beyond the current [Inaudible]. Is there an opportunity for Kohl's in the industry to keep some of the margin discipline that you guys [Inaudible]?\n\nMichelle Gass -- Chief Executive Officer\n\nYep. Great. Thanks, Omar, for those two questions. I'll take those.\n\nFirst to give you a little bit more color on our categories. So starting you brought up home, so two categories that underperformed, home and children's. I mean those had significant outperformance, as you know, the last couple of years and we are seeing like in home sort of broad based challenges as it relates to that middle income customer, as you pointed out. That said, as we look to the back half while we're doing a lot of things to make sure that we've got sharp price points and newness, especially for the holiday time period.\n\nSo, yes, customers are going to have to be a bit more picky around where they are purchasing gifts and etc. So we need to show up both with value and with compelling product. And I will tell you on the home front that the team is bringing in a lot of new newness across the board in categories that we haven't played in that much like outdoor recreation. Just give you an example.\n\nI think similarly with kids, we're seeing -- where we're seeing some bright spots in the kids business today is in that younger kids and toddlers, Jumping Beans, we're seeing pressure in older kids. In some categories, I'd say, like denim. Maybe that will pick up as back-to-school continues on, but we're doing a lot of things again around that assortment. And then you take toys and it has been tough the first half of the year.\n\nBut as you know, the business in toys is really the fourth quarter and the team has been working with all of our partners to make sure we're showing up with not only great value, but a lot of newness. We have a dramatically expanded assortment with Lego. Starting in October, we're doing some proprietary partnership deals with them, which will be great, we believe will resonate with our customers. And then in terms of top selling toys on the on the toy side, two-thirds of our top items are going to be new.\n\nSo I feel like as we look forward, those categories which have had the biggest challenge in the front half, there's some good plans, but we are still going back to the guide. We're still being really prudent because, while we're going to put our best foot forward, we also know that there are headwinds that are kind of bigger than us. Other color, I'd say on the footwear side, we're seeing outperformance in casual and, call it, athleisure, brands like Vans. On the athletic, I think two things.\n\nOne is we're up against, we know, some very big numbers by our brand partners. We still unequivocally believe in the Active category. This is the point in time it's normalizing. But all our data is showing that the consumer is going to want to continue to dress in that sort of active and casual athleisure outdoor.\n\nSo we're deeply committed to that. But as it relates to active footwear, we're up against that. And secondly, we've continued to have pretty significant supply chain disruptions on that. So, we're not in the right stock that we need to be.\n\nIt's probably going to take us six months to fully normalize that. Like I said, the team with our brand partners, they're all over it. And then as it relates to the apparel side of things, as I mentioned on active, all of footwear has been tougher. Our active apparel, including athleisure outdoor that's outperforming the company.\n\nOn women's, we talked about juniors being tough. The core women's business actually had a quite solid performance and substantially outperformed the company. Areas where we've been investing like dresses, elevated casual, so brands like Simply Vera, Lauren Conrad, Nine West, as they go back to work or go out that's really resonating and even categories like plus size, where we've made investments. And then lastly, men's.\n\nMen's has been a steady, solid performer. We're continuing to see that on both sides. The private brands like Sonoma, as well as the new brands we're bringing in like a Hurley, Eddie Bauer, and of course, Calvin Klein and Tommy Hilfiger. So, really important for us to maintain that balance, show up with value overall and be really relevant for the customer.\n\nSo, that was your first question. On the second question on the promotional environment, we're seeing a dynamic we just haven't seen before. I mean, certainly that consumer confidence, the 40-year high inflation, I mean, this is a very dynamic time. And I think all retailers are having to, like I said, show up in a relevant way and it -- the business is cut off very quickly.\n\nSo, we're working through inventory, as are many others. As Jill alluded to and talked about, our inventory position, our core categories, that's not our entire issue. We've got some one time, which are good investments, like beauty. So when you look at the core, it perhaps doesn't look as dramatic as when you look at the total.\n\nBut that said, we've got to take care of it. So we're clearing out the goods, we're cutting out receipts, and we are being more promotional. I do think things will normalize. None of us have a crystal ball.\n\nWe don't know when that happens, but I'd say for Kohl's, we are committed in our longer term journey of having a healthy balance of promotions, but importantly price clarity, investing more in price and overall elevating our portfolio. Having that balance of private brands, but also national brands that the customer is paying a premium price. The apparel brands I just spoke to and incredibly us. So I'll sum it up to say and we feel like we're putting our best foot forward in the back half.\n\nWe're being prudent with our guide. We have great confidence in our long-term strategy. We're seeing that play out as we open these four doors and in the moment, we'll be agile and responsive to what the customer needs.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThanks for the color. All the best.\n\nMichelle Gass -- Chief Executive Officer\n\nThank you.\n\nJill Timm -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Priya Ohri-Gupta with Barclays. Your line is open.\n\nPriya Ohri-Gupta -- Barclays -- Analyst\n\nGreat. Thank you so much for squeezing me in. I'm just wondering if we could speak a little bit about your cash balance. It looks like it's fairly low and we haven't seen a level this low in quite some time.\n\nSo if you could, first, just speak to sort of where we should expect you to run your cash balance over the next two to four quarters. And then secondly, given sort of the elevated cash used in third quarter as you build inventory, what are some of the actions that you anticipate to help shore up the cash needs that you have in the short term ahead of any potential real estate monetization? Thank you.\n\nJill Timm -- Chief Financial Officer\n\nSure. Thanks, Priya. I would say so, obviously, our cash balance was weighted on a couple of things. One is, as we talked about, the sales drop happened quickly in June.\n\nWe're making receipt cuts, but obviously we couldn't react as fast enough as the sales had been dropping. So we will continue to tighten inventory as you see that happening in the back half of the year, specifically as we end the year, we said we'd only be up high teens relative to where we're sitting today. I think second, we obviously always prioritize investment in the company and that didn't change this year in terms of the Sephora shops. We didn't want to cut back on what we see as our long-term growth strategy with Sephora.\n\nThat team is working. We're attracting new customers. Those stores are outperforming. So a lot of the cutbacks, where we may have pulled back in the past, we wanted to lean into given it was such a growth factor for us as we move forward.\n\nI think you'll see us continue to manage down expenses tightly. We're going to continue to be aggressive from an inventory perspective. But we will expect, as we mentioned, Q3 to be a little tighter because, as you mentioned, it's a natural inventory build. And we're not going to want to cut that inventory.\n\nYou're going to want that freshness as we move into the all-important holiday season. So I would expect you're going to see our cash balances lower than you had normally seen them. But I feel very confident with the actions we're taking, we're going to build ourselves back to a normal cash balance, a normal operating cash flow as we move into 2023.\n\nPriya Ohri-Gupta -- Barclays -- Analyst\n\nGreat. Thank you.\n\nJill Timm -- Chief Financial Officer\n\nThanks, everyone.\n\nMichelle Gass -- Chief Executive Officer\n\nGreat. Thank you. Thanks, everyone, for listening in the call this morning. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Rupe -- Vice President, Investor Relations\n\nMichelle Gass -- Chief Executive Officer\n\nJill Timm -- Chief Financial Officer\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nGabby Carbone -- Deutsche Bank -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nBlake Anderson -- Jefferies -- Analyst\n\nTracy Kogan -- Citi -- Analyst\n\nOmar Saad -- Evercore ISI -- Analyst\n\nPriya Ohri-Gupta -- Barclays -- Analyst\n\nMore KSS analysis\n\nAll earnings call transcripts"
}