{
  "companyName": "Bristol Myers Squibb",
  "companyTicker": "BMY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/bristol-myers-squibb-bmy-q3-2022-earnings-call-tra/",
  "content": "Bristol Myers Squibb (BMY -0.21%)\nQ3 2022 Earnings Call\nOct 26, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the Bristol Myers Squibb third quarter results conference call. [Operator instructions] At this time, I would like to turn the conference over to Mr. Tim Power, vice president, investor relations. Please go ahead, sir.\n\nTim Power -- Vice President, Investor Relations\n\nThanks, Dennis. And good morning, everyone. Thanks for joining us this morning for our third quarter 2022 earnings call. Joining me this morning with prepared remarks are Giovanni Caforio, our board chair and chief executive officer; and David Elkins, our chief financial officer.\n\nAlso participating in today's call are Chris Boerner, our chief commercialization officer; and Samit Hirawat, our chief medical officer and head of global drug development. As you'll know, we've posted slides to bms.com that you can follow along with for Giovanni and David's remarks. But before we get going, I'll read our forward-looking statement. During this call, we'll make statements about the company's future plans and prospects that constitute forward-looking statements.\n\nActual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the company's SEC filings. These forward-looking statements represent our estimates as of today and should not be relied upon as representing our estimates as of any future date. We specifically disclaim any obligation to update forward-looking statements, even if our estimates change. We'll also focus our comments on our non-GAAP financial measures, which are adjusted to exclude certain specified items.\n\nReconciliations of certain non-GAAP financial measures to the most comparable GAAP measures are available on bms.com. With that, I'll hand it over to Giovanni.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThank you, Tim. And good morning, everyone. Starting on Slide 4. I'm pleased to share that we delivered another good quarter, and we continue to advance our strategy to position Bristol Myers Squibb for sustainable growth.\n\nIn the third quarter, our in-line and new product portfolio grew by 13%, adjusting for foreign exchange. And we delivered non-GAAP EPS growth of 3%, while also making substantial progress advancing our promising pipeline. Highlights for the quarter included the approval of Sotyktu, our first-in-class TYK2 inhibitor for psoriasis, and closing of our Turning Point acquisition, which brings another product to our portfolio with repotrectinib expected to launch in the second half of next year. Overall, I am very pleased that we have significantly advanced the renewal of our portfolio.\n\nWe have now launched nine new medicines, with three first-in-class products approved this year alone. Let me take a minute to discuss our new products on Slide 5. Our strategy is to accelerate a diversified portfolio of innovative medicines to market, to renew our business, and grow the company during the period of Revlimid exclusivity loss and beyond. Supporting this strategy, we delivered three key new products this year: Opdualag, Camzyos, and Sotyktu.\n\nEach is a first-in-class asset, and these products have the potential to contribute meaningfully to our growth. Opdualag marks the second approved I-O combination that we delivered. Its strong launch continued during the quarter, furthering our leadership in delivering innovative cancer treatments to patients well into the next decade. We are also encouraged with the progress we have made toward building our foundation for Camzyos as a specialty cardiovascular medicine.\n\nWe are seeing increasing numbers of patients initiating therapy, and their feedback has been very positive. David will provide more details on the launch in a moment. Sotyktu has been approved with the label that reflects its profile and is an oral of choice medicine for moderate to severe plaque psoriasis. We are very encouraged by the early days of this launch and see significant benefit to these patients with this important new option.\n\nCombined with our other launch products, these approvals represent a significant milestone in the renewal of our portfolio, allowing multiple avenues for growth in the second half of the decade and beyond. Turning to our scorecard on Slide 6. During the quarter, we made great progress on our pipeline milestones. Abecma is now the first BCMA CAR-T to have demonstrated superiority to standard regimens in relapsed and refractory multiple myeloma based on the positive top-line results of KarMMa-3.\n\nWe also presented exciting data for milvexian, which has exhibited an approximate 30% relative risk reduction in recurrent symptomatic ischemic strokes on top of dual antiplatelet therapy. It has also shown a safety profile that is differentiated to existing anticoagulants. We believe this asset has great potential as a next generation antithrombotic treatment and we look forward to initiating phase 3 trials soon. Samit can provide you with the scientific details during our Q&A.\n\nTurning to Slide 7, you can see several important pipeline catalysts ahead. These include key approvals, as well as important registrational data readouts, including the COMMANDS study for Reblozyl. As you will recall, we've said that our early pipeline would generate multiple proof of concept datasets over time. Importantly, we are expecting proof of concept data for some exciting assets from our early pipeline in the near term.\n\nThese data could support transitions of early stage assets over to full development, thereby strengthening our mid- to late-stage pipeline. Some examples include our BCMA T-cell engager for multiple myeloma. We believe this could be a differentiated asset, and we expect to present the data at ASH in December. Our second-generation LPA1 agent for pulmonary fibrosis.\n\nThe unmet need in this disease is very high. And should phase 2 data be supported, this asset could move into phase 3 trials next year. Our androgen receptor degrader is generating some early promising data, and we hope to transition the asset to full development next year. This highlights the breadth of our protein homeostasis platform beyond CELMoDs, including in solid tumors.\n\nThese examples demonstrate the power of our R&D engine, with a new wave of innovative and differentiated medicines emerging, which have the potential to treat patients with high unmet medical needs. We look forward to updating you on our portfolio of mid-stage assets going forward. With this in mind, let me move to Slide 8 to give you a perspective on how we are thinking about our business moving forward. With continued strong performance of our in-line business and our nine launches now in full commercial execution, our priorities have not changed: delivering the full commercial value of the nine launched products, expanding the opportunity for these assets through new indications, and advancing our mid-stage pipeline.\n\nAdditionally, we will continue to leverage our financial strength and flexibility to prioritize business development opportunities. As we deliver on renewing our portfolio and transforming our company with a younger and more diversified business, I am confident in the future of Bristol Myers Squibb. We now have critical mass across all four of our therapeutic areas. Each has foundational in-line brands, exciting new products, and a broadening mid- to late-stage pipeline.\n\nThis is important because we believe that this more diversified business of younger products, supported by constant innovation and focus in therapeutic areas, where we have real expertise, best position us to navigate the changing U.S. environment. Before I turn it over to David, I want to thank our employees for their relentless focus on delivering for the patients we serve. I am confident we will continue to deliver for patients and our shareholders.\n\nI will now turn it over to David to walk you through the financials. David?\n\nDavid Elkins -- Chief Financial Officer\n\nThank you, Giovanni, and thanks again for joining our third quarter earnings call. Let's turn to Slide 10 to discuss our top-line performance. Unless otherwise stated, I will discuss sales performance growth rates on an underlying basis, which excludes the impacts of foreign exchange. Revenues in the third quarter were approximately $11.2 billion, consistent with prior year.\n\nOur diversified in-line and new product portfolio grew strongly, up 13%, offsetting the impact of our recent LOEs. Now, let me touch on a performance of our new product portfolio on Slide 11. Global revenues were over $550 million, up 66% versus prior year, driven by continued demand. Growth over prior quarter was also strong, up 16%.\n\nWe continue to be very pleased that the performance of our new product portfolio and its future potential. With three new launch brands this year and over $2 billion of annualized revenue so far, our portfolio has been largely derisk, increasing our confidence in the potential to generate greater than $25 billion of nonrisk adjusted revenues in 2029. Turning to Slide 12 to discuss our performance of our solid tumor portfolio, Opdivo sales continue to grow globally, up 13%, driven by demand for newly launched import indications. In the U.S., sales were strong.\n\nWe continue to grow double digits, up 17% versus prior year, driven by demand of our newer metastatic and adjuvant indications, partially offset by declining second-line eligibility, as well as some use from Opdualag and first-line melanoma. Internationally, revenues grew 8%, primarily due to growth from new indications, particularly first-line lung and GI cancers. Looking forward, we continue to expect growth of Opdivo from our new and expanding indications in both early and late-stage cancers. Now let's move to Opdualag.\n\nWe could not be more pleased at the launch of Opdualag. The launch is off to a great start, being the first LAG-3 inhibitor to launch fixed-dose combination with our PD-1 inhibitor, Opdivo. Sales in the quarter were $84 million, growing 45% sequentially. And sales of Opdualag are already annualizing to approximately $350 million.\n\nAt this point in the launch, our share in first-line melanoma is in the mid to high teens. And as expected, we are seeing use of Opdualag coming from PD-1 monotherapy and Opdivo-Yervoy combinations. Moving on to our expanded cardiovascular portfolio on Slide 13, our leading OAC, Eliquis, had another strong quarter, up 16% year over year. In the U.S., sales increased 31% versus prior year, driven primarily by demand and favorable gross to net adjustments.\n\nAs expected, sequential performance was driven by the typical dynamics we experienced each year, from higher gross-to-net payments as patients enter the donut hole. Internationally, Eliquis has become a leading OAC across numerous countries. Given the success of the product, the pricing pressures, as expected, impede growth. Pricing measures, in addition to at-risk generic entry in the U.K.\n\nand Netherlands affected growth in the quarter. Now, turning to Camzyos, a first-in-class medicine to treat underlying disease of obstructive hypertrophic cardiomyopathy, we are continue to be pleased with the progress we are making to bring this life-changing medicine to patients. To date, we have over 2,000 REMS certified healthcare professionals, which is a good indicator for intent to treat. And we've received extremely positive feedback from physicians and patients.\n\nWe are also making progress at large HCM centers to ensure they are operationalized to make Camzyos available to patients. As of the end of Q3, there are over 1,100 patients enrolled in our hub and growing each week. As expected, new patients are generally initiating treatment as part of their regularly scheduled echocardiograms. Based on the time to transition patients to commercially dispense medicine, we expect acceleration of revenue beginning in Q4 and as we move into 2023.\n\nChris can provide more details on the launch during Q&A, but we are pleased with the progress we've made. Turning to Slide 14 to discuss hematology performance. Starting with Revlimid, sales in the quarter were approximately $2.4 billion. Sales were primarily impacted by generic entry, particularly in international markets.\n\nIn the U.S., we saw slower-than-anticipated entry by second-wave generics since September. We expect to see generic erosion progressively increasing in the coming weeks. And at this point, we expect Revlimid sales to be at the upper end of our $9 billion to $9.5 billion range for the year. Pomalyst global revenues grew 8% versus prior year, primarily driven by demand for triplet-based regimens in earlier lines, extending the duration of treatment for patients.\n\nMoving to Reblozyl, which had another strong quarter, sales were $190 million in the quarter, up 22% versus prior year. In the U.S., revenue growth was impacted by a one-time change in distribution model in the prior year. Excluding the impact from last year, sales would have been approximately 25% versus prior year. This is being driven by continued progress in increasing patient adherence and extending treatment duration.\n\nOutside of the U.S., Reblozyl continues to grow, driven by demand in both MDS and beta thalassemia-associated anemia. To date, we are now reimbursed in nine countries and will continue to secure reimbursement in additional countries in the future. Now, turning to our cell therapy assets, Abecma and Breyanzi. Abecma generated strong revenues in the quarter of $107 million.\n\nThis represents growth of 59% versus prior year, or 22% sequentially. In the U.S., sales growth was driven by strong demand, offset primarily by timing of patient infusions, which we expect to materialize in Q4. Outside of the U.S. sales increase due to a one-time step-up of slots in select markets, which is expected to be sustained at this level for this foreseeable future.\n\nWe are very pleased with the manufacturing progress we've made to ensure Abecma gets to more patients while we continue to work on further expanding our capacity, as we prepare to move Abecma into earlier lines based upon the positive readout of KarMMa-3. Finally, on Breyanzi, sales in the quarter were $44 million, up 50% versus prior year. Demand remains strong, and we continue to work hard expanding capacity in next year to benefit more patients with large B-cell lymphoma. As we communicated in the past, we expect Q4 sales to be largely similar to Q3 sales.\n\nNow, turning to our expanded immunology portfolio on Slide 15, starting with Zeposia. Global sales in the quarter were $69 million, up 83% versus prior year, largely due to the expansion of Zeposia in ulcerative colitis. Sequentially, in the U.S., the sales were impacted by last quarter's favorable close-to-net and wholesale buying patterns of approximately $20 million. We continue to see demand growth of 12% over last quarter.\n\nOur strategy remains focused on further expanding volume so we can continue to improve access in 2023. And we've made progress on improving the quality of access as well. Internationally, we are continuing to make strides at securing reimbursement in additional markets to get Zeposia to more patients living with MS and ulcerative colitis. Now, turning to our most recent launch, Sotyktu, our first-in-class selective TYK2 inhibitor for patients with moderate to severe plaque psoriasis.\n\nWe're extremely pleased with the U.S. label based upon the strong data. While early in the launch, we are very encouraged by the feedback we are getting from physicians. Our focus is to ensure many patients as possible get Sotyktu, establishing this medicine as the oral choice, allowing us to secure a broader formulary position in 2024.\n\nInternationally, we are also pleased to have received Japanese approval in September, and we look forward to European approval next year. Let's now discuss our third group P&L on Slide 16. I've already discussed revenues, so I'll now focus on other key non-GAAP items in the quarter. Gross margins decreased primarily due to product mix, partially offset by foreign exchange and related hedging settlements.\n\nExcluding acquired in-process R&D, operating expenses were broadly in line with prior year and affected by the timing of spend. Acquired in-process R&D charges in the quarter were $30 million related to an upfront payment to GentiBio. This is offset by $73 million of licensing income, benefiting OI&E in the quarter. The third quarter effective tax rate was 16.9%, driven by earnings mix.\n\nAnd overall, we delivered another quarter of earnings growth with non-GAAP earnings per share growing 3% versus prior year. Moving to the balance sheet and capital allocation on Slide 17, cash flow from operations in the quarter were $3.7 billion. The company's balance sheet remains strong, with approximately $9 billion in cash and marketable securities on hand as of September 30th, which also accounts for the $3.3 billion we paid for Turning Point Therapeutics. Our capital allocation priorities remain unchanged.\n\nBusiness development continues to be a top priority, and we continue to execute on this strategy with the closing of Turning Point Therapeutics acquisition as a recent example. We remain committed to continued debt reduction. In the quarter, we repaid $2.8 billion of debt. And we remain committed to returning capital to shareholders.\n\nWe executed a $5 billion ASR earlier this year and have $9.5 billion remaining in our share authorization. And we will continue to be opportunistic on share repurchases. Now, turning to our 2022 non-GAAP guidance on Slide 18. We are maintaining our full year outlook.\n\nWe continue to expect revenues to be approximately $46 billion with our in-line and new product portfolio growing in the low double-digit range. Our recent LOE guidance and Revlimid guidance remain unchanged. However, as mentioned earlier, we expect Revlimid sales to be in the upper end of the $9 billion to $9.5 billion range. We continue to expect gross margin to be approximately 79%.\n\nAnd our operating expenses, excluding acquired in-process R&D, remain unchanged, primarily driven by favorability in FX, as well as cost discipline, partially offset by the inclusion of expenses from the Turning Point acquisition. Putting everything I just mentioned together, we are reaffirming our full year non-GAAP EPS guidance, reflecting the strength of our underlying business and absorbing the approximately $0.06 impact from the Turning Point acquisition. Before we move over to the Q&A session, I want to express my gratitude to our employees for the performance in the quarter and their continued commitment to our patients. I'll now turn the call back over to Giovanni and Tim for our Q&A session.\n\nTim Power -- Vice President, Investor Relations\n\nGreat. Thanks very much, David. Dennis, can we go to the first question, please?\n\nOperator\n\nThank you. The first question comes from the line of Chris Schott with JPMorgan. Please go ahead.\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks so much. Just two for me. I guess first, on Sotyktu, given the favorable label, can you talk about the target patient population you're going to be going after here? So, specifically, are you going to be looking mostly at Otezla failures initially? Or are you going to focus more, I guess, on first-line patients starting on systemic therapy? I know you've talked a little bit also here about reimbursement dynamics.\n\nBut is there anything you could do to accelerate this process prior to this kind of 2024 timeline that you've been kind of alluding to? And then, the second quick one was just on Eliquis. I think we've had a few quarters now where we're seeing kind of a positive price adjustment. I just was wondering if you could elaborate a little bit on the dynamics there. And is this something that's more onetime in nature and will reverse? Or is this kind of just a new base we should think about for the business when you think about kind of volume growth going forward? Thank you.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThank you, Chris. Chris Boerner will start, and then David will give you some comments on Eliquis.\n\nChris Boerner -- Chief Commercialization Officer\n\nSure. So, let's start with Sotyktu. Thanks for the question, Chris. First, I think the launch of Sotyktu is off to a very good start.\n\nWe're extremely happy with what we're hearing back from physicians. We've seen a very nice week-over-week acceleration of this product. The majority of the use right now that we're getting is coming from the community setting. That's really important because, Chris, as you may know, about 80% of the volume in the setting is going to be in the community.\n\nAnd so, to see that level of uptake there early on is nice to see. Also, remember that the awareness of this product in the academic community going into the launch was very high. So, the fact that we've got good uptake early in the days of this launch coming from the community is a good early start. In terms of the patient population that we're looking at, we're actually going to be focused on the dynamic portion of this population, which includes both initial starts in the first-line setting, as well as any of those failures who were coming off of Otezla.\n\nWe're also seeing some early switching, though, that's, again, very early days. But I would say that the primary focus of this launch continues to be squarely on Otezla. And that would be patients who would have gone on to Otezla in the absence of TYK2, as well as for those patients who have either failed that product or physicians decide to switch, given the efficacy profile that we're seeing with Sotyktu. In terms of what we're seeing on the access side, our focus continues to be threefold on access: first, removing the neutral market blocks that face all new products in this space; second, taking advantage of where we have open access today.\n\nAnd remember, we estimate that about 10% of patients have open access at the initial stages of this launch. And then, obviously, it's all about building volume during the early phases of the launch and then leveraging that volume. We're going to do everything we can to accelerate getting into a better access position in 2023. But we certainly feel like we're in a very good position and on track to be in a good position in 2024.\n\nDavid?\n\nDavid Elkins -- Chief Financial Officer\n\nYes. And on the Eliquis rebates, you remember, this is a very large product, over $10 billion in revenue. And based upon the product mix, we forecast what the anticipated discounts would be based upon the product mix across all the payers. And each quarter, we adjust that.\n\nSome quarters are up, and some quarters are down. But the last two quarters, we had some releases, and that's what really explains it. But nothing changes for the full year, really.\n\nTim Power -- Vice President, Investor Relations\n\nThanks, David. Dennis, can we go to the next question, please?\n\nOperator\n\nYes. Your next question is from the line of Seamus Fernandez with Guggenheim Securities. Please go ahead.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nOh, great. Thanks, guys. So, a couple quick questions. So, the first one is just on the competitive landscape that's evolving in ulcerative colitis.\n\nCan you guys just give us a sense of how the launch of Zeposia is tracking in MS versus UC, and, you know, what percentage of patients are you see specifically at this point as we look at this sort of separation of scripts, and how you're thinking about the competitive landscape evolving with the increasing interest from physicians in IL-23, perhaps, even the combination of IL-23s with biosimilar, Humira, as a potential new breakthrough in the category? Just wondering what you guys were thinking coming out of the most recent meeting as well. And then just the last -- second question is on the Camzyos launch. Just trying to get a sense of when you guys anticipate seeing a meaningful inflection in prescriptions or revenue. Is this something where we should anticipate seeing a meaningful uptick in the fourth quarter? Or is it, you know, potentially with the new indication in the middle of next year? Thanks so much.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThanks so much. So, Chris and Samit will address your question on UC, and then Chris will comment on Camzyos.\n\nChris Boerner -- Chief Commercialization Officer\n\nSure. Thanks for the question, Seamus. With respect to Zeposia, I would say Zeposia continues to perform well. We saw nice double-digit demand growth in the quarter.\n\nThe majority of that growth is continuing to come from ulcerative colitis. So, I would say that the majority of patients if you look at where the growth of this asset is going to occur through the end of this year. And certainly, as we get into next year, the majority of that's going to be coming from UC. The market share that we have for Zeposia in MS continues to remain stable.\n\nAbove 50% of the share in S1Ps is coming to Zeposia. We feel very good about the position that we're in there. Obviously, as we've talked about previously, the oral market in MS is under some pressure from IV. But in spite of that, we're maintaining a consistent share in the MS population.\n\nThe big focus that we have continues to be on UC. We believe that's where we have the strongest position, as well as the biggest opportunities for growth. And I would say that there, I think that from a competitive standpoint, so far, the position for Zeposia continues to be strong. Obviously, it is a very competitive marketplace.\n\nBut for example, with the introduction of RINVOQ. The growth of RINVOQ has not largely come at the expense of Zeposia. In fact, we've maintained our position in that market in spite of the introduction of that new asset. Clearly, there are a number of dynamics that are going to continue to play out, but we feel pretty good about our competitive position as the first S1P in this market for UC.\n\nThe only other thing that I would note is that, obviously, as we've said, the big focus we have with Zeposia is to build volume and then convert that volume into a stronger access position. We did get a very important early win on the access side in October with CVS Zinc, now covering Zeposia with zero step edits. That's important because if you add that with the other plans that -- smaller plans that have covered Zeposia, we now have about 30 million covered lives. And we're well on track to be in a good position with the other PBMs as we go into 2023.\n\nAnd maybe I'll let Samit address the other part of that question. And then, I'll pick up on Camzyos.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nYeah, very briefly, Seamus. The way we think about it is that unmet medical need still remains very high in patients with ulcerative colitis. And certainly, new medicines are needed. As you know, we have our own clinical development ongoing with Sotyktu in ulcerative colitis.\n\nTwo of the trials will read out from a proof of concept perspective in 2023 for CD and UC. UC would be in the second half of the year. And we'll continue to explore those trials and lead to future development, as well as if combinations are going to be the possibilities of the future with current standard of care or novel therapies. So, more to come.\n\nBut we need to first see the data.\n\nChris Boerner -- Chief Commercialization Officer\n\nAnd then, picking back up on your question on Camzyos. I would just say, at the outset, we are very pleased with the launch of Camzyos. We're seeing a really nice acceleration for this product in the second half. A few elements of color around that.\n\nFirst, we've talked about the importance of REMS-certified physicians. We now have over 2,000 REMS-certified physicians as of the end of the second quarter. We're seeing a nice healthy increase in that week over week. David referenced that, as of the end of the third quarter, we had 1,100 patients who had been prescribed Camzyos.\n\nThat's also seeing nice week-over-week increases. I think we had referenced on the previous quarterly call that a big focus area has been helping some of the larger institutions build the infrastructure to support the use of this product. We've seen very significant improvement on that in recent weeks. And the pace of new starts that we're seeing is consistent with those accounts in particular getting organized.\n\nNearly all of the patients that we are seeing are going through our Camzyos patient hub. And that's really important because that will facilitate getting patients on to therapy and staying on therapy. And I think it's notable that of the patients who have had multiple dispenses thus far, none of them have dropped out therapy, which is a nice indicator of how well that hub is working. I think the question with respect to how fast we're going to see an acceleration of revenue kind of speaks to this question of access.\n\nAccess, as anticipated, has not been a barrier with this launch. We now have about 50% of planned coverings of Camzyos. All of the patients who are covering Camzyos are being PA'd to the label, which is a good indicator of a strong position. And you will have seen on the slides that, as of the end of the third quarter, about 1/3 of those 1,100 patients had converted to commercial drug.\n\nIn October alone, we've seen an almost doubling of the number of commercial dispense that we saw in Q3. So, we feel very good about the pace of this launch and what we're seeing in the second half and happy, obviously, to provide additional color as this launch continues and we get into the fourth quarter call.\n\nTim Power -- Vice President, Investor Relations\n\nThanks very much, Chris. Dennis, can we go to the next question, please?\n\nOperator\n\nYour next question is from the line of Andrew Baum with Citi. Please go ahead.\n\nAndrew Baum -- Citi -- Analyst\n\nThank you. You addressed the Revlimid events in your prepared comments. I'm just curious, same topic on Onureg. Given the attractiveness of the drug as a neural alternative, I'm surprised it's not doing better.\n\nPerhaps, you could outline what are the barriers here and some of the key catalysts it has. And then second, in relation to milvexian, the 200-milligram dose, the efficacy was inferior to placebo. There was some discussion about whether COVID could have impacted the rate of some thromboembolic events during the initiation of that particular dosage. I wonder whether you had trial to characterize that particular dosing arm of the trial? Thank you.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThanks, Andrew. Chris, why don't you start on Onureg? And then Samit will answer the question on milvexian.\n\nChris Boerner -- Chief Commercialization Officer\n\nSure. The question on Onureg around some of the barriers that we're seeing. I would say that the biggest challenge with Onureg continues to be the proportion of patients who are getting intensive chemotherapy. As you know, those dynamics in the first-line setting here are continuing to evolve.\n\nWe've seen a decrease in the U.S., mainly of the percentage of patients who go on to get intensive chemotherapy. And remember, the label is for patients who receive intensive chemotherapy and get a complete response. Having said that, our focus with Onureg continues to be on ensuring that we maximize the opportunity for maintenance. The maintenance share right now is about 50% to 60%.\n\nWe think there's opportunity to continue over time to expand that maintenance that's market. And for those patients who get intensive chemotherapy, get a complete response, go on to maintenance. The choice needs to be Onureg. And so, that's been the significant focus we have for the U.S.\n\nteam. And then, we continue to see very early stages of launch outside of the U.S. in markets like Germany and France, and the early uptake there has been good.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nAnd, Andrew, thank you for the question on milvexian. Yes, certainly, we looked at the hypotheses around COVID and the 200 milligrams dose. It doesn't seem to be driven through there, but we are continuing to explore why the group stood out. But the point to be taken home, I think, remains that we have our eight full dose range that is available to us for picking the right dose for the phase 3 trials.\n\nAnd we are in that place where we are now looking forward to the initiation of the program in the next few months on the phase 3 side, with the three indications that we've spoken about before in AF, ACS, and SSP.\n\nTim Power -- Vice President, Investor Relations\n\nDennis, can we go to the next question, please?\n\nOperator\n\nThe next question is from the line of Chris Shibutani with Goldman Sachs. Please go ahead.\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nThank you very much. If I could ask a question about how you see dynamics in the multiple myeloma setting, particularly the interplay between CAR-T therapies and the anticipated arrival of bispecifics as an option. Could you, perhaps, talk about where you see the dynamics playing out in 2023? Secondly, on Opdualag, there has been a good revenue performance there. Can you remind us what your strategy is for broadening those label opportunities and when we might be able to see data to help build confidence in continued growth for that asset? Thank you.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThank you, Chris. Samit?\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nSure. Thank you, Chris, for the question. On multiple myeloma, I think the starting point is that no matter how many therapies have been developed and become available, the disease remains uncured at this time. So, there is an opportunity to continue to bring more transformative, more effective, and safe therapies to these patients.\n\nAnd in that regard, certainly, cell therapies have really brought in some transformation in terms of getting patients into a complete remission. And hopefully, those are very long lasting. The bispecific, as one has been approved today in the U.S. -- or yesterday in the U.S.\n\nand, certainly, in the EU as well, is a new armamentarium. Certainly brings a good efficacy. However, as you saw from the data that have been presented, there are opportunities to continue to improve on the safety profile. High rates of CRS are going to be problematic, as you also saw some of the statements made by top leaders.\n\nAnd that's where differentiation will need to continue to occur. We'll be presenting our own data at ASH this year for our T-cell engager, and you'll see that. I think the other way to look at it is the holistic development in multiple myeloma, where we are also developing now-initiated phase 3 trials with CELMoDs. And the future probably will look like a combination approaches of T-cell engagers or cell therapies and how CELMoDs can be added to those.\n\nSo, we have a holistic approach of treating multiple myeloma and trying to get more and more patients into very long, durable, complete responses, and at some point, someday, getting to a cure. Do you want to add anything, Chris?\n\nChris Boerner -- Chief Commercialization Officer\n\nSure. Maybe I'll just add that while bispecifics and CAR-T both share, in this case, the target of BCMA, I think it's important to keep in mind they offer very different characteristics for patients, including the availability of the products, the duration of treatment, adverse event profile. And I think, ultimately, as we've said repeatedly, the utility of BCMA CAR-T and bispecifics is going to be unique to each patient and the setting that we're in. And we anticipate that these various patient factors are going to become increasingly important in determining how patients are treated.\n\nAnd then, maybe before I turn it over to Samit about the expansion of Opdualag, let me just say, at the outset, we continue to be very impressed with the strong performance of Opdualag out of the gate. Our focus has been and will continue to be to target that PD-1 monotherapy population. I think, as David alluded to, we're seeing use of conversion of both Opdivo-Yervoy patients, as well as PD-1 monotherapy to drive that use as of today. But as we think about the growth of this asset going forward, remember where we sit today, PD-1 monotherapy is still about 20% of first-line metastatic melanoma.\n\nAnd that's the target for our commercial launch. And so, we see continued opportunity to grow this asset through the end of this year and well into next year.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nAnd I think, in addition to what Chris has just spoken about, there are obviously many other trials that are ongoing. In the phase 3 setting, we've got the melanoma study in the adjuvant setting, as well as the CRC trial in the second-line-plus setting in MSS colorectal cancer, and then looking into the continued enrollment in the phase 3 portion -- phase 2 portion of nonsmall cell lung cancer randomized portion, as well as the two studies ongoing in HCC and multiple other signal-seeking studies ongoing with our collaboration with investigators. So, obviously as the data emerges, we can take that program forward to multiple other indications.\n\nTim Power -- Vice President, Investor Relations\n\nThanks so much. Dennis, can we go to the next question, please?\n\nOperator\n\nYes, the next question is from the line of Tim Anderson with Wolfe Research. Please go ahead.\n\nTim Anderson -- Wolfe Research -- Analyst\n\nThank you. Going back to milvexian, I'm just trying to understand why we haven't seen phase 3 trials start yet. You've had the data for a number of months. In something like atrial fibrillation, you didn't run phase 2, so there's no data specifically in that setting to analyze.\n\nYou're in a race with other companies. So, why haven't we seen anything posted yet? It's almost -- you know, makes me wonder, is FDA, you know, preventing you from advancing yet? And are their concerns or something like that? And then second question is just a general pipeline one for Samit, you know, it's been a pretty big positive news flow in 2022. I think there's the view that you go into more of a catalyst-lite period in 2023. So, Samit, what are the next two or three most important clinical catalysts coming up, let's say, over the next 12 months in your view?\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThank you, Tim. Let me ask Samit to answer your question, both on milvexian and the pipeline. I just want to say, with respect to the pipeline, Tim, as I mentioned in my remarks, I think what's really exciting is that, actually, the mid-stage pipeline is beginning to accelerate, and the number of catalysts there are really important. And that's why we highlighted that in my remarks, and we look forward to continuing to update you there.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nTim, thank you for the question. I'm glad that you are as excited as us in terms of the initiation of the phase 3 program. You know, once the trial reads out, we have to get in touch with the health authorities, agree on the dose, agree on the overall trial design, and then we can initiate the plans by submitting the protocols to IRBs, to ethics committees, to the institutions they have to go through before we can actually enroll patients. So, all of that is being worked through.\n\nWe have our partner, Janssen, and us working very diligently, very closely to get the program started in the next few months. You'll get to hear the initiation of the phase 3 program for milvexian. In terms of the pipeline and what's the new catalyst in the next year or two, I've learned about it before, and I think our pipeline is fortunately very full. And each of the therapeutic areas has multiple opportunities beyond milvexian.\n\nAnd for example, in cardiovascular space that we've spoken about, I think we are looking forward to some of the readouts in the immunology space as we think about cendakimab over the next couple of years for the ongoing eosinophilic esophagitis related study, as well as -- I think Giovanni spoke about in his opening remarks, LPA1 proof-of-concept study. If that reads out and if the data are similar to, from an efficacy perspective, what we saw a couple of years ago or in 2018, the CHEST publication, that could open up the doors if the safety profile is well managed. In a similar way, we have repotrectinib that will be registered and hopefully available in the second half of next year for patients with nonsmall cell lung cancer with advanced mutations. And as the data emerges, there are a few transitions that could occur in 2023 as well from early to late developments, such as androgen receptor independent degrader or alnuctamab.\n\nAnd then, of course, there is the readout for the COMMANDS trial that we are anticipating for Reblozyl as well. So, there are multiple other catalysts that are coming through in the pipeline in 2023.\n\nTim Power -- Vice President, Investor Relations\n\nThanks so much. Denis, can we go to the next question, please?\n\nOperator\n\nYes. The next question is from the line of Steven Scala with Cowen. Please go ahead.\n\nSteve Scala -- Cowen and Company -- Analyst\n\nThank you. Revlimid continues to exceed expectations, presumably creating a tough compare for 2023. So, I'm just wondering, at this point, are you comfortable with consensus looking for growth for Bristol overall next year? I know 2023 guidance will be issued next February. But if you could tell us whether you're comfortable or not willing to comment at this point, that would be helpful.\n\nAnd then, secondly, on branebrutinib, three programs were discontinued. Only RA remains. Why were the other programs discontinued and RA continues? If it was due to tox, can you specifically tell us whether it was liver tox? Thank you.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThank you, Steve. I want to ask David to start on Revlimid and outlook, and then Samit will answer your question.\n\nDavid Elkins -- Chief Financial Officer\n\nThanks, Steven. On Revlimid, you know, as we said in my remarks, we still anticipate, for the full year, Revlimid to be in that 9 billion to 9.5 billion, more in the upper half of that range. But as we said all along, we're going to have quarter-to-quarter variability based upon how generic volumes enter the market and timing from quarter to quarter. So, broadly, we're still in line with, you know, the forecast that we've provided before.\n\nYou know, as far as 2023 guidance, you know, underlying business, we continue -- excluding foreign currency as we see this year, we continue to be able to grow the business. And we'll provide an update on '23 guidance as we normally do on the Q4 call.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nThanks, David. And just, Steve, on the branebrutinib side, it is certainly not the toxicity. We've set ourselves high bars for taking molecules into late-stage development, and we did not meet the high bar for those indications. The indication for RA is continuing, and we'll see what the data reads out.\n\nAnd based on that data, we will make a decision whether that should continue or not.\n\nTim Power -- Vice President, Investor Relations\n\nDennis, can we go to the next question, please?\n\nOperator\n\nYes. Your next question is from the line of Luisa Hector with Berenberg. Please go ahead.\n\nLuisa Hector -- Berenberg Capital Markets -- Analyst\n\nHi. Thank you for taking my question. Maybe just to try again on the outlook for 2023, is there anything more to say on Revlimid? You have the guidance of 2 billion to 2.5 billion of erosion each year. Is that what you're expecting for next year? And then, I wanted to try and clarify on some of the license income partly connected to your statements on IP guarantees.\n\nBut, also, when we look at that line within other operating income, royalties licensing income, it does seem to be a step-up in Q3. So, I'm just wondering if that's driven, perhaps, by the diabetes with Astra that's going particularly well on Farxiga. Is it a one-off item within the line in Q3, or something a bit more sustainable that we should think about going forward? Thank you.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThank you, Luisa. So, let me just reiterate, nothing really changes with respect to 2023 in terms of our outlook. And that includes the fact that we continue to see approximately 2.5 billion of decline for Revlimid. But David can give you more insights into the second question you had.\n\nDavid Elkins -- Chief Financial Officer\n\nOn OI&E, it's a good question. A couple of good things that are going on there. One is that our royalties on PD-1 and diabetes continue to -- as those businesses grow, the royalties that we receive on those businesses continue to grow. A couple other things.\n\nIf you just think about interest rates with our cash balance, interest income is increasing. But as you know, we've been stepping down and paying down our debt, so our interest expense has been declining. And some of our licensing income that we've seen come through has also improved. So, you put all four of those factors together, and that's, you know, how we see the OI&E progressing better over time.\n\nJust recall, they are longer term as it relates to, you know, that royalty income. You know, that -- those royalty rates will step down on our diabetes franchise in '23 and going -- and '24 for PD-1. So, we'll update you on that guidance when we do guidance on the fourth quarter call.\n\nTim Power -- Vice President, Investor Relations\n\nThanks, David. Dennis, can we go to the next question, please?\n\nOperator\n\nThe next question is from the line of Terence Flynn with Morgan Stanley. Please go ahead.\n\nTerence Flynn -- Morgan Stanley -- Analyst\n\nHi. Thanks for taking the questions. Maybe two for me. I was just wondering, first, on Camzyos, just a clarification maybe for Chris.\n\nYou mentioned that commercial access is improving this quarter relative to last quarter. I think you said something about doubling. So, does that mean we should think about sales for the 4Q in the $10 million range? And then, your T-cell engager, the data we're going to see at ASH, maybe you could just remind us, I know you changed the formulation to a subcu there, if you're confident, you now have a go-forward dose, and you're seeing less CRS than maybe you saw with the IV formulation. And if you expect to be competitive with teclistamab, which was just approved from J&J.\n\nThank you.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThank you. Chris, why don't you start on Camzyos, and then Samit?\n\nChris Boerner -- Chief Commercialization Officer\n\nSounds good. So, Terence, thanks for the question. Let me clarify a few things. First, while we're not going to give specific product-level guidance for the fourth quarter, what I would say is that we are very happy with the conversion and increasing conversion of patients on Camzyos to commercial drug.\n\nRemember, as you think about this launch, you need to think about it in the context of how many physicians are REMS-certified. Our ability to then translate those physicians into getting patients into clinics and getting on therapy. We're seeing a nice increase week over week in terms of patients coming in at the top of the funnel, if you will. Because they're going into our hub, they're staying on therapy.\n\nAnd the fact that now we're converting those patients to commercial drug at a faster clip, I think, is a very good sign that this launch continues to accelerate in the fourth quarter. The only other thing to keep in mind is that because most patients will take some time to initiate therapy, as well as work through the benefits verification and any appeals process, those patients are going to be on free drug for roughly seven to eight weeks. That time will decrease over time as we get PBM coverage decisions formally through the end of this year and into early next year. But that's how you should think about this, the flow of patients and the sequence of patients.\n\nThe really good news, though, is that we continue to see physician interest in this product. The feedback has been good. We're seeing week-over-week increases in patients at the top, and we're seeing a nice increase in conversion of patients going on to commercial drug. And we anticipate that continuing.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nAnd, Terence, for the T-cell engager, certainly, we'll not get into the specifics of the data. But as you recall, with the IV formulation, we had very good efficacy that we had seen, but their toxicity profile was not acceptable. And that's why we switched to subcutaneous. And the data will be presented.\n\nSo, certainly, after the presentation of the data, we are happy to get into a dialogue as to what the data are and how we perceive them as we go forward.\n\nTim Power -- Vice President, Investor Relations\n\nThanks so much. Dennis, can we go to the next question, please?\n\nOperator\n\nYes, the next question is from the line of Carter Gould with Barclays. Please go ahead.\n\nCarter Gould -- Barclays -- Analyst\n\nGreat. Good morning, and thanks for all the color on Camzyos. I also have two more on that front, though, for Samit. I guess, first off, we saw that the nonobstructive trial design, the phase 3 got posted.\n\nJust want to -- you know, but it's pretty sparse on details and how you're thinking about titration in the setting, given the phase 2 work that was done here was more drug concentration dependent. Obviously, the REMS is more eco dependent. So, just how you're thinking about titration in the nonobstructive setting. And then, also, on 224, how do you think about this? Should we be think about this as a backup to Camzyos? Or do you see this coexisting maybe in a different set of indications like HFpEF, etc.? Thank you.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nSure. Let me start with Camzyos first and the nonobstructive hypertrophic cardiomyopathy. We are looking forward to initiation in terms of enrollment of patients in that phase 3 study. The data that we had seen already in the phase 2 are quite promising, looking at the impact on biomarkers and even in the longer-term follow-up of that trial.\n\nI can't give you the specifics on the titration at this time. And certainly, for future discussions, once we have initiated the trial, we'll be able to talk more about it. For MYK-224, as you know that we always want to have multiple shots. And this is a new molecule that we are developing.\n\nCertainly, the first trial that you will probably see is going to be looking also at obstructive hypertrophic cardiomyopathy. And the reason for that is because we've got Camzyos data. We have in-house data the way we would want to compare the trials, compare the drug, and see what differentiation features the drug carries. And then, as we look to the future, from a development perspective, we will define which indications we want to pursue with MYK-224, which indication we want to replicate with Camzyos.\n\nWe have not defined and decided yet on how we will develop 224. And certainly, when we have that, we'll get into that dialogue as well.\n\nTim Power -- Vice President, Investor Relations\n\nThanks, Samit. Dennis, can we go to the next question, please?\n\nOperator\n\nThe next question is from the line of Matthew Phipps with William Blair. Please go ahead.\n\nMatt Phipps -- William Blair and Company -- Analyst\n\nGood morning. Thanks for taking my questions. A quick one for me. Samit, there's been a couple of failures this year in EoE where maybe the phase 2 is at 50 histological endpoints but not the dysphagia endpoints.\n\nJust maybe you can give us any comments on why you think IL-13 would be better suited to the IL-13 -- to both of those endpoints in your EoE phase 3.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nSure. Sure, we can certainly -- the one that you're probably talking about is the one that we saw yesterday or the day before for the EoE. Remember, the mechanism of action over there is the IL-5 inhibition as opposed to cendakimab, where it is the IL-13 inhibition. The differentiating feature also compared to some of the other drugs that are approved or have shown data.\n\nThis is a direct inhibitor of IL-13 with a downstream effect of inhibition of both R1 and R2 receptors. And we believe that the inhibition of both is important, not only for decreasing the inflammation, but also for remodeling and reversing the fibrosis. We have seen this in the phase 2 trial that was presented a while back for cendakimab. And that was the basis of taking this into a phase 3 trial.\n\nAnd certainly, we will be looking at dysphagia in this trial as well. So, in a couple of years, when the trial reads out, we are hoping to be able to replicate and improve on the results of the phase 2 study.\n\nTim Power -- Vice President, Investor Relations\n\nLet's go to the next question, please.\n\nOperator\n\nThe next question is from the line of Colin Bristow with UBS. Please go ahead.\n\nColin Bristow -- UBS -- Analyst\n\nHey, good morning. And thanks for taking the questions. Maybe just a quick follow-up on Sotyktu. You've previously talked about the strategy to build volume against established competitors with sort of free drug operating programs.\n\nCould you just give us some more specific details on what you are doing there just to help us think about the progression of the sales trajectory? And then, just secondly, on the next-generation IMID portfolio, what should we specifically expect to see at ASH with regards to iberdomide and mezigdomide? Thank you.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThanks, Colin. Chris, why don't you start on Sotyktu? And then Samit will take the IMID.\n\nChris Boerner -- Chief Commercialization Officer\n\nSure. So, as we think about the progression of Sotyktu, I think you start with a couple of things upfront. One is the profile of the drug. We've talked about that, at some length, that the fact that we have a very clean label here gives us the ability to tell a very strong story about two phase 3 studies that directly show an efficacy improvement against the existing standard of care.\n\nSo, we've got a great efficacy message to tell, good safety profile. The value of this asset is very clear. We saw that coming into this launch. And all of the feedback that we've received from physicians, thus far, is consistent with that.\n\nThe next important point is that we've got a very experienced team. They know this space well. So, we've been able to penetrate where the vast majority of these patients sets, which is in the community setting. So, we feel very good about that.\n\nThe trick with this space, because it is a heavily managed space, is going to be that we do a few things really well. Initially, we've got to remove new-to-market blocks. Those blocks are put in place for every new product in the space, and that's a big focus for us right now. We then have to take advantage of where access is open.\n\nAnd as I said earlier in response to the previous question, that's about 10% of patients, and so we're doing everything we can there. But for the majority of patients, the focus is on building volume and then leveraging that volume to negotiate with PBMs to get you into a more favorable formulary position as soon as feasible. Because of the timing of this launch, we certainly missed the window, by and large, for negotiations. This year, the focus will be on negotiating for 24 access, though, in response to Chris' earlier question, we're going to do everything we can to accelerate that.\n\nSo, that's really the focus that we have. We have a robust set of patient services that we can offer to patients to get them onto therapy. We give them both initial free trial offer, as well as a bridge program. And we would anticipate significant use of that bridge program to guide us into when we have a more favorable formulary position.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nAnd just talking about ASH in general, one of the things that you will be seeing over there is the presentation of the data for the expansion arm of mezigdomide in combination with dexamethasone in fifth-line plus patient population. But in general, for multiple myeloma, we'll also be presenting the data for our next CAR-T, which is GPRC5D-targeted. As well as for KarMMa-2, one of the arms, which is looking at proof of concept in the post-transplant treatment setting, that data will also be presented at ASH in addition to alnuctamab, which is a T-cell engager.\n\nTim Power -- Vice President, Investor Relations\n\nThank you, Samit. Can we go to the next question, please?\n\nOperator\n\nNext question is from the line of Evan Seigerman with BMO Capital. Please go ahead.\n\nEvan Seigerman -- BMO Capital Markets -- Analyst\n\nHey, guys. Thank you for taking the question. One on Abecma, can you provide just some color to when we may see the commissary data? I know that 2seventy press release relayed, you know, a medical meeting, and I see that there's now a green check mark on your near-term catalysts. And also, more broadly speaking, when you think about the evolution in the BCMA CAR-T space, what do you -- how do you position Abecma versus, say, its competitors, especially with, say, the Carvykti full data on the horizon as well? Thank you.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThank you, Evan. Samit.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nSure. I will start with that, Evan. And from a KarMMa-2 data presentation perspective, certainly, as I said earlier, those data will be there as a proof of concept with a longer follow-up at ASH meeting. And certainly, we've talked about what the initiation of the next trial based on those data would be with.\n\nAnd that's what I think 2seventy bio talked about. How we intend to initiate a trial in the earlier setting, it is a differentiated way of looking at it. And more details will be available when we actually do launch the trial, in terms of trial design, and how we have thought about it. In terms of the comparison of Abecma versus the data from Carvykti, once again, as Chris has spoken about earlier, we do believe that Abecma remains a very differentiated asset from a safety profile perspective, as well as the first, CAR-T that has data as a randomized phase 3 trial showing superiority to current standard of care.\n\nSo, that profile will continue to grow. And that profile will continue to improve, hopefully. And that's why we are thinking of initiation of that early line trial in the post-transplant setting.\n\nTim Power -- Vice President, Investor Relations\n\nThanks, Samit. Can we go to the next question, please, Dennis?\n\nOperator\n\nYour next question is from the line of Dane Leone with RJS. Please go ahead.\n\nDane Leone -- Raymond James -- Analyst\n\nThank you for taking the questions. Congratulations on the results and progress this quarter. Two easy ones for me. Firstly, the launch of Opdualag has been going quite well.\n\nAnd, you know, looking into 2023, I think there's still some questions about the cannibalization potentially within the melanoma setting relative to Opdivo, as the street's still expecting quite robust growth of Opdivo into next year. Could you just comment around what you're seeing as the launch starts to mature a little bit with Opdualag and whether your expectations are that it's going to have a limited impact in the utilization of Opdivo in the melanoma setting? And then secondly, an easy one, are you expecting Embark results for Camzyos next year? Or is that being pushed to 2024? Thank you.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThank you, Dane. Chris, why don't you start?\n\nChris Boerner -- Chief Commercialization Officer\n\nYeah, maybe I'll start with Opdualag, and I'll turn it over to Samit. So, what we're seeing right now, just to set sort of where we are with the Opdualag launch is we are sourcing roughly 50% to 60% of this business from PD-1 monotherapy and about 40% to 50% from Opdivo and Yervoy combination. That's slightly higher Opdivo-Yervoy cannibalization in the third quarter as we had anticipated pre-launch. But we do expect that to stabilize, and we would continue to expect that going forward.\n\nThe majority of Opdualag's business is going to come from PD-1 monotherapy. Remember, in the market right now, as I said earlier, we've got about 20% market share for PD-1 monotherapy. That's roughly evenly split between Opdivo and Keytruda. So, the way I would think about the progression of Opdualag is, first and foremost, you will see some cannibalization of Opdivo and some of Yervoy as well.\n\nHowever, the vast majority of the use of this asset in the long run should continue to come from PD-1 monotherapy. Some of that will be Opdivo, some of that will be from a competitor. And as I think about the growth trajectory, that 20% share is the target for us of PD-1 monotherapy. That's where we think we should be getting the business.\n\nAnd the fact that we still have 20% of this market to go gives us confidence we can continue to grow this overall business going into 2023.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nAnd just on Embark results, those are projected to be in 2024.\n\nTim Power -- Vice President, Investor Relations\n\nThanks, Samit. Can we go to the next question, please, Dennis?\n\nOperator\n\nYour next question is from the line of Mohit Bansal with Wells Fargo. Please go ahead.\n\nMohit Bansal -- Wells Fargo Securities -- Analyst\n\nGreat. Thanks for taking my question. So, one clarification and one question, if I may. On Camzyos, Chris, I think you mentioned that 1/3 of the patients who are prescribed Camzyos are on commercial.\n\nBut then you mentioned that, in October, we have seen doubling of that. Can you please clarify what is doubling here, number of commercial patients or the funnel or prescribed prescription for Camzyos? And then, the second part of the question is regarding milvexian. The indications you have mentioned, SSP and ACS, this seems to be a little bit of acute type of indications. So, yes, the patient number are high, but duration of treatment may be smaller.\n\nI think that is only for a month or so after a stroke. So, just trying to understand how should we think about the opportunity in the acute type of settings. Thank you.\n\nChris Boerner -- Chief Commercialization Officer\n\nSure. Maybe I'll start on the Camzyos question. So, let me just clarify the 1/3. Of the 1,100 patients, roughly 1,100 patients that we had as of the end of Q3, 1/3 of those patients had dropped down to commercial drug, beyond commercial drug.\n\nAnd what I was referencing was in the first three weeks of October, we've seen an almost doubling of the number of commercial dispenses that took place through all of the third quarter. So, that illustrates an important consideration for the trajectory of commercial sales here for this product, which is that we're starting to see an acceleration, both in terms of the number of patients coming on to therapy and the pace at which those patients are converting down to commercial drug.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nAnd on the milvexian side, although the words say acute coronary syndrome, but it doesn't mean that the treatment is only done in the acute setting or even for the secondary stroke prevention. Patients actually stay on antiplatelet regimens, for example, for a very long time on a chronic treatment period. And so, in a similar way, milvexian is anticipated to be used in a chronic setting rather -- meaning the long duration of treatment, rather than only in the acute phase.\n\nTim Power -- Vice President, Investor Relations\n\nCan we go to the next one, please, Dennis?\n\nOperator\n\nThe next question is from the line of Robyn Karnauskas with Truist Securities. Please go ahead.\n\nRobyn Karnauskas -- Truist Securities -- Analyst\n\nGreat. Thank you. I guess two for me. Number one, on Reblozyl, we're hearing -- I was just wondering about duration of therapy.\n\nWe've got some anecdotal comments from your Inaudible] some patients still fill a lot of fatigue, and so they'll stop before the drug is actually working. So, could you comment on like what you're seeing for duration of therapy and if you think that will change? And then second, on deucra, I noticed that you have a topical formulation that's being developed. Can you talk a little bit about what your strategy might be there? Obviously, the topicals are becoming a growing market segment, and maybe what different indications you might be pursuing. Thank you.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nThank you. Chris, and then Samit.\n\nChris Boerner -- Chief Commercialization Officer\n\nSure. So, I think you're right that a big focus area for us on Reblozyl continues to be on duration of therapy. The way we anticipate being able to drive that duration of therapy, though, is to continue to focus on dose titration. What we're seeing right now is about 50% of patients are dose titrating.\n\nAnd remember, you need to have two dose titrations to get the benefit that you saw in the clinical program in the real-world setting. And so, about 50% of patients are dose titrating with the first step. And that compares to about 80%, which is what we saw in the clinical study. And if we can get that dose titration, patients will get the full benefit of Reblozyl.\n\nAnd we anticipate that, that full benefit will translate into a longer duration of therapy. So, I think that what you're hearing is consistent with the focus that we have the continued growth of this product, continue to make sure that Reblozyl is the standard of care in the second-line on-label population, expand that population as much as we can by decreasing the time that patients are in ESAs, and then ensuring they get the full benefit of Reblozyl by focusing on appropriate dose titration, which we anticipate will increase the duration of therapy.\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nYeah. And just very briefly on Sotyktu. Look, I think the overall potential for topical therapy is being evaluated, and we'll have to inform you in due course because landscape is continuing to evolve with multiple therapies coming for the milder population or mild population. We already have the approval for moderate-to-severe plaque psoriasis.\n\nAnd the mild population indication, we'll need to continue to explore.\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nSo thanks, everyone. In closing, with nine new product launches in the last three years, I want to take a moment to reflect on all of the progress we have made. We have significantly derisked our portfolio with strong clinical, commercial, and financial execution. And we are well underway to transform our business into a more diversified and resilient company.\n\nI look forward to the coming catalysts ahead from our new product portfolio and our mid-stage pipeline. With that, thanks again for taking the time to join our call today. And as always, our IR team will be available for any follow-up questions you may have. Thank you, and have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTim Power -- Vice President, Investor Relations\n\nGiovanni Caforio -- Chairman and Chief Executive Officer\n\nDavid Elkins -- Chief Financial Officer\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nChris Boerner -- Chief Commercialization Officer\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nSamit Hirawat -- Chief Medical Officer and Head of Global Drug Development\n\nAndrew Baum -- Citi -- Analyst\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nTim Anderson -- Wolfe Research -- Analyst\n\nSteve Scala -- Cowen and Company -- Analyst\n\nLuisa Hector -- Berenberg Capital Markets -- Analyst\n\nTerence Flynn -- Morgan Stanley -- Analyst\n\nCarter Gould -- Barclays -- Analyst\n\nMatt Phipps -- William Blair and Company -- Analyst\n\nColin Bristow -- UBS -- Analyst\n\nEvan Seigerman -- BMO Capital Markets -- Analyst\n\nDane Leone -- Raymond James -- Analyst\n\nMohit Bansal -- Wells Fargo Securities -- Analyst\n\nRobyn Karnauskas -- Truist Securities -- Analyst\n\nMore BMY analysis\n\nAll earnings call transcripts"
}