{
  "companyName": "Coca-Cola",
  "companyTicker": "KO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/coca-cola-ko-q3-2022-earnings-call-transcript/",
  "content": "Coca-Cola (KO -0.53%)\nQ3 2022 Earnings Call\nOct 25, 2022, 8:30 a.m. ET\n\nOperator\n\nAt this time, I'd like to welcome everyone to the Coca-Cola Company's third quarter earnings results conference call. Today's call is being recorded. If you have any objections, please disconnect at this time. [Operator instructions] I would like to remind everyone that the purpose of this conference is to talk with investors, and therefore, questions from the media will not be addressed.\n\nMedia participants should contact Coca-Cola's Media Relations department if they have any questions. I would now like to introduce Mr. Tim Leveridge, vice president of IR and FP&A. Mr.\n\nLeveridge, you may now begin.\n\nTim Leveridge -- Vice President of Investor Relations, Financial Planning, and Analysis\n\nGood morning, and thank you for joining us. I'm here with James Quincey, our chairman and chief executive officer; and John Murphy, our president and chief financial officer. We posted schedules under financial information in the Investors section of our company website at coca-colacompany.com. These schedules reconcile certain non-GAAP financial measures, which may be referred to by our senior executives during this morning's discussion to our results as reported under generally accepted accounting principles.\n\nYou can also find schedules in the same section of our website that provide an analysis of our gross and operating margins. In addition, this call may contain forward-looking statements including statements concerning long-term earnings objectives, which should be considered in conjunction with cautionary statements contained in our earnings release and in the company's periodic SEC reports. Following prepared remarks, we will turn the call over for questions. Please limit yourself to one question.\n\nIf you have more than one, please ask your most pressing first and then reenter the queue. Now let me turn the call over to James.\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nThanks, Tim, and good morning, everyone. After a strong first half of the year, we continued our momentum in the third quarter with effective execution across our global system despite a macro backdrop that remains challenging. In the face of these pressures, consumers stayed resilient, and we continue to invest behind our loved brands to drive value in the marketplace and growth in our business. Given our strong results year to date, and increased visibility into the rest of the year, we are raising our top-line and bottom-line guidance, while continuing to invest strategically.\n\nSo this morning, I'll provide a business update and discuss how we are expanding the circumference of what we can control. Then I'll pass to John, and he will discuss financial details for the quarter, our revised guidance for the full year 2022 and some early considerations for 2023. During the third quarter, macroeconomic crosscurrents continued to impact the operating environment. The conflict in Ukraine is ongoing, which creates challenges in that country and beyond.\n\nAnd we saw renewed pandemic-related mobility restrictions in China. Inflationary forces are driving costs, pricing, and interest rates higher, resulting in currency volatility in many parts of the world. Against this backdrop, our industry remains healthy and is growing both in value and volume, which continues to include some benefit from cycling COVID-related impacts from the prior year. In the third quarter, we delivered strong organic revenue growth across all operating segments.\n\nThis was driven by pricing actions and robust volume growth. We had share gains overall and across most categories, as well as within both at-home and away-from-home channels. We accomplished this by investing in our business and providing the right portfolio of brands and packages to retain and add consumers. Notably, we drove revenue growth ahead of transactions growth, which is also ahead of volume growth in the quarter, reflecting the strength of our revenue growth management capabilities.\n\nConsumer elasticities in core categories have continued to hold up well. We are leveraging our consumer-centric marketing model and increasingly using digital engagement to link consumption occasions with passion points. And our system has never been stronger, and our global network model is allowing us to leverage the vast experiences of the systems' leaders from various parts of the world. We are increasingly sharing learnings and generating faster responses to a changing environment through the right mix of local relevance and scale.\n\nNow recapping the third quarter performance across the world. Starting with Asia Pacific. In India, we continued to strengthen in the first half of the year as we gained share in sparkling offerings. Trademark Coke delivered strong growth through effective execution and occasion-based marketing.\n\nYear to date, we drove approximately 2.5 billion transactions at affordable price points through the expansion of returnable glass bottles and single-serve PET packages. Sprite has grown to become a $1 billion brand in the market, driven by the success of locally adapted occasion-based global marketing campaigns like Heat Happens and Screentime. In Japan, we continue to strengthen our business. Amidst an inflationary environment in the country for the first time in many years, we took price increases in large PET packages.\n\nThrough intelligent innovation on small packs, we've gained value share, transactions, and household penetration year to date. Additionally, we continued our strong share gains in vending in the quarter, and we expanded our leadership position in e-commerce. In China, we grew volume in the quarter and achieved strong growth in sparkling soft drinks during the summer selling season, amid varying levels of pandemic-related mobility restrictions. We focused on digital to unlock new opportunities.\n\nWe deployed Fans Festival, a drink scan wind pilot at scale, which drove widespread brand exposure and connected consumer traffic to more than 30,000 outlets. We remain focused on executing RGM strategies to drive outlet expansion and increase key SKU availability. In ASEAN and South Pacific, we saw strong volume and transaction growth across most markets, driven by new product launches and continued recovery in away-from-home channels. We saw significant top-line improvement in sparkling flavors for most markets, driven by our Sprite Lemons Plus and Schweppes Zero Sugar innovations.\n\nIn EMEA, European consumers continue to experience inflationary costs. We leveraged our RGM strategies to drive away-from-home, single-serve mix and retain consumers and delivered value share gains across most categories. And our system has delivered top-tier incremental retail value for customers year to date for a second year in a row. We accelerated digital engagement with more than 4 million connected consumers year to date.\n\nIn Africa, despite the macro environment remaining challenging, we gained volume and value share. We focus relentlessly on excellence in execution and reduced retail out-of-stocks. We've built sustainable customer engagement in more than 80,000 points of sale year to date through a customer loyalty partnership program. In Eurasia and the Middle East, we remain resilient amid an unprecedented inflationary environment in many markets and some supply related disruptions.\n\nA cross-market launch of fee for activation and the Fanta Fest campaign were in key enablers of growth. With strong focus on execution, we placed over 50,000 coolers and have gained availability in 33,000 new outlets year to date. In North America, we drove volume and value share gains through strong core sparkling performance, complemented by robust innovation and music-led experiential marketing despite intermittent supply chain challenges. Smartwater growth was strong during the quarter and innovations like Coca-Cola Creations and Minute Maid Aguas Frescas continue to expand and exceed expectations.\n\nThe Coca-Cola Value Bundle, a collection of core sparkling offerings, providing more choices to cost-conscious consumers, is helping to retain and recruit more consumers while creating value for our customers. In Latin America, we leveraged connected experiences and strong execution to drive top-line growth and sequentially improve on our share losses. We strengthened our connections with Use Through Music, leveraging the Coca-Cola Marshmallow flavor to stream Rock in Rio across the continent. Through RGM initiatives, we focused on single-serve package growth to drive transaction growth.\n\nAlignment with our bonding partners remain strong, and our joint market initiatives are ensuring our focus on accelerating growth. In Global Ventures, we witnessed robust volume growth. However, overall cost of performance was impacted by a dynamic operating environment in the U.K., along with investments in the marketplace as we expand internationally. China ready-to-drink value share grew with the strong performance of innovations like Costa Char Tea and Oak Coffee.\n\nReady-to-drink in Japan is also delivering strong performance supported by sampling in-store execution and the launch of Caramel Latte. Finally, our Bottling Investments Group delivered strong volume and top-line performance driven by a focus on affordable entry-pack expansion across all markets. Additionally, we're driving availability and efficiencies in cost to serve. As we look forward beyond this year, we continue to see great opportunity for our industry.\n\nWe are allocating resources in a disciplined way to gain share. Success from our marketing model is based on two critical components: linking occasions and passion points to drive engagement, and leveraging experiments to optimize our marketing. This drives deeper connections with consumers, reaching them in new and unique ways. The launch of the Bleeding is Magic global campaign for the FIFA World Cup celebrates the passionate journey of soccer fans by unveiling a suite of digital experiences that capture the full extent of fans' devotion to their beloved teams.\n\nThe campaign includes the FIFA World Cup Trophy Tour as well as a digital hub called Coca-Cola Fan Zone, which creates in-person opportunities for fans to come together to trade Panini stickers behind the Coca-Cola labels. This campaign has already led to a gain of more than 3.5 million consumers for direct engagement. Building on our digital experiments, we also announced a strategic partnership in six countries with Grab, Southeast Asia's leading connected app. This builds new consumer connections and offers a new level of convenience.\n\nThrough a mix of offline advertising on the graph fleet, online advertising in the Grab app, gamification, and product sampling, we are building more purchasing occasions to grow demand for at-home consumption. Our innovations have delivered strong results with more than 25% contribution to incremental gross profit year to date. Our innovations span markets and categories, with 55% of year-to-date innovations outside of the sparkling category. Our pipeline is robust and we are excited about their unique consumer propositions.\n\nFor example, Coca-Cola Creations is providing bold on-trend flavors designed to build both with younger consumers. Ready-to-drink Costa offers new and exciting flavors with authentic, rich coffee and milk taste. We are also excited about the potential for Jack Daniel's and Coca-Cola ready-to-drink, which will launch in Mexico in the fourth quarter and is coming to a digital markets next year, including the U.S. in the spring through our agreements with Brown-Forman.\n\nThis will give consumers a convenient way to enjoy the world's most popular bar cooler. Our innovations are designed with scalability in mind to further support our growth portfolio. We expect inflationary pressures to continue, so we are leveraging all the levers of RGM at our disposal, including price, promotional intelligence and proactive mix management. Our RGM capability is mining insights such as consumer motivations as well as category and customer opportunities, giving us a precise approach to package, placement, and promotional investments.\n\nThis drives trip conversion and value growth for customers. For example, in Japan, we are seeing strong results from our segmented approach. Instead of our key 500 ml PET pack for Fanta, we now sell on smaller 350 ml PET pack on the go and one larger 700 MLP back for home occasions. This dual-pack strategy has increased beverage incidents by 9%.\n\nIn Q3, retail value transactions and market share were all up for these packages. Our system is investing to grow our executional footprint, adding to what was already pervasive distribution, resulting in availability of our products in nearly two-thirds of all outlets globally. These strong results are clear proof points of what is possible when our alliance system leans forward for growth. Underpinning all of this work is our purpose to Refresh the World and Make a Difference.\n\nSustainability remains an integral part of our business and strategy and is a key driver of future growth and business resilience. While we have made progress toward our World Without Waste goals, we remain committed to do more and faster so we can grow our business the right way. We're continuing to partner with other businesses, civil society, and governments to support cooperative action on this critical issue. During the quarter, we played a leadership role and helped launch the business coalition for a global plastics treaty convened by key partners, the Ellen MacArthur Foundation and Worldwide Life Fund, alongside other private sector companies.\n\nWe are also continuing to take steps to help drive the circular economy by making our bottles more eco-friendly. In North America and Latin America, Sprite has shifted all of its PET packaging from green to clear, improving the efficiency of recycling systems and increasing the availability of food-grade RPET. In Vietnam, we launched Coca-Cola bottles made from 100% recycled plastic, excluding the cap and the label. We now have more than 30 markets where we offer at least one brand in a 100% RPET package, with similar launches planned in additional markets next year.\n\nIn an operating environment that increasingly puts more variables into the equation than we've seen in the past, we are focused on delivering and executing for growth. We are encouraged by what we are seeing in the business. We are committed to expanding the circumference of what we can control by delivering world-class marketing, disciplined innovation, excellence in revenue growth management, and laser-sharp execution in the marketplace, with a goal of operating at a higher level through these challenging market conditions. We are doing this with capable and aligned bottling partners around the world.\n\nThe combination of strong loved brands and a pervasive distribution system is a formula for resilience in times like these, and we are pleased to be raising both our top-line and bottom-line guidance today. With that, I'll turn the call over to you, John.\n\nJohn Murphy -- Chief Financial Officer\n\nThank you, James, and good morning, everyone. Today, I'll comment on our third quarter performance and provide considerations for our updated guidance to this year. I'll also provide some early commentary on 2023 and what actions we are taking to drive a top-line-led growth equation to navigate this dynamic environment. We are encouraged with the continued momentum of our business, and we delivered another set of strong results in the third quarter.\n\nWe grew organic revenue 16%, unit cases grew 4%, with broad-based growth across most operating segments and targeted investments in the marketplace. Concentrate sales were in line with unit cases for the quarter. Our price/mix of 12% was driven primarily by pricing actions across operating segments, along with revenue growth management initiatives, further improvement in away-from-home channels in most markets and positive segment mix. Comparable gross margin for the quarter was down approximately 190 basis points versus the prior year.\n\nThe underlying margin compression was approximately 60 basis points, with the rest of the impact coming from currency headwinds driven by the volatile macro backdrop and the mechanical effect of consolidating the Bodyarmor finished goods business. We significantly stepped up our consumer and customer-facing investments to support our robust marketing agenda and strong innovation pipeline. Notwithstanding higher costs and continued investments in the marketplace, we expanded underlying operating margin by approximately 100 basis points, driven by strong top-line growth. Comparable operating margin, however, compressed by approximately 50 basis points due to the impact of the Bodyarmor acquisition and currency headwinds.\n\nBelow the line, we benefited from a lower-than-expected effective tax rate for the full year. All in, third quarter comparable EPS of $0.69 grew 7% year over year, and this was impacted by 11 points of currency headwinds. On cash flow, we delivered free cash flow of $7.3 billion year to date driven by our strong business performance. This was 14% lower versus the prior year, primarily due to two items: one, cycling the timing of working capital benefits in the prior year; and two, higher 2021 annual incentives paid in the first quarter.\n\nAdditionally, our net debt leverage is 1.8 times EBITDA, which is slightly below our targeted range of two and two and a half times. As we look to the operating environment, there are clearly many variables at play today, as James mentioned. We are spinning our top line and bottom line flywheels faster to fortify our business and manage through many types of environments, and we're investing in the marketplace to create value for our customers and consumers. Given our strong results and the visibility we have for the rest of the year, we are raising guidance for the full year.\n\nWe now expect to deliver organic revenue growth of 14% to 15% and comparable currency-neutral EPS growth of 15% to 16%. Based on current rates and our hedge positions, we expect currency to be a seven-point headwind to comparable net revenues and a nine-point headwind to comparable earnings per share for full year 2022. We now expect an underlying effective tax rate of 19% in 2022. All in, we expect comparable earnings-per-share growth of 6% to 7% versus 2021.\n\nWe continue to expect to generate approximately $10.5 billion of free cash flow for 2022, through approximately $12 billion in cash from operations, less about $1.5 million in capital investments. There are some considerations to keep in mind for Q4 that we factored into our full year guidance. There is an additional day in the fourth quarter, however, we expect concentrate sales to end the year in line with unit case sales. We are investing in consumer-facing marketing to get a fast start for next year.\n\nLastly, given the backdrop of rising interest rates, we expect to see an impact on our interest expense given our effective exposure to floating rate debt. The environment remains volatile, and while we are preparing for many futures in 2023, we did want to share some early considerations for next year based on what we know today. We are encouraged by the momentum in our top line and we leverage our capabilities to sustain top-line growth with the ongoing inflationary backdrop. As we look to our cost outlook, we expect global inflation to continue to impact our expenses across the board and commodities to remain volatile.\n\nWe benefited from hedges in our commodity exposure this year. And even though some of the commodities have started to come off their highs, we expect another year of elevated inflation on a per-case basis next year. We estimate the underlying effective tax rate to be 19.5% for 2023. Regarding currency, if we were to assume current rates and our hedge positions, there would be an approximate five- to six-point currency headwind to comparable net revenues, and an approximate seven- to eight-point currency headwind to comparable earnings per share for full year 2023.\n\nHowever, given the amount of volatility in the currency markets, this initial view could change when we come back to you for the fourth quarter call in February. We are committed to delivering top-line-led growth and we remain focused and confident in our ability to achieve our three key objectives: investing for the long-term health of the business, winning locally and generating U.S. dollar EPS growth. We are pleased with our results so far and have the visibility to deliver on our updated guidance, creating value for our shareowners through strong top-line growth, cash flow generation, and dividend growth.\n\nOur strong system leadership and the tremendous ongoing commitment of our people around the world gives us confidence that we will continue to deliver sustainable results in the year ahead. With that, operator, we are ready to take questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Bryan Spillane from Bank of America. Please go ahead. Your line is open.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks, operator. Good morning, everyone. So I guess, John, I wanted to just pick up on your commentary about '23.\n\nWe've got this question a bunch this morning about dollar earnings growth next year. So I just want to clarify, in your comments on those three objectives, does that apply to next year kind of based on where you sit now? And then maybe if you can just talk about some of the trade-offs with regards to delivering on dollar earnings growth given all of the dynamics that are going on in the marketplace.\n\nJohn Murphy -- Chief Financial Officer\n\nThanks, Bryan. Yes. Those comments were very much related to next year. We do see a path to generating U.S.\n\ndollar EPS growth next year. Clearly, there's a lot of variables in the equation. And if anything, there's even more variability with some of those variables. We've talked a lot about our strategy is to lead a sustainable equation from the top line.\n\nWe continue to have confidence in the momentum that our business has and to continue that momentum. The cost outlook does remain more elevated than we are used to. But we've got a higher revenue, higher cost algorithm that we're looking to manage going into next year. I think the work we've done over the last couple of years to build flexibility to be able to adapt quicker than perhaps we have done historically to changes in the markets around us, is something that we take on board and will continue to drive.\n\nAnd with that, we've given the guidance or the considerations for next year. And we're very focused on finishing the year strong, starting fast, and being able to deliver on those three objectives.\n\nOperator\n\nOur next question comes from Dara Mohsenian from Morgan Stanley. Please go ahead. Your line is open.\n\nDara Mohsenian -- Morgan Stanley -- Analyst\n\nHey, guys. So obviously, another set of strong top line results in the quarter. You also mentioned the underlying top line momentum in the release when thinking about 2023. So just wanted to get a bit of an update, given the external environment, there's obviously a lot of concerns around weaker consumer spending and some of the pressure points out there.\n\nDo you guys see anything toward the end of the quarter or so far in October that would give you any cause for concern? And as you think about these much higher than typical levels of pricing, are you seeing any sort of changes in consumer volume demand elasticity, that pricing, as you look around the world here, that would be helpful? Thanks.\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nYeah. Thanks, Dara. The short answer is yes, we're seeing some changes in consumer behavior. I mean, overall, in the third quarter, consumer remained pretty resilient and elasticities were at the better end of the spectrum.\n\nClearly, there are some changes in consumer behavior going on. We talked last quarter about how we have typically experienced recessions. In other words, there tends to be a sequence, which is that the consumers back off on some more discretionary, higher ticket items white goods types of things. And then as they -- as the pressure comes on purchasing power, they start to reevaluate the total basket.\n\nThey tend to squeeze down the basket size per trip and they look in some categories where the equity isn't as strong to perhaps trade down to some private label or smaller packages. And you can clearly see that happening -- beginning to happen in a number of places. It would seem to us that Europe is probably the most obvious example, where, in the at-home channel, you can see some growth in private label across a number of categories. In beverages, you could see it tick up a little in water and juices.\n\nYou can certainly see the growth of the hard discounters, some channel shifting in Europe. That's very consistent with purchasing power squeeze behavior, some signs of that, too, in the U.S. with the dollar channels. So there's clearly the impact of inflation running ahead of wages is starting to come through now that the summer is over and back to school has happened.\n\nOur focus and our confidence in our year to go and going into next year is about the momentum we've created in our business over the years and our ability to not just to continue with marketing and innovation, but to leverage all the thinking behind revenue growth management and the price pack promo architectures to maximize affordability, and therefore, accessibility of our categories for those consumers that are under pressure. And, of course, backed by excellence in execution and generating the value for retailers by our system that will help us get through what is likely, in all likelihood, going to be a tighter situation for the next six to 12 months. And if I just come back and close the circle by using the European example, where consumers are under pressure. In the third quarter, the Coke system was the biggest creator of additional retail value for at-home retailers well ahead of the rest of CPG.\n\nBut we believe we have a strategy that's given us momentum. It will see us through the year to go. It will see us into 2023. It may, as John said, end up with above algorithm pricing and some pressure on volume, but we believe our top line can go forward.\n\nOperator\n\nOur next question comes from Lauren Lieberman from Barclays. Please go ahead. Your line is open.\n\nLauren Lieberman -- Barclays -- Analyst\n\nGreat. Thanks. Good morning. You'd mentioned the ability for the company to adapt more quickly than in the past.\n\nAnd I was intrigued by the example you gave of the value packs in North America that you've started to roll out. So I was curious if you could tell us a bit more about kind of how broad-based those are, the degree to which that's something that's being explored for other markets? And James, you just mentioned some of the pressures in Western Europe, but anything you can share on the kind of leveraging experience and learning across the global system in terms of how to manage through in different RGM type practices? Thanks.\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nYes. Absolutely. I mean value packs or ensuring affordability for the consumer is one of the core pieces of RGM. It's about extending the price ladder and, in recessionary times, about making sure the entry price point, whether it would be on the larger packs or on the smaller packs becomes as low down in the price spectrum, the actual out-of-pocket as possible.\n\nAs I talked about in the last answer, one of the recession behavior tends to be to try and reduce the dollar outlay of the basket, and therefore, the price point becomes even more important than the price per liter. And so around the world, that's absolutely what we're pursuing, whether it's in the U.S., having smaller bottles or smaller multipacks of less cans per multipack; or the example I used in Japan, where we took the 500 mL and split it into 350 and 700. Of course, around the world in a number of countries, we leverage our capabilities with returnable bottles. Given the economics of returnables particularly in the developing markets, that is a way of generating a lower price point because, of course, in effect, you don't pay for the packaging because it comes back again.\n\nAnd so those returnable bottles that we refill are a way of bringing the price points down and keeping the consumer in the category. And so that's -- it's a well-developed skill around the world. The bottlers share a lot of learnings between themselves on how to think about the technology of RGM, and that allows us to leverage it to its maximum, particularly in times like these.\n\nOperator\n\nOur next question comes from Steve Powers from Deutsche Bank. Please go ahead. Your line is open.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nThank you very much. I guess just to drill a little bit further into the path to dollar-based EPS growth next year. Clearly, as we stand here today, there are a number of headwinds to overcome, and you've outlined and quantified some of them between FX and interest expense, underlying inflation, higher year-over-year tax rate next year. I guess what I'm left trying to unravel is how dependent is the path to dollar-based EPS growth next year on this continued top-line momentum that you've been -- that you've emphasized today? Versus are there other levers that you can look to, whether that's paring back a bit on marketing investments and the innovation agenda investments or just doubling down on productivity? I guess the question I'm asking is, underneath from an underlying perspective, is it -- are we to be -- are we -- how dependent are we on that top of momentum continuing versus there being other levers that the company can look to?\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nThe simple answer, Steve, is we're very dependent on top-line momentum. In the sense that we are going to continue, we believe, barring something very unforeseen -- or at this stage, we believe we're going to continue to invest for the long-term health of the business and that's going to drive top-line growth. As it has. I mean, if I -- just for the sake of the argument, if you take the five-year CAGR of revenue through all the ups and downs of COVID and everything, in round numbers, it's trending at 6% compound for the last five years.\n\nSo preserving and sustaining top-line momentum is actually the key starting point. And of course, if there are parts of the world where circumstances do not merit continued high levels of marketing investment and there's reasons to pare back, then as John mentioned earlier, we absolutely will lean on our increased degree of agility and adaptability to make those adjustments in the moment. And similarly, with any SG&A. But the predominant drivers, again, is going to be the top line.\n\nWe will manage the other elements of the P&L based on the local markets. I don't think it's our expectation that this is going to be like the second quarter of 2020, where everything stoped everywhere at the same time. If there are to be pressures, it's likely that they are spread out over time. So the predominant modus operandi will be leaning to growth, invest in top-line growth.\n\nAnd then yes, we expect, at times, different markets to kind of have to, yes, optimize the marketing. But on an overall basis, it's top-line momentum driven.\n\nOperator\n\nNext question comes from Nik Modi from RBC Capital Markets. Please go ahead. Your line is open.\n\nNik Modi -- RBC Capital Markets -- Analyst\n\nYeah. Thank you. Good morning, everyone. So, James, I was wondering if you could just comment.\n\nI saw some of the organizational priorities that came out of the U.S. bottler meeting recently, and I was hoping, just linked to this top-line momentum comment, if you can provide some context on other markets in terms of organizational priorities, whether it be some of your larger markets like in Japan or in Western Europe or Latin America. Maybe you can just share some thoughts on how you're thinking about some of the key initiatives in those regions.\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nSure. I mean let's start with Japan. Clearly, in Japan, we're very focused on the marketing and innovation. It tends to be a market that's very driven by engagement with the consumer.\n\nAlso, importantly in Japan, after perhaps multiple decades of not taking price, we have taken price on large packs,in Japan in the third quarter. Actually, in the fourth quarter, we've been taking pricing on immediate consumption packaging in Japan. So I think we're going to see an opportunity to lean a little more on the RGM lever in Japan as we continue to engage with the consumer there. In Western Europe, clearly, the basic strategy of investing in marketing, investing in innovation, leveraging RGM and driving in-store execution and value for retailers has been working in Western Europe.\n\nAs we go into the winter and going into next year, that's still going to be the push we make. The bottlers have got great momentum in execution. Of course, Europe is where there's more of the developed world inflation. Think commodities plus the devaluation of the euro, so that's feeding through.\n\nAnd so we're likely to have to lean heavier on RGM in Europe in the next 12 months, backed up by the marketing, innovation, and execution. And then Latin America, a lot of work over the last number of years with the long-term relationship model. Bottlers there have good momentum. Clearly, it's one of our strongest regions.\n\nWe lost a little share in the beginning of the year. They're very focused on getting that back, obviously, starting from a high bar. And I think perhaps, overall, it would be worth commenting that, obviously, in COVID, we took a number of what were difficult decisions at the time, slimming down the portfolio, changing the marketing model, changing the organizational model for the company. We've got that done and stood up.\n\nAnd I think now we're reaping the benefits of us being able to drive growth with a more agile organization ourselves. Combined with really strong and aligned bottling partners. We've driven growth this year, and we're well set up next year. I mean just to cap it all, we had a global system top to top with a number of the bottlers a few weeks ago, and I think everyone is ready and energized for what's ahead.\n\nOperator\n\nOur next question comes from Kaumil Gajrawala from Credit Suisse. Please go ahead. Your line is open.\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nHi, guys. Good morning. Can you talk a bit about fixed versus floating debt and how that might impact both your cash balance and your interest expense in the coming year?\n\nJohn Murphy -- Chief Financial Officer\n\nSure. Kaumil, thanks for the question. Yes, as you know, we manage our funding through -- with an eye toward liquidity risk and with a multiyear lens, and have done that for many years. We've -- through COVID, I think we've talked about we've pushed our age of our debt out a number of years, and we do have a mix of fixed and floating.\n\nMost of the floating is in euro, and so we will wait and see what the ECB does over the coming months to have a clearer picture on the impact for 2023. But I think it's an area that we'll provide more detail on in February, subject to the development by the Fed here and by ECB over the coming months.\n\nOperator\n\nOur next question comes from Bonnie Herzog from Goldman Sachs. Please go ahead. Your line is open.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nAll right. Thank you. Good morning. I have a question on your commodity inflation.\n\nJohn, you touched on this, but hoping you could help frame the commodity inflation expectation next year. You mentioned another year of expected growth, but is it realistic to expect this growth might be more modest versus this year, possibly in the mid-single-digit range, given some of your commodities peaking as well as hedges you have in place? And then I guess I'm asking in the context of the pricing environment and whether you think it's likely that ongoing price increases maybe won't need to be as aggressive and we might actually see a step-up in promotional spend to ensure price points for consumers are affordable. And then if so, is it realistic to expect a better balance between price/mix and volume growth next year? Thanks.\n\nJohn Murphy -- Chief Financial Officer\n\nA lot of questions, Bonnie. Let me start with the commodity point and our outlook for the year ahead. As I said at the -- I think in answer to the first question, there are a lot of variables in that equation. And indeed, the variability with some of them is maybe even broader.\n\nWhen I think about the cost environment, not just the commodity environment, I think about both our commodities, the commodity pressures that we have within our business and the noncommodity pressures that we have. And so as we look at '23 on the commodity front, we are rolling off some very favorable hedges that we were fortunate to have this year. And it's still -- in our mind, it's still unclear as to how commodities will trend over the next 6 to 12 months. So we'll have more visibility on that when we get to the call in February.\n\nWith regard to the non-commodity items, just within that, you've got a bucket of different topics -- freight, logistics, the transportation in our finished goods models and the overall wage environment. And we have to take into account that the wage environment is not the same everywhere, and indirect impacts on supply chain pressures. As we think about the supply chain, it's important to not just have efficiency as a metric, we also need to make sure that we have continuity. We have, for the short and longer term, and we're able to manage -- many of the pressures that I think we've talked about on previous calls, manage those effectively.\n\nSo there's a lot going on inside of the cost of goods line. And hence, I think it's better for us to just provide you with how we're seeing it overall, and we'll come back in February with more specifics. And to your second question on ongoing price increases, I think it links back to some of James' comments earlier. The name of the game is to optimize our revenue equation over the next 12 to 18 months.\n\nThat's going to be a combination of smart pricing, understanding the mix, both from a channel and package perspective, and being able to utilize the many levers that we have inside of the RGM toolkits that our bottlers have. So again, I think at this stage, it's still early to say what the exact numbers will be for each of those topics. But I think the broader point is that the top-line momentum that we've enjoyed here today, that we see continuing to hold through the rest of the year, is something that we expect to be able to generate into 2023.\n\nOperator\n\nOur next question comes from Chris Carey from Wells Fargo. Please go ahead. Your line is open.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nHi. Good morning. So just following up on that. I think it's pretty well-established price/mix versus volume algorithm will probably be more skewed to price/mix next year again.\n\nThis could be for James or John, but is it fair to assume that the rate of pricing is likely to be a bigger percentage of the price/mix equation going forward as we lap the recovery and the away-from-home channel and some other channel mix dynamics? And then just connected, James, it's been harder to see the underlying rate of pricing this year relative to the price mix. Can you just remind us your philosophy for the rate of pricing to track inflation, and whether you believe your business is close to satisfying that objective today and perhaps how much room you have? Thanks a lot.\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nYeah, Chris. I think, yes, clearly, it's likely that next year price/mix will run ahead of volume in a similar way it has this year. I mean our long-term growth algorithm has assumed a relative balance between price and mix. Clearly, at the moment, we're in a period where there's more price/mix than there is volume, and that seems that seems likely to continue into next year.\n\nIt is also true that this year, there has been some benefit from the channel mix on the reopening. The reopening benefit that was obviously a reopening cost in the previous year in price/mix is now largely done. And so that kind of tailwind won't be there last -- next year. Are all the channels away from home completely reopened? No.\n\nBut the remaining kind of sliver is either a function of closed outlets or something that's going to take a while to come back. And of course, some of the mobility restrictions in places like China, which I think also won't snap back certainly in the first half of next year. So the away-from-home of price/mix won't be the tailwind next year. And so in that sense, yes, we'll be very much back to it's all about what's the rate and what's the benefit from all the RGM strategies, whether to drive affordability or to offer premium categories or package sizes, and that's what will be the primary driver going into next year.\n\nOperator\n\nThe next question comes from Andrea Teixeira from J.P. Morgan Chase. Please go ahead. Your line is open.\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nThank you. Good morning. I wanted to go back to John's comment on growing EPS in dollar terms next year. And along with that, James, you mentioned that you're looking at pricing above algorithm, which makes sense.\n\nBut given the volume loss, I was just hoping if you can comment, in general, as we stand right now, that operating income would probably grow faster than EPS in order to absorb some of the unfavorable hedges and any issues in the financial expenses. Is that the way we should be thinking of next year, to a more muted EPS growth? Or you still think you can grow above low single next year in EPS?\n\nJohn Murphy -- Chief Financial Officer\n\nSo, Andrea, thanks. I'll take that. As we said on the earlier, I think it's too early to get into those specifics for next year. I think the way to think about the year ahead is I think it's going to be another year out of our typical algorithm.\n\nWe continue to build greater visibility around how -- what to expect in the -- particularly in the first half of the year when we'll be looking for that fast start. What each line item of the income statement looks like is -- it's just too early. We'll come back in February with that detail. I think the key takeaway is that as we sit here, we do see a path to generating U.S.\n\ndollar EPS growth in 2023. As I said earlier, there's many variables to bring that path to fruition. And we know that top-line driven, smart investments and effective management of our cost structure, those three will deliver. And below the operating income line, as I said, there's a lot that still needs to play out in the next few months to give you a clearer picture on what to expect.\n\nAnd we'll come back in February with that detail.\n\nOperator\n\nOur next question comes from Carlos Laboy from HSBC. Please go ahead. Your line is open.\n\nCarlos Laboy -- HSBC -- Analyst\n\nYes. Good morning. Some of the benefits of the new Latin American LCRM are obvious, like faster revenue growth, higher ROIC for the bottlers for the system, really clarity of profit splits. But can you expand on some of the less obvious but important benefits that are important to you, James?\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nSure. Thanks, Carlos. I mean, clearly, this is a feature of particularly the Latin American system. We're using similar models in conversations around the world.\n\nThey're built on many years of working together collaboratively in Latin America. And then other than some of the features that you mentioned, I think what's really kind of less visible perhaps is its ability to speed up the rate at which actions or decisions and actions are taken by the system. And so it has provided a stimulus to really focusing in on getting to grips with some of the nausea problems and to moving with speed and simplifying the decision-making progress in a whole series of areas, particularly those that have been kind of slower historically. Some of the stills business models come to mind, particularly as it relates to Latin America.\n\nAnd that will ultimately feed through to, as I said, speed of decision-making, which then needs better marketplace actions, whether that be marketing, innovation, RGM or execution. And I think the system in Latin America is very energized and building on their historic great position and set for further momentum going forward.\n\nOperator\n\nOur next question comes from Rob Ottenstein from Evercore ISI. Please go ahead. Your line is open.\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nGreat. Thank you very much and terrific results. I was wondering, James, if you could drill down a little bit more on what's going on in emerging markets and the emerging market consumer. We were a little surprised by the results of China looking to be maybe a little bit more, do a little better than we had modeled given the lockdowns.\n\nSome of the other emerging markets, a little bit weaker than we would have thought. So I guess the question is, are -- is local competition a problem? Is it demand? Is it too much pricing? And obviously, it depends market by market. But if you could give us some sense of what is going on in the major emerging markets, that would be helpful. Thank you.\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nSure. I'm not sure which ones you're putting in the bucket of weaker, but let me do a little walk around some of the emerging markets. We had good results we feel in China for the quarter. I mean we had good growth overall for China, notwithstanding some of the mobility restrictions that came in the whole raft of cities.\n\nSo China remains a good long-term opportunity. We have a good business there, good bottling partners, and there was some resilience to the business in the quarter. Just keeping with the Asian theme, India had a knockout quarter. Clearly, they're having a very strong run this year.\n\nLots of growth in India, really powering forward. Very pleased with that. Looking, of course, to extend that into the future. Probably won't be a straight line, but certainly looking to continue to invest strongly in India.\n\nThe rest of ASEAN, there were some pluses and minuses, but generally positive. If I switch to Africa. Africa you've heard me talk in the past that it's always a rollercoaster. There was a little bit of rollercoaster in the quarter.\n\nBut overall, we had good growth in those markets we were focused on. There was growth that was ultimately pretty broad-based, whether that was South Africa or elsewhere. It would be worth noting that this quarter, remember, we made a switch in our franchise partner in a number of territories across Africa. So we brought to a close our relationship with BGI, the Castel Group, in a whole raft of African markets.\n\nAnd some of them we had partners ready to go, and some of them we're still working on it. So there is a transition loss of volume in those ex-BGI territories where we ceased that partnership. And so that weighs on the Africa number. And then as you keep going around the world, obviously, Latin America had a good quarter.\n\nAnd then I think the last one I'm really missing is a bit of Eurasia. And there, we had a pretty decent quarter. We had growth in Turkey, which is an important market to us, and a number of other of the Central Asian markets and the Middle Eastern markets. Obviously, those ones that are -- tend to have resources or oil exporting countries tend to have done better than the heavily oil-importing countries, so the Middle East is better than Egypt.\n\nOf course, remember that the EMEA numbers have the dropout of the Russia business.\n\nOperator\n\nNext question comes from Charlie Higgs from Redburn. Please go ahead. Your line is open.\n\nCharlie Higgs -- Redburn Partners -- Analyst\n\nHi, James and John. Hope you're doing well. So we're a year now into the reformulation of Coca-Cola Zero Sugar. And to cap it off, we've seen 11% volume growth and double-digit growth in developed markets.\n\nSo James, just wondering your opinion on Coke Zero, how it's gone since the relaunch. And then also just looking into 2023, does your approach to innovation changes, that we think we're going to enter a weakening consumer environment? Thank you.\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nYeah. Sure. Look, super happy with Coke Zero Sugar. We have been investing behind it for a good number of years and have been driving double-digit Coke Zero Sugar volumes for many years in a row.\n\nAnd obviously, that's getting really material, including strong double-digit growth in the U.S. So very pleased with the reformulation update. Of course, we continue to bring new marketing and new innovation to Coke Zero Sugar and it's going to be a big focus of what we drive going forward. On innovation, as it relates to 2023.\n\nI mean, yes, there will be a kind of bias shift in the mix of the innovation for 2023. If one of the imperatives remains affordability and to kind of anchor price points, at the low end of the actual dollar outlay, then clearly, package innovation takes a bigger role in that sort of environment, whether it be smaller packages, whether it be the returnable packaging. Big investments going in by the bottling system in returnable packaging to help the affordability strategy. So in a kind of purchasing power pressured year for the consumer, we expect innovation to be slightly heavier on the packaging side, particularly to drive affordability.\n\nBut of course, that will also have its other side of the coin which is to try and ensure there are some perhaps more premium options for those that still have plenty of disposable income. Not everyone will have exactly the same effect in this period. So likely to see continued push, for example, in the U.S. on small cans or sleek cans to really stretching out the pricing ladder, not just putting all the bets on the affordable end.\n\nAnd we will continue with the brand and the product innovation. I don't know if you went to the NACS. There was a lot of innovation on show -- the Convenience Store Conference for the North America, there was a lot of innovation on display there, both package and product. And so we will be approaching '23 with a broad innovation agenda, but with some slight weighting to packaging to stretch on the price ladder.\n\nOperator\n\nOur next question comes from Peter Grom from UBS. Please go ahead. Your line is open.\n\nPeter Grom -- UBS -- Analyst\n\nHey. Good morning, everyone. Hope you're doing well. So I guess I wanted to circle back to '23 guidance.\n\nAnd I guess what I'm trying to understand is the company's long-term algorithm has largely embedded some operating leverage over time. And maybe I'm just reading too much into this, but there was just a lot of emphasis throughout the call today that next year will be a top-line-driven year. And so I guess based on where things stand today, should we expect underlying growth from a top line and operating profit perspective to be more aligned versus what's embedded in a long-term algorithm? Again, I could be misinterpreting the emphasis, but if that's correct, it would imply very strong top-line growth in order to deliver U.S. dollar EPS growth.\n\nThanks.\n\nJohn Murphy -- Chief Financial Officer\n\nThanks for the question. And just to maybe to reiterate, the difference, I think, between the long-term growth algorithm and what may be coming at us over the next year or so, I think it's going to be somewhat out of algorithm, given the various factors that we have discussed on the call and indeed have discussed throughout the year. So at this point in time, I think it is too soon to give you line-by-line guidance. But we continue to see a path to generate U.S.\n\ndollar EPS growth in 2023, and that will be -- will need to be driven from the top line. The cost pressures are there. We're very aware of them. We talked about the currency outlook.\n\nAnd so we still think when you put all the pieces together that we have that path. But we'll have a lot more coming at us over the next three to four months. And in February, can give you a more granular breakdown of how we expect to get there.\n\nOperator\n\nOur last question will come from Bill Chappell from Truist Securities. Please go ahead. Your line is open.\n\nBill Chappell -- Truist Securities -- Analyst\n\nGood morning and thanks for squeezing in. Just I guess a question on some of the competitive response or individual markets. I mean everything you've talked about today has certainly been positive. And I guess, any of the setbacks have been kind of attributed to macro issues.\n\nAre there any areas where you're worried about where there's been a competitive response, where you need to step up, be it on a product or an individual country? Or is it really just there's just so much momentum and anything else is just macro related?\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nIt would be a particularly delusional position to, say, I'm not worried about anything. That would be very weird. But clearly, we have -- it's a competitive industry. There are a lot of good competitors, big and small.\n\nSo we absolutely worry what they're up to. We always take it from satisfying the consumer and the retailer point of view. We're not chasing the competitors, we're chasing the consumers and the retailers. And certainly, there, we could point to a set of things where competitors have done well, and that calls attention to us to whether we are really doing everything we can to satisfy the consumer or the retailer.\n\nI think one obvious example is in sports drinks advanced hydration in the U.S., where this year, our competitors are coming off having a whole series of supply chain challenges last year. And that's -- we had a great year last year, and we've had a not-so-great year this year and we're also obviously in the transition of taking on the Bodyarmor. But the U.S. bottle is very energized about the Bodyarmor and Powerade plans going forward.\n\nA lot of innovation on the brand, on the product, on the packaging setup, so we'll be back. I mean -- but it's -- what guides us is are we satisfying the consumer and the retailer.\n\nOperator\n\nLadies and gentlemen, this concludes our question-and-answer session. I would now like to turn the call back over to James Quincey for any closing remarks.\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nThank you, operator. So just in summary, third quarter results, I think, exemplify how we're executing and winning in the marketplace. It's been driven by the work we've done as a system and the transformation we've undergone over the last few years. We are a more resilient business, and we're committed to delivering long-term value for our shareholders and stakeholders.\n\nAnd thank you for your interest, your investment in our company, and for joining us this morning.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTim Leveridge -- Vice President of Investor Relations, Financial Planning, and Analysis\n\nJames Quincey -- Chairman and Chief Executive Officer\n\nJohn Murphy -- Chief Financial Officer\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nDara Mohsenian -- Morgan Stanley -- Analyst\n\nLauren Lieberman -- Barclays -- Analyst\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nNik Modi -- RBC Capital Markets -- Analyst\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nCarlos Laboy -- HSBC -- Analyst\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nCharlie Higgs -- Redburn Partners -- Analyst\n\nPeter Grom -- UBS -- Analyst\n\nBill Chappell -- Truist Securities -- Analyst\n\nMore KO analysis\n\nAll earnings call transcripts"
}