{
  "companyName": "Patria Investments Limited",
  "companyTicker": "PAX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/patria-investments-limited-pax-q2-2022-earnings-ca/",
  "content": "Patria Investments Limited (PAX 0.51%)\nQ2 2022 Earnings Call\nAug 09, 2022, 9:00 a.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the Patria Investments second quarter earnings conference call. [Operator instructions] Please be advised that today's conference call is being recorded. I will now turn the conference over to your host for today, Josh Wood, head of shareholder relations. Please go ahead.\n\nJosh Wood -- Head of Shareholder Relations\n\nThank you. Good morning, everyone. And welcome to Patria's second quarter 2022 earnings call. Joining today, our chief executive officer, Alex Saigh; and our chief financial officer, Marco D'Ippolito.\n\nEarlier this morning, we issued a press release and earnings presentation detailing our results for the second quarter, which you can find posted on our investor relations website at ir.patria.com or on Form 6-K filed with the Securities and Exchange Commission. Any forward-looking statements made on this call are uncertain, do not guarantee future performance and undue reliance should not be placed on them. Patria assumes no obligation and does not intend to update any such forward-looking statements. Such statements are based on current management expectations and involve inherent risks, including those discussed in the risk factors section of our latest Form 20-F annual report.\n\nAlso note that no statements on this call constitute an offer to sell or a solicitation of an offer to purchase an interest in any Patria fund. As a foreign private issuer, Patria reports financial results using International Financial Reporting Standards, or IFRS, as opposed to U.S. GAAP. Additionally, we will report and refer to certain non-GAAP industry measures, which should not be considered in isolation from or as a substitute for measures prepared in accordance with IFRS.\n\nReconciliations of these measures to the most comparable IFRS measures are included in our earnings presentation. On headline metrics, Patria generated fee-related earnings of $31.1 million in distributable earnings of $29.2 million or $0.20 per share for the second quarter of 2022. We declared a quarterly dividend of $0.169 per share payable on September 16 to shareholders of record, as of September 2. With that, I'll now turn the call over to our chief executive officer, Alex Saigh.\n\nAlex?\n\nAlex Saigh -- Chief Executive Officer\n\nThank you, Josh. Good morning, everyone. And we appreciate you joining us this morning. In the second quarter, Patria continue to execute on both 2022 financial targets, as well as long-term strategic growth plan, despite the difficult backdrop across global financial markets.\n\nWe remain on track for our 2022 full year fee-related earning guidance of 50% year-over-year growth, having delivered $63 million of fee-related earnings in the first half of the year, after generating $0.44 of distributable earnings per share and cumulative dividends of $0.37 per share through the second quarter. We are delivering an annualized yield of more than 5% in 2022, based on recent share price. We had $764 million of new capital inflows across the platform, putting us over $2.2 billion for the first half and more than halfway of our $4 billion fundraising target for the year across a diverse range of products in each of our verticals. We deployed about $650 million in our drawdown funds to drive continued fee revenue growth.\n\nOur total assets under management and fee earning AUM are up 66% and 126%, respectively, compared to one year ago, illustrating the expansion and diversification of our platform. In the short time, since our IPO, we're also focused on building our base of permanent capital, having grown to more than $1 billion or 6% of total fee earning AUM in a priority of new initiatives in real estate and infrastructure, with a significant opportunity to scale and consolidate. Over 20% of new capital coming into the platform so far this year is permanent capital. Turning now to highlights across our strategies.\n\nOur biggest story of the quarter was the announcement of our acquisition of VBI to anchor our real estate platform in Brazil. And we recently closed on the first tranche of the transaction for 50% ownership. This transaction is crucial step, as we look to build out the real estate vertical, bringing an experience and proven leadership team and over BRL5 billion or more than U.S. $1 billion in a very high-quality AUM, where more than 70% is of permanent capital.\n\nIn a Brazilian REIT market that has grown up more than 20% over the last five years and is still underpenetrated. VBI has grown even faster to become one of the largest independent players in an asset class that is the key gateway to alternatives for many local investors. With VBI as a core, we believe we are now well-positioned to grow our real estate business in Brazil in a meaningful way, and potentially replicate the strategy in the other Latin American countries. In Private Equity, we made our first deployment for our next vintage fund allocating $450 million to launch the first thesis in that fund.\n\nWe are highly focused on our fundraising efforts with additional closings expected in the back half of 2022, and then finishing in 2023. And we continue to feel good about our targets. We also expect to hold the first closing of our new growth equity fund here in August, at a time when market dislocations represent great opportunity in the space. Since our funds are largely denominated in U.S.\n\ndollars. The strengthening of the dollar relatively to global currencies contributed mostly to the valuation impact in the quarter. Why we, of course, see some impact from public company holdings and comps in our quarterly evaluations, our overall portfolio, comfortably outperform Brazilian and Latin America public equity markets in the quarter, and we continue to lean forward with confidence on the quality of the portfolio. Private Equity Fund V and VI continue to deliver strong net IRRs at 24% and 16%, respectively, in U.S.\n\ndollars. Year-to-date portfolio company EBITDA is growing at a healthy 18% organically and 36%, including M&A. And we do not see deterioration in our overall business plans and target exit values. We remain very active within the portfolio.\n\nHaving now signed 18 M&A transactions so far this year, with at least as many targeted for the second half. In infrastructure, we continue to accelerate toward the allowance of infrastructure fund 5 as Fund 4 near the end of its investing cycle. In the second quarter, the acquisition of nine hydropower assets drove incremental deployment of approximately $200 million from Fund 4. Just recently, we announced fundraising of nearly BRL200 million for our second core infrastructure fund, which adds more permanent capital AUM.\n\nAnd we will jointly invest in these hydro assets. This fund continues to build on our income focus core offering and provides better access for local investors in Brazil. Given the acceleration we have seen in the flagship fund timeline, we now expected dedicated renewable spool of capital to be raised as a sidecar with infrastructure Fund V, as it would not make sense to raise a separate fund concurrently. We continue to see demand to scale the combined size by 50% relatively to infrastructure Fund 4, given the extensive and attractive pipeline to address in the region.\n\nThe existing infrastructure portfolio continues to perform very well with the latest two vintages delivering 28% and 12% net IRRs in U.S. dollars. Second quarter valuations were up to $135 million, excluding currency impact, driven by investments in a renewable energy, data centers and toll roads. Turning into credit, despite a tough quarter for the asset class across the globe, the Moneda high yield credit strategy outperforms its benchmark by more than 400 basis points in the second quarter and now 700 basis points year to date.\n\n600 basis points of that outperformance is attributable to selectivity or the team's ability to pick the best performing assets with the remaining a 100 basis points attributable to actively shortening the duration of the fund. Both high yield and investment-grade credit yields in Latin America are among the highest in the world with Moneda's high yield fund currently delivering an impressive 12.3% yields at the end of July. Our in-house bottom-up credit analysis shows that Latin American corporates face low refinancing risks, with very reasonable liquidity and falling leverage, demonstrating that even at this yield levels, there is no expectation of credit defaults compared to other emerging markets. With highly active management, our team can swiftly react to the environment to the opportunistic and take advantage of miss pricing relative to the fundamentals.\n\nWe also saw the recent announcement of a key BRL500 million anchor commitment for our new infra credit fund, as we seek to ramp efforts on that fund in the back half of the year. This fund will have a closed end drawdown structure like our flagship funds, and we'll seek to capitalize on the credit size of the sizable infrastructure opportunity that I referenced just a moment ago. In public equities, although macro certainly impacted absolute returns in the quarter, there is also clear demonstration of portfolio quality with our more Constructivist Chilean Small Cap strategy outperforming its benchmark by 1,400 basis points in the second quarter. Now zooming back out, the first half of 2022 brought challenging conditions to every corner of the investment world, driven by a combination of persistent inflation, rising interest rates and disruption of trade, it comes as no surprise that global equity and credit markets had a tough quarter.\n\nPatria and our peers are not immune to some of the short-term impacts of this environment, but importantly, it does not define our success. As fundamentally long-term investors, we are confident with the alternative asset management industry, we continue to be a model of resilience, secular growth, and excess returns. Our business model is built to be patient and opportunistic and not just to weather these storms, but to do some of our best work in times of this location. Within our industry, we also believe Patria differentiates itself in some very interesting and attractive ways in the current environment, and I want to spend just a few minutes reinforcing some of those points.\n\nFirst, the default assumption about rising interest rates is that returns in private equity portfolios will be squeezed by the higher cost of leverage. Put simply, Patria's private equity business is not running the traditional LVA model and does not depend on leverage to drive transactions or target returns. It has simply never been practical operating LBOs in our region of the world. In developed markets, private equity net debt-to-EBITDA ratios averaged near five times at the time of acquisition, compared to just 0.4 times historically for Patria.\n\nOur strategy generates assets through consolidation, organic growth and operational improvement and eventually multiple expansion. As we de-risk an institutionalized businesses to create market leaders. In our infrastructure business, leverage is typically in the form of project finance with a debt fixed and structured alongside long-term revenue contracts. And in credit, our exposure to predominantly floating-rate debt minimizes risk and even allows us to benefit from rising rates.\n\nSecond, focusing in Latin America, Patria has operated and grown its platform amid high interest rates and inflation since our inception. And the environment today does not feel like an exception to us. Our investment strategy has been forced over the years of experience, now entering our seventh vintage for private equity and fifth for infrastructure with many lessons learned. The result as an investment portfolio focus in core basic needs sectors that we can whether persistent inflation and GDP volatility, thus outperforming through economic cycles.\n\nThird, we think Latin America continues to look well-positioned as a destination for global capital in the current backdrop and especially within allocations to emerging markets. The region is a net exporter of commodities that are in high demand, and we believe the resulting gains in terms of trade will continue to be an economic tailwind. Latin America has historically demonstrated both low geopolitical risk and a comparatively low correlation with the U.S. and developed markets.\n\nAnd right now, the region is likely near the peak of its monetary tightening cycle compared to the U.S. and Europe. Therefore, it is no surprise that the expected economic growth is being revised upwards in Latin America and downward in developed countries. Finally, there are significant benefits of scale in our industry, and these apply at the regional level as well.\n\nLatin America and emerging markets present distinct challenges relative to developed markets, and we believe Patria has a real home field advantage. We offer a compelling combination of profit scale and localized industry expertise with the scale allowing us to pursue complex projects that smaller local competitors cannot and the boots on the ground, providing a competitive advantage that large global players would find hard or inconvenience to replicate. We are able to deliver on our regional consolidation strategy with three M&A transactions now to date, in large part because of our people, the strength of our brands and our public equity currency. As a firm, we believe Patria's uniquely positioned to thrive as the dominant alternatives manager focused in Latin America and our story is only in its early chapters.\n\nLet me now turn things over to Marco to cover the results in more detail. Marco, over to you.\n\nMarco D'Ippolito -- Chief Financial Officer\n\nThank you, Alex, and good morning, everyone. Patria's financial results for the second quarter reflect our continued track toward our 2022 guidance. Fee-related earnings were $31.1 million in second quarter '22, up 76% compared to second quarter '21, driven by organic growth in private equity and infrastructure, as well as the addition of Moneda. On a year-to-date basis, fee-related earnings of $52.9 million were similarly up 80% from the prior year-to-date period.\n\nThe FRE margin was 56% in second quarter '22 and a similar 57% year to date, tracking in line or slightly above our guidance for the year. Driving the FRE growth, fee revenues of $55.6 million in the second quarter '22 are up 73% from second quarter '21. And year to date, fee revenues of $110.6 million are up 76% from last year. On a year-to-date basis, about 25% of that 76% growth is organic and driven by deployment of $2.5 billion from the flagship funds in 2021 and the remaining 51%, driven by the acquisition of Moneda.\n\nYear to date, accrued incentive fees, which are accrued in certain credit and public equity funds and mostly realized at year end stood at $4.9 million at June 30, slightly up from $4.2 million at March 31, due to benchmark outperformance despite the challenging quarter. Personnel expenses were $15.7 million in second quarter '22, up 55% from second quarter '21 and $30.8 million year to date, up 51% from the prior year-to-date period, driven mostly by the addition of Moneda's team. On an organic basis, year-to-date compensation increased by just 4% compared to the prior year-to-date period. Administrative expenses were $7.4 million in the second quarter '22, up from $3.8 million in the second quarter '21 and $13.9 million year to date, up from $6.2 million in the prior year-to-date period.\n\nWhile some of this increase is also driven by the addition of Moneda, we did have organic increase in areas like professional services and IT due to new public company-related expenses, as well as increase the T&E, as teams resume more normalized travel activity as pandemic restrictions fade. Placement costs of $2.9 million year to date are up from $1.2 million in the prior year-to-date period due to increased fundraising activity as expected. These costs are generally amortized over the relevant investment period of each fund being raised. Net financial income was a negative $0.8 million in the second quarter '22, driven primarily by unrealized impact from currency on our balance sheet investment in the quarter.\n\nOn a year-to-date basis, net financial income stands at $4 million. Distributable earnings of $29.2 million in the second quarter '22, compared to $74.2 million in the second quarter '21, with the difference attributable to the benefit of performance-related earnings of $56.4 million in the second quarter '21. DE per share of $0.20 in the second quarter '22 will generate a dividend of $0.169 for shareholders. And year to date, our DE per share of $0.44 has generated cumulative dividend of $0.37, which would equate to a feel of more than 5% on our recent share price.\n\nThe reconciliation of distributable earnings to IFRS net income is fairly consistent with the schedule from last quarter, with most amounts attributable to acquisition-related costs. The amortization of intangible assets is rising, primarily due to the inclusion of impact from Kamaroopin. The notable addition to the reconciliation is cost related to our recent SPAC listing. These costs are recognized in IFRS and amortized over 15 months and will be adjusted from the DE in these initial periods, but later recognizes through [inaudible] as an offset to the sponsor promote at the point of realization.\n\nNet accrued performance fees stood at $419 million at June 30, compared to $503 million last quarter, but still up 28% from one year ago. The U.S. dollar strengthened significantly against nearly all global currencies in the quarter, driving relative local currency depreciation, these accordingly impacts the USD fund valuations in the quarter, along with the general weakness in Latin American equity markets. While the accrual can, of course, retrace in volatile quarters like this, we continue to feel very confident in the quality of our portfolio, as Alex noted.\n\nThe current accrual stands at nearly $3 per share, which is significant relative to our current share price. Turning to AUM. Total AUM was $26.3 billion at June 30, down from $27.6 billion last quarter due to currency and valuation headwinds in the second quarter, but up 66% from $15.8 billion one year ago, demonstrating the growth in our platform. Total AUM is up 10% year to date, driven by strong depreciation in the first quarter and the acquisition of VBI.\n\nNote that we have closed on the first tranche of our transaction with VBI and included in our reported AUM. Economics for our initial 50% stake will be affected for the full third quarter. Despite macro environment, inflows have been strong in the first half of '22, nearly $2.3 billion of inflows year to date, not including the acquired inflow from VBI puts us halfway to the $4 billion fundraising target for the year. We expect a diverse contribution in the second half of the year, led by private equity and credit products, including the pending anchor commitment for infra credit, which has not yet been recognized.\n\nOn the upside, we also have a reasonable chance to be approaching a first close for our next infrastructure fund around the New Year. Fee earning AUM of $18.8 billion at June 30 is similar to the prior quarter as deployment for the first half of 2022 only activates for the second half of the year. Fee earning AUM is up 126% from $8.3 billion one year ago and up 5% year to date. We deployed about $650 million from our flagship funds in the second quarter '22, which will accrue to fee earnings AUM for the second half of the year.\n\n$450 million came from the first pieces in our new vintage private equity funds, though a typical fee holiday for first closures will apply. Additional closing for debt fund in the second half of the year, however, we'll have a retroactive catch-up to July 1 on this capital that has been invested. As Alex noted, our 2022 financial guidance for the year remains consistent. We expect to grow FRE by at least 50% year over year.\n\nWe have generated $63 million in FRE throughout the second quarter. And considering any growth in the second half of the year, plus the realization of incentive fees at the end of the year, we feel very confident in achieving our target. It bears repeating the benefits of long-term capital and sticky management fees allow us to generate reliable fee-related earnings for our shareholders. Since our IPO, we have doubled the basis of fee earnings AUM that generate those earnings, and that growth is ongoing through the organic scaling of our flagship funds, new fund launches and M&A.\n\nThose fee-related earnings are generating and the annualized yield of approximately 5% on our current share price, and that is just the baseline. Strong investment performance in our flagship fund has generated a performance fee accrual that is still untapped. With the 2014 and '15 vintage funds, in particular, representing significant earnings upside as realizations materialize over the next few years. We continue to execute on our journey as the premier alternative asset management platform in Latin America, and we believe Patria can deliver premium shareholder value in the coming years.\n\nWe're now happy to take your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Craig Siegenthaler of Bank of America. Your line is open.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nCan you guys hear me OK?\n\nAlex Saigh -- Chief Executive Officer\n\nYeah. We can hear you. Good morning.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nRight, perfect. We want to get an update on fundraising. The denominator effect and a crowded private equity backdrop, they are creating some challenges in the U.S. But Patria, I believe, is competing within a different sleeve of capital.\n\nAnd in your vertical, emerging market private dollars and now more restricted to two of the biggest economies, Russia, and China. So what type of impact is all this having on Patria, just given that Patria is the largest private markets manager in Brazil and LATAM?\n\nAlex Saigh -- Chief Executive Officer\n\nHi, Craig. This is Alex here, and thanks for joining the call. And again, thanks for your patience here. Well, we continue to be very positive on fundraising.\n\nThat's the general message here. And we have so many processes going on. Specifically, I go from the macro and then I'll talk kind of product by product, asset class by asset class. On the macro side, yes, I think you're correct.\n\nWhat we see from investors is, number one, as it comes to emerging markets, Latin America is in an advantaged kind of phase right now, given the low geopolitical risks and the high geopolitical risks, of course, in Europe -- Eastern Europe, more specifically, and the more of territory and regime that we are now seeing in China. So that puts actually our region of the world, highlighted by investors. In addition, there's the new assuring thesis that favors the region. Also, in addition, I think the Latin America was already increasing its market share of the overall allocations within the emerging markets.\n\nAnd if you see the growth of the economies is pretty positive compared to other developed economies. So all in all, I think -- and lastly, I think also, I think some of our central banks in the region have anticipated a bit the monetary tightening. Now we're seeing that most of the central banks in the regions are already predicting a loosening up of the monetary policies and probably most of this economy will continue even to grow faster in [Technical difficulty] predicting a loosening up of the monetary policies and probably most of this economy will continue even to grow faster in '23 onwards. So in general, that's exactly what on a macros -- that's exactly what you said.\n\nI think the region has been benefiting from all this. Plus, of course, I forgot here the commodity cycle that was already a big push for the region, and in addition to all the geopolitical tensions and risks in Ukraine, etc. Commodity prices, there also drives exports in the region and also benefiting the economies. Then going for a more micro kind of administrative issues here, as you mentioned, mostly in the U.S., not other parts of the world, investors have been having to deal with so many funds coming to market.\n\nAnd of course, they are overwhelmed and what they're deciding to do, most of them are generalizing here is basically to focus on reups and definitely, we are on that list of reups given our long-standing relationship with several institutional American investors. But the process is taking a little longer because it's the same amount of people that they have in their teams. I mean, the institutional American investors, and they have to deal with more volume of funds to be analyzed. And we have received, no, I wouldn't say 0 numbers, but very, very few notes.\n\nAnd that's why I'm positive on our private XC fundraising process. Because investors just saying, Alex is going to take another month or two, I need to go down a due diligence. The firm that I work for have not allowed full travel plans yet, and the bubble and I have a lot of other funds to analyze. So again, very, very few.\n\nI'm not going to say no noes, because it's no, it's impossible to say 0 nos, but very, very few nos is just a delay in the process. But as you go through other regions of the world back, Craig, that's a different scenario. Now in the Middle East, for example, which is a major part of our fundraising efforts is in the opposite side of what I just said. The region was already under allocated to private markets in general alternatives, emerging markets LATAM.\n\nAnd as you know, now, most of the sovereign funds and pension funds in the regions are generating a lot of cash and receiving new cash because of the whole price of oil, etc., and gas, etc., going up. Asia, the same. I think, Asia's investors kind of were under allocated to emerging markets in the region and everything that I said. So Asia investors are also now increasing their allocations to the region.\n\nAnd lastly, and more so the local investors, I think we have been able to fundraise quite healthily in the local markets. We're now running as we speak two very big processes with high net worth and ultra-high network distributors in Brazil specifically. And now we have very, positive news coming from that front. So in the end, pretty positive overall cause the region has been benefiting from all these geopolitical tensions.\n\nAnd I don't -- I'm not receiving any -- very, very few noes, that just process taking a little longer. And we have all of these other regions in the world allocating more through private markets, alternatives, emerging markets in Latin America specifically. However, what also plays in our favor here is that we have other products also that are flagships in our menu offering that are coming to market in a very positive note. Marco mentioned infra credit, for example.\n\nSo the whole credit story here is very positive given now where interest rates are. And because interest rates are also higher in the region, not only globally and investors are looking to protect themselves from inflation and actually take advantage of the higher interest rates. So we did receive a very positive confirmation from anchor investors of a $100 million for our infra credit fund, which is not in the number that we gave you because they have not signed the sub docs yet, but it has already been published in their websites that they approved because it's a public institution. We also have another public institution that already approved and officially they have -- they just have to sign the papers.\n\nThey are another $150 million for the same infra credit fund. So very positive news on that front; two anchor investors, one international public institution and a local Brazilian public institution, actually sponsoring, anchoring this thing for credit fund. Also Mark also mentioned in more detail, but we are anticipating our infrastructure flagship Fund V fundraising process because investors not only, they want to invest more in LATAM, as I just mentioned, but they want to invest in products that are inflation kind of protected and that's the case of our Infrastructure Flagship Development Fund V. And what we are looking into now is to have a first close within this year, closer to December versus actually one year from now.\n\nNow we were expecting to fundraise infrastructure Fund V as of September 23, 2023. And we are looking into have a first close in 2022, late 2022, but within 2022. So having all of these different products to offer as private equity goes through this that I just mentioned. We have infrastructure coming back very healthily, and we're having reverse inquiries for our infrastructure of Flagship Fund V, which is not very common to have reverse inquiries.\n\nNow investors calling and say, when are you going to go out to the market? Because we're interested in your fund. And also the infra credit that I mentioned, which is also a closed end fund which gives us this long-dated kind of fees to our FRE expectation. So I'm, again, of course, everything that is going on, of course, that you know, you have to deal with the whole geopolitical situation that is sad in a global basis. But in our region, we are benefiting from this and of course we didn't want to benefit from the war, but we are benefiting from the geopolitical sanctions around the world.\n\nAnd you can see in our numbers $2.3 billion raise up to now with $4 billion target. So it looks -- we're pretty confident that we're going to reach target here.\n\nMarco D'Ippolito -- Chief Financial Officer\n\nAlex, if I can just ask one follow-up relating to Fund VII, Private Equity Fund VII. It looks like you raised about $900 million to date. I was wondering if you could help us in terms of time line for the next set of closes and the final close and your expectations on how big that fund will be relative to the $2.7 billion for Private Equity Fund VI.\n\nAlex Saigh -- Chief Executive Officer\n\nYeah. We are about now. We were going to have a second close, I think late July in the second quarter. But we were running these processes that I just mentioned here, with two big Brazilian ultra-high net worth and high net worth distributors now.\n\nAnd again, given where we were in the process, we went into August to grab -- they were, and it's good news, because they were pretty confident that they could raise more money. So actually, we're going to have a closing that we are expecting in the late second quarter, in the third quarter as we speak in August/September. And plus institutional money coming in in this closing. So we got some of the institutional money that we already had in the second quarter with the sub doc signed.\n\nWe know we're putting everything in this one quarter. Administratively, it's easier to have just one closing on the legal side and legal cost. So we just waited a little bit with all these sub docs that we had signed in the second quarter to join this effort that I just mentioned, that we are doing in Brazil with ultra-high net worth individuals. As far as expectations, I think our fund does say in the cover $3.5 billion, and I think we're confident that we'll get there.\n\nAnd which is larger than the $2.7 billion and normally how these funds go, I don't think I can say this, but whatever it's -- I have to say that it's $3.5 billion. But normally, looking into the past, I think I can say that looking into the past, normally our funds did not only reach, but exceed the cover. So I think that's what I can say up to now. But the cover is $3.5 billion, Craig,\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nThank you, Alex.\n\nAlex Saigh -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Marcelo Telles of Credit Suisse. Your line is open.\n\nMarcelo Telles -- Credit Suisse -- Analyst\n\nGood morning, Alex. Good morning, Marco Thanks for the opportunity. My question is with regards to the VBI acquisition. You mentioned there's very significant opportunities to leverage on that structure.\n\nSo I was wondering, this is a $1 billion asset business. How do you see that scaling up over time? And how big you think that business can be? And given the high-rate environment that Brazil is going through right now, do you think this can be an obstacle for you to scale that in a timely manner?\n\nAlex Saigh -- Chief Executive Officer\n\nThank you. I think it's -- first of all, Marcelo, nice to see you. And as you know, we're going to see each other in person next week. So looking forward to that.\n\nAnd thank you for seeing me next week in person. Well, I think taking one step back, the whole permanent capital business for us is very important. It's already 6% of our fee pay AUM, as mentioned by Marco here. And we were basically 0.\n\nIf you go two years ago at the time of the IPO, we were 1% or 2%. So we've been growing that business -- and the PPM has been growing in general, as mentioned, so have it grow more than the other asset classes to become today, 6% of the total AUM, not only real estate, but we also launched the infrastructure investment trusts that also adds to the permanent capital, 6% of the fee pay AUM. Specifically with VBI, they're pretty and very positive about it because within the permanent capital structures of our real estate listed assets in Brazil, you have several different themes and strategies, and one of them that have been growing very significantly is the debt-related thesis on the CRIs, as we call them in Brazil. And VBI did launch -- it was in the second quarter already a CRI fund.\n\nThey had one, but they did a follow-on for the fund of the CRI fund, which is real estate debt, also under the permanent capital structure and did very well. And did raise a good amount of money and they want to raise more. So if the high interest rates do affect corporate offices kind of strategy, you have the real estate debt strategies that are growing very healthily. And when interest rates come down, as I know, you see that the yield curve in Brazil is already inverted, investors are looking into a decrease in interest rates in the next, whatever, 12 months that as you can see from the inverted yield curve, then the other kind of themes within real estate will also benefit from that falling yield curve.\n\nBut in general, I think VBI has a very strong name, very expert and seasoned group of people, and we are very positive about that. In addition, we're also looking to other permanent capital structures to increase inorganically or through mergers and acquisitions like the association with VBI, not only in Brazil but in other parts of Latin America. So really targeting for that $1 billion something to reach a significant part of our AUM. Now when I look at my peers in more of a -- in a global basis, I see that 20% to 30% of their fee pay AUM comes from these permanent structures, and that's a number that I would like to hit.\n\nOf course, over time, and of course, using our cash to do acquisitions to get there faster, but that's the number that I think we can go from 6% to 20% to 30% of AUM in the future.\n\nMarco D'Ippolito -- Chief Financial Officer\n\nAnd just to add, Marcelo, I think when we released the notice on VBI, we tried to emphasize that the market is very big, about $4 billion that have been growing 28% and it's still small relative to any other developed economy. And the REIT business is what we call an entry-level alternative assets. And as we continue to believe on the financial deepening, we think that this market still has a lot of potential to grow the market, not to mention the capacity to consolidate and to replicate the strategy in other geographies. I think recently, the Central Bank indicated that the modified timing should be arriving to possibly its end.\n\nAnd we start to see some indications of -- even indications of deflation. So there is also -- there is a positive scenario looking forward, and we believe that as the market -- as the interest rates reduce, we believe that this will be cut strong. Nevertheless, I think it's important to mention, VBI closed recently on an important and raising BRL100 million, which is not added to the fee pay AUM base because it was closed just the beginning of this third quarter. So we continue to see positive trends coming from the REIT business.\n\nMarcelo Telles -- Credit Suisse -- Analyst\n\nThat's very helpful. Thank you, and see you next week.\n\nAlex Saigh -- Chief Executive Officer\n\nThank you very much.\n\nOperator\n\nThank you. Our next question comes from Guilherme Grespan of J.P. Morgan. Your line is open.\n\nGuilherme Grespan -- J.P. Morgan -- Analyst\n\nGood morning, Alex, Marco, Josh. Thank you for presenting the earnings. Our question here for the quarter is actually on -- specifically on the credit performance on the credit vertical. We saw an outflow of close to $350 million in the quarter in the segment.\n\nTo us was a little bit surprising. We would imagine that this would be a vertical that would perform better under the environment we are. But when we add up your inflows and outflows, we actually had a net outflow in the quarter. So the question is just to explain a little bit what happened if this is recurring or not? And what was the driver behind this outlook?\n\nAlex Saigh -- Chief Executive Officer\n\nWell, specifically, do you want to -- on the number specific, do you want to respond to that, Marco, on the -- and then I can talk more in general about it?\n\nMarco D'Ippolito -- Chief Financial Officer\n\nYeah, absolutely. So what we see specifically on Page 15 in our presentation at a year-to-date inflows of $392 million and now to $497 million. And let's remember that on the outflows you have to add to that also the divestment and the dividend payment. And so this is not only a reduction of AUM resulting from withdraws.\n\nWhat we see here, what I can mention about the credit business, specifically in Chile that has been some turnover related to the local investors. We've also seen a strong demand from new funds. So we've seen some investors moving along from one fund to another -- and that is very well explained on the line of inflows year to date. You see that we have about $2.2 billion of inflows in AUM over the year.\n\nAnd that's just a sign of the capacity of the platform to leverage on the fundraising of this vertical. Alex?\n\nJosh Wood -- Head of Shareholder Relations\n\nYeah. And I would just -- this is Josh. I'll just add of the $345 million outflows in the quarter, to Marco's point on dividends being included in that, about $61 million of that was dividends, just to put a number to it for you.\n\nAlex Saigh -- Chief Executive Officer\n\nYeah. I think that -- my point was exactly that. I think investors do shift some time of strategy. So we had a very, in my view, positive cash being invested into the funds of $2.2 billion.\n\nThat's a very, very strong number. Sometimes you'll see investors coming out of one fund and joining the other fund because they see a better moment that they like, a specific strategy or sub-strategy of the Moneda credit product in general. So they probably they saw already what happened with the dollar-denominated securities in LATAM. Now they see the pickup of interest rates in local Chile, and they want to shift to a local Chilean credit fund.\n\nSo -- but I think you have to look more of the general picture when you add all of these numbers, there's a very positive net inflow of cash into the Moneda funds. So again, be careful not to pick up, I think one strategy specifically. And if you have the money moving to other strategies, but the net general inflows were positive for the quarter and the semester. Thank you.\n\nGuilherme Grespan -- J.P. Morgan -- Analyst\n\nSuper clear. Thank you, guys.\n\nAlex Saigh -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from William Baranjard. Your line is open.\n\nUnknown speaker\n\nThanks for hosting the call. So my question is a follow-up actually of Craig's question regarding demand in the current environment. So among your range of products, which products do you see a higher demand now? Is it mostly the infrastructure products, as you said before? And then more broadly, how do you see the evolution of your total AUM for the next quarters?\n\nAlex Saigh -- Chief Executive Officer\n\nYeah. I think we, in general, for inflation protected and credit products are more involved in general. However, I think that things are shifting over the last quarter to equities as investors are beginning to realize that we might have hit the bottom as far as these public equities valuations are concerned. But yes, if you look into our menu of products, I think we continue raising -- continue to be positive about our private equity 7.\n\nOur growth equity, private equity growth we're having a first close as we speak in the month of August, early September. So it continues to do well, continues to show very positive signs that we will hit the numbers that I mentioned, answering Craig's question of the $3.5 billion cover for Private Equity Fund VI. We're raising $200 million, and we should have a first close, which is around 40% of that, which is [inaudible] as we speak. So that on the equity side.\n\nThe infrastructure side, even more so, we're getting reverse inquiries when are we going to come back to the market. And again, we were thinking about raising -- or beginning to raise Infrastructure Fund V, which is one of our flagship funds in September of 2023. We're looking to have a first close within 2022 -- late 2022. So it's that kind of a year in advance because inflation hedged infrastructure products are really in demand by investors and with the major investors, the main investors of our -- that supports us in our infrastructure efforts, we talk to them.\n\nAnd again, why don't we then with them do a first close as of this year. Also on the credit side, I mentioned infrastructure credit also gaining a lot of momentum. We didn't add to the numbers because the sub docs are not signed yet, but we have two important anchor commitment to this fund, a local public institution for $100 million. It's already in its website, but the sub docs are not signed.\n\nAnd an international also public institution of $150 million. So that's already $250 million for this fund. Infra credit, we want to raise approximately $800 million to $1 billion for the fund. And having two anchor investors already 25% of the fund or more is very, very positive.\n\nSo that's infra credit. Also on -- if you look at the Moneda credit products in general, so when you look at all of the Moneda credit products, a lot of money coming in because of the situation that I just explained. So -- we had this target that we established to ourselves all the way back in the IPO early '21 to raise around $4 billion organically this year in 2022. And when we did actually start, this target was late 2020 because we did go public in very early January of '21.\n\nSo late 2020, we said, look, this is our three-year plan, and we plan to raise organically $4 billion in 2022, and we plan to do acquisitions like the VBI, which adds $1 billion. We didn't have a specific number for the acquisitions, but we said that we were going to do acquisitions. And getting into 2022 and been able to have already in the first semester, $2.3 billion already raised -- so it looks like we're going to be able to hit the target of $4 billion for the year because we are over 50%, and we're half the year. And I see the year continue to grow very strongly, plus the anticipation of Infrastructure Fund V, our flagship infrastructure fund having our first close late this year, makes me feel extremely happy and confident because so many things happened and so many moving parts.\n\nAnd from late 2020 when we defined this to be able to hit the targets in '22 with all of these moving parts and the war in Ukraine and this and that and higher interest rates, blah, blah, blah, blah. So look, we will not only hit but beat the target of $4 billion organic fundraising for 2022, again, established all the way late in 2020. I'm very happy about it. And again, just remembering that we started the year with $19 billion of fee earnings AUM.\n\nSo $4 billion is 20% of increase in fee earnings AUM for the year plus the acquisitions, $1 billion right now, it will be $5 billion, which is 25% increase in fee paying AUM. So very, very strong. Plus we have -- as we grow, we have synergies. You can see that our FRE margins have been growing even after the acquisitions of and integrating Moneda, our fee earnings AUM has increased and that shows that we are continuing to be able to generate synergies from scale.\n\nSo all of that makes me pretty comfortable. Of course, you might have -- we have so many products, one product here, one product there. But in the overall scheme of things, I feel very comfortable with the fundraising for 2022. Thank you.\n\nUnknown speaker\n\nOK. That's clear. Thank you.\n\nOperator\n\nThank you. Our next question comes from Beatriz Abreu of Goldman Sachs. Your line is open.\n\nBeatriz Abreu -- Goldman Sachs -- Analyst\n\nThanks for taking my questions. My question is around net financial results, which were a negative $0.8 million this quarter, especially comparing to last quarter when it was a positive $4.8 million. You mentioned during the call that this was related to unrealized impact from currency in the balance sheet. But could you give us a little bit more color around why that is? And is there anything else that impacts this line? And a second question, if I may, is a more broader one around divestments and exit strategies.\n\nWhat are you thinking in terms of divestments for the year? Do you think that the macro environment in Latin America impacts divestments at all? If you could talk a little bit about that, it would be great. Thank you.\n\nMarco D'Ippolito -- Chief Financial Officer\n\nOK. Beatriz, when you look at the net financial income, what you're going to see there is the unrealized results from our investments. If you pay closer attention to our presentation on Page 22, you'll see that there's a line of investments that is about $24 million. So the number is basically a function of the currency impact over our investments and also the valuation impact on our investments.\n\nWhat are these investments? These are mostly GP commitment and the minority stakes in our recent acquisition. So we -- at the time of the IPO, the number was very small, and it's not meant to be very significant into our financials.\n\nAlex Saigh -- Chief Executive Officer\n\nOK. I can talk about divestments. And we're pretty positive with the divestments, Beatriz. We have been, as mentioned, I think, with a lot of our companies, the portfolio companies actually for sale, we did sell a couple of them already during this quarter from our infrastructure efforts and from our private equity efforts.\n\nAnd we have been receiving nonbinding offers at the valuations that we expected. And now we're receiving binding offers at the valuation that we expected even with -- plus a slightly notch up here vis-a-vis where we expected our marks. So everything going in my view, as planned. I think during the second half of the year, I think we will continue to be able to deliver on that, and that actually is the main engine, the main driver to push performance fees.\n\nAnd the way that we see it, I think private equity Fund V continues to do well on that front, on the divestment front, now building in the DPI or distributable paid-in capital to get into the performance fee zone. And I think we see the same thing for Infrastructure Fund 3, which, again, to our surprise, we were not expecting to get in close to the performance fee zone this year. We were expecting more to get into the performance fee zone in '23, '24. But because of some divestments that we are pursuing in our Infrastructure Fund 3, we see that we are moving in that direction.\n\nI don't see actually generating performance fee from Infrastructure Fund 3 this year. There's a chance that we can, but we were not expecting that. So it's -- we're expecting in 2023, 2024, but we are anticipating some of those divestments. And again, the nonbinding offers are -- now some of the binding offers are in line with our expectations with a slightly notch up from what we expected.\n\nWhat we see here, I think, is a question of having the good assets in the portfolio, and I think that's a consequences of the quality of our assets. We, for example, in our private equity efforts, we're selling leaders in cold logistics distribution. We are selling a leader in agricultural inputs distribution. And those are sectors very sought by investors also.\n\nWe're looking at some of -- to sell some of our healthcare-related assets and logistics -- cold logistics, frozen logistics, agricultural inputs, distribution, healthcare-related assets are very well in demand, very well sought by investors are in demand. So being in the right sector with the right asset, all of them leaders in their respective segments, of the healthcare industry, agri industry or logistics industry, I think, is the reason why we're getting strong bids from all of them from strategic investors, so most of them from strategic investments. On the infrastructure, the same and even more so because we are selling a couple of our or more than a couple, actually, of our renewable energy assets and we're having great demand for those assets, some of them in Brazil, some of them outside of Brazil. And again, the same kind of view that we are getting the processes running as expected or with a slight notch positive from our expectations.\n\nSo we should deliver good news on that front in the second semester of 2022, Beatriz.\n\nBeatriz Abreu -- Goldman Sachs -- Analyst\n\nThat's very clear. Thanks, Alex, and thank you, Marco.\n\nOperator\n\nThank you. I'm showing no further questions at this time. I'd like to turn the call back over to Alex Saigh, CEO, for any closing remarks.\n\nAlex Saigh -- Chief Executive Officer\n\nAll right. Thank you very much for your patience, and thanks for participating in our second quarter 2022 earnings call. Again, in our view, very, very positive. We are very much in line to deliver the guidance for fee-related earnings, 50% growth versus last year.\n\nWe are in line to deliver our $4 billion organic growth in fundraising. We also think in line with what we expect to do in organic growth or M&A with the acquisition of VBI already public and already announced and looking at a good pipeline for acquisitions in the second half of the year. In addition, I think I see that we are entering in a good divestment cycle and pace. I think with everything that I just mentioned here answering Beatriz's question.\n\nSo very positive about that as well. That actually then pushes us to the performance fee zone generating performance fee-related earnings. So fee-related earnings right on track to hit the 50% growth, good chances on the performance fee-related earnings. If we do these divestments, we move into the performance fee zone.\n\nOf course, as you guys know, it might slip a month here, a month there, quarter here or quarter there, but the general direction and the prices and valuations that we are getting from the nonbinding and the binding process are pretty much in line with what we expect with the notch up. And if we move into that direction, we get into performance fee zone even though, again, it might slip a quarter here, but the direction is the right direction. We didn't get any negative impact on our valuations or processes that we are divesting. So that actually then pushes us to a very strong distributable earnings growth for the year.\n\nAnd hopefully, as we move into 2022, we'll give you more good news on that front. I'm already looking into -- given that our business is so predictable, looking also already into 2023. So thank you very much for participating, and I hope to see you guys in person over the next couple of months in different meetings and conferences. And with that, I'll close the call here.\n\nThere are no other further comments from Marco or Josh. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJosh Wood -- Head of Shareholder Relations\n\nAlex Saigh -- Chief Executive Officer\n\nMarco D'Ippolito -- Chief Financial Officer\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nMarcelo Telles -- Credit Suisse -- Analyst\n\nGuilherme Grespan -- J.P. Morgan -- Analyst\n\nUnknown speaker\n\nBeatriz Abreu -- Goldman Sachs -- Analyst\n\nMore PAX analysis\n\nAll earnings call transcripts"
}