{
  "companyName": "Proto Labs",
  "companyTicker": "PRLB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/proto-labs-prlb-q3-2022-earnings-call-transcript/",
  "content": "Proto Labs (PRLB 0.75%)\nQ3 2022 Earnings Call\nNov 04, 2022, 8:30 a.m. ET\n\nOperator\n\nGreetings, and welcome to the Proto Labs third quarter 2022 earnings call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Jason Frankman, vice president and corporate controller. Mr.\n\nFrankman, you may begin.\n\nJason Frankman -- Vice President and Corporate Controller\n\nThank you, Ronan, and welcome, everyone, to Proto Labs third quarter 2022 earnings conference call. I'm joined today by Rob Bodor, Proto Labs President and chief executive officer, and Dan Schumacher, chief financial officer. This morning, Proto Labs issued a press release announcing its financial results for the third quarter ended September 30, 2022. The release is available on the company's website.\n\nIn addition, a prepared slide presentation is available online at the web address provided in our press release. Our discussion today will include statements relating to future performance and expectations that are or may be considered forward-looking statements and subject to many risks and uncertainties that could cause actual results to differ materially from expectations. Please refer to our earnings press release and recent SEC filings, including our annual report on Form 10-K, for information on certain risks that could cause actual outcomes to differ materially and adversely from any forward-looking statements made today. The results and guidance we will discuss include non-GAAP financial measures consistent with our past practice.\n\nPlease refer to our press release and the accompanying slide presentation at the investor relations section of our company website for a complete reconciliation of GAAP to non-GAAP results. Now I will turn the call over to Rob Bodor. Rob?\n\nRob Bodor -- President and Chief Executive Officer\n\nThanks, Jason. Good morning, everyone, and thank you for joining our third quarter earnings call. This morning, we reported revenue and non-GAAP earnings per share within our guidance ranges. Revenue came in near the bottom end of our guidance as strong growth in several areas of our business is being largely overshadowed by a decline in our injection molding revenue, predominantly due to the challenging macroeconomic climate.\n\nThe primary headwind in injection molding is a lower level of follow-on parts orders. These are orders for parts made from our previously purchased mold. Following significant growth in the third quarter of 2021, parts revenue decreased 17% this quarter in constant currencies and excluding Japan. As was the case in the first half of 2022, our third quarter injection molding growth rate was negatively impacted by the absence of several large parts orders that occurred last year.\n\nAdditionally, we saw fewer production parts orders in the most recent quarter due to excess inventory buildup in the market at a time when many of our customers are experiencing softening demand and elevated inflation. These macroeconomic and inflationary headwinds impact injection molding parts orders more than our other manufacturing services because injection molding has the highest relative proportion of low-volume production compared to prototyping and the highest average number of parts per order. I'm pleased to say that, by contrast, our business outside of injection molding has continued to grow double digits throughout 2022. As I have said before and still firmly believe as much as ever today, we are very confident in the competitive advantages of our injection molding service and are committed to improving our performance.\n\nLast quarter, I mentioned we were focusing our go-to-market efforts with targeted campaigns to inform and reengage customers. Other planned actions will materially expand our offering in injection molding to drive growth. Besides additional go-to-market enhancements and e-commerce user interface improvements, we're expanding our lead time and pricing options available through our digital factories. We will also leverage our manufacturing partner network to provide a more holistic injection molding service, offering parts outside of our digital manufacturing capabilities as well as additional pricing and lead time options.\n\nIn contrast to follow-on parts revenue, third quarter mold revenue was up slightly year over year in constant currencies and excluding Japan. We have planned actions in place to continue to drive this growth but recognize that we face some near-term headwinds, including macro uncertainty. Though we are disappointed with our recent injection molding parts performance, there are many areas of our business that are performing very well in a challenging operating environment. We reported yet another quarter of double-digit growth in CNC machining and 3D printing.\n\nIn particular, we are very pleased with the performance in the longer lead time portion of our CNC machining offer, where revenues fulfilled by both the digital factory and the digital network grew over 40% year over year. This is a great example of Proto Labs responding to the market and expanding our customer offering by launching a new service quickly to drive significant growth. Now, I'd like to shift away from our third quarter performance and take a few moments to reflect on the impact our business has on society. Proto Labs has many stakeholders, including shareholders, employees, customers, the communities in which we operate, and others.\n\nWe get to partner with 55,000 customers annually on very meaningful projects. Our mission is to empower companies to bring new products to market by offering the fastest and most comprehensive digital manufacturing service in the world. We empower companies to change the world for the better on a regular basis. In general, if there's an industry in which fast innovation and speed to market are vital, Proto Labs is likely heavily involved.\n\nLet me provide a few examples. First, medical devices are a great example of the impact we have on society. During the COVID-19 pandemic, we provided prototyping and low-volume production for COVID-19 test kits, life-saving medical devices, personal protective equipment and more. The world-class speed and reliability of our digital manufacturing service allowed customers to choose us to help combat one of the most severe public health and economic crises we've seen.\n\nAnd we produced over 20 million parts in response. Space exploration is another example. Proto Labs is helping NASA make a return to the moon, and a voyage to Mars, a reality. We teamed with a trio of universities in a national competition to develop technology that could someday extract water on these surfaces.\n\nNext up, electric vehicle development. Many companies are working to develop next generation of EVs and charging infrastructure, reducing global reliance on fossil fuels. In many cases, we're along for the ride as a quick-turn supplier, delighting our customers and helping to fight climate change simultaneously. My last example is sustainable energy sources.\n\nWe worked with a customer during the Department of Energy's American Made Challenge, in which entrants were tasked with finding a sustainable geothermal energy solution using U.S.-based suppliers. Our customer won that competition. Sustainability is another area in which there is a definite urgency in innovation and development, which is why many customers choose Proto Labs as a supplier. Clearly, the work we do and the parts we manufacture matter to our customers and to the world.\n\nFighting the COVID-19 pandemic, accelerating space exploration, furthering electric vehicle development, and enhancing sustainability are just a small sample of the areas in which we contribute. Proto Labs partners with customers to accelerate the advancement and betterment of the communities we live in and society as a whole. Before I provide an update on our strategic priorities, I'd like to address important third quarter business updates. First, I'm excited to announce that in September, after an extensive search process, Oleg Ryaboy was hired as Proto Labs chief technology officer.\n\nOleg was previously CTO at Digital River, a global e-commerce platform and Software-as-a-Service company that provides online storefronts. Oleg brings a wealth of knowledge and experience as he takes on the leadership of our technology teams around the world. We're very excited to have Oleg onboard, and he has already had positive impact on our business. Also in September, we launched the first iteration of our integrated offer in Europe.\n\nWe now offer CNC manufacturing for eligible parts through the combination of our internal digital manufacturing and our digital network of manufacturing partners. We began the rollout in Europe, and we'll continue to test and iterate. In the coming months, we will offer customers more expanded capabilities through the digital network, and we plan to expand the integrated offer to the Americas in early 2023. And finally, Proto Labs U.S.\n\nInjection molding facility was named the 2022 Best Plant by Industry Week, edging out finalists such as GE Appliances, Flex and others. According to Industry Week, our injection molding facility was awarded best plant as it is on the leading edge of efforts to increase competitiveness, enhance customer satisfaction and create stimulating and rewarding work environments. Now, let me provide an update on our strategic priorities for 2022. Our first priority is accelerating revenue growth.\n\nOur primary focus areas for investment in the near term are driving injection molding growth and continuing to expand our integrated offer. In other areas of our business, we're making great progress on accelerating growth. CNC machining and 3D printing have grown double digits year-to-date and hubs continues to grow rapidly. To accelerate growth, we must delight our customers, our second priority.\n\nDuring the third quarter, we delivered strong on-time delivery and quality rates while maintaining the industry's fastest lead times. New in 2022, our cross-functional customer experience council has made great progress throughout the year gathering customer and employee feedback and are working to continually improve the experience across the entire customer journey. These efforts have led to a substantial increase in our NPS scores so far in 2022. Our next priority is to be the global leader at scale.\n\nWe continue to launch enhancements to our digital manufacturing technology that enable us to produce more complex parts and increase automation. We expanded our automation in the quarter. However, we measure success in this priority with gross and operating margins. In the most recent quarter, the decline in injection molding created a significant headwind to our margins.\n\nInjection molding is one of our higher margin services, and with lower volume, it becomes challenging to absorb fixed costs and overhead. As we plan for the end of 2022 and onto 2023, we will control spending based on volume levels and demonstrate discipline as we focus our investments. We're working to drive efficiency by realigning resources to invest in our biggest growth opportunities. Our fourth priority is to be a great place to work.\n\nDuring the third quarter, we rolled out expanded development resources, including a mentorship program and expanded leadership training to ensure our employees have the support, skills, and environment they need to achieve their goals and ours. Proto Labs employees globally are aligned around our strategic priorities and are working to focus on our investments while accelerating our growth. Despite near-term disruptions and macroeconomic uncertainty, we are confident in our long-term strategy and are focused on executing these four priorities. As we enter 2023, we will continue to invest responsibly for the long term in a way that is adaptive to the current economic environment.\n\nThe combination of Proto Labs best-in-class digital manufacturing services and hubs digital manufacturing partner network is a unique model that will win in the long run. With that, Dan will cover our third quarter financial results and our outlook for the fourth quarter. Dan?\n\nDan Schumacher -- Chief Financial Officer\n\nThanks, Rob, and good morning, everyone. Our third quarter financial results begin on Page 7 of the presentation. Third quarter total revenue of $121.7 million was within our guidance range and represents a 2.9% decrease year over year. Excluding revenue in our Japanese operations, third quarter revenue increased 1.6% in constant currencies.\n\nhubs generated $12.1 million of revenue in the third quarter, representing growth of 38.5% year over year. In constant currencies, hubs' revenue grew 50.1%. Changes in foreign currencies continue to negatively impact global revenue growth and represented a $4.1 million unfavorable impact to revenue in the quarter, higher than an expected $2.9 million impact. Third quarter revenue by region is summarized on Slide 11.\n\nIn the Americas, third quarter revenue decreased 1.2% year over year. In Europe, third quarter revenue grew 14% year over year in constant currencies. Transitioning to revenue by service. As Rob noted, revenue from injection molding parts has underperformed expectations in the first three quarters of 2022, and we are working to drive growth in this area.\n\nOverall, third quarter injection molding revenue declined 12.3% year over year in constant currencies, causing overall revenue to come in near the low end of our guidance range. Third quarter CNC machining and 3D printing revenue grew 12.4% and 11% year over year in constant currencies, respectively. Sheet Metal grew 8.3% year over year in constant currencies. We served 23,816 unique product developers in the third quarter, up 1.5% from the same period a year ago, up 4.4% excluding Japan.\n\nTurning to Slide 15 and our detailed income statement. Overall, third quarter non-GAAP gross margin decreased 110 basis points sequentially to 44.8%. The sequential gross margin change was primarily driven by lower volume in injection molding and a continued headwind from the closure of our Japan business. Hub's gross margin in the third quarter was 26% compared to 26.4% in the second quarter of 2022.\n\nTotal non-GAAP operating expenses were $40.9 million in the quarter or 33.6% of revenue compared to $42.3 million or 33.4% of revenue in the second quarter of 2022. The sequential decline in operating expenses was driven by a $1.2 million gain on the sale of an R&D facility in the Americas that was no longer in use and lower incentive compensation accruals. These decreases were partially offset by continued investment at hubs. Regarding the closure of our Japan business, we shipped final orders out of our Japanese facility in September and continue to incur expenses associated with the shutdown through the end of the third quarter.\n\nThe Japan business closure resulted in $1.2 million in GAAP operating expenses during the quarter, including $100,000 of employee severance and $1.1 million related to the write-down of fixed assets. Consistent with the previous quarter, these expenses have been excluded from our non-GAAP financial results to enable clean comparisons to prior and future periods. See Slide 15 in the appendix of our accompanying slide presentation for GAAP to non-GAAP reconciliations. Moving to taxes, our non-GAAP effective tax rate in the third quarter was 22.4% compared to 21.1% in the prior quarter.\n\nOur non-GAAP effective tax rate was higher compared to the prior quarter due to a onetime release of reserves for uncertain tax positions in the previous quarter that did not repeat. Third quarter non-GAAP diluted net income per share was $0.40 compared to $0.46 in the prior quarter, due primarily to overall volume and lower internal manufacturing gross margin. Transitioning to cash flow and balance sheet highlights on Slide 16. We generated $20.5 million in cash from operations in the third quarter.\n\nYear to date, cash generated from operations is up 60% over 2021, evidence of the strength of Proto Labs unique digital manufacturing model. We repurchased $7.8 million in shares during the quarter as we continued to purchase opportunistically. At September 30, we had $113.9 million of cash and investments on our balance sheet, and we remain debt-free. Now, I will provide our outlook for the fourth quarter of 2022 as outlined on Slide 18.\n\nWe expect to generate revenue between $107 million and $115 million in the fourth quarter. This guidance incorporates October performance and typical seasonality patterns. We have received feedback from key customers that demand levels are uncertain given the challenging macro environment. The closure of our Japan operation is expected to have a $3.5 million negative year-over-year impact on our revenue growth.\n\nWe expect foreign currency to have approximately a $4.2 million unfavorable impact on revenue compared to the fourth quarter of 2021. Moving to earnings guidance, we anticipate non-GAAP add-backs in the fourth quarter to include stock-based compensation of approximately $4 million and amortization expense of $1.5 million. We currently estimate our non-GAAP effective tax rate will be approximately 10% in the fourth quarter due to the release of an accrual for an uncertain tax position that was resolved in November. In summary, we expect fourth quarter non-GAAP earnings per share between $0.18 and $0.26.\n\nThat concludes our prepared remarks. Rob and I will now gladly take your questions.\n\nOperator\n\nThank you. [Operator instructions] Thank you. Our first question comes from Brian Drab with William Blair.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nHi. Good morning. Thanks for taking my question. First, I just wanted to ask on gross profit, I know there's one of the key issues is just some deleveraging on lower volume.\n\nWhat do you see in the near term in terms of gross profit margin? Is there more pressure to come there? Potentially expecting revenue to step down?\n\nDan Schumacher -- Chief Financial Officer\n\nCorrect. Yeah, we expect more pressure into the fourth quarter just based on the lower revenue.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nAnd are you making any comments today, Dan, around how you -- the plan you have for '23 for gross margin?\n\nDan Schumacher -- Chief Financial Officer\n\nWell, we're part of the planning cycle right now. We're putting together that and finalizing that, but we won't be talking about 2023 on this call.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nGot it. OK. So can you -- just a higher-level question then. In terms of Proto Labs 2.0, can you just remind me and everyone, where are we in terms of integration of all the different components, rapid, hubs, the timing of this? And are we done? Or is there more -- how much longer to go?\n\nRob Bodor -- President and Chief Executive Officer\n\nSure, Brian. So as I mentioned on the call, we launched the first component of our integrated offer in the quarter and we're starting to see some nice progress with that. This is -- what we're now enabling is for a customer to be able to see, in a unified way, parts that can be fulfilled through our digital factory or through the digital network and order them with that broader range of lead time and pricing options. We just launched that.\n\nWe're starting in Europe with kind of a select set of geometries, and we are going to be accelerating that rollout over the coming months to bring that to the U.S. and to expand to our entire range of offering. We're pretty excited about that.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nHow does the user know what the select set of geometries is? I mean because it's just -- you're accommodating any random design someone can come up with. What does that mean?\n\nRob Bodor -- President and Chief Executive Officer\n\nSure. So you upload your custom geometry and your CAD file and when the network options are available, they are presented to you and you can select them and order.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nI see, OK. And then just one last quickly. How much of hubs business today is still in Europe versus outside of Europe?\n\nRob Bodor -- President and Chief Executive Officer\n\nIt's roughly 50/50 with the U.S.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nYeah. OK, I'll get back in line and pass along. Thank you.\n\nRob Bodor -- President and Chief Executive Officer\n\nThanks, Brian.\n\nOperator\n\nThank you. The next question comes from Greg Palm with Craig-Hallum.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nYeah. Good morning. Thanks. I guess maybe you can dig in a little bit on what you're seeing in October.\n\nI mean the Q4 guide is quite a bit worse than normal seasonality. What exactly are you seeing in October that gives you this amount of caution?\n\nDan Schumacher -- Chief Financial Officer\n\nYeah, I mean we're doing our normal work that we do in terms of looking at what our order trend rates have been in October. I think for us, the challenge from the normal seasonality pattern, Greg, was really started in August and late September. Which is why you saw from a Q3 perspective, us coming to the lower end of our guidance range. What we're seeing is, on the injection molding side, we talked about the softness there.\n\nThat softness is continuing to the fourth quarter. I think what we're seeing across the other product lines is things with the longer lead times, at this point in time are holding up. Those are actually doing well. It's the shorter lead times, say prototyping type business, that we're seeing additional softening in, in October.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nGiven that, what makes you confident that this is macro-related versus additional competitive share loss?\n\nDan Schumacher -- Chief Financial Officer\n\nI think what we did is, we reached out to customers and talked to customers about specifically what they were seeing. We heard feedback from them on projects that were being put on hold on. Hey, I'm already done with my budget for the year, my budget is shorter for the year. Really, it was talking with the customers about what they were seeing.\n\nRob Bodor -- President and Chief Executive Officer\n\nYes, and hearing a lot of input on slower demand, on excess inventories with our customers. And Greg, as I said, recall that our IM service is really designed for speed and high reliability and it's priced to win in low to mid volume. In times when macroeconomically we're seeing high demand, that service does very well and outperforms the market. When we see times of big supply chain shocks, we do very well because of our ability to be responsive.\n\nIn times when there's slower demand in the market overall, customers aren't in so much of a hurry. They're very price sensitive. That's when we start to see headwinds in this service. That's what we heard from our customers is that they're seeing slowing demand, they're sitting on excess inventories.\n\nAs I talked about in the call, our response to this is really to broaden our offer in injection molding just as we have defined in our strategy and started to execute in our other services. When you look at our CNC business, in our longer lead time portion of that business as we've expanded that offer, that's growing over 40%. I think that's the exact same strategy that we're now executing in injection molding, and we'll start to see traction in that here in the coming months.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nOK. And I guess, if I could -- I mean if I could ask one more follow-up. Looking back, injection molding has been a lot less impacted by macro weakness in historical years, especially relative to CNC. And that's a business, you've always talked about as being very defensible in nature.\n\nI guess it's just surprising that you're seeing this magnitude of weakness now, especially relative to CNC. I guess I'm just trying to dig into that a little bit further. And I guess, more importantly, what exactly are you doing internally to stem some of this weakness?\n\nRob Bodor -- President and Chief Executive Officer\n\nSure. So -- well, last year Q3, our injection molding parts business was up year over year at 25%. So in fact, we do see cyclicality in this business, and we think that cyclicality is really driven by the area of the market that we've historically focused in, which is in -- that depends on innovation and our ability to be highly responsive. And so what we're doing is basically in two areas.\n\nFirst, on go-to-market, very aggressive sales actions, making sure we're following up on every opportunity, calling on every quote, and actively engaging with our customers and hunting for new customers. And then, of course, a broad range of digital marketing around that. But I really want to highlight the offer. We're going to be -- just as we've done in CNC where we've added longer lead times, we're going to be expanding our offering in both the factory to provide even faster lead time options, so leaning in to where we're highly differentiated.\n\nBut then also offering much broader capabilities and longer lead times, both within the digital factory and through cross-selling through our hubs NP network. So that's all accelerating and we'll be seeing those capabilities roll out here in the coming months.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nOK. Understood. All right. Thanks.\n\nBest of luck.\n\nRob Bodor -- President and Chief Executive Officer\n\nThank you. \n\nOperator\n\nThank you. The next question comes from Jim Ricchiuti with Needham and Co.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nYes. Good morning. Again, I just would like to understand a little better what you've seen later in Q3 into Q4. And perhaps in the Americas, in the U.S.\n\nCNC machining and 3D printing business, I mean it sounds like injection molding is just going to be a little bit more challenging in the near term. But I'm wondering if there's been a shift in demand that you're now seeing in CNC machining and 3D printing.\n\nDan Schumacher -- Chief Financial Officer\n\nSo specifically, as I said before, I think specifically in CNC machining and 3D printing and across the services, things that are in that shorter lead time have been softening a bit in October. And things that are in our longer lead times in those services have been holding up. Both in CNC and in 3D, we do offer longer lead times in those services at a lower price point than our traditional quick-turn businesses in both CNC and 3D. So we're seeing evidence that is different than what we saw in the third quarter, and what we saw throughout 2022 is that there is some softening in that quick-turn type business.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nAnd when you say that you've seen some key customers express caution, presumably that's in those areas. Can you elaborate on that in terms of what sectors that you're seeing that? And is that consistent with what you might see in a slowing economic environment?\n\nDan Schumacher -- Chief Financial Officer\n\nYeah, I mean -- so a couple of the places that just specifically -- I don't have the industry split maybe in terms of what I'm seeing in October, but just some color on the quarter, auto for us was down quite a bit. And then medical actually was down more. Now medical, some of that, we really understand that to be that last year we still were having some COVID orders within medical, so that's part of it. But I would say, how much we were down, it goes above and beyond that COVID piece, right? So those are some of the industries at least we are seeing softening.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nAnd then last question for me, just with respect to the growth, at least in constant currency that you're seeing in Europe, sounds like a good portion of that is hubs related. But also, it sounds like the rest of the business is doing a little bit better there. How concerned are you that -- or are you seeing any signs of weakness in that part of it in Europe, albeit it's a smaller part of your business, but just wondering what you're seeing there?\n\nDan Schumacher -- Chief Financial Officer\n\nYeah, I mean specifically for Europe, again, it wasn't an injection molding story, but outside of that, we saw really good growth in both CNC and 3D, specifically in Europe. CNC growing mid-30% and 3D growing 20%-ish in constant currencies. I mean so those businesses within Europe with hubs did very well. Yeah, in Europe, I think we're seeing less of a softening trend from Q3 to Q4 than what we're seeing in the U.S.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nOK, thank you.\n\nOperator\n\nThank you. The next question comes from Ben Rose with Battle Road Research.\n\nBen Rose -- Battle Road Research -- Analyst\n\nYes. Good morning. Rob, just to drill down a little bit in terms of the plans for rekindling the growth in injection molding, I understand kind of at a high level what you want to do is try to compete for some of that business which has longer lead times. From a kind of a mechanic standpoint, is it a question of reconfiguring the factory space that you have at Proto Labs in order to respond to that kind of business? Is it a question of sales coverage or not or maybe some of your customers or prospects not knowing that you can fulfill longer lead time orders? Maybe just some color on that would be helpful.\n\nRob Bodor -- President and Chief Executive Officer\n\nSure, absolutely. So I think the first step is to make the software and e-commerce changes to make those additional capabilities available to order online. And then the factory, the factory is able to manufacture in that way. That doesn't require reconfiguration in any material way.\n\nThe first would be the e-commerce changes. And then, of course, yes, having the sales teams communicate that message to our customers and start to engage them on those orders. Frankly, we're seeing those opportunities come through in the flow and so that would be the next step. We will also expose, now as we reach this point in our integration with hubs, the network, to those opportunities as well.\n\nAnd we'll be continuing to accelerate our cross-selling into the network. Those are the steps.\n\nBen Rose -- Battle Road Research -- Analyst\n\nOK. That make sense. And another question that I have is, is there any sense that you have that perhaps some of your customers are, in terms of their own material use in terms of the prototypes and low-volume production that they're doing, is there any evidence to indicate that their use might be shifting? Their use cases might be shifting more to CNC machining and 3D printing as opposed to injection molding?\n\nRob Bodor -- President and Chief Executive Officer\n\nWell, we're seeing continued growth in CNC and 3D printing. If you're asking if those are taking share from injection molding, no, we don't believe so. The applications and the use cases where it makes sense to do 3D printing or CNC are different than injection molding. And our injection molding service, our molds are very inexpensive.\n\nWe start at like around $1,500 a mold, so the crossover point even from a volume standpoint is quite low. So that's not what we see as the dynamic.\n\nBen Rose -- Battle Road Research -- Analyst\n\nOK. And then one final question. At the outset of your remarks, you talked about some of the exciting developments in the EV industry. And obviously, there's quite a bit of prototyping going on in the U.S.\n\nand maybe some in Europe as well. But maybe a little bit surprised to hear that the automotive sector was down year over year. Do you see in your pipeline some growing opportunities for EV product development? And if so, when do you think those might materialize?\n\nRob Bodor -- President and Chief Executive Officer\n\nFirst thing, Ben, on auto being down year over year, auto is one place in our injection molding parts business that we had fairly large part orders last year as customers were facing supply chain impacts and came to us because we can give them their parts quickly. Auto on the production side, I would say, is what drove the decrease year over year, specifically in IM. In EV, yeah, we are seeing opportunities to help companies prototype and to advance those technologies for them. So we see that as a great place of opportunity for us on the prototype as we go through the fourth quarter and next year.\n\nBen Rose -- Battle Road Research -- Analyst\n\nOK. All right. Thank you.\n\nOperator\n\nThank you. There are no further questions at this time. I would like to turn the floor back over to Rob Bodor for closing comments.\n\nRob Bodor -- President and Chief Executive Officer\n\nThank you for joining us for our third quarter earnings call. The global manufacturing market is undergoing substantial transformation and enduring macroeconomic headwinds that will create volatility in the near term. We are confident that our profitable business model and strong balance sheet positions us well for profitable growth in the long term. We've sharpened our focus on a clear set of priorities, including improved performance in our injection molding business and continued progress on our integrated offerings.\n\nExpanding our offering in CNC has driven significant growth in that service, and we're confident this strategy will have positive impact in injection molding as well. I want to thank our employees around the world for their continued efforts as we close out 2022. We look forward to updating you on our performance in early 2023. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJason Frankman -- Vice President and Corporate Controller\n\nRob Bodor -- President and Chief Executive Officer\n\nDan Schumacher -- Chief Financial Officer\n\nBrian Drab -- William Blair and Company -- Analyst\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nBen Rose -- Battle Road Research -- Analyst\n\nMore PRLB analysis\n\nAll earnings call transcripts"
}