{
  "companyName": "MannKind Corporation",
  "companyTicker": "MNKD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/mannkind-corporation-mnkd-q3-2022-earnings-call-tr/",
  "content": "MannKind Corporation (MNKD -1.86%)\nQ3 2022 Earnings Call\nNov 08, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning. And welcome to the MannKind Corporation third quarter 2022 earnings call. As a reminder, this call is being recorded on November 8, 2022, and will be available for playback on the MannKind Corporation website shortly after the conclusion of this call until November 22nd, 2022. This call will contain forward-looking statements.\n\nSuch forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ materially from the stated expectations. For further information on the company's risk factors, please see their 10-Q report filed with Securities and Exchange Commission this morning, the earnings release, and the slides prepared for this presentation. Joining us today from MannKind are chief executive officer, Michael Castagna; and chief financial officer, Steven Binder. I would now like to turn the conference over to Mr.\n\nCastagna. Please go ahead.\n\nMichael Castagna -- Chief Executive Officer\n\nGood afternoon. It's Michael Castagna, and I hope you could hear me OK. OK. We're having technical issues, just want to make sure everybody could hear me before I got started.\n\nGood morning, and thank you for joining us for our earnings call today. Today marks the beginning of the new MannKind. You can start to see our execution from a single product to a sustainable growth company. We've never been more excited about our future than now.\n\nWhen you look down, you see four sources of revenue growth and 74% growth quarter over quarter. Orphan lung business is really starting to shape up as you look at the collaboration and service revenue with Tyvaso, as I'll talk about capacity moving forward. The endocrine business was also doing well at double-digit growth 28% quarter over quarter with Afrezza and V-Go revenue. When you look at the orphan lung, we're well-positioned with Tyvaso DPI growing significantly as we go forward and clofazimine starting to enter patients hopefully in 2023.\n\nOur EBU's growing year over year but in Q3 we made some changes and integrated V-Go and started -- as you'll see in a minute that we started to make -- as those changes took place, we started to grow our market share month over month, quarter over quarter. In the Tyvaso side, you'll see our first quarter of commercial manufacturing, one of the first questions I get is, is this full manufacturing, and the answer is no. This is just the beginning. The first full quarter commercialized by UT, our royalties earned were about $6 million, which is significantly higher than what we'd expected.\n\nOur capacity expansion is ongoing and quickly progressing here in Danbury. On our pipeline, we have reported [Technical difficulty] on September our Phase 1 results that were generally well tolerated up to 90 milligrams, no significant adverse events or QT prolongation, and we're planning to meet with the FDA here in late Q4. We're very excited about this program in place to get this product to patients. On Afrezza really focused on paid TRx, which grew 10% year over year and 4% Q3 to Q2.\n\nOn INHALE-1, we're currently on track to hit our goals for enrollment this year with an expectation to complete enrollment by mid-next year and results six months later. We also will be presenting our ABC results very shortly and which is the Afrezza with Basal combination trial where we switch some patients off of pump we add an Afrezza to a pump and we maintained the people on the pump. On from the V-Go side, we feel good that we've stabilized the revenue and we're ready for growth. Overall, we have the $170 million in cash to fund our growth on our five-year plan.\n\nHere's a quick [Inaudible] just to see the team in Danbury working through making our devices 24/7 not just devices but also product and dry powder cartridges. It's very exciting time for people at MannKind and our future. With the purchase of V-Go, we really do become the mealtime solutions company. Let me start off by talking about Afrezza and what we're doing to kind of continue to grow market share there.\n\nWe pivoted this year to focus on a subset of doctors as well as ultra-acting analog insulin, URAI. And so that market share if you look among our key targets that's continued to grow after years of decline and watching our competition continue to take ultra acting market share away from us, and we believe they're reaching for a faster insulin and Afrezza should be the fastest insulin of choice. And with that refocus this year, we've continued to grow market share quarter over quarter, month over month. When you look year over year, very excited that the new Rxs are a leading indicator of our TRxs, and you can really see the NRx growth from Q1 to Q2, to Q3, where we had 18% NRx growth year over year and how that translates to TRx growth quarter over quarter, year over year.\n\nOn the V-Go, we gave guidance of $18 million to $22 million we purchased this asset were on the higher end of that expectations with revenue of $5.4 million here in Q3, and we continue to see positive momentum with V-Go here in Q4 and we're planning to implement this into 60 additional sales reps in January of 2023. We stabilized the TRx decline that's been happening for over 18 months and exited Q3 around 1,200 TRxs a week. We've additional business here [Inaudible] Symphony and distributors, as well as some of the TRICARE accounts. V-Go will be in a P2 position the Afrezza sales force as we exit this year going into next year.\n\nSo people ask me what does that mean for product segmentation? We just got the ABC results and market research telling us where we need to fix on Afrezza and to continue to accelerate the growth. We expect to focus on 2023 on a narrow focus on a set group of providers that write both V-Go and the Afrezza, which is around 3,000 providers. Additionally, we want to make this business cash flow breakeven and really choose to win where we choose to play. On the Afrezza side, you'll continue to see us focus more on type one younger population commercially insured and the endocrinology focus.\n\nOn the V-Go side continue to focus on type two for patients looking for simple ways to deliver their insulin and basal control. All the population typically Medicare and ENDO, MPPA, PCP. The bottom right corner shows you Afrezza will be a P1 target for our core sales force and type two will be a P3 target and V-Go will be in position two targets in that sales force. As we go forward, we're very excited about the endocrine business unit, our pipeline, I'll talk about the end of today, as well as the impact Tyvaso is going to have on the future of MannKind.\n\nI'm going to turn it over to Steve. Thank you.\n\nSteven Binder -- Chief Financial Officer\n\nThanks, Mike, and good morning. I'm pleased to review select third quarter and September year-to-date financial results. Please supplement this call by reading the condemn consolidated financial statements and MD&A contained in our 10-Q, which is filed with the SEC this morning. This is the first full quarter of revenue activity across all four sources of commercial revenue, Afrezza and V-Go for our endocrine business and Tyvaso DPI manufacturing, and Tyvaso DPI sales royalties for our orphan lung business.\n\nLooking at how our business is growing year on year, please focus on the bottom of the table, where it shows we had a 48% increase in total revenues, which amounted to $32.8 million for the third quarter of 2022. Breaking down the third quarter by source of revenue, Afrezza net revenue was $10.8 million versus $9.8 million in 2021, a growth rate of 11%. The increase was mainly driven by price, including a more favorable gross net percentage and higher patient demand with paid TRx growth of 10%, partially offset by wholesale inventory ordering patterns, which resulted in lower channel inventory levels for the third quarter of 2022. Lower channel inventory levels have been recurring theme this year as we have seen channel inventories lower by approximately $1.1 million in the six-month period ended September 30th and almost $2 million since a year ago at September 30, 2021, which has adversely impacted our revenue -- our net revenue growth this year.\n\nWe believe that the Afrezza channel inventory levels have likely hit their minimum maintenance balances and shouldn't lower much more. Year to date, Afrezza growth came in a plus 13%, which was mainly due to favorable price including a more favorable gross net percentage, higher product demand and a more favorable cartridge mix. Next is our net revenue for V-Go, the recently acquired wearable insulin delivery device where we had $5.4 million in net revenue for the third quarter and $7.5 million for year to date, which represents the four months of June through September. We expect V-Go net revenue for the 12 months post-acquisition to be in the range of $18 million to $22 million and we are tracking to the mid to high end of that range.\n\nMoving to collaboration services. Revenue for the third quarter was $10.3 million versus $12.5 million for 2021. The main driver of collaboration revenue has shifted from the amortization of United Therapeutics milestones in 2021 to Tyvaso DPI manufacturing revenues in 2022. Included in the third quarter 2022 collaboration and services revenue number of $10.3 million is $9.9 million of Tyvaso DPI manufacturing revenue.\n\nThe September year-to-date revenue of $18.4 million is mainly lower in 2022 versus '21, because of the prior year UT's milestone amortization and the first half '22 deferral of revenue associated with the delay in the start of commercial manufacturing. In addition to UT-related revenue recognized in 2022, we had $32.2 million of deferred revenue on the September 30, '22 balance sheet associated with United Therapeutics, which will be recognized to income through 2031, which is the remaining term of the commercial supply agreement with the United Therapeutics. And lastly, we recorded royalties on sales of Tyvaso DPI by United Therapeutics to their customers. The third quarter was the first full quarter of sales of Tyvaso DPI by UT, and we earned $6.2 million in royalties for those sales based on a low double-digit royalty.\n\nUnited Therapeutics release third quarter earnings last week and on their earnings call said that the physician engagement and enthusiasm around Tyvaso DPI is extremely high, and we continue to manufacture on a 24/7 basis to supply UT. I consider MannKind to be a new commercial growth story. The next slide shows our revenue growth quarter to quarter for 2022. Moving from the left to the right, we grew total revenues from $12 million in the first quarter to $18.9 million in the second quarter, a 58% increase and then grew total revenues from $18.9 million in the second quarter to $32.8 million in the third quarter, a 74% increase.\n\nOur quarterly revenues grew almost three times from first quarter to third quarter. Driving the revenue growth are three new sources of revenue, Tyvaso DPI manufacturing revenue, royalties associated with the sales of Tyvaso DPI and sales of V-Go. We're pretty pumped about the future revenue growth potential across all four revenue streams. Now let's look at the profitability of our endocrine products, Afrezza and V-Go.\n\nAfrezza gross margin increased from 61% in the third quarter of 2021 to 81% in the third quarter of '22, and the gross profit associated with Afrezza increased to $8.7 million in the quarter. The increase in the third quarter gross margin versus '21 was due to an increase in Afrezza sales coupled with decrease in the cost of goods sold mainly due to a decrease in excess manufacturing capacity costs. When looking at the profitability for September 22 year to date, Afrezza gross margin of 75% and gross profit of $23.6 million driven by higher sales and lower cost of goods sold mainly due to a decrease in excess manufacturing capacity costs and a $2 million fee incurred on amendment of our insulin supply agreement in the second quarter of 2021. Please note that there will always be some variability in Afrezza gross margin between quarters due to the timing of manufacturing spin and activity as we are not at maximum production capacity.\n\nThe far right table shows V-Go September year-to-date gross margin of 44%, which is about where we expected the margin to be. Let me conclude with some final comments around liquidity and performance. We ended the third quarter with $178 million in cash, cash equivalents, and investments. And with our growth across all four commercial revenue streams, we're able to invest behind our pipeline and strategically behind Afrezza and V-Go.\n\nOur collaboration with UT is tight and the Tyvaso DPI launch is off to a strong start. I feel like the company has turned a corner. We are focused on maximizing the potential of our collaboration with UT. We are focused on profitably growing our endocrine business and we are focused on developing and bringing innovative products to patients from our emerging pipeline.\n\nThank you. And now I'll turn it back over to Mike to review key milestones to provide a pipeline update.\n\nMichael Castagna -- Chief Executive Officer\n\nThank you, Steve. Great summary. Great future. If you look at over the next 18 months, I'm just going to share a couple things that were good purview on the endocrine business unit and where we are with Afrezza.\n\nFirst, we want to quick start program to get patients started quickly here in Q4 to pilot that as we get ready for next year to house scale our business. In 2023, we fully expect that Afrezza will be covered in Medicare at $35 under the inflation protection act bill that was passed. That changes the game as one of the major objections for Afrezza is around access, I really want you to see that patients can only pay $35 for Afrezza and it's not a short while a low-cost cash program available. We expect to finally launch BluHale [Inaudible], which is our patient addition integrated with CGM in Q1 as a pilot with a full-scale launch in Q2 next year soon if that goes well.\n\n[Inaudible] was fully enrolled in type two study and we expect that readout to happen by Q3 next year, and then INHALE-1 readout [Inaudible] repeat could happen late Q4 or early Q1 at the latest. I'm going to bring it over to our MannKind pipeline. This is a position that we started three years ago when we look at the orphan lung business. In 2019, we decided to pivot and focus on orphan lung as we thought that was the best opportunity to help patients.\n\nHearing the patient stories on nontuberculous mycobacteria, as well as Tyvaso DPI are heartbreaking, but we are fundamentally going to extend and ehnahcne people's lives as it comes to using our product and our technology to give them the freedom to live their life. With clofazimine, we are fully engaged in getting this ready for FDA submission in terms of our Phase 2, hopefully, three study, that's one study. On nintedanib, we're progressing that rapidly into a Phase 1. On 301, the team is working hard on the formulation and we're almost ready to go to next stage there.\n\nAnd the TGF beta, we'll be giving final study report very shortly in the next couple of weeks. On the Cannabidiol program, [Inaudible] just released recent data and they're going forward with their second trial, and on the [Inaudible] we continue to watch that progress on the oncology space. One thing though talking to some of the investors yesterday was how do we start to help people understand our pipeline and the opportunity that we're going after. I think this line is a good summary.\n\nWhen you look at NTM, a pretty much big unmet need, most of the drugs are generic and have severe toxicities. Competition is narrow and our market value for this is in the $3 billion to $4 billion range. We look at this as about 58,000 patients orphan here in the US with 15,000 in treatment, as well as Japan is another large market for this opportunity. In the IPF space, the market is littered with failures of very tough disease, it's called idiopathic pulmonary fibrosis because it's very hard to treat, it's very hard to diagnose, very hard to get a consistent patient population.\n\nHowever, we believe the only two products approved nintedanib and pirfenidone give us an opportunity to reformulate nintedanib in an orphan lung delivered product where we know one of the rate limiting side effects of nintedanib is the dose related adverse event, they cannot do much higher. We're excited about this as there's 100,000 patients at IPF who need more options. On the cystic fibrosis side, I was actually privileged to be at the CF Conference this past weekend, hearing all the great progress and life expectancy that's been extended in this patient population. Despite the life expectancy extension, there's a subset of patients who continue to be sick and there's a subset of patients who continue to have exacerbations and infections.\n\nIn fact, one of the conversations there was the fact that people's lungs are getting better are masking the infections, because these patients are no longer producing sputum, and how do you continue to treat an infection if you can't culture the sputum. These are great opportunities and challenges to develop drug in the space, so I think they point to the unmet need in CF community and the interest that the CF Foundation has in our product pipeline as we go forward. As every year we lay out all of our milestones, we feel pretty good that we're on track to hit all of them. Nothing here is surprise and in Q2 we released the 101 [Inaudible] ABC results, and the MannKind 101 has also been short.\n\nQ4, we're lined up to have a great quarter, close out the year strong and get ready for 2023. I'll stop there and get ready for questions.\n\nOperator\n\n[Operator instructions] And our first question comes from Brandon Folkes with Cantor Fitzgerald. Your line is now open.\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nHi. Thanks for taking my questions and congratulations on another very good quarter. Maybe just two from me. You talked about the manufacturing on Tyvaso running 24/7.\n\nCan you just give us an update in terms of how you have been with staffing? Obviously, we've had staffing challenges across the board in 2022. But do you have the staff there, do you have sort of the ability to kind of ramp up should this strong ramp on Tyvaso DPI continue? And then maybe just a point of clarification. I think you mentioned 60 additional sales reps that are going to target, they're going to detail V-Go. Are these current risks that you have detailing Afrezza, or are these new hires to the company?\n\nMichael Castagna -- Chief Executive Officer\n\nGreat. Brandon, thank you for calling in this morning. Just answer that one easily, it's our existing infrastructure. We bought V-Go [Inaudible] to add a ton of more infrastructure to the diabetes business, but to leverage the existing infrastructure we have.\n\nSo we have 60 current Afrezza salespeople across the country and we'll be dropping V-Go in that bag around late January. So that hopefully clarifies that one. On the Tyvaso 24/7 manufacturing, fortunately, we've had a really good year of staffing, very low turnover relatively to the market. And on the ramp, the real issue on the ramp is continued production, I think, that's the biggest thing is, when equipment starts and stops, that's when we have headaches, when equipments running 24/7, it actually gets more efficient over time.\n\nAnd so I think that's really where the team is focused on is making sure as you ramp up production that the equipment continues to manufacture, fill cartridges at the rate we need, and then ultimately get better on the supply chain in terms of packaging and shipping to the pharmacies. So we don't anticipate have to hire more people in the near term for production, outside of the scale-up facility. Remember, we're building a major expansion in Danbury and that facility will require some extra employees next year, which will be reimbursed by UT. So currently, we have already worked with UT to anticipate an upside demand and we will make sure we're able to supply that demand in 2023.\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nThank you for both of those. Do you mind if I just sneak one more in. Just given your strong cash balance, I know you talked about you mentioned sort of getting investors to understand your pipeline. But how do you think about capital allocation going forward, just given sort of the strong position you've bought in the company on your balance sheet now? And then that's it for me.\n\nThank you.\n\nMichael Castagna -- Chief Executive Officer\n\nAnd I think that's a question we just had with our board last week around the future of the company, the five-year plan, priorities for investment. I think the way we look at the company is continuing to run the diabetes business on a tight leash in terms of budgets and returns for money that we're spending there. We think the pipeline has a huge amount of opportunity. And we also will look for external innovation.\n\nWe haven't really decided on which of those focuses will be priority for 2023, but we do believe Afrezza and V-Go off to a great start. We do believe there's some milestones in that business unit that will give us some information that should we invest more in 2024, should we invest harder in pediatrics, let's get the data, let's put the data drive, some of the uptake of Afrezza as we go forward in '24. We also believe we'll start to see V-Go as a platform. I think that's something I don't want to talk about now, but as we get ready for next year, that's probably where some of that capital can go, which is how do you repurpose V-Go outside of diabetes.\n\nAnd we think it's a platform device that can be leveraged for other products. So that's an area that we're looking at. And then I think in the future is their investments in automation? How do we bring down our cost structure across the company, given the inflation, the impact on employees? And the growth we have, we got to get more efficiencies out of the company. So is there ways to invest to bring more efficiencies in the future, for example.\n\nAnd one of the decisions we'll make today is around lab automation and manufacturing automation on data, and how to transfer from a manual process to a digital process. So things like that bring efficiencies as we continue to scale the company as we go forward. Steve, I don't know, if you have additional comments on that. Thank you.\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nThank you, both, and congratulations on all the progress. Thank you.\n\nSteven Binder -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from Gregory Renza with RBC Capital Markets. Your line is now open.\n\nGregory Renza -- RBC Capital Markets -- Analyst\n\nGood morning, Michael and Steve. Congrats on the progress in the quarter and thanks for taking my question. Michael, just perhaps piggyback on the previous question when it comes to capacity. I'm just curious if you could maybe provide some additional color or highlights just on that process through which you intend to meet the advancing demand.\n\nAny color on the runway through which you can lock down product currently, how that engagement works? And maybe to be direct, you've mentioned the collaboration there is healthy and engaging, and strong. I'm just curious, do those engagement points change,care there ongoing touch points that provide that that closeness for anticipating the demand and meeting with supply, now that the product is launched and underway say versus the previous development process? Thank you very much.\n\nMichael Castagna -- Chief Executive Officer\n\nThere's really two things when it comes to production. Number one is how much product can you spray dry and what does that yield, and the second one is how quickly can you fill that cartridge per minute. And currently, there's two different rate-limiting steps in that process. And as we continue to build efficiencies on the cartridges per minute, one of the product -- production lines next year that will become online, hopefully, will be the fill-finish part of the cartridges, and that will then bring [Inaudible] expect to be how much powder can we produce to fill those cartridges.\n\nThe other part that's shifted a little bit is the dosing, so probably more naive patients than UT has expected. But on the flip side, higher dose patients also they titrate up and ILD. So we kind of got both ends of those spectrums, and as 64 unit cartridge, for example, requires four times as much power than 16 units. So those are some of the things that drive production volume and time and capacity and retain the balance as when this initial launch phase.\n\nThe good news is every week we can adjust that production volume, we can adjust that with the packager, there's no limitations in the short term that we can see, as we continue to watch the launch phase every week. We talk to UT weekly, we feel good about where we are, great communication, collaboration, and continue to prioritize the most needed packaging, for example, to get this to patients to make sure there's no stockouts. So, so far, everything is really tight and going very well. On the capacity side, we ordered equipment to manufacturing, the build out is happening, as you saw.\n\nAnd we continue to see that, the rate limit effect there is really the construction as opposed to equipment, which is what you hear from many other companies buying stuff these days. So we feel pretty good about getting the expansion done next year, getting it ready for 2024. And when we built the factory, we anticipated high end of demand from where we are and we anticipated ILD and PH. So we have enough production capacity to supply the market from where we are today that we can see.\n\nI think that answers the questions there.\n\nGregory Renza -- RBC Capital Markets -- Analyst\n\nAbsolutely. Thanks so much. Helpful color and congratulations again.\n\nMichael Castagna -- Chief Executive Officer\n\nThank you.\n\nSteven Binder -- Chief Financial Officer\n\nThank you. Thank you guys for coming to business.\n\nOperator\n\nThank you. And our next question comes from Steven Lichtman with Oppenheimer. Your line is now open.\n\nUnknown speaker\n\nThis is Ron for Steven Lichtman. I just wanted to ask if you can -- you guys can give a bit more of an update on the BluHale launch. Are you seeing any easing on the chip shortages that you've talked about in the past? What -- you gave a new timing for 2Q '23, and if you can please remind us about opportunity you see for BluHale? Thanks and congrats.\n\nMichael Castagna -- Chief Executive Officer\n\nI want to make sure I heard your question properly. I think you asked for any shortages on Tyvaso launch and --\n\nUnknown speaker\n\nNo. Sorry. An update on BluHale. And you've talked in the past that some of the issues with the launch were because of chip shortages.\n\nAnd are you seeing any easing with that, because we heard from other companies that shortages have been easing up a little bit. So I wondered if that affects you as well and if you can remind us about the opportunities for BluHale?\n\nMichael Castagna -- Chief Executive Officer\n\nSure. So BluHale was, in terms of large scale production, was limited by chips in the short term. The main chip that we were using became obsolete and so we had to reprogram the motherboard and redo all the bluetooth technology around that. We're on our next iteration that's almost done or should we wrapped up shortly.\n\nAnd so we have enough units we'll be able to make Q1 launch, but coming in for Q2 launch, we believe that chip shortage and power shortage should be behind us, at least in the short term that that should not be our rate limiting factor, much we're worry about the reliability and consistency of the device, the patient feedback and the patient experience. So we feel like that's the most critical part of BluHale. The product [Inaudible] looks great, the app looks great, the team did an amazing job. And I think it's going to be really nice for patients.\n\nWe're just working through the placement and device finalization and technical aspects there. But otherwise, it looks like it should be ready to go in 2022.\n\nUnknown speaker\n\nJust a follow-up here. Could you remind us about the opportunity you guys see for BluHale?\n\nMichael Castagna -- Chief Executive Officer\n\nOpportunity, I think there were opportunities as we continue to go deeper in type one. We know technology and dosing and feedback loops are important. And so that's really where we're really repositioning Afrezza, we tried for a long time to help type twos, the type two market got really crowded with [Inaudible] launch. We just feel the best place for Afrezza to win is really in that type one market.\n\nYes, we'll be able to get into pumps and omnipod but we think about omnipod success with pay-as-you-go model. Afrezza sits right into that mindset. And I think with the dataset that we're seeing, people do want faster insulin, they do want faster control the sit on their CGM. We think Afrezza is really well-positioned.\n\nAnd with the [Inaudible] study readout, we think that's going to reinforce a new dataset in type one. And we also know from the market research that the more doctors get used to type one, they will by default use it in type two. And now with V-Go, we think that's a natural segue for them. They've already used insulin, they really like the device and being able to have a nice simple device for type two is a nice growth opportunity.\n\nSo we feel really good about the co-positioning of those assets and really providing a solution for customers, which is something we always had.\n\nUnknown speaker\n\nThank you. Thank you so much and congrats on the progress.\n\nMichael Castagna -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from Robert Hazlett with BTIG. Your line is now open.\n\nBert Hazlett -- BTIG -- Analyst\n\nThanks. Thank you for taking the question and congrats on all the progress. So one or two from me. First on gross margins for V-Go, I think 40% and 45% was where you said that came in and that was in line with expectations.\n\nIs there an opportunity for expansion of gross margin with that product? Love to hear what the potential is there.\n\nMichael Castagna -- Chief Executive Officer\n\nYeah. I think there is. We just met with Jeffrey, the head of manufacturing yesterday. It's going to require some automation investment, but that's when I think the earlier [Inaudible] on capital allocation.\n\nThese are the types of things we can now do when we have a two to five-year view of capital allocation. In the short term, it was always hard to make any investments in the company, because we were just focused on survival. When you think now, we are focused on gross margin, we are focused on profitability, we are focused on advancing the pipeline. So we got to make these plans now as they come to fruition.\n\nAnd I think when you look back in the last five years where we made the risk based decision to bring Tyvaso DPI forward, we made the decision to continue about the pediatrics and Afrezza. Those decisions are paying off now. And I think the same thing is true over the next three to four years is how do we -- V-Go will be here, we expect to invest in that product. And you're right, the gross margin can be approved through automation and manufacturing.\n\nWe're also going to look at gross to net. So as we go into '23 and understand are we getting the value from the payers that we expect in terms of formulary access and restrictions, we're going to make it easy for patients to get access. And we think these are all really important attributes to continue to help those two products get more profitable.\n\nBert Hazlett -- BTIG -- Analyst\n\nThat's terrific. And then just one on the pipeline with regard to clofazimine. I guess if you could just touch on what the goals are for that program. Is it to reduce the AEs, maybe the skin AEs you see with the product in different routes of administration? And what are next steps and are we going to see any data anytime in the near future in terms of publications of the results you have? Thanks.\n\nMichael Castagna -- Chief Executive Officer\n\nYeah. Well, first, I just reviewed a publication last night that's getting accepted to one of the journals. So that's exciting. It's our first animal data and reviewer comments were really positive around the unmet need that clofazimine nebulization is going to bring to patients.\n\nAnd so I thought that was really positive. The Phase 1 data is just wrapping up and coming in with a complete study report. We'll publish that data as well showing the dose range effects and what we see in terms of dosing. And then I think the FDA feedback will be critical here in Q4.\n\nWe've meeting set up for late December that should give us the green light to go forward in the Phase 2/3 design that we've laid out, that doesn't mean the FDA is going to agree with it, it doesn't mean all the endpoints are going to be aligned. But we hope to be able to find some commonality with the FDA, because there's a big difference with clofazimine or any of the NTM assets between how the Japan -- Japan thinks regulatory wise from a sputum conversion, and the FDA will fill form and function. And so we think clofazimine can improved both. But as you know this disease is very hard to treat and it takes a while to get those types of results, it doesn't happen in two to three weeks.\n\nAnd so that we feel good. In terms of what we want to improve on clofazimine, I think clofazimine has been an incredible drug that's underappreciated. And the number one thing as you think about it is the accumulation of toxicities, because of the long half life, we really will be reducing that through our dosing regimen and are dosed into the lungs. I think the skin discoloration, you nailed it, that's a big one for patients.\n\nBut we don't foresee that issue so far in our dosing. We don't see any complaints and we don't expect that to be an issue. And then really just getting deep into the lungs and getting a very high concentration above [Inaudible], we feel like that's going to give patients the effectiveness that they want without the systemic side effects. And lastly, the QT prolongation, that's a known side effect of clofazimine.\n\nWe have not seen that on our highest dosing patients yet after seven days, and we feel really good about that safety profile given our dose. So I think clofazimine overall should be a better safer product for patients that really treat that lung infection at the site and it's very hard to penetrate from the oral route administration. So we'll see, that's a big unmet need and we think the struggle in a lot of these patients.\n\nBert Hazlett -- BTIG -- Analyst\n\nTerrific. Look forward to more progress there. Thanks.\n\nMichael Castagna -- Chief Executive Officer\n\nThanks, Bert.\n\nOperator\n\nThank you. And our next question comes from Thomas Smith with SVB Securities. Your line is now open.\n\nMike Kratky -- SVB Leerink Partners -- Analyst\n\nHi, everyone. This is Mike on for Tom, thanks for taking our questions and congrats on a really strong quarter. On Tyvaso DPI, can you provide any color on the preliminary commercial and manufacturing trends that you're seeing? And if you'd expect some seasonality in the first quarter of 2023, are there other dynamics that you'd kind of flag for investors, trying to get a sense of the potential ramp here?\n\nMichael Castagna -- Chief Executive Officer\n\nYeah. I think one thing I'll say, Mike, is at least more investors I've talked to a little bit, people are watching Symphony data and I think that's OK to get some direction. But I don't think UT has a very close distribution network. So not all those scripts probably show up in the framework out there.\n\nSo we can only say so much, right, this is UT's launch, this is their product, their revenue, we are just the manufacturer and trying to make sure we keep up with their demands and their successful launch. And so we don't see any -- we don't anticipate any problems there. We're doing a decent job and team really looks at the inventory, the demand, the product shipments every week, a lot of constant communication. So I think we're on top of it.\n\nThings have always happened beyond our control, we can't see. But as of now, I think every week we get big [Inaudible], we look at demand, we can adjust our supply chain pretty quickly. And it takes about 30 days to get through a batch in terms of we make it and by the time it's released and packaged, it's about that time. So we can adjust pretty quickly on that demand forecast.\n\nI think what you heard from UT, which I thought was very encouraging, is of the patient referrals coming in 50% were for nebulizer, 50% were for DPI. And I thought that was a fairly good statistic, because we know that this is going to continue to grow, it's going to be billion dollar-plus product and how much of that becomes DPI is a billion dollar question. And obviously, we feel pretty good about that. And if you heard the patient's stories and freedom that they're getting, I think it's going to be a no-brainer that for more and more people want this.\n\nI think the other question I get around this topic is where do you see the market. I think the good news is the Medicare Part D, I know that's one of the reasons UT feels there's some limitations on conversion. But that whole closes in 2025, and so those patient out of pocket costs would costs will be capped about 125 a month roughly, and that will create the next leg up. So anyone that doesn't convert that's on Medicare, for example, will have that opportunity in the next 24 months to get there.\n\nSo this is a tough disease, people are going to die and they don't want to die. And so they really want to extend their life and enhance their life for the remaining years they have, and Tyvaso DPI is doing an amazing job changing those lives. I mean, I just wish our shareholders and our investors and our analysts could hear the stories of the patients and the doctors have been extremely motivating and positive. And our team is so encouraged by the feedback that's happening, it just feels that much more motivation for our pipeline, because really are changing lives and extending life.\n\nSo it's just super exciting times here.\n\nMike Kratky -- SVB Leerink Partners -- Analyst\n\nAnd then just a separate one from me, with respect to Afrezza. You really did a nice job kind of laying out the important kind of milestones that you have coming up there. Is there a certain one, in particular, either a clinical or regulatory, that you think could be important for seeing that next leg of growth for product sales?\n\nMichael Castagna -- Chief Executive Officer\n\nI think next year is really an execution year. Every year we try to do something different to try to spike growth on Afrezza, and we just seem to drive along. And then COVID hits for a couple of years and I don't think it's fair to investors to keep guessing where Afrezza is going to go. And so what we really have done for the business is purchasing V-Go, integrating this to next year and really just focus on execution and alignment.\n\nIf we have an asset and a franchise that's going to do $80 million to $100 million in growth, 10%, 20% a year for the foreseeable future, that's a good business for MannKind. And so we will continue to hope the data readout demonstrate upside opportunities. But I think being real about where we are at this much time of getting this to be a profitable division for the company, helping as many patients as we can and really placing some strategic bets, and pediatrics is one of them. We believe kids is where you're going to change type one care, we think being able to show you as good as an AID system will be important, and those are the attributes that we're focused on.\n\nThose aren't going to happen in the next six months, but those are really the key milestones we're looking at saying, how does Afrezza do in kids, is that really going to be the game-changing opportunity to transform growth to 2024, and then data readout in India will be important. But little less important [Inaudible], I think, important for India, but we're really focused Afrezza on type ones. And so the India studies for type twos, that'll be nice to have and additional dataset to support what we think is a great drug for type twos. But recognizing, you know, there's 1.5 million people live with type one diabetes, they're half the insulin market, we've got to -- the kids opportunity first to get that really foundation bill, work with JDRF a lot more in the patient walks and raising our awareness out there in the society, there's still too many patients not aware in type one, especially that [Inaudible] option.\n\nAnd so we think we just -- when we look at next year, it's really about making sure Afrezza is a choice among the doctors that we're targeting. And I just think we're not in the choice set, we're like number eight out of the eight things they could do and we got to move up that ladder a little bit. And year by year we'll get better from here on out. But we have a map, we have a plan that we got the team to do and I feel very good about 2023 with the team we have.\n\nMike Kratky -- SVB Leerink Partners -- Analyst\n\nGreat. Thanks very much again for the color and congrats on the strong quarter.\n\nThank you.\n\nOperator\n\nThank you. I would now like to turn the conference back over to Michael Castagna, CEO, for closing remarks.\n\nMichael Castagna -- Chief Executive Officer\n\nThank you, Daniel. Overall, monumental quarter for the company, super excited about where we are with Tyvaso. The company is in the best shape it's ever been, we got the best talent we could possibly have. We feel really, really good about our future.\n\nWe continue to make change and pivot us for the next five years. Afrezza and V-Go will be great in 2023 in terms of pivoting to an endocrine focus, make sure that business is a cash flow positive unit by the end of the year. I think on the pipeline, you're going to see really nice progress over the next 12 months of moving assets from preclinical formulation stage in the Phase 1, Phase 2, Phase 3, and we think that's going to be a monumental opportunity for investors to start to really understand that value. Just like Tyvaso for years, as we have signed a deal with UT in 2018, no one really appreciated it until probably 2021.\n\nAnd I think when you look at the pipeline, we started this progress in 2019. I don't think we have a lot of value or attributes in the pipeline. I think you're going to start to see that come out over the next couple quarters. And we think that's a nice upside for investors from where we are and ultimately positioning the future of the company.\n\nAnd in Tyvaso, it's just going to continue to rock the world. It's just a great product and helping a lot of patients, UT is doing an amazing job. And we will do what we do -- everything we can to make sure we stay ahead of the demand curve and build that inventory and make sure we can supply to patients. So overall great year.\n\nCompany is well-positioned for 2023, be a great year. It's a tough economy, tough biotech investors. But we feel MannKind's well-positioned for investors to have double-digit growth for the foreseeable future, and we're very excited about where we are. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Castagna -- Chief Executive Officer\n\nSteven Binder -- Chief Financial Officer\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nGregory Renza -- RBC Capital Markets -- Analyst\n\nUnknown speaker\n\nBert Hazlett -- BTIG -- Analyst\n\nMike Kratky -- SVB Leerink Partners -- Analyst\n\nMore MNKD analysis\n\nAll earnings call transcripts"
}