{
  "companyName": "Sterling Check Corp.",
  "companyTicker": "STER",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/sterling-check-corp-ster-q2-2022-earnings-call-tra/",
  "content": "Sterling Check Corp. (STER -0.13%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, and welcome to Sterling second quarter 2022 earnings call. My name is Harry, and I'll be coordinating your call today. [Operator instructions] I would now like to hand you over to Judah from Sterling to begin. Judah, please go ahead.\n\nJudah Sokel -- Vice President, Investor Relations\n\nThank you, operator. Welcome to Sterling's second quarter 2022 earnings call. Joining me today are Josh Peirez, chief executive officer of Sterling; and Peter Walker, chief financial officer of Sterling. The slides we will reference during this presentation can be accessed on Sterling's Investor Relations website under News and Events.\n\nThe slides have been posted to our website, and a replay will be made available on the website. After prepared remarks, we will open the call to questions. Before we discuss our results, I encourage all listeners to review the legal notice on Slide 2, which explains the risks offorward-looking statements and the use of non-GAAP financial measures. Additionally, please refer to our Form 10-K filed with the Securities and Exchange Commission for a discussion of risk factors that could cause actual results to differ materially from these forward-looking statements.\n\nOur slide presentation and discussions on this call will include certain non-GAAP financial measures. For such measures, reconciliations to the most directly comparable GAAP measures are in the appendix to the presentation and in our earnings release issued this morning. I will now turn the call over to Josh Peirez.\n\nJosh Peirez -- Chief Executive Officer and Director\n\nThank you, Judah. Good morning, and thank you for joining us. Before beginning our prepared remarks, I'd like to congratulate Judah on his expanded role as head of treasury and investor relations. Turning to Slide 4.\n\nSterling's second quarter of 2022 was exceptional and continues the momentum we saw throughout our record 2021 and first quarter of 2022. We achieved new company records for revenue and adjusted EBITDA, driven by continued excellence in new business growth, client service and innovation. During Q2, we surpassed $200 million of quarterly revenues for the first time with year-over-year revenue growth of 29%, including 23% organic constant currency revenue growth, even as we lapped last year's second quarter growth of 80%. We also saw approximately 8% growth from our EBI acquisition, which continues to outperform our initial expectations from when we closed the deal at the end of November.\n\nWe are very encouraged that our quarter's strong results were driven by all four of our revenue drivers performing above the target range. Our product innovation and technology excellence continue to resonate with prospective and existing clients. In the second quarter, our growth from new business was once again a stellar 10% as we continue to win new logos from competitors of all sizes and in all regions due to our competitive differentiators, such as innovative product offerings, client service excellence and cloud-based technology. And clients are deepening their spend with us through our upsell, cross-sell strategy as we expand package density and sell innovative and unique new products such as identity verification.\n\nIn the second quarter, our identity offerings continued to gain traction with enterprise clients increasingly appreciating the differentiated offerings Sterling can provide. The second quarter was another great example of our strategy to invest for the long term while also driving profitable revenue growth. Our adjusted EBITDA and adjusted net income grew by 20% and 44%, respectively, both of which exceeded our expectations. Looking ahead, we continue to diligently watch the macro environment for any changes in the labor market, and we have a comprehensive playbook ready for different market conditions.\n\nWe are cognizant of the near-term recessionary risks and the impacts on economic slowdown could have on the overall economy and our industry. Still, our client conversations continue to be encouraging, and we have not seen signs of material cyclical slowdown within our business. We have increased our full year guidance across the board as our outlook for the balance of 2022 is strong. For 2022, we now expect to generate revenues of $785 million to $795 million, adjusted EBITDA of $214 million to $220 million and adjusted net income of $115 million to $118 million.\n\nWe feel great about our playbook and execution, and we expect to achieve our raised guidance because of the quality of our business and resiliency of our company through different cycles. Turning to Slide 5. The second quarter of 2022 marks our sixth consecutive quarter of double-digit year-over-year organic revenue growth and our eighth consecutive quarter of sequential revenue growth, achievements we are very proud of. We believe our strong results are sustainable.\n\nI want to provide some color on the drivers of our long-term revenue targets. As shown on Slide 6, we plan to deliver 9% to 11% organic revenue growth per year over the next three to five years. Included in the 9% to 11% are four drivers. First is 2% to 3% base growth comprised of volume increases from existing clients, driven by secular tailwinds, economic cycles and client-specific factors.\n\nNext is 4% to 5% growth from upsell and cross-sell comprised of increasing wallet share by selling additional products, more comprehensive screen packages and serving more divisions or regions of a client. The third source of organic revenue growth is 7% to 8% from new business, which includes revenue from brand-new logos in their first 12 months. These three drivers add 13 to 16 points of growth. We target a 95% to 96% gross retention rate, implying client attrition of four to five points.\n\nThis adds up to our 9% to 11% organic revenue growth target with any potential M&A driving the growth even higher. Turning to Slide 7. Since launching our strategy in 2019, our focus has been around accelerating growth in the drivers we control. We have deployed strategies and tactics focused on new business, driving cross-sell, upsell and increasing our gross retention rate.\n\nOur vertical teams have targets around these metrics, and we believe the accountability has served us well. From the combination of these three drivers, our organic revenue growth has averaged 16% since the first quarter of 2021, more than double our combined 7% to 8% target for those items. Even during the 2020 COVID downturn, we still achieved our upsell, cross-sell and new business targets, and our retention improved by 300 basis points year over year. This demonstrates that our solid strategy and execution have enabled us to perform well in the areas most within our control, even during challenging economic times.\n\nWith respect to base growth, industry volumes should grow over the long term due to secular tailwinds such as remote work, millennial churn and continued growth of the gig economy, though periodically, base growth will slow down due to cyclical factors. Our target for base growth is just 2% to 3%, the smallest component of our overall organic revenue growth targets. We believe we will continue to perform well in the areas in our control, which should offset possible softness in base growth if we see a macro downturn sometime in the future. Our outperformance is particularly strong within the category of new business, where we have been winning new clients at an accelerated pace.\n\nFollowing new business growth within our 7% to 8% target range in 2020, we've over delivered against that range in 2021 and thus far in 2022. Our growth from new customers in the first half of 2022 has been 10% and second quarter 2022 marks the seventh consecutive quarter of double-digit growth from new clients with many sizable deals that will begin driving revenue over coming quarters. Due to the ongoing growth of our pipeline and ACV signed, we expect to continue achieving our new business growth target over the long term and see the potential to continue overperforming that target. Slide 8 gives some of the key drivers of our new business growth.\n\nAs part of our strategic transformation over the past few years, we have invested in enhancing our sales and go-to-market strategies to be well positioned to take market share in the fragmented background screening market, and those investments continue to deliver returns. Key drivers of new wins include our global scale, deep market expertise, seamless workflows, cloud-based technology and fulfillment automation at scale. Of course, the foundation of our competitive strength is our world-class team, which drives a culture of client service excellence built on vertical expertise, speed, accuracy and compliance. In conclusion, the second quarter of 2022 was another record for our company.\n\nOur results were stellar. Our outlook for the full year has increased, and we believe we are prepared to operate through a range of market conditions going forward. With that, I will hand it over to Peter Walker, our CFO, to take you through our financial results and updated 2022 guidance. Peter?\n\nPeter Walker -- Executive Vice President and Chief Financial Officer\n\nThank you, Josh, and good morning, everyone. Turning now to an overview of our most recent quarterly performance on Slide 10. During the second quarter of 2022, we reported new company records for quarterly revenues and adjusted EBITDA. Revenue was approximately $206 million, a 29% increase compared to the second quarter of 2021 with 23% organic constant currency revenue growth.\n\nAs Josh mentioned, this was Sterling's sixth consecutive quarter of double-digit year-over-year organic revenue growth and our eighth consecutive quarter of sequential revenue growth. The second quarter also included an 8% contribution from M&A, partially offset by 150 basis points drag due to foreign currency translation. The organic revenue increase included approximately 11% of base revenue growth, including cross-sell, upsell net of attrition and 10% of new customer growth. Q2 represents the seventh consecutive quarter of double-digit year-over-year growth from new customers.\n\nWe're very encouraged that our quarter's strong results were driven by all four of our revenue drivers performing above the target range. As Josh described, we are seeing significant success in the areas of our business most within our control, including strong growth from new customers and cross-sell, upsell as well as maintaining industry-leading customer retention rates. We are most focused on these areas, and we feel that our momentum in winning market share and expanding wallet share with clients can help offset potential softness in base growth, an inherently less predictable source of revenue growth. That said, we feel comfortable with our expectation that base growth will grow by at least 2% to 3% per year on average over the long term.\n\nLooking at revenues by region. Revenues in our U.S. business grew by 34% compared to the second quarter of 2021, including 9% growth from the EBI acquisition. We saw broad-based strength across our industry verticals with particularly exceptional results in our industrials, healthcare and finbiz verticals as we executed our growth playbook and the U.S.\n\nbenefited from a strong labor market. In recent years, we've been strategic in selecting high-growth verticals with significant opportunity for our business, and those efforts continue to pay off. Revenue in our international business grew by 16% on an organic constant currency basis, solidly ahead of our long-term expectations. International growth was led by the APAC region, which continues to exhibit broad-based strength, including in Australia and Singapore due to new client wins and strong underlying performance.\n\nIn the second quarter, we delivered 8% of inorganic revenue growth from EBI, our November 2021 acquisition. We were very pleased with this performance as it was a second consecutive quarter above our expectations, driven by strong base growth and client retention. The deal integration is running smoothly, and we are very encouraged by the enthusiasm of EBI clients to move onto our platform quickly in order to benefit from enhanced capabilities and access to new products. The success of this deal and integration provide us with confidence that we are well prepared to pursue additional synergistic M&A.\n\nWe've increased our full year outlook for EBI's contribution to revenues, which I will describe shortly. Turning to Slide 11. Due to our strong top line results, our second quarter adjusted EBITDA was a company record $56.5 million, representing a 20% year-over-year increase compared to the second quarter of 2021. Adjusted EBITDA margin for the second quarter of 2022 was 27.5% as we benefited from savings initiatives and accelerated synergies from EBI.\n\nAs anticipated, margins were down year over year in Q2 due to public company costs, EBI's lower margins and some incremental investments to staff ahead of the robust new business we continue to see come online. The impact to margins from public company costs and EBI will continue during 2022, but are moderating over the course of the year as we lap our September IPO as well as integrate EBI and realized cost synergies. As a result, we expect margins will continue to improve through the year. In the second quarter of 2022, we had adjusted net income of $32.5 million or $0.33 per diluted share, representing year-over-year growth in adjusted earnings per share of 32%.\n\nThis growth was primarily driven by strong year-over-year growth in revenues and operating income. Our adjusted effective tax rate in the second quarter was 25%, and we expect the rate to be in the range of 27% to 28% for the full year, including approximately 26% to 28% for the balance of 2022. Josh earlier described the consistency we have displayed in growing our top line organically. Slide 12 demonstrates our commitment to growing revenue profitably with Q2 marking the seventh consecutive quarter of double-digit year-over-year growth in adjusted EBITDA.\n\nWe have accomplished this in recent quarters despite an increase in public company costs and our full year guidance suggests the positive trend will continue. Our success in growing the bottom line is driven by our laser focus on achieving healthy profitable growth, cost discipline and innovation and automation, where we have made great strides, yet have more room for future improvement, particularly outside the U.S. This focus has positioned Sterling to scale profitably with 45% to 50% underlying incremental margins. In recent years, our operating leverage has driven significant margin expansion, and we expect this to continue once we move past this year.\n\nTurning to Slide 13. Free cash flow in the second quarter was $24 million, an increase of 28% from the prior year period. Q2's free cash flow was in line with our internal expectations and driven by growth in operating income. We continue to expect full year free cash flow conversion of adjusted EBITDA of 45% to 50%, similar to the rate achieved in 2021.\n\nOur net leverage at quarter end was 2.2 times net debt to adjusted EBITDA, inside our two times to three times net leverage target. Our net leverage continues to decline due to our strong adjusted EBITDA growth and is poised to continue declining absent any future M&A. We ended the quarter with total debt of $507 million, cash and cash equivalents of $66 million and $140 million available under our revolver, providing us with ample capacity to execute our growth strategy of reinvesting in organic revenue growth and pursuing M&A. As I discussed last quarter, our capital allocation priorities have not changed since the time of our IPO, investing in organic revenue growth, pursuing M&A and maintaining a healthy balance sheet.\n\nWe expect market consolidation to accelerate over the coming years, and we plan to be a key player in that dynamic. We remain active in exploring deals and believe that now is a great time to be opportunistic with our organic revenues growing strongly, our tech transformation mostly behind us and EBI integration progressing smoothly. Still, we remain disciplined in our approach, and we'll wait patiently for the right deals at the right price with a focus on target quality, synergy upside and ease of integration. On Slide 14 and 15, we provide our updated guidance for 2022.\n\nFor 2022, we now expect to generate revenues of $785 million to $795 million, representing year-over-year growth of 22% to 24%. Adjusted EBITDA $214 million to $220 million, representing year-over-year growth of 19.5% to 23% and adjusted net income of $115 million to $118 million, representing year-over-year growth of 25% to 28%. As shown on Slide 15, our guidance includes full year organic constant currency revenue growth of 17% to 19%, an increase from our previous guidance of 14.5% to 16.5%. Our guidance implies that over the back half of the year, our organic constant currency revenue growth will be at the high end of our long-term 9% to 11% target, even as we comp against a robust 37% organic constant currency revenue growth in the second half of 2021.\n\nAs expected, base growth is moderating from the outsized pace we have seen yet is still growing at a healthy rate. Based upon the strong results we are seeing from revenue drivers in our control, including our deep pipeline for new business coming online, we're excited about our prospects going forward. For the contribution from the acquisition of EBI, we now expect the deal to contribute six points of revenue growth in 2022, ahead of our initial expectations of 5% to 5.5%. And we are assuming approximately 100 basis points drag from fluctuations in foreign currency compared to 25 basis points in our previous guidance.\n\nWe have increased our full year organic constant currency revenue guide to reflect the excellent first half we recorded and strong outlook for the second half. As Josh mentioned, we've not seen any significant impact from a macroeconomic slowdown and expect our healthy revenue growth to continue. We continue to watch the overall economy and labor market carefully and have been thoughtful in setting our forecast. Turning to profitability.\n\nOur guidance includes adjusted EBITDA growth of 19.5% to 23% and implies a 2022 adjusted EBITDA margin of 27.5% at the midpoint, consistent with our previous guidance. This year, our expected underlying margin expansion of at least 100 basis points is being muted by a few items, including the absorption of three-quarters of public company costs, the acquisition of lower-margin EBI prior to full integration and advanced hiring of additional staff to support revenue growth against the tight labor backdrop. The year-over-year impact to margins from public company costs and EBI was most felt in the first half of the year, but we expect these drags to steadily alleviate as we go through 2022 and benefit from lapping the IPO plus EBI synergies. Additionally, as the new revenues come online during the second half, we expect the impact from our advanced hiring to normalize.\n\nAs a result of these dynamics, Q2 margins lifted considerably from Q1, and we expect margins to further improve sequentially throughout the year. Finally, turning to our adjusted net income growth guidance of 25% to 28%, we will benefit this year from reduced G&A, which should drive strong growth to the bottom line, well in excess of our revenue and adjusted EBITDA growth. We remain encouraged by the leverage in our financial model, driving strong adjusted net income growth during 2022 even in the absence of adjusted EBITDA margin expansion. To further help with your modeling, we've included a page in the appendix with our assumptions for 2022.\n\nIn closing, we are reaffirming our long-term targets on Slide 16. Over the next three to five years, we are targeting an annual organic revenue growth rate of 9% to 11%, with adjusted EBITDA margins ultimately expanding to 29% to 32% or more over that period as well as annual adjusted net income growth of 15% to 20% per year. We're thrilled with the trajectory of our company and the resilience of our business model. That concludes our prepared remarks.\n\nAt this time, operator, please open up the line for questions.\n\nOperator\n\n[Operator instructions] And our first question today is from George Tong of Goldman Sachs.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nYou indicated that you're not seeing a sign of a material cyclical slowdown based on trends in the business. Can you describe what KPIs you're tracking and if you're seeing early signs of a potential inflection point in performance?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nGeorge, it's Josh. Thanks for joining us, and thanks for the question. So I think, first of all, I think as you're aware, we monitor our transaction volumes on an hourly basis, on a daily basis, on a weekly basis. So in terms of actual results and order volumes that we're seeing, we really are continuing to see consistent trends with what we've seen throughout the year.\n\nAnd in terms of client conversations, again, they have been very consistent with what we've heard. So that is what led us to articulate our guidance and our belief in the rest of the year.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nOK. Got it. And then you mentioned you're expanding your package density with existing customers in the form of cross-sell, upsell. Could you describe the rate at which that's increasing by any specific details you could provide there?\n\nPeter Walker -- Executive Vice President and Chief Financial Officer\n\nSo, George, nice to hear from you. So we think about that in terms of cross-sell, upsell. And as we shared with you, we outperformed our cross-sell, upsell target for the quarter. So we continue to increase package density with our clients.\n\nIn terms of products, we think about that in terms of what is the offering within the background screening product that they're focused on. So is there enhanced crime products that would fit the client from a risk management perspective. And then we're also very focused on the sale of identity and our post-hire monitoring.\n\nOperator\n\nAnd our next question comes from the line of Manav Patnaik of Barclays.\n\nManav Patnaik -- Barclays -- Analyst\n\nMy first question is, Josh, the 10% or the double-digit new business growth that you're posting up, how much of that would you say is from kind of the fragmented players in the industry versus your other two big competitors? Is there any way to pass that out?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nManav, so we don't break it out specifically. What I said in my remarks, which I'll reemphasize is that our new business wins are coming from players of all size and from all across the globe. We're having a very, very consistent performance there. We've had the seven straight quarters of double-digit revenue growth from new business.\n\nAnd our pipeline remains consistent with what we've seen over that time. Our new wins that haven't yet started to build, but that we know are there and our implementation are consistent with everything we've seen through that time. So we've been performing extremely well on new business, really in all the verticals, in all the regions, and we continue to do so.\n\nManav Patnaik -- Barclays -- Analyst\n\nGot it. OK. And then just talking on the globe. I mean, if you look at the international growth, clearly all the focus on potential business, etc., in the U.S.\n\nBut just given your size and fragmentation there, do you think international could just power through the way it is if and if things slow down?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nManav, I'm just having a little trouble hearing your audio, but I believe your question was about the international growth and whether we think that we'll be able to continue to power through even if there's a slowdown. Is that fair?\n\nManav Patnaik -- Barclays -- Analyst\n\nThat is correct. Yes.\n\nJosh Peirez -- Chief Executive Officer and Director\n\nYes. So again, we think we're very well positioned internationally. We think we're the leader internationally. We continue to perform above our long-term metrics internationally, even over an extremely strong 2021.\n\nSo even over those comps, we're performing above our long-term expectations for our international business and our overall business. And we do expect international to be a grower through all cycles. So we are excited about our position there.\n\nOperator\n\nAnd our next question is from the line of Andrew Nicholas of William Blair.\n\nDaniel Maxwell -- William Blair and Company -- Analyst\n\nThis is Daniel Maxwell on for Andrew today. So to start off, still looking like double-digit revenue growth in the second half to get into that range of revenue guidance. How should we be thinking about kind of the conservatism of those numbers in the back half of the year? Especially if you see -- you mentioned no slowdown, but if you do see clients starting to tell you they're slowing. Is that churn enough to continue generating those double-digit revenue growth quarters indefinitely?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nThanks, Daniel. It's Josh. So first, indefinitely is a really long time. I'm going to focus on your question about the back half of this year.\n\nAnd of course, we reiterated our long-term targets of the 9% to 11%. So that's a three- to five-year period will sort of stick in that time frame. In terms of the rest of this year and the guidance, our view is consistent with what we did last quarter. We're not seeing the slowdown.\n\nWe have built in a little bit of conservatism as we stated last quarter, but of course, we have three months more of visibility than we did last quarter. You saw how we performed over those three months. So we continue to see very consistent trends. We are lapping a big second half, which I do want to reiterate, and I think that's part of what's underlying your question.\n\nAnd so as we look at the second half, we do believe that we're going to continue to perform within the long-term range that we've provided and at the higher end implied by the guidance that we've provided.\n\nDaniel Maxwell -- William Blair and Company -- Analyst\n\nOK. Great. That's helpful. And then for my follow-up, can you give us any update on any pricing trends you're seeing from third-party data vendors or any other third-party costs, any acceleration in price increases due to the inflationary environment?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nYes. Thanks for the question. And we don't comment on sort of specific input costs that we have, but I do want to emphasize that our contractual structures allow us when we do have cost increases from data vendors to actually pass those costs along to our clients, which we do. So while it could have an effect on margin, it does not affect our profitabilityand our ability to continue to charge our clients for the data that we provide them.\n\nIn terms of the input costs we're seeing, we believe that we are continuing to perform well in terms of our gross margin and as Peter shared in his remarks. But for the impacts of the lower-margin and EBI business and the public company costs coming on the books, we would have increased our margins by over 100 basis points. So whatever those input costs are, we believe that we're able to manage those and increase margins through them.\n\nOperator\n\nAnd our next question is from the line of Toni Kaplan of Morgan Stanley.\n\nGreg Parrish -- Morgan Stanley -- Analyst\n\nThis is Greg Parrish on for Tony. And congrats on another strong result. Peter, I just wanted to talk about pacing in the second half. I know there's some seasonality in the business given hiring schedules, but we really haven't seen that over the last couple of years.\n\nI think maybe partly, a, from recovery from COVID and also your new business has been so strong. It's kind of outpaced that. So how should we think about pacing in the back half in 3Q versus 4Q?\n\nPeter Walker -- Executive Vice President and Chief Financial Officer\n\nSure. So I think that you need to think -- the guidance that I shared on the call was that the organic revenue growth in the back half of the year would be between 9% and -- to 11% and at the high end of that range. We're not giving specific quarterly guidance, but you should think about that for the back half of the year in terms of the organic revenue growth rate. And then we also provided the expectation of full year 6% growth from EBI and full year 150 basis points headwind from FX.\n\nGreg Parrish -- Morgan Stanley -- Analyst\n\nOK. Great. And then wanted to talk about identity, which I know you have a TAM out there and you talked about it quite a bit, but maybe you can kind of give us an update what percent of clients are currently using identity in the package and where you see that going over the next year or two? And how is it going with clients just sort of educating them on identity?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nYes. Thanks, Greg. It's Josh. So we're not going to be providing updates every single quarter on how specific products do.\n\nBut I think that when we talk about identity, we really have three different flavors. One, we have our fingerprinting business continue to see very strong results from our partnership with FINRA and our uptake from clients moving direct to us versus also where we're channeling on behalf of our competitors and other players. So really pleased there. In terms of the second offering, which is really just facial recognition compared with government-issued IDs, which is kind of what others in the industry have started to do in copying us, we continue to see really good traction there, particularly in the U.K.\n\nand in Australia, where the uptake really looks good. And then in the U.S., we have our exclusive partnership with ID.me continues to be early days and it's something we would expect to be able to provide some updates on closer to the end of the year.\n\nOperator\n\nOur next question is from Andrew Steinerman of J.P. Morgan.\n\nAlex Hess -- J.P. Morgan -- Analyst\n\nThis is Alex Hess on for Andrew Steinerman. Just want to touch briefly about pricing. Have you guys been able to pass through like-for-like price increases in any meaningful way? Or has pricing broadly been sort of consistent or flat in the quarter?\n\nPeter Walker -- Executive Vice President and Chief Financial Officer\n\nYes. So, Alex, thanks for the question. So in terms of pricing, as we've shared in the past, right, we believe we have a unique contract structure where the majority of our contracts are three-year contracts with exclusivity or primary designation and those contracts allow us to take an annual price increase. We did take an annual price increase midyear this year, just as we've done in previous years, and we basically do that across the book of the business where it feels appropriate to do it.\n\nAlex Hess -- J.P. Morgan -- Analyst\n\nAnd then my second question is on M&A. Both you guys and some of your public peers have stepped up their sort of language around M&A and around their views on consolidation and the outlook for that in the years ahead. What's changed sort of materially in the last quarter or so in your view? And why is now maybe a better time to do M&A than in the recent invest?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nAlex, it's Josh. So I can't comment on what competitors have said or why they've changed their view. I think we have been very consistent since our road show in terms of M&A, in terms of our uses of our available capital, in terms of our priorities, first being to drive the organic growth, investing in that business. We think that's bearing fruit pretty significantly when you look particularly at the new business and the cross-sell, upsell numbers.\n\nOur second priority being M&A. And obviously, we're pleased with the way EBI is performing, which we closed at the end of November last year. And we continue to look for good assets. I will remind you at the time when we talked about the deal for EBI, we articulated that we were paying somewhere between in our view, four to four and a half times the pro forma synergized EBITDA that we could generate once we synergize the asset.\n\nWe continue to look for assets where we can do that and where there are enough size and scale but not too big, that we're able to do that. So we've been very clear on our M&A approach throughout. I think what we're seeing in market right now is that the assets that have been there, we just didn't love the price, honestly. There were a couple of good assets, but we're not going to overpay for them.\n\nBut we continue to see a rich pipeline of M&A, and we do expect it to be a significant part of our future, and we do look forward to helping consolidate the industry over time.\n\nOperator\n\nAnd our next question is from Darrin Peller of Wolfe Research.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHow much -- if you could just, Josh, if you could talk a little bit through the speed in the top end of the range for the second half of the year for revenue? And how much of that you think is coming from the macro side, employment levels versus your own performance? And what you -- you're overperforming or out achieving what you'd expect in terms of your own initiatives? And what were those initiatives that you think are going so well that were maybe beyond expectations?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nYes. Thanks, Darrin. Thanks for joining us. I think that our view, and that's why we focused on it in this call, is that we're performing extremely well on the areas we control, new business generation, cross-sell, upsell and making sure that we retain our clients.\n\nAnd looking at those long-term targets, as Peter said, in the quarter, really pleased to actually outperform all our drivers. So that is something that we're very, very focused on. In terms of the macro environment, we think that it remains strong. We think it will continue to remain strong overall.\n\nAgain, base growth can vary, as I mentioned in my prepared remarks, but we don't count on base growth to hit our targets. It's the smallest element of our growth algorithm. And obviously, it's been overperforming for the last couple of years coming out of the COVID lockdown, but it's not something we're counting on really continuing in the back half or into the future, although it might.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nSo it sounds like it's mostly operational execution with a stable employment expected to continue for at least some time. All right. And then maybe just on the other side of that, if you think about managing your costs and your margins going forward, I mean it sounds like from again, from a macro standpoint, you're assuming a consistent environment. Is that fair in terms of how you're planning for cost build-out and investments going forward? And just a follow-on to that question would be any flexibility if you see a quick change in the labor market or the hiring market? How much you can really flex costs, if necessary?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nYes. Thanks, Darrin. So first, just on your summary of my answer on the first question, I want to clarify that as we shared even in 2020, we were able to be within the range of our long-term algorithm on the new business and on the cross-sell, upsell, and we improved our retention rate at that time getting closer to where we are now. So we think that even if the macro does slow down, we are in a position to continue to perform well because we are performing well on the things we control, and that's really why we're exercising that.\n\nWell, I just want to emphasize that. In terms of the second part of your question on cost, one of the beautiful things about our business is that there are very few fixed costs. So much of our cost base is variable. So you have our cost of goods sold, which you see laid out, almost automatically, the overwhelming majority of that goes away if the orders are not there because they only happen when we go and pull data and pull reports.\n\nIn terms of the people, we did share that we were hiring people a bit ahead of when we normally would have on our last call in order to ramp for the volumes we expected. We see those volumes in the quarter. So we were happy to be staffed for them. We believe that, that was something that served us well here.\n\nBut in a normal environment, we would be able to take those costs out very quickly. And in terms of the costs that are sitting in our SG&A, we have quite a bit of flexibility, and we took a lot of cost saving measures in 2020 within a week when we had to do it. And we would do that again if that's required. And I do want to say one thing you mentioned in your question was that we were sort of assuming a stable environment.\n\nWe're assuming that only because that's what we're seeing. But we have game plans for many different environments, basically sitting there ready to be executed, the moment that we see some sort of change in the environment. Whether that's a ramp up or a ramp down, we'll be positioned well in order to execute against that in any macro environment.\n\nOperator\n\n[Operator instructions] Our next question is from the line of Mark Marcon of Baird.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nCongratulations on the strong results. Just wondering, can you talk a little bit about where you are with Project Ignite? And what the potential is for Project Ignite to improve the margins even further next year and the year beyond that?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nThanks, Mark, it's Josh. I'll start, and if Peter wants to add color, I'll turn it to him after. So we're very pleased with where we are. Again, Project Ignite had three phases to it.\n\nPhase one, which was the front end and the experiences we gave to our clients. That's been done now really since the very beginning of 2020. So we're really pleased with that. We think that's actually a huge part of the new business growth and the retention improvements because that client experience, we believe, is definitely best-in-class.\n\nThe second piece, which was our migration to the cloud, we've been articulating kind of the 95% of revenue running through the cloud already since the middle-ish of 2020. We believe that, that has well positioned us competitively as well. I would expect to complete that migration itself sometime this year. It's really just our Asia region at this point.\n\nThat's the primary piece that's not there. And we've got a couple of data center shutdowns planned in the third quarter as well here in the U.S., which will be very good for us. Again, we're not running things through them today other than internal systems, but it will be good to get those off the books. The third part of Project Ignite, which was really shutting down older platforms that had been acquired even before my time at Sterling and migrating those clients on to our best-in-class platform now is underway and going well.\n\nAs always with these projects, you have to do the work before you can move the clients. We've been moving tranches of clients as we've both the capabilities that we needed for them so that they are having that better experience as they move, and we expect to continue that. We should be in a position on our next call to provide an update on how much volume is remaining to be moved and when we expect the cost to be fully out of the system.\n\nPeter Walker -- Executive Vice President and Chief Financial Officer\n\nAnd then maybe, Mark, pick up on the financial side. So I think three things to think about. I think number one, the cost of Ignite is already out of the financial statement, and it's running through as an adjustment. So you're not seeing the cost for executing the project.\n\nSo you're already seeing the margin benefit there. Two, in terms of capex, we do expect capex to go down by about a third as we finish our Project Ignite just because we'll be capitalizing less development related to that project as it closes out. And then I think third, going forward, we really see opportunity in how we run our global fulfillment operations. And as we're complete the migration of being on one platform, we just think there's continued opportunity for automation, and that should help us improve the gross margin.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nThat's great. And then can you talk a little bit about international? You mentioned you got the 16% growth, APAC growing the fastest. What are you seeing in terms of EMEA? And what are the opportunities for further international expansion that you're currently working on?\n\nPeter Walker -- Executive Vice President and Chief Financial Officer\n\nYes. Sure. So we were really pleased with the 16% organic constant currency revenue growth in the quarter, especially lapping such a strong quarter last year, and we did highlight that APAC led that. We continue to see robust opportunities in Asia Pacific, EMEA and Canada.\n\nSo I feel good about the 16% for the quarter, and it's really above our long-term expectations for International.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nGreat. Any signs of slowing in any international markets?\n\nPeter Walker -- Executive Vice President and Chief Financial Officer\n\nNo. We saw broad-based growth across all seven of our verticals in the U.S. and across all three of our international markets.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nExcellent. And then can you talk a little bit about the base growth of 2% to 3%? How -- on a go-forward basis for your expectations, how does that compare to the price increase that you have in place?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nMark, it's Josh. I think I'm just -- want to make sure I understand your question. You're asking in terms of the long-term base growth, how much of that are we expecting to come from price increases versus just incremental ordering?\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nJust as it relates to the balance of this year, I thought you said 2% to 3% base growth for the balance of the year. I was wondering how that continues to the midyear price increase.\n\nJosh Peirez -- Chief Executive Officer and Director\n\nSure. Thanks. So if I said that, that is not what we meant to say, so I do want to clarify. We did not say what we're expecting on the drivers for the rest of the year.\n\nWe simply said that our long-term algorithm has the 2 to 3, or 9 to 11, which is in our long-term algorithm as you look at our guide for the rest of the year. It would imply being at the high end of that range, but we've not broken it down in terms of the different elements.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nOK. Great. And then what are you seeing across the rest of the industry from a pricing perspective?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nWe're really focused on sterling, Mark. We think that we're the premier provider. We think that our new business generation, our retention rates tell everyone that we're the premier provider, and we're focused on us. So I can't speak to what competitors are doing, but I know that what we're doing is taking care of our clients doing well, executing on our strategy, providing added value to our clients and making sure that we're able to serve them through these challenging environments where it's very hard to bring people on board and what we do is super important to what they need.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nGreat. And then last quarter, you talked about the pilot programs in ID.me. Are there any more companies that are coming on for additional pilot programs? Or I know you don't want to go into ID.me in a lot of detail, but can you give us just a little bit of an update there?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nYes. I think the update sort of provided is we continue to be pleased with what we're seeing overall with identity. We're not planning incremental piloting programs. We think that the pilots gave us what we needed in terms of some additional functionality and features and things that we think will really allow us to juice the rollout.\n\nWe're working on implementing those right now. And as I said, I think we'll be in a position to provide more of an update on the pipeline and the uptake in the next couple of calls.\n\nOperator\n\nAnd our final question today is from the line of Shlomo Rosenbaum of Stifel.\n\nAdam Parrington -- Stifel Financial Corp. -- Analyst\n\nIt's Adam Parrington on for Shlomo. In terms of the EBI acquisition, I hear it's looks like it's performing well. Just in terms of the integration, in terms of the execution and in terms of getting it integrated within the time -- a target time frame, where the things stand?\n\nJosh Peirez -- Chief Executive Officer and Director\n\nThanks, Adam. It's Josh. So I think a couple of things. First of all, we're definitely pleased with the feedback from the EBI clients and their excitement about being with Sterling.\n\nAnd part of why we think it's overperforming is we tend to take a view of retention and an acquisition that you're likely to lose some clients, and we've been able to overperform that. So we're very pleased about the early traction with clients, and that's important. Part of the reason for that is that we have tried to move even quicker than our initial plans in terms of the integration, and we've been able to do a few key things. One, we were able to implement much of our fulfillment and replaced our fulfillment for what had been there before, which gives us some benefit early on in the results and also gives our clients a benefit.\n\nIt's not fully done, but that's been helpful. I think the second piece is moving faster to integrate our teams which has been successful. In fact, three of the most senior EBI folks are now in three key roles. One is a general manager in one of our verticals, one leading a client success team there and one actually running our crime product set.\n\nSo we're really pleased that we were able to leverage the talent, particularly in this kind of a challenging labor market to bring on some really good people and have them in really key roles very quickly. We think that bodes as well for the business. And then in terms of kind of completion, we're in the heat right now of starting to move clients. We think we've got the functionality there, and we're starting to really get to that point.\n\nSo we'll probably have a better update on that in the Q3 call. But so far, we're a little bit ahead of schedule. But really, the toughest part is the actual move of the clients from one platform to another. So I don't want to say that we'll finish earlier than our initial expectations until we get a little more experience with that over the next quarter or so.\n\nAdam Parrington -- Stifel Financial Corp. -- Analyst\n\nOK. And as a percentage of revenue is coming from international locations this quarter?\n\nPeter Walker -- Executive Vice President and Chief Financial Officer\n\nSo as we shared on the call, for second quarter, we had an organic constant currency of 16% from the international, the three regions, and that was performing ahead of our long-term target for international growth.\n\nAdam Parrington -- Stifel Financial Corp. -- Analyst\n\nSo what was the percentage of revenue, [Inaudible] revenue versus international?\n\nPeter Walker -- Executive Vice President and Chief Financial Officer\n\nFor the quarter, it was 15%.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJudah Sokel -- Vice President, Investor Relations\n\nJosh Peirez -- Chief Executive Officer and Director\n\nPeter Walker -- Executive Vice President and Chief Financial Officer\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nManav Patnaik -- Barclays -- Analyst\n\nDaniel Maxwell -- William Blair and Company -- Analyst\n\nGreg Parrish -- Morgan Stanley -- Analyst\n\nAlex Hess -- J.P. Morgan -- Analyst\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nAdam Parrington -- Stifel Financial Corp. -- Analyst\n\nMore STER analysis\n\nAll earnings call transcripts"
}