{
  "companyName": "D.R. Horton",
  "companyTicker": "DHI",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/dr-horton-dhi-q4-2022-earnings-call-transcript/",
  "content": "D.R. Horton (DHI -0.29%)\nQ4 2022 Earnings Call\nNov 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the fourth quarter 2022 earnings conference call for D.R. Horton, America's Builder, the largest builder in the United States. At this time, all participants have been placed on a listen-only mode, and we will open the floor for your questions and comments. [Operator instructions] I will now turn the call over to Jessica Hansen, vice president of investor relations for D.R.\n\nHorton. Jessica, the floor is yours.\n\nJessica Hansen -- Vice President, Investor Relations\n\nThank you, Tom, and good morning. Welcome to our call to discuss our fourth quarter and fiscal 2022 financial results. Before we get started, today's call includes forward-looking statements as defined by the Private Securities Litigation Reform Act of 1995. Although D.R.\n\nHorton believes any such statements are based on reasonable assumptions, there is no assurance that actual outcomes will not be materially different. All forward-looking statements are based upon information available to D.R. Horton on the date of this conference call and D.R Horton does not undertake any obligation to publicly update or revise any forward-looking statements. Additional information about factors that could lead to material changes in performance is contained in D.R.\n\nHorton's annual report on Form 10-K and subsequent reports on Form 10-Q, all of which are filed with the Securities and Exchange Commission. This morning's earnings release can be found on our website at investor.drhorton.com, and we plan to file our 10-K toward the end of next week. After this call, we will post updated investor and supplementary presentations to our Investor Relations site on the Presentations section, under News and Events, for your reference. Now, I will turn the call over to David Auld, our president and CEO.\n\nDavid Auld -- President and Chief Executive Officer\n\nThank you, Jessica. And good morning. We are also joined on this call by Mike Murray and Paul Romanowski, our executive vice president and co-chief operating officers; and Bill Wheat, our executive vice president and chief financial officer. The D.R.\n\nHorton team finished the year with a solid fourth quarter, which included a 20% increase in consolidated pre-tax income to $2.1 billion and a 19% increase in revenues to $9.6 billion. Our pre-tax profit margin for the quarter improved 10 basis points to 21.4%, and our earnings per diluted share increased 26% to $4.67. For the year, consolidated pre-tax income increased 42% to $7.6 billion on $33.5 billion of revenue, which increased 21%. Our pre-tax profit margin for the year improved 350 basis points to 22.8%, and our earnings per diluted share increased 45% to $16.51.\n\nWe closed a record of 83,518 this year in our whole building and single-family rental operations. And our homebuilding SG&A as a percentage of revenues of 6.8% was an all-time low. Our homebuilding return on inventory for the year was 42.8%, and our consolidated return on the equity was 34.5%. Our strong financial performance during a year of significant challenges and volatility reflects the strength of our experienced teams, industry-leading market share, broad geographic footprint, and diverse product offerings.\n\nOur homebuilding cash flow from operations for 2022 was $1.9 billion. Over the past five years, we have generated $7.5 billion of cash flow from homebuilding operations while growing our consolidated revenues by 138% and our earnings per share by 503%. During this time, we also more than doubled our book value per share, consistently kept our homebuilding leverage under 20%, and increased our homebuilding liquidity by $1.8 billion, all while significantly increasing our returns on inventory and equity. During most of the year, demand for our homes was strong.\n\nIn June, we began to see a moderation in housing demand that has continued and accelerated through today. The rapid rise in mortgage rates, coupled with high inflation and general economic uncertainty, have made many buyers pause in their home-buying decision or choose to not move forward with their home purchase. However, the supply of both new and resell homes at affordable price points remains limited and the demographics supporting housing demand remained favorable. The uncertainty of this market transition may persist for some time and could get more challenging if mortgage rates continue increasing.\n\nHowever, we are well-positioned to meet changing market conditions with our experienced teams, affordable product offerings, flexible lot supply, and great trade and supplier relationships. Our strong balance sheet, liquidity, and low leverage provide us financial flexibility. We will continue to focus on turning our inventory and managing our product offerings, incentives, old pricing, sales pace, and inventory levels to beat the market, optimize returns, increase market share, and generate increased cash flow from our homebuilding operations. Mike?\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nDiluted earnings per share for the fourth quarter of fiscal 2022 increased 26% to $4.67 per share. And for the year, earnings per share increased 45% to $16.51. Net income for the quarter increased 22% to $1.6 billion. And for the year, net income increased 40% to $5.9 billion.\n\nOur fourth-quarter home sales revenues increased 23% and to $9.4 billion on 23,212 homes closed, up from $7.6 billion on 21,937 homes closed in the prior year. Our average closing price for the quarter was $403,700, up 17% from last year and up 3% sequentially. We closed fewer homes than we expected during the fourth quarter due to a slower sales pace, increased cancellations, and continued construction delays. In addition, we estimate that approximately 730 home closings in Florida and South Carolina were delayed from September due to Hurricane Ian.\n\nPaul?\n\nPaul Romanowski -- Executive Vice President and Co-Chief Operating Officer\n\nDuring the quarter, we continued to sell homes later in the construction cycle to better ensure the certainty of the home close date and mortgage rate for our homebuyers with almost no sales occurring prior to start of home construction. Our net sales orders in the fourth quarter decreased 15% to 13,582 homes, and our net sales order value was down 10% from the prior year to $5.4 billion. Our cancellation rate during the fourth quarter was 32%, compared to 19% in the prior-year quarter and 24% in the third quarter. Our average number of active selling communities increased 8% from the prior year and was flat sequentially.\n\nThe average sales price on net sales orders in the fourth quarter was $399,600, up 6% from the prior year but down 4% sequentially from the June quarter. In October, as mortgage rates continue to increase, our net sales orders were below prior-year levels, and our cancellation rate remained elevated. As a result, we currently expect our first quarter net sales orders to be down approximately 25% to 35% year over year. Bill?\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nOur gross profit margin on home sales revenue in the fourth quarter was 28.3%, up 140 basis points from the prior-year quarter but down 180 basis points sequentially from the June quarter. On a per-square-foot basis, our revenues were up 4% sequentially while our stick and brick cost per square foot increased 8% and our lot cost increased 3%. The decrease in our gross margin from the third to fourth quarter reflects the increase in our stick and brick costs and increased incentives provided to homebuyers to ensure the closings of our homes and backlog during the rapid rise in mortgage interest rates. We are offering mortgage interest rate locks and buydowns and other sales incentives to address affordability concerns and to drive sales traffic to our communities.\n\nAs we adjust to market conditions and focus on turning our inventory to maximize returns, our incentive levels have continued to increase, and we are adjusting base home prices where necessary. We expect our average sales price and home sales gross margin to decrease from current levels in fiscal 2023. As a result, we are working with our trade partners and suppliers to reduce our construction costs on new home starts and are pleased with our early progress. Jessica?\n\nJessica Hansen -- Vice President, Investor Relations\n\nIn the fourth quarter, homebuilding SG&A expense as a percentage of revenues was 6.7%, down 20 basis points from 6.9% in the prior-year quarter. For the year, homebuilding SG&A expense was 6.8%, down 50 basis points from 7.3% in 2021. Our annual homebuilding SG&A expense as a percentage of revenues is at its lowest point in our history, and we will continue to control our SG&A while ensuring that our platform adequately supports our business. In fiscal 2023, our homebuilding SG&A as a percentage of revenues will likely increase from current levels.\n\nPaul?\n\nPaul Romanowski -- Executive Vice President and Co-Chief Operating Officer\n\nWe started fewer homes this quarter as we work to position our inventory with an appropriate number of homes relative to market conditions. We started 13,100 homes during the quarter in our homebuilding operations as we began negotiations to lower our construction costs on future new home starts. We ended the year with 46,400 homes in inventory, down 3% from a year ago and down 18% sequentially. Twenty-seven thousand two hundred of our total homes at September 30 were unsold, of which 4,400 were completed.\n\nFor homes we closed this quarter, our construction cycle time increased by a week compared to the third quarter, which reflects continued lingering supply chain issues. However, we are beginning to see some stabilization in cycle times on homes we have recently started, and we expect our cycle time to improve in fiscal 2023. We expect our start pace in the first quarter of fiscal 2023 to increase versus our fourth quarter pace, and we will adjust our starts in homes and inventory to meet the level of demand in the market. Mike?\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nAt September 30, our homebuilding lot position consisted of approximately 573,000 lots, of which 23% were owned and 77% were controlled through purchase contracts. Our total homebuilding lot position decreased by 25,000 lots from June to September. 29% of our total owned lots are finished and 50% of our controlled lots are or will be finished when we purchase them. Our capital-efficient and flexible lot portfolio is a key to our strong competitive position.\n\nWe continually underwrite all of our lot and land purchases based on current and expected home prices and cost. We are actively managing our lot and land pipeline and our investments in lots, land, and development to meet our needs during this transition in the housing market. During the quarter, our homebuilding segment wrote off $34 million of option deposits and due diligence cost related to land and lot option contracts we terminated or expect to terminate in the future. We expect our level of option cost write-offs to remain elevated in fiscal 2023 as we manage our lot portfolio.\n\nOur homebuilding segment had no inventory impairments during the quarter or the year. Our fourth-quarter homebuilding investments in lots, land, and development totaled $1.5 billion, down 19% from the prior-year quarter and down 15% sequentially. Our current quarter investments consisted of $780 million for finished lots, $560 million for land development, and $150 million to acquire land. Paul?\n\nPaul Romanowski -- Executive Vice President and Co-Chief Operating Officer\n\nFor the fourth quarter, Forestar, our majority-owned residential lot development company reported total revenues of $381.4 million, 3,914 lots sold, and pre-tax income of $66.4 million. For the full year, Forestar delivered 17,691 lots, generating $1.5 billion of revenues with a pre-tax profit margin of 15.5%. At September 30, Forestar's owned and controlled lot position was 90,100 lots. 59% of Forestar's owned lots are under contract with D.R.\n\nHorton or subject to a right of first offer. $250 million of D.R. Horton's lot purchases in the fourth quarter were from Forestar. Forestar is separately capitalized from D.R.\n\nHorton and had approximately $620 million of liquidity at year-end with a net debt-to-capital ratio of 26.9%. Forestar is well positioned to meet changing market conditions with a strong capitalization, lot supply, and relationship with D.R. Horton. Bill?\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nFinancial services pre-tax income in the fourth quarter was $2.4 million on $134 million of revenue, with a pre-tax profit margin of 1.8%. As expected, our financial services pre-tax profit margin decreased this quarter primarily due to a significant pull forward of revenue from rate lock commitments in the third quarter, as we discussed on last quarter's call. Also, during the fourth quarter, there were increased competitive pressures in the mortgage market and increased cost of rate locks provided to customers due to rising rates. For the year, financial services pre-tax income was $291 million, on $795 million of revenue, representing a 36.6% pre-tax profit margin.\n\nWe expect our financial services pre-tax profit margin for fiscal 2023 to be higher than the fourth quarter but below the full year of fiscal 2022. During the fourth quarter, 99% of our mortgage company's loan originations related to homes closed by our homebuilding operations, and our mortgage company handled the financing for 73% of our homebuyers. FHA and VA loans accounted for 42% of the mortgage company's volume. Borrowers originating loans with DHI Mortgage this quarter had an average FICO score of 724 and an average loan-to-value ratio of 87%.\n\nFirst-time homebuyers represented 57% of the closings handled by our mortgage company this quarter. Mike?\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nDuring fiscal 2022, our rental operations generated $510 million from the sale of 775 multifamily rental units and 774 single-family rental homes, earning pre-tax income of $202 million. In the fourth quarter, our rental operations generated $21 million of revenues from the sale of 96 single-family rental homes and incurred a pre-tax loss of $13 million, which were below our expectations going into the quarter. We had several single-family rental projects in Florida, totaling 562 homes that were scheduled to close in September, but were delayed due to Hurricane Ian. These projects closed in October and will be reflected in our first-quarter results.\n\nAlso, one multifamily project and multiple single-family rental projects that were expected to be sold and closed in the fourth quarter were delayed due to changes in the capital markets that affected the timing of buyers' financing. Our rental property inventory at September 30 was $2.6 billion, which included approximately $900 million of multifamily rental properties and $1.7 billion of single-family rental properties. As a reminder, our multifamily and single-family rental operating results are separately reported in our rental segment and are not included in our homebuilding segments homes closed revenues, or inventories. We expect our rental operations to generate significant increases in both revenues and profits in fiscal 2023 as our platform matures and expands across more markets.\n\nBill?\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nOur balanced capital approach focuses on being disciplined, flexible, and opportunistic. We are committed to maintaining a strong balance sheet with low leverage and significant liquidity to provide a firm foundation for our operating platforms during changes in market conditions and to support our ability to provide consistent returns to our shareholders. During fiscal 2022, our cash provided by homebuilding operations was $1.9 billion and the cumulative cash generated from our homebuilding operations for the past five years was $7.5 billion. At September 30, we had $4 billion of homebuilding liquidity, consisting of $2 billion of unrestricted homebuilding cash and $2 billion of available capacity on our homebuilding revolving credit facility.\n\nOur liquidity provides significant flexibility to adjust to changing market conditions. Our homebuilding leverage was 13.2% at fiscal year-end, and homebuilding leverage net of cash was 4.4%. Our consolidated leverage at September 30 was 23.8%, and consolidated leverage net of cash was 15.4%. We repaid $350 million of senior notes at maturity this quarter, and we have $700 million of senior notes that mature during fiscal 2023.\n\nAt September 30, our stockholders' equity was $19.4 billion, and book value per share was $56.39 and up 35% from a year ago. For the year, our return on equity was 34.5%, an improvement of 290 basis points from 31.6% a year ago. During the quarter, we paid cash dividends of $78.2 million for a total of $316.5 million of dividends paid during the year. During the quarter, we repurchased 3.6 million shares of common stock for $251.7 million for a total of 14 million shares repurchased during the year for $1.1 billion.\n\nAs a result, our outstanding share count is down 3% from a year ago. Based on our strong financial position, our board of directors increased our quarterly cash dividend by 11% to $0.25 per share. Jessica?\n\nJessica Hansen -- Vice President, Investor Relations\n\nAs we look forward to the first quarter of fiscal 2023, we expect challenging market conditions to persist with continued uncertainty regarding mortgage rates, the capital markets, and general economic conditions that may significantly impact our business. As we have already mentioned, we are utilizing more incentives in today's market and are reducing home sales prices where necessary which will impact our average sales prices and gross margins more in the first quarter than the quarter we just completed. We are providing detailed guidance for the first quarter as is our standard practice but due to the current uncertainty in the market, our ranges for expectations are wider than normal. We currently expect to generate consolidated revenues in our December quarter of $6 billion to $6.8 billion and our homes closed by our homebuilding operations to be in the range of 15,000 to 16,500 homes.\n\nWe expect our home sales gross margin in the first quarter to be approximately 23% to 24% and homebuilding SG&A as a percentage of revenues in the first quarter to be approximately 8% to 8.4%. We anticipate a financial services pre-tax profit margin of around 20% and we expect our income tax rate to be approximately 23% in the first quarter. Looking further out into fiscal 2023, we have less visibility due to the macro-level uncertainties we have mentioned. It is too early to know what housing market conditions will be three to six months from now during the spring selling season, so we are not providing specific guidance for the full year yet.\n\nWe will reassess each quarter and give more color on our expectations as we can. We are well-positioned to aggregate market share in both our homebuilding and rental operations. Our fiscal 2023 home closings volume, pricing, and margins will be determined by future market conditions and our efforts to meet the market and improve our inventory turns, construction cycle times, and costs. Our goal is to generate consolidated revenues in fiscal 2023 that are slightly higher than fiscal 2022.\n\nHowever, the low end of our current range of expectations includes consolidated revenues potentially down from fiscal 2022 by a mid-teens percentage. We forecast an income tax rate for fiscal 2023 of approximately 23% we expect to generate increased cash flow from our homebuilding operations in fiscal 2023 compared to fiscal 2022, and we plan to consistently repurchase shares to reduce our share count during the year with the amount of our repurchases dependent on cash flow, liquidity, market conditions, and our investment opportunities. We plan to continue to balance our cash flow utilization priorities among our core homebuilding operations, our rental operations, maintaining conservative homebuilding leverage and strong liquidity, paying an increased dividend, and consistently repurchasing shares. David?\n\nDavid Auld -- President and Chief Executive Officer\n\nIn closing, our results and position reflect our experienced teams, industry-leading market share, broad geographic footprint, and diverse product offerings. Our strong balance sheet, liquidity, and low leverage provide us with significant financial flexibility to operate effectively in changing economic conditions and continuing to aggregate market share. We plan to maintain our disciplined approach to investing capital to enhance the long-term value of the company, which includes returning capital to our shareholders through both dividends and share repurchases on a consistent basis. Thank you to the entire D.R.\n\nHorton team for your focus and hard work. Your efforts during 2022 were remarkable. This was a year in which we faced construction and operational challenges we have never faced before with periods of unsustainably high demand, followed by historic rise in mortgage rates. Despite these challenges and market volatility, we closed the most homes in a year in our company's history, completing our 21st year as the largest builder in the United States with record profit and returns, and we are well positioned to continue improving our operations and providing homeownership opportunities to more American families in 2023.\n\nThis concludes our prepared remarks. We will now host questions.\n\nOperator\n\nThank you. Ladies and gentlemen, the floor is now open for questions. We do ask that while asking your questions, you limit yourself to one question and one follow-up. [Operator instructions] Once again, as a reminder, ladies and gentlemen, to please limit yourself to one question and one follow-up.\n\nPlease hold a moment while we poll for questions. And the first question today is coming from Stephen Kim from Evercore ISI. Stephen, your line is live. Please go ahead.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nThanks very much, guys, and thanks for all the information. Obviously, pretty solid performance in a tough environment. I wanted to ask you specifically about your starts outlook. Can you give us a sense for how much of an increase in starts we might expect in the December quarter, maybe year over year or quarter over quarter? And maybe alternatively, how many finished specs or total specs per community are you expecting to have as you enter the new calendar year?\n\nPaul Romanowski -- Executive Vice President and Co-Chief Operating Officer\n\nStephen, looking into the first quarter, we are finishing the year with 46,000 homes in inventory and positioned for our goals as we look forward to the year and looking to maintain a similar balance as we work through the first quarter. So, expect that our starts will keep pace with our closings through the first quarter.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nGotcha. And then --\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nYeah. In terms of the completed specs, Steve, we're in a more normal position now with having some completed specs across more of our communities. That puts us in a good position to sell in the current environment given that buyers are concerned about what their interest rates are going to be. So, if we have homes that are ready to move into quickly, they can lock their rates with confidence and close on a known schedule.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nSo, the level of completed specs you have now is you're comfortable with sort of maintaining that level, right? That's what you're saying?\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nYeah.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nOK. And then the second question relates to your comments about navigating the difficult environment or the uncertain environment by managing your product offerings and negotiating lower cost is certainly the negotiation of lower costs. I understand that's going to be ongoing. But the managing of your product offerings, can you give us a sense for how quickly you're able to swap out models or at least floor plans that you're offering in your communities? Is that something that we could expect you to do in communities that are currently open? Or are we really looking at communities that are going to be new communities opening up? Maybe give us a sense for like what share of the communities you will have open, let's say, for the spring selling season will have a revamped product line.\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nIn most of our communities across the country, Steve, we'll be able to start back smaller homes primarily and change specification levels in those homes. That we start -- have been starting in the most recent quarter and will be starting in the first quarter. There are some communities that are a little more locked in on product and planned neighborhood phases that it may take three to six months to work through some changes in the product offerings. But by and large, most of our communities, those changes are starting today, and we'll continue to see that roll out through the next six to nine months.\n\nDavid Auld -- President and Chief Executive Officer\n\nAnd, Stephen, even with product lines that we've been offering as a spec builder, we release certain houses every month. So, when the market is running red hot like it was first half-plus of last year, you know, you have a tendency to release the bigger houses because your net dollar profit per house is higher. Now, when a price point becomes much more important to the buyers. We made the release, they go from the 2,300-square foot two-story down to the 1,600-square foot ranch, which drops the overall ASP of the community without really changing the product or impacting valuations within the community.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nGreat. That's really helpful. Thanks so much, guys.\n\nDavid Auld -- President and Chief Executive Officer\n\nWe control that by which houses we release into production.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nGreat. Thanks very much, guys.\n\nOperator\n\nThank you. The next question is coming from John Lovallo from UBS. John, your line is live. Please go ahead.\n\nJohn Lovallo -- UBS -- Analyst\n\nGood morning, guys. Thank you for taking my questions. First one is the first quarter order guide implies quarter-over-quarter improvement, which would sort of buck normal seasonality. Can you just help us with some of the puts and takes there?\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nWell, really, we're just looking at our plans and what we're seeing right now week to week. We're already five weeks into our quarter. So, we've got one month in the books. And as we just look at our pace that we're seeing right now and that we believe that that's where we're going to wind up.\n\nThere obviously seasonality, if you look at history, has been a little bit unusual in the last couple of years. And I think we're still in a little bit of an unusual time with what has happened with rates. But with our positioning across the board with our community count increasing, we feel like our order position in Q1 is in line with what we guided.\n\nJessica Hansen -- Vice President, Investor Relations\n\nAnd as our production got further along as well, we felt more comfortable loosening up a lot of the sales restrictions you've heard us talk about. Even though we're continuing to sell later in the process, with some negligible improvement on our cycle times, but getting further along in the construction cycles, we have more homes available for sale going into Q1 than we've had.\n\nJohn Lovallo -- UBS -- Analyst\n\nMakes sense. OK. Great. And then the ASP in the fourth quarter down about 4% sequentially.\n\nHow much of that was like-for-like pricing versus mix?\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nYeah. At this point, it's like-for-like. I mean, we're -- as we said, we're increasing incentives, and then where necessary community by community, we're adjusting prices. And so, I don't believe there's necessarily been a big change in mix yet.\n\nAnd so, it's more likely from like-for-like.\n\nJohn Lovallo -- UBS -- Analyst\n\nGot it. Thank you, guys.\n\nOperator\n\nThank you. The next question today is coming from Carl Reichardt from BTIG. Carl, your line is live. Please go ahead.\n\nCarl Reichardt -- BTIG -- Analyst\n\nThanks, everybody. You talked about cutting base prices where necessary. Can you give me a sense of how often it's been necessary that maybe a percentage of communities or percentage of orders this quarter where base prices were cut, and what level of cuts are creating some elasticity in unit demand?\n\nPaul Romanowski -- Executive Vice President and Co-Chief Operating Officer\n\nCarl, I don't know that we can get specific in terms of communities or by area. We are finding the market community by community and market by market. Those cuts on base have not been significant to this point. We have focused on financial incentives and interest rate and where needed to, we've been able to adjust price and find the market to drive additional traffic and sales.\n\nJessica Hansen -- Vice President, Investor Relations\n\nAnd a lot of our guide is coming from what we know we're going to put into the market in terms of when we're opening new communities or new phases, we can reset our base pricing that way. And so, we do expect our ASP to shift down throughout the year. But as Paul mentioned, to date, it's been more heavily incentivized than it has been base price cuts.\n\nCarl Reichardt -- BTIG -- Analyst\n\nOK. Thank you. And then on cycle times, starting to see a little bit of easing and working with the trades and suppliers, would your guess be that your cycle times could get to sort of normal pre-pandemic levels in fiscal '23? Or is that too much to help for at this point?\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nAnecdotally, I was talking to a builder last week. He said he started a house in late August, and he's going to close it in December. So, he was pretty excited about that. That's one story, one house out of a lot of houses.\n\nJessica Hansen -- Vice President, Investor Relations\n\nAnd builder equals construction superintendent, right?\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nYeah. And he was really excited about that. So, I think we're making the right progress. We're starting to see a little bit of progress pick up in the numbers of October completions.\n\nWe got a little bit of time back there. Getting all the way back to where we want to be pre-pandemic levels, it might be by the end of the year for the starts that we have later in the year that we're pushing It through, but we're going to make that progress this year.\n\nDavid Auld -- President and Chief Executive Officer\n\nYou know, Carl, just -- we've talked about it, I think, for a while, but just the discipline in the industry today is it has translated into across-the-board slowdown in starts. And I think it will allow the trade base material suppliers to kind of get the feet under them. And I've been accused of being overly optimistic at times, but I do think 2023 if the industry stays disciplined, we will get back into a situation where we can sell a house, now what it's going to go and what are we going to be able to deliver and that will be a good thing.\n\nCarl Reichardt -- BTIG -- Analyst\n\nWell, it starts with one house. So, I appreciate the color, guys. Thanks so much.\n\nDavid Auld -- President and Chief Executive Officer\n\nThanks, Carl.\n\nOperator\n\nThank you. Your next question is coming from Mike Rehaut from J.P. Morgan. Mike, your line is live.\n\nPlease go ahead.\n\nMike Rehaut -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks. Thanks very much. Appreciate you taking my questions.\n\nFirst off, just wanted to get a sense of the cadence and progression of incentives as it works through your fiscal fourth quarter and into October and perhaps even into November. Obviously, a lot of that, I would presume as being reflected in the first quarter gross margin guidance. But what I'm trying to get a sense is just the degree of magnitude of the change in trend and how we should be thinking about perhaps where incentives are today versus where they were three or four months ago.\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nI think it starts with just looking -- taking a step back and looking at where interest rates were. At the end of the last quarter, mortgage rates were still in the low to mid-5s. And by the end of the quarter, they're in the high 6s. And subsequent to the end of the quarter, they've now stepped into the 7s.\n\nAnd so, we have been adjusting to reflect that. A lot of our incentives have been on the financing side with interest rate locks and buy downs to try to address the payment shock there from the interest rates. And that has increased sequentially through the quarter and has continued into October. So, the levels have continued to increase.\n\nWe were focused on ensuring that we could close our backlog because we did have a lot of homes scheduled to close in September. And so, we believe we did hold off on some price adjustments to ensure that we could close that backlog. And so, price adjustments have started to fold in a little more commonly as we've stepped into Q1. So, it's been a sequential increase along the way.\n\nAnd then what it will be going forward will depend largely on what happens with rates in the market and then our efforts to meet the market. We are looking community by community to make adjustments in order to hit our sales pace and turn our inventory and maximize our returns. And so, we're looking to find the market and find that pace community by community.\n\nMike Rehaut -- JPMorgan Chase and Company -- Analyst\n\nSo, you know, I guess, you know, I appreciate that answer. I know obviously, projecting gross margins beyond the first quarter is somewhat difficult, but it would seem like given the trends that we're not yet at a point of stabilization. I guess my second question, and if you have any thoughts on that, that would be great, I guess. But second question, just on the SG&A guide for the first quarter, with consolidated revenue being a little bit below, obviously, it's not a surprise to see the SG&A come up.\n\nI'm also wondering if there's anything in that number around increased broker commissions to the market as part of encouraging the broker community in a softer environment. And how we should be thinking about that line item within SG&A over the next year?\n\nJessica Hansen -- Vice President, Investor Relations\n\nSure, Mike. So, builders report those things separately -- or differently, I should say. So, broker commissions for us are actually in gross margin. So, that is contemplated as one of the increased incentives in our gross margin guide and not an impact for us, particularly on SG&A.\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nAnd in terms of SG&A overall, with our ASPs expected to come down with revenues down a bit. That's driving an expected increase in our SG&A as a percentage of revenues. We're coming off of all-time lows there and are still positioning ourselves to continue to gain market share. And so, with essentially SG&A spend staying relatively stable with the exception of variable SG&A that moves with revenues or with profitability, that's resulting in the expected increase from all-time lows to a little bit higher level as a percentage of revenues in Q1.\n\nMike Rehaut -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nThank you. And the next question today is coming from Matthew Bouley from Barclays. Matthew, your line is live. Please go ahead.\n\nMatthew Bouley -- Barclays -- Analyst\n\nGood morning, everyone. Thank you for taking the questions and for all the detail. Just a follow-up on the incentive side. I think I heard you say at the top that within financial services, you were including some -- I think you said rate buydowns and things like that.\n\nSo, in the incentive comments you just made around reaching six or seven, I think I heard you say -- is that all in the gross margin? And is there additional incentives on the financial services side that we should look out for? Or is that kind of all in? Thank you.\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nThere's always some of those costs on both sides, Matt, and that can vary a bit depending on the nature of the incentives. But yes, both of our guides, the guidance for financial services margins going into Q1, as well as the guide for our gross margin on the homebuilding side reflect our anticipation for our level of incentives related to financing.\n\nMatthew Bouley -- Barclays -- Analyst\n\nUnderstood. OK. Thanks for that clarification. And then just secondly, you mentioned that you would -- I think I heard you say you would expect the option abandonments that occurred this quarter to kind of continue to occur.\n\nI mean, should we expect the magnitude of that to increase? And then just kind of any update on actual impairment thoughts around your own land portfolio?\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nWith the option write-off cost, as we evaluate projects at various decision points, we'll be working with various land sellers and developers and where we can't reach an agreement on our accommodation, we're not going to move forward with a bad deal. So, if it doesn't make sense and what we expect the market conditions are or will be over the life of the project, that's the reason we have the option arrangement. So, we may have an increase in those costs, but we do take a pretty accurate look at those things, very realistic expectation, and we'll be very quick to move on those.\n\nDavid Auld -- President and Chief Executive Officer\n\nAnd I'll just add, both when the market was accelerating and now at the center pause, we are very disciplined in how we approach every economic decision on the land side. It's all about creating optionality and efficiency of capital. And that's been our program, and it's going to continue to be our program.\n\nJessica Hansen -- Vice President, Investor Relations\n\nIn terms of your impairment question, even with our guide for gross margins today, we're still projecting for our gross margins to remain at very healthy levels that would signify that we're a long way off from any sort of broad-based impairments. We're also in a completely different financial position mid-cycle to prior cycles, which allows us some flexibility in terms of how we look at the land that we have on our balance sheet and what we plan to do with it going forward. That being said, we do expect there to be some impairments along the way in weaker submarkets. But right now, I don't expect anything broadly based in the near term.\n\nMatthew Bouley -- Barclays -- Analyst\n\nMakes sense. Thanks, Jessica. Thanks, everyone.\n\nOperator\n\nThank you. And the next question is coming from Eric Bosshard from the Cleveland Research Company. Eric, your line is live. Please go ahead.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nThanks. Context, if you could, around two things. First of all, the 23% to 24% gross margin in 1Q. Obviously, a component of that is what's going on with incentives and pricing.\n\nYou talked today about savings on the cost side or changing the product mix. And so, what I'm trying to understand is, is that a baseline the changes that you're making to support gross margin or change mix, can that number improve? Can you just give us a little bit of sense of what's contributing to that and in terms of the things you're doing to protect gross margin, what the path forward might look like?\n\nPaul Romanowski -- Executive Vice President and Co-Chief Operating Officer\n\nYeah, Eric. I think as we are out in the market with our trade partners and suppliers working to reduce cost to provide the best value we can to our homebuyers. And we provided the visibility into the first quarter with those gross margins. What we're seeing which is encouraging early on in that isn't going to come through in homes to close for the next six to nine months toward the end of the year.\n\nSo, we've still got the homes that we have in the ground with that cost structure -- but as we continue to find the market, we expect to see gross margins like we have guided to in the first quarter.\n\nDavid Auld -- President and Chief Executive Officer\n\nAnd we did suffer through extended bill cycle times. So, the houses will be closing in Q1, our houses that were started and bear the cost of high lumber cost. And really trade shortages. So, you've got the double whammy of high cost and a more normalized ASP.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nAnd just within that, is -- like today, can you comment, is that the floor? Or is there both upside and downside through the rest of the year relative to the 1Q gross margin?\n\nDavid Auld -- President and Chief Executive Officer\n\nIt depends on what the capital markets and interest rates do. I mean, it's -- if we see stabilization in interest rates, I feel very optimistic about what we can do this year. if we continue to see 100 basis point increase quarter to quarter to quarter, I think it's going to be a very challenging year.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nOK. And then secondly, you mentioned single-family for rent, both of what you're doing and buyers of home of your homes from others. I'm just curious if you can give us a sense of how much of the business is single-family for rent, what the expectation is in '23, and if there's any risk or volatility around that buyer group.\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nSo, our approach to the single-family rental business is to build communities of traditional single-family homes. Rent those up and stabilization and then sell them to typically institutional owners of that sort of residential asset class. It's about $1.7 billion, I think, is our current investment in the single-family rental platform. We expect that's going to grow during '23.\n\nDepending upon market conditions, probably not more growth than we had from the end of '21 to the end of '22, but we do expect growth in '23. And we still see that when we complete the homes and they go to market to lease, there's still good demand and people are needing a place to live, and they're choosing to live in these communities.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. The next question is coming from Alan Ratner from Zelman and Associates. Alan, your line is live. Please go ahead.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nHey, guys. Good morning. Thanks for all the great detail in a difficult market to forecast out here, so we appreciate it. I guess first question, just trying to triangulate all the comments you made about the margin outlook, the goals as far as revenue are concerned in '23.\n\nSo, if I look at your 1Q margin guide, it's down about 600 to 700 basis points from the peak a couple of quarters ago, and I think that's largely consistent with kind of the net price adjustments we've seen across the industry. As you think about that versus your goal to grow revenues for the year or even maybe the low end of that range, what's the price sensitivity to achieving that goal? How low are you willing to take that margin in the near term, recognizing that maybe longer term, you have some potential cost relief coming or other things that could be offset? But in order to hit your '23 target there? How low could that margin go before you kind of hold back and say, you know what, we're just going to slow the start pace? We're not going to chase that revenue growth because the price environment is too difficult.\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nYou know, Alan, there's always a balance. We're always balancing what we're doing on pricing and incentives and what that results in margin versus pace and turning inventory to generate the best return. And so, we'll be trying to strike that balance across all our communities throughout the year. It's too early and too uncertain to know what the year may bring in terms of the macro environment in terms of rates, in terms of the general economy to know exactly what those decisions may need to be.\n\nAnd so, that's why we're trying to provide as much color as we can around how we're looking at things, but in reality, we don't have, really, any specificity or visibility to what those conditions may be into the spring and into '23. So, in terms of where the line is on where margin or pricing might need to go or what we're willing to do to push pace, I think, remains to be seen. We're going to be making those decisions day to day, week to week as we march forward here.\n\nJessica Hansen -- Vice President, Investor Relations\n\nAnd as you know, we don't push or dictate that from a high level. It really is managed community by community, market by market so we can make sure we're maximizing our returns at the local level and then blend it overall.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nOK. I appreciate the thoughts there. I guess on the Rental segment, so I hear the delays in Florida, but I thought I also heard maybe a couple of projects that you thought would close this quarter that got pushed out because of presumably the higher borrowing costs that your counterparties are experiencing and how that impacts the underwriting. So, I guess I'm just thinking out loud here, you do expect growth in that segment, and certainly, the inventory has been building.\n\nBut how concerned or not concerned are you about what's going on with borrowing costs for those investors? I mean, we're hearing that there's a bit of a stalemate, if you will, or at least a widening bid-ask spread on the rental side as well given the difficulty underwriting to the new borrowing costs. So, what's the sensitivity for you to achieve that growth? Is there any risk to that if borrowing costs remain elevated?\n\nPaul Romanowski -- Executive Vice President and Co-Chief Operating Officer\n\nAlan, we have certainly seen from that buyer base in the credit markets and their ability to borrow soften, but there's still plenty of buyers out there. Like our buyers on the homebuyer side, they're taking a bit of a pause in some cases, just to evaluate the market. But we've got about 7,400 homes in production on the single-family for-rent side, and that's from beginning to those that are complete. We still expect to see people in that market.\n\nNot everyone needs to be in the credit markets or borrowing to purchase. And our single-family rental communities tend to be on the lower end side relative to apartment sizes. And so, we still feel good about that business, but we certainly did see communities that we expected to be sold and closed in the fourth quarter pushed into the second quarter. So --\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nAnd when you look at your deals that are under construction or completed or close and if you underwrite those deals as if you're a buyer today, you're still seeing those penciling. In other words, you can make the math work and assume that a buyer theoretically can as well.\n\nPaul Romanowski -- Executive Vice President and Co-Chief Operating Officer\n\nYes. And we have been very conservative on our underwriting. We are really looking at each of those communities as we would on the for-sale side. And so, the performance we saw on the ones that we sold in the market a year ago and through the last year, were far outperformed our underwriting.\n\nAnd so, we still feel good about the position in the active communities that we have, and we will adjust as the market adjusts in terms of that business on a go-forward.\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nAnd more of the issue, I think, Alan, related to a change in that buyer. They were -- just to say they were very excited would be an understatement to get their hands on the communities early in fiscal '22. We experienced some of the same construction delays in those products that we did in our single-family for-sale business, and we had expectations and buyer indications of interest willing to close on the projects prior to completion and prior to full stabilization. The markets come back and more normalized now, and their expectation is that we get to a stabilized point before they're -- we're going to get a good valuation.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nIf I could just sneak in one last one, and I apologize, but it's relevant to this topic here. In the environment where the capital markets remain tough and the borrowing costs continue to rise here, but you're still seeing good fundamentals at the community level, good occupancy, good rents. Are you willing to kind of shift the strategy in the near term and kind of hold on to more of these assets on your balance sheet and wait for the transaction environment to improve? Or is the goal here really to turn the capital and then you're not looking to necessarily grow a portfolio of stabilized assets?\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nOur base business model is to sell the assets. That still generally will generate the best return. But we're going to make sure that we stay in a position from a capital perspective to be able to manage timing to manage a bit of a slower process, if necessary, due to some disruptions in the capital markets, which typically don't last that long. But we do want to make sure we stay in a flexible position to be able to manage timing when necessary.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nOK. Perfect. Thanks. Thanks for all the time, guys.\n\nI appreciate it.\n\nOperator\n\nThank you. Your next question is coming from Buck Horne from Raymond James. Buck, your line is live. Please go ahead.\n\nBuck Horne -- Raymond James -- Analyst\n\nYeah. Thank you. Appreciate that. I was wondering if you could -- I think you mentioned the cancellation rate in October remained elevated.\n\nI was just wondering if directionally you could indicate whether that was the cancellation rate was higher or lower than what happened in the fourth quarter, you know, in October.\n\nJessica Hansen -- Vice President, Investor Relations\n\nYeah. We typically have volatility month to month in our can rate throughout the quarter, so we don't give it specifically for the month. But anything for us above the, call it, low 20s, high teens to low 20s is elevated, and we certainly did not see any market improvement in October as compared to Q4.\n\nBuck Horne -- Raymond James -- Analyst\n\nOK. Appreciate that. And can we talk about any just regional differences in terms of how buyer traffic and interest levels have behaved as the progression of interest rates kind of marched higher either during the quarter through October? Just kind of walk us through the map and just kind of where things are -- how buyers are behaving in different geographies.\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nWe've seen still see a lot of traffic in our models. We still see people coming in looking to get into a home, a little more challenging with the affordability sometimes to get them qualified. But as we see stabilization in rates. And when we see periods when rates have stabilized and that demand is there, we're able to meet it.\n\nWe do see in our sales process is that we're selling the large majority of our homes passed a certain stage of construction, not just from our restriction of that sale, but from the buyer wanting certainty of what that interest rate payment can be within the lock window that can be afforded to them. And so, that's been important for us to accelerate the cycle times, have more inventoried later in the production process that we can deliver within the interest rate lock window.\n\nBuck Horne -- Raymond James -- Analyst\n\nRight. I'm just curious, are the pockets of strength kind of geographically?\n\nDavid Auld -- President and Chief Executive Officer\n\nJust from geographically, it's the same markets that are experienced in inflow of buyers. I mean, I think our relocate percentage relocation buyers picked up last quarter again -- there is -- it's -- the market is, I think, evolving maybe is the best word. There is still a migration out of urban or out of urban into the suburbs. And there's still housing formation taking place that exceeds the supply of homes.\n\nIt's easy to get caught up in the short term. Our goal here is to stay focused on the long term. And I can tell you, our efforts are in positioning, for now, Q2, Q3, Q4 and '24 and '25. And so, we're trying to stay out of the short-term reaction, but where do we want to be as this platform continues to develop, improve, and get built out?\n\nBuck Horne -- Raymond James -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nThank you. The next question is coming from Susan Maklari from Goldman Sachs. Susan, your line is live. Please go ahead.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nThank you. Good morning, everyone. My first question is going back to the land market a bit. Can you talk about what you're hearing from the sellers? And how are the renegotiations of some of those option contracts coming together? What is the pushback that you're getting if there is any? And how is that progressing and changing as the market is changing?\n\nPaul Romanowski -- Executive Vice President and Co-Chief Operating Officer\n\nYes, Susan. We have been very proactive with our land sellers and development partners and realistic in terms of expectations with the market as it moves. So, largely, they have the understanding and working with us to keep those deals alive where we can. To the extent that it just the underwriting doesn't make sense.\n\nThen we're having to make the decisions that we are. And we will, if needs be, have to walk away from some of those options. But that's why we have the option contracts in place and have made that shift with our land strategy. But by and large, they are reading the headlines like everyone else and understanding of where the market is.\n\nThey ultimately want to be in a position to move through those lots and so have been relatively well received and receptive to come to the Table Talk.\n\nDavid Auld -- President and Chief Executive Officer\n\nAnd we treat our attempt to treat our development partners like they're part of the family. I mean, we're very transparent. They understand where we're headed and what our start pace is and what our expectations for that community. And coming out of the last downturn, we built relationships that are still existing today, and our goals in every community, every division is to be kind of the favorite nation builder.\n\nAnd we are going to treat them better. So, you know, we really do believe in the transparency and consistency and audit and direct communication, and that's how you build relationships.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nYes. OK. And then can you talk a bit about capital allocation? As the market is changing, how are you thinking about the different uses of cash and especially maybe any thoughts on buybacks as we think about 2023?\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nYou know, Sue, we'll continue to take a balanced approach to it all. We're in a good, flexible position to be able to continue to provide returns to our shareholders, both in the terms of increased dividends and share repurchases. Obviously, we'll be adjusting in our business and how much we invest into land and to help home starts and into our rental business based on market conditions. But at a base level, we do expect to generate an increase in our homebuilding cash from operations in fiscal 2023.\n\nAnd with that, that gives us even more flexibility to make those relative decisions but continue with more of the same in terms of the balance and the consistency in the approach.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nOK. Thank you. Good luck.\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nThanks, Sue.\n\nOperator\n\nThank you. And that is all the time we have for questions this morning. At this time, I would like to turn the floor back to David Auld for closing remarks.\n\nDavid Auld -- President and Chief Executive Officer\n\nThank you, Tom. We appreciate everybody's time on the call today and look forward to speaking with you again to share our first quarter results in January. And finally, congratulations to the entire D.R. Horton family for another remarkable year.\n\nStay humble, stay hungry, stay focused, go compete and win every day. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJessica Hansen -- Vice President, Investor Relations\n\nDavid Auld -- President and Chief Executive Officer\n\nMike Murray -- Executive Vice President and Co-Chief Operating Officer\n\nPaul Romanowski -- Executive Vice President and Co-Chief Operating Officer\n\nBill Wheat -- Executive Vice President and Chief Financial Officer\n\nStephen Kim -- Evercore ISI -- Analyst\n\nJohn Lovallo -- UBS -- Analyst\n\nCarl Reichardt -- BTIG -- Analyst\n\nMike Rehaut -- JPMorgan Chase and Company -- Analyst\n\nMatthew Bouley -- Barclays -- Analyst\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nBuck Horne -- Raymond James -- Analyst\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nMore DHI analysis\n\nAll earnings call transcripts"
}