{
  "companyName": "JPMorgan Chase",
  "companyTicker": "JPM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/14/jpmorgan-chase-jpm-q3-2022-earnings-call-transcrip/",
  "content": "JPMorgan Chase (JPM 0.66%)\nQ3 2022 Earnings Call\nOct 14, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen. Welcome to JPMorgan Chase's third quarter 2022 earnings call. This call is being recorded. [Operator instructions] At this time, I would like to turn the call over to JPMorgan Chase's chairman and CEO, Jamie Dimon; and Chief Financial Officer Jeremy Barnum.\n\nMr. Barnum, please go ahead.\n\nJeremy Barnum -- Chief Financial Officer\n\nThank you very much. Good morning, everyone. As always, the presentation is available on our website, and please refer to the disclaimer in the back. Starting on Page 1.\n\nThe firm reported net income of $9.7 billion, EPS of $3.12 on revenue of $33.5 billion, and delivered an ROTCE of 18%. The only significant item this quarter was discretionary net investment securities losses in corporate of $959 million as a result of repositioning the portfolio by selling U.S. treasuries and mortgages. Our strong results this quarter reflect the resilience of the franchise in a dynamic environment.\n\nTouching on a few highlights. We had a record third quarter -- we had record third-quarter revenue in Markets of $6.8 billion, we ranked No. 1 in retail deposit share based on FDIC data, and credit is still healthy with net charge-offs remaining low. On Page 2, we have more detail.\n\nRevenue of $33.5 billion was up $3.1 billion or 10% year on year. Excluding the net investment securities losses, it was up 13%. NII ex-markets was up $5.7 billion or 51%, driven by higher rates. NIR ex-markets was down $3.2 billion or 24%, largely driven by lower IB fees and the securities losses.\n\nAnd markets revenue was up $502 million or 8% year on year. Expenses of $19.2 billion were up $2.1 billion or 12% year on year, driven by higher structural costs and investments. And credit costs of $1.5 billion included net charge-offs of $727 million. The net reserve build of $808 million included a $937 million build in wholesale, reflecting loan growth and updates to the firm's macroeconomic scenarios, partially offset by $150 million release in home lending.\n\nOn the balance sheet and capital on Page 3. We ended the quarter with a CET1 ratio of 12.5%, up 30 basis points versus the prior quarter, which was primarily driven by the benefit of net income less distributions, partially offset by the impact of AOCI. RWA was down approximately $23 billion quarter on quarter, with growth in lending more than offset by continued active balance sheet management and lower market risk RWA. Given our results this quarter, we are well-positioned to meet our CET1 targets of 12.5% in the fourth quarter and 13% in the first quarter of 2023.\n\nThese current targets include a 50 basis point buffer over the growing regulatory requirements, which provides flexibility over the coming quarters. To conclude on capital, with the future increases in our risk-based requirements, SLR will no longer be our binding capital constraint. So we announced the call of $5.4 billion in press this quarter and issued $3.5 billion in sub-debt to rebalance our capital stack. Now let's go to our businesses, starting on Page 4.\n\nBefore I review CCB's performance, let me provide you with an update on the health of U.S. consumers and small businesses based on our data. Nominal spend is still strong across both discretionary and nondiscretionary categories, with combined debit and credit spend up 13% year on year. Cash offers remain elevated across all income segments.\n\nHowever, with spending growing faster than income, we are seeing a continued decrease in median deposits year on year, particularly in the lower-income segment. And not surprisingly, small business owners are increasingly focused on the risks and the economic outlook. Now moving to financial results. This quarter, CCB reported net income of $4.3 billion on revenue of $14.3 billion, which was up 14% year on year.\n\nIn consumer and business banking, revenue was up 30% year on year, driven by higher NII on higher rates. Deposits were up 10% year on year and down 1% quarter on quarter. We ranked No. 1 in retail deposit share based on FDIC data, up 60% year on year, making us the fastest-growing among the top 20 banks.\n\nAnd we are now No. 1 in L.A., in addition to New York and Chicago, making us top-ranked in the three largest markets. Client investment assets were down 10% year on year, driven by market performance, partially offset by flows, while lending revenue was down 34% year on year on lower production margins and volume. Moving to card and auto.\n\nRevenue was up 9% year on year, driven by higher card NII, partially offset by lower auto lease income. Card outstandings were up 18%. And while revolving balances were up 15%, driven by strong net new account originations and growth in revolving balances per account, they still remain slightly below pre-pandemic levels. And in auto, originations were $7.5 billion, down 35%, due to lack of vehicle supply and rising rates.\n\nExpenses of $8 billion were up 11% year on year driven by the investments we're making in technology, travel, marketing, and branches. In terms of actual credit performance this quarter, credit costs were $529 million, reflecting net charge-offs of $679 million, which were up $188 million year on year, largely driven by loan growth in card as well as a reserve release of $150 million in home lending. Card delinquencies remain well below pre-pandemic levels, though we continue to see gradual normalization. Next, to CIB on Page 5.\n\nCIB reported net income of $3.5 billion on revenue of $11.9 billion. Investment banking revenue of $1.7 billion was down 43% year on year. IB fees were down 47% versus a strong third quarter last year. We maintained our No.\n\n1 rank with a year-to-date wallet share of 8.1%. In advisory, fees were down 31%, reflecting lower announced activity this year. Underwriting businesses continued to be affected by market volatility, resulting in fees down 40% for debt and down 72% for equity. In terms of the fourth quarter outlook, we expect to be down versus a very strong prior year.\n\nAnd while our existing pipeline is healthy, conversion will, of course, depend on market conditions. Funding revenue of $323 million was up 32% versus the prior year, driven by higher NII on loan growth. Moving to Markets. Revenue was $6.8 billion, up 8% year on year.\n\nFixed income was up 22%, as elevated volatility drove strong client activity in the macro franchise, partially offset by a less favorable environment in securitized products. Equity markets were down 11% against a record third quarter last year. This quarter saw relative strength in derivatives, lower balances in prime and lower cash revenues on lower block activity. Payments revenue was $2 billion, up 22% year on year.\n\nExcluding the net impact of equity investments, it was up 41%, and the year-on-year growth was driven by higher rates and growth in fees. Securities services revenue of $1.1 billion was relatively flat year on year. Expenses of $6.6 billion were up 13% year on year, largely driven by compensation. Credit costs were $513 million, driven by a net reserve build of $486 million.\n\nMoving to commercial banking on Page 6. Commercial banking reported net income of $946 million. Record revenue of $3 billion was up 21% year on year, driven by higher deposit margins, partially offset by lower Investment Banking revenue. Gross investment banking revenue of $761 million was down 43% year on year, driven by reduced capital markets activity.\n\nExpenses of $1.2 billion were up 14% year on year. Deposits were down 6% year on year and quarter on quarter, primarily driven by attrition of nonoperating balances, while our core operating balances have shown stability as payment volumes continue to be robust. Loans were up 13% year on year and 4% sequentially. C&I loans were up 7% sequentially, reflecting continued strength in originations and revolver utilization.\n\nCRE loans were up 2% sequentially, driven by lower prepayment activity in commercial-term lending and real estate banking. Finally, credit costs were $618 million, predominantly driven by a net reserve build of $587 million, while net charge-offs remained low. And then to complete our lines of business, AWM on Page 7. The asset and wealth management reported net income of $1.2 billion, with pre-tax margin of 36%.\n\nFor the quarter, revenue of $4.5 billion was up 6% year on year, predominantly driven by deposits and loans on higher margins and balances, largely offset by reductions in management fees linked to this year's market declines. Expenses of $3 billion were up 10% year on year, driven by compensation, including investments in our private banking advisory teams, technology, and asset management initiatives. For the quarter, net long-term inflows were $12 billion across fixed income, equities, and alternatives. AUM of $2.6 trillion and overall client assets of $3.8 trillion were down 13% and 7% year on year, respectively, driven by lower market levels, partially offset by continued net inflows.\n\nAnd finally, loans were flat quarter on quarter, while deposits were down 6% sequentially, driven by migration to investments, partially offset by client flows. Turning to corporate on Page 8. Corporate reported a net loss of $294 million. Revenue was a net loss of $302 million compared to a net loss of $1.3 billion last year.\n\nNII was $792 million, up $1.8 billion year on year, driven by the impact of higher rates. NIR was a loss of $1.1 billion, down $852 million, primarily due to the securities losses I mentioned upfront. And expenses of $305 million were higher by $125 million year on year. Next, the outlook on Page 9.\n\nGoing forward, we will also provide guidance for total firmwide NII. For the fourth quarter, we expect it to be approximately $19 billion, implying full year 2022 NII of approximately $66 billion. And we expect NII ex markets for the fourth quarter to also be about $19 billion, implying that we expect markets NII to be around zero, which brings the full year to about $61.5 billion. While we're not giving 2023 NII guidance today, you will recall that at Investor Day, we talked about a fourth quarter 2022 NII ex-markets run rate of $66 billion, with potential upside for the full year 2023.\n\nToday's guidance for the fourth quarter of this year implies an approximate run rate of $76 billion. And from this much higher level, we would now expect some modest decline for the full year 2023. In addition, there's quite a bit of uncertainty surrounding the trajectory of key drivers, including rates, deposit reprice and loan growth. So keep both of those things in mind as you update the 2023 estimates in your models.\n\nMoving to expenses. Our outlook remains unchanged. And as it relates to the card net charge-off rate, we now expect the full-year rate to be approximately 1.5%, below our previous expectations. So to wrap up, we are happy with the strong diversified performance of the quarter as we continue to navigate an environment of elevated uncertainty.\n\nWith that, I will turn it over to Jamie for some additional remarks.\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nJeremy, thank you very much. Hello, everybody. I just wanted to give you a little more insight into how we're looking at capital and interest rates a little bit. So capital planning, we're very comfortable with the earnings power of this company, which, you can see, is enormous and the margins and the returns.\n\nAnd more importantly than that is we're growing franchise value, I think, all around the firm. And in most areas, we're up in market share, in a few areas, we're not, and of course, that disappoints us. But the earnings power gives us a lot of confidence that we'll get over that 13% in the first quarter. But we always have to keep in mind the volatility and a bunch of other things.\n\nSo we know we have to deal with Basel IV. We don't know when and how this is going to be, and any change in G-SIB such as an uncertainty in back of our mind. AOCI. AOCI was traditionally countercyclical, but this kind of environment is more pro-cyclical.\n\nSo think of this ratio below 100 basis points, that's $4 billion, easily can handle it just in the back of our mind. CECL. CECL already incorporates a percent of what we think the adverse consequences might be. But obviously, if the environment gets worse, we'll have to add to reserves.\n\nAnd/or if we change our outlook, meaning that we think the chance of adverse events are higher, we'll change our reserves. Put in the back of your mind that if unemployment goes to 5% or 6%, you're probably talking about $5 billion or $6 billion over the course of a couple of quarters. Again, easy to handle, not a big deal. It just doesn't affect capital a little bit.\n\nAnd then RWA management, I mean, I think we're showing that we can easily manage RWA and drive it down in some areas and up in other areas and stuff like that. With that what I would say, a very limited financial effect. And the way you should look at this is we don't tell commercial bank or investment bank don't get new business, don't serve your clients. So we're serving clients that we always do, and you see the loan book growing in a lot of areas, but there are some discretionary things which barely affect us.\n\nSo we're not putting -- conforming mortgage on the balance sheet, whether we originate them or whether correspondents originate the most part. Because it makes very low sense to do that in the balance sheet, and we make other choices. And so we've got a lot of tools to manage it. Obviously, with the capital requirements going up, we're going to find ways to reduce RWA.\n\nI'm talking about over years strategically, I think without affecting our basic franchises. Interest rates. I think the way to look at it is we're fairly neutral at this point. Interest rates going up or down.\n\nJeremy said the $19 billion, please do not annualize that. There are a lot of uncertainties today. And I'm just going to mention a few. We're not worried about them.\n\nIt's not going to change things dramatically, but does change things. What's going to be Q2's effect on deposits? How much deposit migration you're going to have in this new technological environment? And there are pluses and minus from that. And of course, there will lag. There are lags in consumer.\n\nThere can be some lags in treasury services. There can be some lags and commercial banking. So it's just on the back of the mind, we're going to kind of actively manage that. And the other thing I want to point out is that taking investment securities losses for the most part, it could be want to sell our rich securities and replacement chief securities.\n\nWe don't want to be locked into something we think will get worse and not take a chance to buy something that we think will get better. So you might expect to see that taking place now. There may be some securities loss in the future, we can do that. We're not doing -- we can do this to manage interest rate exposure.\n\nBut for the most part, we can do that with swaps to or other things. We just do it the most efficient and effective way. I want the people that manage these portfolios to know that we can sell things we don't want to own and buy things that we do want to own. And other than that, we think it was a very, very good strong quarter across the board.\n\nAnd I guess, we'll open for questions now.\n\nJeremy Barnum -- Chief Financial Officer\n\nYes. Thanks, Jamie. Let's go ahead and open up for questions.\n\nOperator\n\nAnd the first question is coming from the line of Ken Usdin from Jefferies.\n\nKen Usdin -- Jefferies -- Analyst\n\nI just wanted to follow up on the NII and the deposit side to Jamie's comments there. Obviously, one of the toughest uncertainties is to understand think about flows and mix and beta. So just starting to see it, it looks like in terms of deposit costs starting to increase. So how do you think about it now in this new environment, where we might go to 4.5, maybe higher in terms of how betas might act over the course of this cycle as compared to any prior cycles and previous thoughts?\n\nJeremy Barnum -- Chief Financial Officer\n\nYes. Thanks, Ken. So at Investor Day, you'll recall that Jamie said that we expected betas to be low this cycle as they were in the prior cycle, which was a low beta cycle by historical standards. And what we're now seeing, as we see the rate hikes come through and we see the deposit rate paid develop, is that we're seeing realized betas being even lower than the prior cycle, just through the actuals.\n\nAnd the question is why is that? And it's, of course, we don't really know, but plausible theories include the speed of the hikes, which probably means that some of this is lagged, but also the fact that the system is more better positioned from a liquidity perspective than in prior cycles. So as we look forward, we know that lags are significant right now. We know that at some point, that will start to come out. Obviously, in wholesale, they come out much faster.\n\nThat's probably starting to happen now. The exact timing of how that develops is going to be very much a function of the competitive environment in the marketplace for deposits, and we'll see how that plays out.\n\nKen Usdin -- Jefferies -- Analyst\n\nGot it. OK. And then just the second follow-up on Jamie's points about like, OK, if things do look worse ahead, looking ahead, you might have to build a little bit more understandable over the next couple of years. Can you just help us understand just where you are in your scenario scenarios built and just today still looks great, tomorrow, there's some more uncertainty.\n\nSo how do we just get to start to understand how quickly and how you get your handle on that magnitude of ACL delta? And how do you think about it versus either, I don't know, pandemic peak or day one CECL? It's very hard for all of us to see this, of course.\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nYes. As you know, I think CECL has informed us the bad accounting policy. Honestly, I wouldn't spend too much time on it because it's not a real number. It's a hypothetical probability-based number.\n\nAnd the way I'm trying to make it very simple for you. So if you look at the pandemic, we put up $15 billion over two quarters, and then we took it down over three or four after that, OK? And all it did swing all these numbers, and it didn't change that much. I'm trying to give you a number, obviously, this number to be plus or minus several billion. But if unemployment goes to 60%, and that becomes the central kind of case, and then you have possibilities to get better and possibilities gets worse, we would probably add something like $5 billion or $6 billion.\n\nThat probably would happen over two or three quarters. I mean that's as simple I can make it. Right now, what we have -- right now, we already have 8% in these adverse -- in severe adverse case. We can -- if we change that next quarter, that will be part of that $6 billion I'm talking about.\n\nKen Usdin -- Jefferies -- Analyst\n\nYes. Understood. OK.\n\nOperator\n\nThe next question is coming from the line of Ebrahim Poonawala from Bank of America Merrill Lynch.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nI guess just following up, Jamie. So I appreciate CECL and the model-based approach. I think you were quoted in the press talking about the potential for a recession in the next six to nine months. Would appreciate any perspective in terms of are you beginning to see cracks, either be it commercial real estate, consumer where it feels like the economic pain from inflation, higher rates is beginning to filter through to your clients? I would appreciate any insights there.\n\nJeremy Barnum -- Chief Financial Officer\n\nYes. I'll take the over him. Thanks. The short answer to that question is just no.\n\nWe just don't see anything that you could realistically describe as a crack in any of our actual credit performance. I made some comments about this in the prepared remarks on the consumer side. But we've done some fairly detailed analysis about different cohorts and early delinquency bucket entry rates and stuff like that. And we do see, in some cases, some tiny increases.\n\nBut generally, in almost all cases, we think that's normalization, and it's even slower than we expect.\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nYes. I think I'd say we're in an environment where it's kind of odd, which is very strong consumer spend. You see it in our numbers. You see it in other people's numbers, up 10% prior to last year, up 35% pre-COVID.\n\nBalance sheets are very good for consumers. Credit card borrowing is normalizing, not getting worse. You might see -- and that's really good. So you go in a recession, you've got a very strong consumer.\n\nHowever, it's rather predictable if you look at how they're spending and inflation. So inflation is 10% reduces that by 10%. And that extra cap -- money they have in the checking accounts will deplete probably by sometime midyear next year. And then, of course, you have inflation, higher rates, higher mortgage rates, oil volatility war.\n\nSo those things are out there, and that is not a crack in current numbers. It's quite predictable. It will strain future numbers.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nAnd just tied to that, I think the other thing that investors from the outside worry about is interconnectedness of the systems, be it the U.K. gilts market, LBOs. How much are you worried about that part of the business in terms of having a meaningful impact in terms of a capital shock at some point over the next year, just given all the QT happening around the world?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nI mentioned QT as being one of the uncertainties because it's a very large change in the flow of funds around the world, who are the buyers and sellers of sovereign debt. There's a lot of sovereign debt. But I think if you look at the building alone is a bump, it's not going to change what we do or how we do it. And you're going to see bumps like that because all of the things I already mentioned.\n\nIt's inevitable that you're going to see them. Whether they create systemic risk, I don't know. I have pointed out, it's harder for banks to intermediate in that, and that creates a little bit more fragility in the system. That does not mean that you're going to see a crack of some sort.\n\nBut again, it's almost impossible not to have real volatility based on the fact where I told you. Those are large uncertainties that we know about today and in the future.\n\nOperator\n\nThe next question is coming from the line of Jim Mitchell from Seaport Global Securities.\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nJeremy, at the Investor Day, you noted that expense growth in '23 would slow from this year's level and might be slightly higher than consensus expectations at the time. So is that -- now that you get closer to next year, does that still hold? And if the economy does get worse than expected, is there some levers to pull? Or is it just still investing heavily regardless?\n\nJeremy Barnum -- Chief Financial Officer\n\nYes. Thanks, Jim. So broadly, yes, it still holds. No real change on the outlook.\n\nJust to remind everyone, at Investor Day, I think the consensus was 79.5 for 2023. We said you were a little low. I think it got revised up to sort of the 80.5 or something like that. And that's still -- that's not -- still roughly in the right ballpark.\n\nObviously, we're going through our budget cycle. We're looking at the opportunity side and the environment set for next year. So it's not in stone. But broadly, on the question of investment, and I'm sure Jamie will agree here, that our investment decisions are very much through-the-cycle decisions.\n\nAnd so we're not going to tend to change those just because of a sort of difference in the short-term economic environment. Of course, the volume and revenue-related expense can fluctuate as a function of the environment, as you would expect.\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nNow I would just like to add. Obviously, compensation go up or down dramatically. So you'll have different estimates about investment pacing revenues and markets revenues, and we can't really adjust for your numbers for that. But I just want to point out the other side of this, we're making heavy investments and we have among the best margins in the business.\n\nI think that's a very good thing.\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nRight. And maybe on that front, leverage loan, right? Were there any leverage loan write-downs this quarter? And is that -- and how do you -- is that market beginning to clear? Or are there still overhangs?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nThere are no real levels of loan write-down this quarter, and that market isn't yet clear. Our share of it is very small. So we're very comfortable.\n\nOperator\n\nThe next question is coming from the line of John McDonald from Autonomous.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nJeremy, I wanted to ask about your EAR disclosures, what we call your rate sensitivity disclosures. They look a little different than peers. And when we look at the sensitivity to 100 basis points of higher rates beyond the forward curve, it looks like you're liability-sensitive. Can you give us some context of maybe the limitations of that disclosure and how we should put that in context of the assumptions behind it?\n\nJeremy Barnum -- Chief Financial Officer\n\nYes. Thanks, John. And I'd love to have a very long conversation with you about this, but I'm going to keep it short here. It's really all about lags.\n\nSo as our disclosure says, we do not include the impact of reprice lags in our EAR calculation. So as a result of that, the entire calculation is based on modeled rates paid in the terminal state. As you well know, right now, we're in the middle of some very significant lags, which are affecting the numbers quite a bit and which we expect to persist for some time. So as a result of that, what I would expect in the near term is something quite similar to what we've experienced this year.\n\nAs you know, this year, as rates have gone up, we've revised our NII outlook from 50 at the beginning of the year to now 61.5. So as we look forward in the near term from here, I would expect similar type sensitivities or rate fluctuations given the lag environment that we're in.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nAnd just to follow up on Jamie's comments about not annualizing the fourth quarter, is that where the risks lie to annualize in the fourth quarter? What are some of the puts and takes that you said it might be down a little bit from that fourth quarter annualized?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nYes. I've already mentioned, you have a rapidly changing yield curve deposit migration. Everyone does EAR differently. So one is lag.\n\nOne is we assume deposit migration. Some people don't. We assume -- our ECR is included there, some people don't and all of that. I just think for your models, because of all that kind of stuff, just use a number less than annualized in the 19.\n\nSo instead of 76, use a number like 74. Just keep it as simple as possible, and we don't know. We hope to beat that, but with all the stuff going on, I just -- you just got to be a little cautious and conservative.\n\nOperator\n\nThe next question is coming from the line of Erika Najarian from UBS.\n\nErika Najarian -- UBS -- Analyst\n\nI agree with Ebrahim that your presentation this morning was quite crisp and impactful. So I'm going to ask the question that I think has been sort of the key debate to the stock all year. So at Investor Day in May, you mentioned a ROTCE target of 17%, and that was before we found out that the SCB would be higher in June. As we think about your capital build is going faster than expected and you think about the revenue power that shows through in this firm, plus or minus what may happen with CECL, do you think you can achieve 17% ROTCE next year?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nYes. That's obviously a good question. The answer is yes. And one of the things we always look at is normalized ROTCE.\n\nSo we're very honest. We are -- we're not over earning in NII, maybe a little bit because the lags and stuff like that, but not a lot, but we are over earning on credit. Think of credit card. And the 1.5%, we've never seen a number of that low risk.\n\nWe're quite conscious of that. So we don't drag about the 19% this quarter, figure that's going to continue [Inaudible] not. And obviously, we may adjust that 17 a little bit, but it's not a material adjustment. We're going to -- we've got a lot of great, bright people.\n\nWe're going to find a lot of ways to squeeze some of these things down, including like call CCAR is and SCB and liquidate some assets and change business models just a little bit. If you look at our acquisition, for example, they were a non-G-SIFI acquisitions, noncapital, non-G-SIFI, all services and service related. So that's what we're going to do over time, and we're pretty comfortable that we'll get very good returns. So yes, we're quite -- and next year is totally dependent on what happens in [Inaudible].\n\nBut the other thing I would look at, maybe both given this number of other time, is what would we earn in a recession? We would have pretty damn good returns in a recession. I mean, so I feel very good about that.\n\nErika Najarian -- UBS -- Analyst\n\nAnd this is a super micro question as a follow-up for Jeremy. Why would Markets NII be zero next quarter? And should we expect that to be zero next year?\n\nJeremy Barnum -- Chief Financial Officer\n\nYes. Thanks.\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nWe're advancing the Markets businesses at the yield curve. So you're earning this in your pain to finance the training book.\n\nJeremy Barnum -- Chief Financial Officer\n\nYes, Erika. I mean, basically, as rates go up, the funding cost goes up. And the offsets on the other side, in many cases, work through derivatives or derivatives like instruments, so it goes through NIR. Fundamentally, we believe the Markets business revenue is rate insensitive.\n\nYou can see that history through our disclosures this year. So as you look out to next year with the forward curve implying a much less biased evolution of Fed funds, you shouldn't expect to see as many changes at least from rates. Of course, we can sometimes see somewhat more unpredictable changes from balances, but that should be unbiased one way or the other.\n\nOperator\n\nThe next question is coming from the line of Mike Mayo from Wells Fargo.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nJamie, once again, I'm trying to reconcile your actions with your words. You've said publicly, you mentioned the hurricane. You mentioned a recession. You mentioned look out, and there are all sorts of risks.\n\nI don't think anyone disagrees with that. On the other hand, your reserves to loans are still well below CECL day one. So your actions with the reserving don't seem to reflect your more pessimistic comments about the economy. So how do I reconcile the two?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nYes. So the way to do that is in our CECL -- in our reserves today, there is a significant percentage probability that we put on adverse and severe adverse already. So it's in there already. A lot of people work in the CECL reserves.\n\nOur economist, Jeremy, a lot of other folks. It's not set by me because I have to think that the odds might be different than other people. And so -- but I conclude as Jeremy saying. But the numbers are very good.\n\nWe have some of that. I'm trying to be very honest about if things get worse, here's what it might will mean for reserves. That may be different because, of course, these calculations change a lot of time. But that will be, Michael, which is another thing, which is CECL, the timing of when something happens is very important.\n\nSo if it happens, if you said a recession is going to happen in the fourth quarter of next year, that would be very different. So it's going to happen in the first quarter of next year.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nYes, I just understood it as the lifetime losses on the loans as opposed to that.\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nIt is. But some loans -- yes, some loans have a short life and some loans have a long life.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nLet's just cut to the chase. So where are you versus three months ago? I mean, is it -- you certainly got headlines with the hurricane comment and all that. And it's -- look, like as you said, you have Fed tightening, QT, tighter capital rules for banks. You have like the trifecta of tightening by the Fed and then you have bars and everything else.\n\nSo I don't think any in the stock market supports your view and about all the risks out there, but are things better or worse or the same as they were three months ago?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nThey're roughly the same. We're just getting closer to what you and I might consider bad events. So -- in my hurricane, I've been very consistent, but looking at probabilities and possibilities. There is still, for example, a possibility of a soft land.\n\nWe can debate what we think that percentage of yours might be different than mine, but there's a possibility of a mild recession. Consumers are in very good shape, coming in a very good shape. And there's possibility is something worse, mostly because of the war in Ukraine and oil price and all things like that. Those -- I would not change by possibilities and probabilities this quarter versus last quarter, for me.\n\nAnd then lastly is a different point.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nYes. Last follow-up. I know your investor cycles. You've always done that.\n\nYou're consistent. But I mean, your headcount increase is probably going to be the highest in the industry. I mean, headcount from 266,000 to 288,000, your CIB, you're adding headcount. I mean you did expect weakness in nine months from now, wouldn't you wait to hire people, maybe get them a little cheaper?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nNo.\n\nOperator\n\nThe next question is coming from the line of Betsy Graseck from Morgan Stanley.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nA couple of questions. One, just on the investment spend. Could you give us a sense as to the areas that you're leaning in the most as we should be thinking about into next year? Because you've obviously done a lot this year with regard to technology advancement, companies that you're buying to enhance your digital capabilities and international expansion, in particular on the consumer side. So just thinking through is this continuation on those themes? Or is there something else we should be looking for?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nBetsy, it's exactly what we showed you at Investor Day, almost no change. So take out that deck, we broke out by business kind of investment. Investment spend in tech is pretty much on track for that.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nAnd the inflation that drives some of that cost structure, you can deal with through just efficiencies elsewhere. Is that fair?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nBelieve it or not, that was in the numbers we gave you in May.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nOK. And then separately on the bond restructuring that you did this quarter and the comments around, look, we don't need to hold stuff we don't need to hold. We don't want to hold with that. That kind of suggests to me that there'll be more bond restructuring as we go through the next quarter.\n\nIs there a reason why you didn't clean the whole thing up this quarter?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nNo, I think I said we sell rich securities and buy cheap. So if you look at -- if you looked what happened to mortgage spreads, they gapped out. They gapped in, we bought. They gapped out, we sold.\n\nAnd that kind of stuff getting to. So you can have different point of views. And I do expect future bond losses going forward. I just don't think that's real earnings.\n\nSo I think if I want our people -- our experts in the investment areas to know, if they really want to sell something, we're going to sell it. We're not going to sit here and lock ourselves into somebody who's gotten very, very rich because we feel like we can't take a bond loss. And remember, it doesn't affect capital. And in fact, when you reinvest it, which we tend to do, we actually have higher earnings going forward.\n\nOperator\n\nThe next question is coming from the line of Glenn Schorr from Evercore ISI.\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nAnd let me just add too, like you saw the CLOs gapped out in Europe. I want our people, when they gap out like 300 or 400 basis points, I want them to be willing to buy. They might sell something to do that, but that is a very smart thing to the pen.\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nOK. So it's Glenn. So look, from time to time, where things happen in the market, we get these losses like [Inaudible] and now this U.K. pension LDI issue.\n\nSo my question for you is, besides that, do you have risk in the derivatives book? And is the situation done? It's more of when you meet with risk committee, are there pockets of leverage that you're considering on these big market moves, whether it be the dollar or rates where we are not thinking of like us? Or do you view the LDI issue as an isolated event?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nI'll mention, and Jeremy, you might have something to add. So the LDI thing is a bump in the road. And I think the Bank of England is also trying to get through this thing without changing the policy about monetary policy and QT. And I was surprised to see how much leverage there was in some of those pension plans.\n\nAnd my experience in life has been you have things like what we're going through today, there are going to be other surprises. Someone is going to be offsides. We don't see anything looks systemic, but there is leverage in certain credit portfolio, this leverage for certain companies is leverage. So you're probably going to see some of that.\n\nI do think you see volatile markets. You already see very low liquidity. So something like the LDI think could cause more issues down the road, if it happens constantly and stuff like that. But so far, it's a bump in the road.\n\nThe banking system itself is extraordinarily strong.\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nWould the dollar qualify as one of those super strong moves that could put people offsides? And if so, how do you make sure you protect JPMorgan against that?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nWell, we're -- because we're -- we generally -- we do not -- we're not taking them. We owe hedge when it comes to big currencies and stuff like that. But yes, dollar flows, QT, emerging markets hedge funds, yes, that would be a category that might -- something might happen there. It wouldn't be -- it shouldn't be something that's going to affect JPMorgan that much.\n\nIn fact, it usually creates an opportunity for JPMorgan.\n\nJeremy Barnum -- Chief Financial Officer\n\nYes, I'm not going to [Inaudible] is traditionally the case that emerging markets struggle, sovereign struggle with the kind of dollar strength that we're experiencing right now, but our emerging market franchise folks have been through these cycles before. So we manage through it.\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nJust to add to the strength of the franchise, I remember looking back at our emerging markets results by quarter over a decade, it was shocking to me how few quarters and how few countries we ever lost money. We may have had low returns in some quarters, but it was shocking. We made money in Argentina every -- almost every year for the last 20 years. And I think there was one quarter we put up reserves for one of the oil companies and took them down, but it's kind of very -- the stability is striking.\n\nOperator\n\nThe next question is coming from the line of Gerard Cassidy from RBC Capital Markets.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nYou guys have been talking about the system liquidity with, Jamie, you referenced QT, also the fragility of the system. Can you share with us what are the metrics you guys are looking at to see if the system does have a problem on liquidity? Just this week, you probably saw that the Swiss National Bank upped its reserve, currency swapped lines to $6.3 billion. So what are some of the things you guys focus in on to see if there's going to be maybe more -- some liquidity issues that could lead to greater problems?\n\nJeremy Barnum -- Chief Financial Officer\n\nYes. I mean, Gerard, broadly, if you just look at standard regulatory reporting of LCR ratios in the U.S. banking system, everyone just has very significant surpluses. And of course, we can go into the question of as QT plays through and how that interacts with RPM loan growth, whether that puts some pressure on banking system deposits, but that's starting from a very, very strong position.\n\nSo there's a lot of cushion there for that to come down before you start to have a real challenge from a liquidity perspective.\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nYes. We look at everything from the Fed repo, deposit tightening to net issuance of treasury, net issuance of mortgages and treasury volatility and treasury bid-ask spreads and treasury markets and all that. We're looking at all of that. The banking itself is extremely strong, extremely strong.\n\nIt's not -- what you're going to see will not be in the banking. And there may be a bankers outside somewhere, but it will be somewhere else. It will be somewhere else. It might be in credit, it might be in emerging margins.\n\nIt might be in FX, but you're likely to have something like that, you have events like the ones we're talking about.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nVery good. And then in terms of the investment banking and capital markets businesses, can you guys give us any color into pipelines, how they stood at the end of the third quarter? And as you're going into the fourth quarter, what you're seeing in terms of those business lines?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nYes. And I've always pointed out to you all, the pipelines come and go, OK? You've seen that the size, there never had before. So pipeline is not necessarily to see. I would put in your model lower IB revenues next quarter than this quarter based on what we see today.\n\nMarkets, we have no idea. Seasonally, it's generally a low quarter, the fourth quarter, but we don't know this quarter because there's so much activity taking place, and your guess is as good as ours.\n\nOperator\n\nThe next question is coming from the line of Matt O'Connor from Deutsche Bank.\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nCan you guys talk about the outlook for loan growth the next few quarters? And besides some of the obvious areas like leverage lending and correspondent mortgage you already talked about, any areas that you're tightening around the edges?\n\nJeremy Barnum -- Chief Financial Officer\n\nYes, Matt, let me take your last question first. So in general, no, we underwrite through the cycle. We haven't -- we didn't really loosen our underwriting standards in the moment where everything looked great. And so we don't see any need to tighten now, really a lot of consistency there.\n\nIn terms of the actual loan growth outlook, we have said for this year, obviously, only one quarter left, that we'd have high single digits. No meaningful change in that outlook there, probably a little bit of a headwind as a function of rates, as you mentioned, and some of the RWA optimization in mortgages. As we go into next year, we remain very positive and optimistic about the card story across a range of dimensions, in terms of both outstandings and revolve normalization. But for the rest of the loan growth environment, it's going to be, I think, very dependent, especially in wholesale on the macro situation.\n\nWe know that in recession environments, we tend to see lower loan demand. At the same time, we've got a lot of great initiatives going and client engagement and new clients. So we'll just have to see how that plays out next year.\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nAnd I guess when we read headlines about home prices going down in some markets and car prices starting to roll, I mean, why doesn't that drive some tightening in those businesses?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nWell, it has. I mean look at the volumes and mortgage have dropped and cars on the quota have dropped and stuff like that. And that's already in our numbers, and we would expect that to continue that way.\n\nOperator\n\nThe last question is coming from the line of Charles Peabody from Portales Partners.\n\nCharles Peabody -- Portales Partners -- Analyst\n\nYes. I'm just curious in your guidance on NII where you kind of implied fourth quarter would be peak run rate. Next year, do you factor in any impact from a possible treasury buyback program, which could direct liquidity out of the money market system into the banking system, and therefore, keep your deposit betas lower? Do you think about that at all as a possibility?\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nYes. I think -- I don't know if you were listening when I said it before, QT, net issuance in mortgages, net issuance in treasuries globally is going to reduce deposits and create certain forms of volatility and absolutely incorporated that our thinking, including lags, the change in the yield curve, change in spreads and all those things in the numbers we gave you. And that's why we're being trying to be conservative in NII, that while you can annualize the 19 to 76, you have a model, put in 74 and it incorporates all of that.\n\nOperator\n\nAt the moment, there are no further questions on the line.\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nWell, thank you very much, and we'll talk to you all next quarter.\n\nJeremy Barnum -- Chief Financial Officer\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeremy Barnum -- Chief Financial Officer\n\nJamie Dimon -- Chairman and Chief Executive Officer\n\nKen Usdin -- Jefferies -- Analyst\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nErika Najarian -- UBS -- Analyst\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nMatt OConnor -- Deutsche Bank -- Analyst\n\nCharles Peabody -- Portales Partners -- Analyst\n\nMore JPM analysis\n\nAll earnings call transcripts"
}