{
  "companyName": "ForgeRock, Inc.",
  "companyTicker": "FORG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/forgerock-inc-forg-q2-2022-earnings-call-transcrip/",
  "content": "ForgeRock, Inc. (FORG 0.44%)\nQ2 2022 Earnings Call\nAug 11, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to the ForgeRock second quarter earnings conference call. As a reminder, this call is being recorded. I would like to turn the call over to Mr. Mark Kang, ForgeRock's head of investor relations.\n\nPlease go ahead, sir.\n\nMark Kang -- Head of Investor Relations\n\nHello, everyone. Welcome to ForgeRock's Q2 2022 earnings conference call. On the call with me today are Fran Rosch, CEO of ForgeRock; and John Fernandez, our chief financial officer and EVP of global operations. Before we begin, I'd like to remind you that our discussion today includes forward-looking statements within the meaning of the federal securities laws.\n\nForward-looking statements include statements related to our expected results for Q3 and full year 2022, our future offerings and enhancements to our current offerings, the market for our offerings, customer demand for our offerings and other matters. Actual results could differ materially from those indicated by these forward-looking statements. We encourage you to review the risk factors that we have included in our SEC filings including our quarterly report on Form 10-Q filed with the SEC on May 12, 2022, for some of the factors that could cause actual results to differ from those indicated by the forward-looking statements. All non-GAAP numbers referenced in today's call are reconciled in our press release and in slides available on our Investor Relations website.\n\nWith that, I'll hand the call over to Fran.\n\nFran Rosch -- Chief Executive Officer\n\nThanks, Mark, and thanks to everyone for joining us to discuss our second quarter 2022 results. Our ARR grew 30% year over year in Q2, marking the sixth consecutive quarter of ARR growth of 30% or greater. While we experienced record growth of 35% in Q4 of 2021 and Q1 of '22, our ARR in Q2 was below the low end of our guidance by $1.4 million. The primary reason that our ARR results were below our expectations was that we did not close the larger deals in our pipeline as expected.\n\nIn the latter part of June, we began to experience lengthening sales cycles, especially for our larger enterprise deals. It is important to note that some of these deals have already closed in the first part of July, which has resulted in a strong start to Q3. Other deals are still in our pipeline, and we are engaged with our customers on these opportunities. We believe the changing macro and business climate materially contributed to these lengthening sales cycles.\n\nWe also saw more FX impact than we anticipated for Q2, primarily due to the dollar strengthening against the British pound and the euro. But by and large, our ARR results were impacted primarily by the unexpected lengthening of sales cycles for our larger enterprise deals. Given that the challenging economic environment will likely continue to drive companies to take a harder look at IT spending, we are already taking action within ForgeRock to address the challenges. We are focused on the following: efficient pipeline growth.\n\nWe continue to focus on increasing the size and improving the quality of our pipeline, keeping the focus on generating opportunities from our named accounts and our enterprise -- and large enterprise target market. We generated a record amount of high-quality pipeline in Q2. We're on track to create the necessary pipeline to achieve our growth targets, which John will discuss in a bit. Optimizing sales capacity.\n\nWe continue to focus on cost-effectively scaling our go-to-market organization to ensure that we have the capacity and coverage to support our growing business. Customer-centric business model. The investments we made in our customer success organization and culture has resulted in another record quarter of customer retention. This provides us with a strong foundation to increase expansion opportunities within our install base.\n\nDriving platform innovation. We are driving more product releases and partnerships. On our last call, we announced the release of Autonomous Access, and we've quickly built a significant pipeline for this offering. Even factoring in a challenging macro and business climate, we are confident we can deliver on our ARR growth targets discussed on this call.\n\nForgeRock is a growth company with a huge opportunity, and we remain focused on making measured investments to drive robust and durable long-term growth in the range of 30% as we march toward achieving our non-GAAP operating margin profitability sometime in the back half of 2023. A key driver of our growth continues to be our market-leading technology and our continued innovation. In the past, you may have heard us mention the triple crown. ForgeRock continues to be the only identity provider recognized as a leader by Gartner for Access Management and Forrester and KuppingerCole for CIAM.\n\nAlso, in Q4 of last year, Gartner published a report called critical capabilities for access management, which is a deep technical review of 12 identity companies. When you combine our scores across all three categories in the report, which are CIAM, workforce and application development, ForgeRock is the highest ranked platform. I'm excited to provide the following product updates. First, we released a series of major enhancements to our market-leading identity orchestration capability called Intelligent Access trees that make it easier than ever for enterprises to deliver and measure world-class customer and employee experience, while accelerating time to develop user journeys.\n\nKey enhancements include new out-of-the-box, journey themes, custom UI theming, localized language for end user UI in terms of conditions and improved accessibility compliance. Key enhancements for administrators, including new analytics dashboard that measures the success and failure rates of user journeys and new organization features to enable tagging and searching journeys. All of these improvements make our already market-leading trees stand even further apart from the competition and enable our customers to deliver outstanding digital experiences. Identity of the on-ramp to digital customer journey and done well as a force multiplier for businesses.\n\nNext, we released our 7.2 version of self-managed ForgeRock Identity platform. Leveraging our single code base, this release provides our self-managed customers with all the new innovation that is already been delivered to ForgeRock Identity Cloud, including all of the advancements to our trees that I just covered a moment ago. Key additional features include significant updates to our access token capabilities, including token exchange and enrichment and new OAuth 2.0 features, which allow customers to tailor the user experience and increase security. The addition of several new tree nodes that accelerate time to value and improvements to scalability and resiliency of our directory services and data synchronization in elastically scaled environments.\n\nThese new areas of innovation provide additional differentiation between ForgeRock and our competitors. We win in the market because we empower our customers to create better identity experiences without compromising on security, offer a full suite and unified identity platform, our enterprise-grade performance and scalability, the extensibility of our platform, AI and innovation leadership and our proprietary SaaS architecture. Our SaaS offering has been a key accelerator of our growth since its inception. SaaS now represents 17% of our ARR, and we are tracking well toward our goal of finishing this year with 22% to 27% of ARR from SaaS.\n\nWe are still in the early innings of migrating our existing customer base to SaaS with 83% of our ARR still self-managed. Our existing customers who migrate to SaaS represent larger average ARR and more importantly, we've seen a two to three times expansion of ARR after they begin their migration to SaaS. We had some fantastic customer wins during Q2 across both our SaaS and self-managed offerings that I'd like to share. Our first customer win example is a health insurer serving more than 7 million people nationwide.\n\nTheir legacy Oracle solution was nearing end of life. It was complex, costly and limited in its capabilities. This customer selected ForgeRock Identity Cloud to help rebuild its portal for providers and customers. The new solution aims to reduce cost while providing a more secure and enhanced user experience.\n\nNext is European-based IWG, the world's largest provider hybrid work solutions with over 3,500 locations in more than 120 countries. 83% of Fortune 500 companies are IWG customers. Furthermore, IWG is the leading provider when it comes to the safety and security of its customer, and today's security spans both the physical and digital domains. Physical refers to building and office access, visitor logs and convenient vending using one mobile key.\n\nDigital refers to providing companies with the ability to manage their own security related to bookings and managing services such as the collaboration of hybrid teams. IWG needs to automate the synchronization of new starters and levers, add multi-factor authentication and introduce password-less log-in, all with seamless integrations with third-party systems. As such, IWG has selected ForgeRock as their platform to meet these requirements, support their complex use cases of its business and to provide enterprise-grade security and scalability. Our third example is a North American mall retailer with several hundred locations in the United States and Canada.\n\nThis retailer recently purchased ForgeRock Identity Cloud to replace a legacy IAM system that could not keep pace with modern demands. They will use, ForgeRock to improve the speed and security of employee onboarding, featuring capabilities, including SSO, multipath log-in for associates, MFA, custom URLs, self-registration, self-service password reset, employee validation and provisioning of users. Our fourth example is a statewide system that we use ForgeRock to help make access easier and safer for millions of citizens applying for assistance programs. As part of this win, ForgeRock has also provided secure access for hundreds of thousands of state employees.\n\nThey were previously handling audits manually, which was resource and time intensive. With ForgeRock, they're able to automate and streamline their quarterly audits with ForgeRock's IGA module, saving significant time and costs. Our last example is a global designer and manufacturer of household appliances. This customer purchased our self-managed offering six years ago for a CIAM use case.\n\nThey're in the process of transitioning to our SaaS offering for greater simplicity, ease of use and cost reduction for tens of millions of consumer identity. The shift now makes them one of our top five SaaS customers by ARR. Even in a challenging macro environment, we believe ForgeRock is well-positioned for growth because we are at the intersection of three powerful value drivers for our customers. First is cybersecurity.\n\nIdentity is critical to securing the enterprise and increasing threat landscape, and ForgeRock enables greater security without sacrificing end-user experience. We recently released our 2022 Consumer Identity Breach report, revealing that unauthorized access was the leading cause of breaches for the fourth consecutive year, steadily increasing to account for 50% of all records compromised during 2021. Breaches involving user names and passwords increased by 35% during 2021, accounting for more than 2 billion records compromised. Second is driving revenue growth.\n\nEvery company with a digital presence use a frictionless, personalized, user-friendly identity experience to drive digital product adoption and in turn, revenue. Our platform is mission-critical and enabling enterprises to achieve superior customer experience, security and privacy for new lines of business such as a digital bank. Our market-leading identity orchestration capabilities are a key enabler of this. Third is cost reduction.\n\nOur customers are able to achieve significant cost reductions in two primary ways: first, by migrating off legacy or homegrown solutions to our enterprise-grade platform; and second, by leveraging AI to automate governance processes such as managing entitlements, and detecting over-provisioned access that pose security and compliance risks. In July, we announced that Forrester Consulting performed a total economic impact study that examined that ROI enterprises could realize by deploying ForgeRock's CIAM platform. Forrester interviewed seven representatives at five organizations with experience using ForgeRock, and aggregated the results into a single composite organization. These results show that the composite organization saw 186% ROI in less than nine months and a net present value of $28.5 million over three years.\n\nAccording to the study, the composite organization realized significant cost savings over three years. Over $8 million in savings from transforming their legacy environment to ForgeRock; $1.3 million in savings from avoiding IT development costs; almost $6 million in savings for more efficient rollout and deployment of new functionality; reduced instances of fraud resulting in $4.7 million in savings; and a 40% reduction in security-related calls to the call center resulting in a benefit of $24 million. These value drivers that I just discussed are reasons why Identity remains the top priority for every modern organization and why we continue to see strong customer demand for our enterprise-grade Identity platform. We built an incredible business of ForgeRock with world-class customer base, a market-leading Identity platform and over 860 ForgeRockers worldwide who are passionate about modernizing identity for enterprises.\n\nWe are confident that we can drive robust and durable long-term growth in the range of 30% as we capitalized on our $71 billion addressable market. Looking ahead to the second half of the year, we remain encouraged by the underlying drivers of our momentum, which remains strong despite macroeconomic challenges. Our integrated platform across Identity, Access and governance for CIAM workforce and IoT use cases that supports all identity types, continues to be a differentiator for us and our ability to empower our customers to choose how they want to deploy our software, whether it be self-managed or SaaS maximizes the market opportunity for us. With that, I'll turn the call over to John to walk through our financial results in more detail.\n\nJohn?\n\nJohn Fernandez -- Chief Financial Officer and Executive Vice President of Global Operations\n\nThank you, Fran. We were pleased to deliver revenue, non-GAAP operating loss and non-GAAP EPS results above our guided ranges in the second quarter. As Fran mentioned, our Q2 ARR results were impacted primarily by the unexpected lengthening of sales cycles for our larger enterprise deals and significant FX headwinds. Before I dive into specifics on our financials, I wanted to highlight three themes that give us confidence in the durability of our growth and our march toward profitability.\n\nFirst, the ForgeRock Identity platform is a market-leading product that is sold into large enterprises and serves a mission-critical purpose. This is why we have world-class retention rates and high customer lifetime values. Second, our gross margins remained strong and stable as we scale our SaaS business. And lastly, we are marching toward reaching non-GAAP operating margin profitability sometime in the back half of 2023 through measured investments to support the growth of our business for the long term and achieving operating leverage as our revenue growth begins to more closely align with our ARR growth, which has been impacted by our SaaS transition in the most recent periods.\n\nAs we look back over the past six quarters, we have experienced ARR growth of 30% or greater. We ended Q2 ARR at $201.6 million, up 30% year over year. Adjusting for approximately $1 million of FX impact in 2022 year to date, our ARR growth was 31% year over year. Some of our contracts are denominated in local international currencies and impacted by fluctuating FX rates.\n\nSaaS ARR represented 17% of our ending ARR as of June 30. Adoption of our SaaS offering among new and existing customers continues to be strong. SaaS as a percentage of ARR from new customers was 53% in Q2 and 23% of our new customers in Q2 purchased SaaS. We are seeing strong SaaS growth from both new and existing customers.\n\nOf our SaaS customers that initially purchased our self-managed offering after purchasing our SaaS offering, they have expanded their ARR with us by two to three times on average, and they're not done yet. Average SaaS ARR from new customers who purchased SaaS in Q2 exceeded 350,000. We continued to see robust adoption of our SaaS offering in Q2, and we are tracking well toward our goal of finishing the year with 22% to 27% of ending ARR from SaaS. Moving on to customers.\n\nWe continued to experience very high retention and are seeing great results from our investments in customer success. We ended Q2 with 414 large customers, defined as customers with $100,000 of ARR or greater. Our large customer base grew 17% year over year, and they represented over 91% of our ARR as of the end of Q2. The average ARR for a large customer has steadily increased since the end of 2019 and is now $445,000 of ARR.\n\nOur net retention rate for Q2 was 112%, up sequentially from 111% in Q1. The expansion of ARR from our existing customers is being driven by customers adding more identities, more use cases and more product modules. We also have a big opportunity to convert our existing self-managed customers to the ForgeRock Identity Cloud. We continued to expect our net retention rate to stay in the 110% to 112% range for the remainder of this year.\n\nMoving to revenue. Revenue recognition for self-managed deals is significantly different than ratable revenue recognition for SaaS deals under ASC 606. ARR best reflects our growth, while GAAP revenue is impacted by our SaaS increasing as a percentage of ARR. Total revenue for Q2 was $47.7 million, which was above the high end of our guidance.\n\nSubscription SaaS support and maintenance revenue grew 46% year over year in Q2, up sequentially from 43% year-over-year growth in Q1. As it relates to the increasing level of predictability in our revenue, we're pleased to announce that our ratable revenue now represents 62% of our total revenue, up from 46% of revenue in Q2 of last year. Professional services revenue grew from $1.1 million in Q2 of 2021 to $2.6 million in Q2 of this year. The primary driver of this growth was due to services related to the delivery of our SaaS deals.\n\nBefore turning to profitability and expense items, I would like to point out that I will only be discussing non-GAAP results going forward. Non-GAAP results exclude stock-based compensation for all periods discussed. Our press release contains our GAAP results and reconciliations to our non-GAAP results. Q2 gross profit was $39 million and gross margin was 82%.\n\nAs we continue to scale our SaaS offering, we expect to see increasing investment in cloud infrastructure and incur higher hosting cost, which is partially offset by our large SaaS ASPs. Our professional services margin significantly improved year over year, primarily driven by higher utilization and higher professional services revenue. Turning now to operating expenses. We remain focused on investing strategically for growth, while achieving our operating margin goals and our path to profitability.\n\nThe percentages of revenue for our operating expenses are currently heavily impacted by revenue recognition under ASC 606. Also, please keep in mind that we were not a public company in Q2 of last year. Sales and marketing expense for Q2 was $27.2 million, compared to $21.5 million in Q2 last year. This represents 57% of total revenue for Q2 compared to 49% in Q2 of last year.\n\nR&D expense for Q2 was $14 million, compared to $9.7 million in Q2 last year. This represents 29% of total revenue for Q2 versus 22% in Q2 of last year. G&A expense for Q2 was $12 million, compared to $7.8 million in Q2 last year. G&A was 25% of revenue versus 18% of revenue last year.\n\nOperating loss for Q2 was $14.3 million, compared to a loss of $2.9 million in Q2 last year, representing an operating margin of negative 30% versus negative 7% a year ago. It's important to note that the biggest impact to our operating margin year over year is our rapidly growing SaaS business and the resulting impact to revenue under ASC 606. Our balance sheet is very strong, and we ended the quarter with $347 million in cash, cash equivalents and marketable securities. In Q2, free cash flow was negative $20.7 million or negative 44% of total revenue, compared to negative $22.4 million or negative 51% of total revenue in the second quarter of last year.\n\nIn 2020 and 2021, free cash flow in Q2 was the lowest seasonal quarter within each fiscal year. Before we turn to guidance, I'd like to provide some comments that should give additional context for the remainder of this year. While we remain optimistic on our growth for the remainder of this year, we are revising our annual ARR guidance to factor in greater impact from longer sales cycles, especially for large enterprise deals and incremental FX headwinds. On the FX impact to ARR, we estimate the impact to Q3 and Q4 is approximately 1 percentage point of growth for both periods, which has been built into our ARR guidance.\n\nFor revenue, we expect Q2 to be the trough in terms of revenue growth in 2022. We expect revenue growth to begin meaningful sequential reacceleration in Q3, with Q4 being our strongest seasonal quarter for growth. For our annual and operating loss and operating margin guidance, we are managing our business to achieve the margin range over the dollar range. We remain confident in our ability to reach non-GAAP operating margin profitability sometime in the back half of 2023, though our progress between now and then may not be linear primarily due to seasonal variability.\n\nNow turning to guidance. For the third quarter of 2022, ForgeRock expects total ARR of $208 million to $211 million, representing 28% year-over-year growth at the midpoint. Our Q3 and annual guidance is inclusive of estimated FX impact. Total revenue of $49 million to $52 million, representing 14% year-over-year growth at the midpoint.\n\nNon-GAAP operating loss of $12 million to $10 million, representing an operating margin range of negative 24% to negative 19% and non-GAAP net loss per share of $0.17 to $0.13, assuming weighted average shares outstanding of approximately 84.7 million. For the full year 2022, ForgeRock now expects total ARR of $225 million to $232 million, representing 25% year-over-year growth at the midpoint. Total revenue of $206 million to $212 million, representing 18% year-over-year growth at the midpoint. Non-GAAP operating loss of $35 million to $33 million, representing an operating margin range of negative 17% to negative 16%.\n\nAnd non-GAAP net loss per share of $0.49 to $0.44, assuming weighted average shares outstanding of approximately 84.5 million. I'll now turn the call back to Fran for closing remarks. Fran?\n\nFran Rosch -- Chief Executive Officer\n\nThank you, John. Before we open for questions, I'd like to close with a quick summary of the actions that we are taking as a company to achieve our targets and to drive robust and durable long-term growth in the range of 30%. We continue to focus on increasing the size and improving the quality of our pipeline. We are cost effectively scaling our go-to-market organization to ensure that we have the capacity and coverage to support our growing business.\n\nWe continue to focus on customer success to maintain our strong gross retention rates while creating additional opportunities to expand our business within our existing customer base. We're driving more product releases and partnerships. As CEO, I continue to be very excited about the incredible business we've built and the opportunity ahead for ForgeRock. Operator, you may now open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] We'll now take our first question from Gregg Moskowitz from Mizuho. Your line is open. Please go ahead.\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nOK. Thank you very much for taking the questions, and good afternoon, gentlemen. I guess first question for Fran regarding the macro. Are the longer sales cycles that you're seeing or began to see in the latter part of June, are they more pronounced in any particular region? Or is that broad-based? And then also, are you seeing any changes in average deal sizes in any of your territories?\n\nFran Rosch -- Chief Executive Officer\n\nThanks, Gregg. We did not see any concentration of those kind of challenges in any particular geo, in any particular industry or really any particular product line. It was really kind of reflective of our business. As we came into Q2, but we had a strong pipeline of a lot of great large enterprise deals.\n\nAnd as we work those, we saw those challenges at the end of the quarter, but it was kind of reflective of the business.\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nOK. Understood. And then I guess a question for John. I think a lot of investors are just wondering how conservative your assumptions may be as it relates to your Q3 and full year guide.\n\nIn other words, are you assuming a continuation of these trends that surfaced in June or a worsening of them? Any color there would be terrific.\n\nFran Rosch -- Chief Executive Officer\n\nYeah. Let me -- I'll touch on that, and then maybe John can add some color if he thinks it's beneficial. When we looked at the Q3 guidance and the rest of the year guidance, we recognize we're really building off a very strong foundation. We've now had 10 quarters of this growth in that 30% range, including a couple of them at that 35 over the past couple of quarters.\n\nThe market continues to be really strong for digital identity. With these great customers, our technology continues to be really well recognized. So we really have a strong foundation as we went into -- in the second half. But given that lengthening of the sales cycles that we saw at the end of Q2, we spent a lot of time working with our sales team and looking at our pipeline for the second half of the year.\n\nAnd we feel we have a strong both quantity and quality of pipeline because you recognize not all of it is created equal, whether it's new customers or existing customers, cloud or SaaS or self-managed. We applied our conversion rates to that pipeline, but we also did apply some additional impact for those longer sales cycles, as well as some FX that we saw earlier in the year. But when we -- as we get in here to Q3, we've seen improved linearity, we had a record July at ForgeRock. So some of those deals that we experienced those longer sales cycles have already closed, which is great.\n\nWe have a strong pipeline. We have the right sales capacity. So when we look at these things, we do have confidence that we did create the right guidance for the second half of the year.\n\nJohn Fernandez -- Chief Financial Officer and Executive Vice President of Global Operations\n\nAnd I think to add to that, Gregg, well, we really -- as you look at that FX, we experienced such material movements in Q2, just globally against the euro and the pound depreciated against the dollar. We've got almost $3 million of FX that's now incorporated into the reduction in the ARR guide. So obviously, very, very meaningful. And we hope the worst is behind us in that sense.\n\nHowever, I'd state that we've also incorporated, again, I think, three additional level of discounts, additional level of discount that was iterated in for macro in general for additional potential FX and also for the lengthening of the sales cycle. So really material and the way we've thought about this. And again, I think focused around what we saw in just the handful of large deals. We hope that is not the norm going forward.\n\nBut obviously, we felt it was prudent and important to incorporate that conservativeness into our guide.\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nThat's helpful. Thank you, both.\n\nFran Rosch -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext up, we have Eric Heath from KeyBanc Capital Markets. Your line is open. Please go ahead.\n\nEric Heath -- KeyBanc Capital Markets -- Analyst\n\nHey, Fran. Hey, John. Good afternoon. So just on the margins, I think it was clear that you're taking a little bit more of a measurable approach to spend this year.\n\nSo just curious, a, kind of where you're kind of focusing those dollars that you want to continue investing in, and maybe where you're just pulling back a little bit.\n\nFran Rosch -- Chief Executive Officer\n\nSure. Absolutely. I think first of all, ForgeRock is really a growth company and an amazing growth opportunity looking forward. And we've had this long stream of 30% growth.\n\nWe think that's going to continue as our long-term durable growth target in the company. So we've got to invest and build into that. We are targeting. We are primarily a technology company, obviously.\n\nAnd our companies choose us for that. So we continue to invest in R&D to ensure that we can continue to release really cool things to help our customers with better digital identity. We'll continue to invest in our go-to-market and our sales efforts to scale that capacity, so we have what we need to deliver the numbers. We continue to invest in customer success and customer support to ensure that our customers get that value.\n\nSo we're kind of -- we reprioritized some things within the company, some things that we felt we could do less of to ensure that we protect the investments in some of those key areas to continue to drive the strong growth that we've experienced over the past several years.\n\nJohn Fernandez -- Chief Financial Officer and Executive Vice President of Global Operations\n\nYeah, and I would just add, the leadership team, you take a really careful look at all of our expenses, I think it's always prudent to do. And again, as Fran mentioned, reprioritize and reduce some dollars where we could. What we were able to do with that was the flow-through from the reduction in revenue did not completely flow through as you'll note in the guidance around the operating loss. And so we did there was made some of those strategic reductions, but also with an eye toward really importantly, always running our three-year plan out, looking at that, looking at making sure we're feeding that growth from the future, obviously, around R&D, customer success, sales and marketing, but also really importantly, to ensure that we could reaffirm that target we have around that profitability somewhere in that back half of 2023.\n\nSo all of that was done as a very coordinated review in this cycle.\n\nEric Heath -- KeyBanc Capital Markets -- Analyst\n\nGot it. That's helpful. And then, Fran, I mean, I think about your business, it's still largely CIAM, which does include both security organizations and marketing organizations in terms of making that decision on the buying cycle. So just curious, I mean I think we all think security budgets are pretty safe relatively speaking.\n\nSo is it maybe a function of kind of the marketing side that might have caused a little bit more kind of scrutiny of deals? Just curious your thoughts there.\n\nFran Rosch -- Chief Executive Officer\n\nYeah, it's a great question. And at ForgeRock, we do service both parts of the market. Our platform works definitely a lot of focus in CIAM, where we tend to land most frequently and expand from there, but we also continue to land on the workforce side as well. We had some wins in governance this past quarter that we feel really great about.\n\nBut we do tend to land in CIAM. And when we looked at kind of some of those changing dynamics in those sales cycles in the latter half of June, I think some of what you're talking about is kind of what we saw that we were in some of these opportunities where our champion said, look, we chose a ForgeRock, the right platform for us. And then we're moving it through the purchasing process. And when we got through that that champion might have been buying the platform for maybe a sales business unit or line of business within that organization.\n\nAnd as identity is becoming more and more strategic and important, companies looked and said, hey, could we potentially use this technology in other places? So that's led to further conversations, more POCs, which importantly has driven those longer sales cycles. But by and large, we've not lost any of these opportunities to our competitors. We continue to engage with our customers. Some of them have closed already.\n\nSo we feel good about that momentum. And I guess just to kind of put one other way to answer that question, consumer identity continues to be a top priority, even in these environments, whether from a cybersecurity standpoint, with account takeover still being a common attack vector. As all these companies try to compete in their market, the identity experience becomes so important so that they can deepen relationships and drive loyalty with their own customer base, as well as reducing costs and making more self-service to reduce kind of helped us. So we feel it's still a great market for both CIAM and workforce, and we continue to drive growth in both areas.\n\nEric Heath -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thanks for taking the questions.\n\nFran Rosch -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext up, we have Angie Song from Morgan Stanley. Your line is open. Please go ahead.\n\nAngie Song -- Morgan Stanley -- Analyst\n\nHi. Thanks so much for taking my question. So there's been some consolidation within the identity management space lately. So could you just talk on how you think this might impact the current competitive landscape? Thanks so much.\n\nFran Rosch -- Chief Executive Officer\n\nYes. Absolutely. We have seen that consolidation over the past couple of quarters, and I think that's really -- that really demonstrates how interesting this market is. And people really see when they talk to CIOs and CISOs, Identity always comes up in the top one, two or three priority of an organization.\n\nAnd I think we're seeing all kinds of investors take a lot of interest in this market. And we think we're really happy to be in such an exciting market. I think for us -- and in my career, I've been involved in a lot of M&A, and M&A can be really challenging and potentially distracting. And so as new owners come in, new priorities get set, new budgets rolled out, change of leadership, that can be distracting for these companies.\n\nSo at ForgeRock we're really focused in using this time and using this opportunity as a stand-alone public company to execute and grow in the market. And the last element when we think of sort of how some of these owners might put some of these other pieces of technology together, at ForgeRock, we recognized a long time ago talking to our customers, that they don't want to have to cobble together multiple point solutions across that identity journey. And at ForgeRock, we already have identity and identity management, access management, SSO, MFA, governance entitlement management all in a single platform, all organically built by our development team, all fully integrated into that single platform. So it's interesting everyone else is kind of noticing what a great market this is and taking some actions, but we feel really good about our position and our ability to continue to win with our platform.\n\nAngie Song -- Morgan Stanley -- Analyst\n\nGreat. Thank yo. And just one other follow-up question. Have you guys been seeing any or have you guys been making any changes in terms of hiring plans versus six months ago? Thank you.\n\nFran Rosch -- Chief Executive Officer\n\nWe're -- as we mentioned, we're a growth company, and we continue to hire. We also talked about doing that prudently and where we could pulling back, so we could focus our hiring in the areas that are really going to move the needle. We really focus on our sales capacity, and we know that we look at our sales capacity in a pretty sophisticated way to look at rep productivity in the zero to six months, six to 12 and greater than 12. And we know we've got to constantly build that pipeline to grow that go-to-market machines we're in, continue definitely to stay focused in that area.\n\nWe've got to continue to create great innovation. So we're continuing to invest in R&D, customer success and support and look at other areas where we might slow down hiring, so we can focus investing in those growth areas.\n\nThank you for the question. I guess next one.\n\nOperator\n\nRight next, we have Jonathan Ho from William Blair. Your line is open. Please go ahead.\n\nJonathan Ho -- William Blair -- Analyst\n\nHi. Good afternoon. I just wanted to see if we could get a sense of the magnitude of the deals that slipped out. And have they all subsequently closed? Or are there still some that are open right now?\n\nFran Rosch -- Chief Executive Officer\n\nYeah. So when we go into any quarter, at the beginning of the quarter, we spent a lot of time looking at our pipeline and looking at the deals that are in the pipeline and how some combination of those are going to close to result in us achieving our targets. Of course, it's not all those. It's a percent of those.\n\nSo for us, it was really just a handful of these larger deals that we were looking forward to closing and being part of that quarter. Some of them have already closed. We had one of our large healthcare companies that is already closed here in Q2 and that -- in Q3, excuse me. So off to a really good start.\n\nSeveral others as well -- have closed as well, but we've got more to go. As I mentioned, we haven't lost any of these to our competitors. We just continue to engage with our customers. helping them further put this, whether it's an ROI or more POCs to get these deals closed.\n\nJohn Fernandez -- Chief Financial Officer and Executive Vice President of Global Operations\n\nAnd Jon, I'll just add, some of those deals that didn't close enough of them closed such that we're actually off to a record linearity in July, and August is looking incredibly strong. So I think is testament to the fact that they really did not come in just on the goal line with respect to Q2, but we've closed substantial amounts such to contribute to that record linearity.\n\nJonathan Ho -- William Blair -- Analyst\n\nGot it. And then in a tougher environment, do you see maybe the contribution mix shifting from new customers to more existing customers or vice versa. I just want to get a sense for how you're thinking about relative net retention versus new customer growth? Thank you.\n\nFran Rosch -- Chief Executive Officer\n\nYeah. Let me give my perspective, and then maybe John can add a little more around our net retention approach. But we continue, Jonathan, to think both of these are really great opportunities. We've got a great customer base with really strong gross retention, and we believe that's a great opportunity to cross sell, upsell, and grow more ARR through that channel, whether it's workforce to signed customers or signed to workforce.\n\nWe just launched our Autonomous Access last quarter. We now have $7 million of pipeline in that with several deals we expect to close this quarter. Our software to SaaS initiative. So we think there's a lot of opportunity.\n\nWe're going to continue to focus on that embrace the base as we call it at ForgeRock. But we're going to continue to focus on new logos and new customers. It's still a really dynamic market. There's still a lot of companies that we see that are running Oracle or CA or other legacy platforms that need to modernize a lot of homegrown technology out there that's ready to be replaced.\n\nWe still see strong growth in RFPs that are coming to the company. So we're going to continue to focus on both. Our sales team are compensated on new ARR whether that comes in from existing customers or new logos. Our marketing team is focused on driving leads from new logos, but we're selling to our installed base as well.\n\nSo I guess a long way of saying we think both opportunities continue to be really great for ForgeRock.\n\nJohn Fernandez -- Chief Financial Officer and Executive Vice President of Global Operations\n\nYeah. And as it relates into net retention, new logos are a huge opportunity of the largest deals that slipped in Q2, they're really more a function of new logo acquisition. As you might expect, there's more of a contracting and POC kind of process that you go through. What that meant was that the percentage of new business we closed, as you might expect, was then skewed toward our installed base.\n\nHowever, if you look back over the prior four quarters, it's not just the percentage that was higher in the prior 4 quarters, actually, the absolute dollars were higher. So when you go a layer deeper into that expansion, we think that really shows those great results from having built up that customer success last year, really moving toward getting that deeper upsell, cross-sell and adding more identity. So the base -- install base is really strong, showing really nice expansion. We're pleased to see that.\n\nAdding as well multiple software to SaaS deals, which again continue to convert at that two to 3x of ARR. So really, really pleased with how that's flowed through in an overall in net retention. Just to note, gross retention continues to be a record highs and ticked up even further in Q2.\n\nJonathan Ho -- William Blair -- Analyst\n\nThank you.\n\nOperator\n\nNext up, we have Brad Zelnick from Deutsche Bank. Your line is open. Please go ahead.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGreat. Thanks so much for taking the questions, guys. Maybe I'll start with you, Fran. We all know the environment is tough out there.\n\nAnd I know you're a pro. You've lived through prior cycles. What gives you confidence this is all environment that you're seeing and that your team is executing the best that they possibly can? And just given what's going on out there, can you double click -- I know you spoke to some of this in your prepared remarks, but just some of the adjustments that you're making in your go-to-market to adapt to the environment. Does it make more sense to put more effort behind expansion versus new logo as an example? Thanks.\n\nFran Rosch -- Chief Executive Officer\n\nThank you. You're right. I've been around a while, and that gives me a great foundation to -- I do feel really confident in the future of the company and the opportunity we have in the back half of the year. And I would say there are two things that really give me that confidence, first is really looking at the pipeline.\n\nWe've spent a lot more time understanding not only the quantity, but the quality of that pipeline that we have. We had a record pipeline development in Q2. We're on track for strong pipeline development here in Q3 from a quantity standpoint. We've also spent a lot of time continuing to dig into the quality.\n\nAnd by that, not every opportunity is created equal. Some opportunities convert at higher rates than others. So whether we look at pipeline from our new logos or existing customers or self-managed versus SaaS or CIAM versus workforce or opportunities that are generating our target account list, we know those convert at a higher level. So that really drives that confidence is looking in that pipeline and seeing the quantity and quality there to deliver the numbers.\n\nBut I would also say it's the conversations that I have with our customers and our prospects. And I was on the phone with one of our larger financial services customers over the past couple of days who are just are looking at opportunities to further use ForgeRock and other business lines as they continue to grow as an organization or I talked to brand new prospects, a technology company here in Silicon Valley that has done a nice takeoff and selected ForgeRock, and they're now in our pipeline here to close this quarter. So a lot of confidence there, both by the numbers and the data I see in the pipeline, as well as the conversations that I'm having with customers and prospects.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nThanks for that, Fran. And maybe just a follow-up for John. John, it seems that DSOs have been creeping up pretty meaningfully, especially in Q2, which is a little counterintuitive. If the story of Q2 was larger deals pushing out at the very end.\n\nSo is there anything else that's happening in terms of payment terms that explain what we're seeing in receivables? And what should we expect as it relates to collections going forward?\n\nJohn Fernandez -- Chief Financial Officer and Executive Vice President of Global Operations\n\nYeah. That's really interesting. If you go through prior filings, you look at the actual bad debt, I would challenge anyone in our business to show a better level of collections than we have. I think our bad debt is absolutely record for the industry.\n\nAnd so that is really where everything comes out in the wash, so to speak, and that's just a function of great product, really durable, great customers, enterprise that pay. So I think DSO can be just a function of period-over-period changes, not anything there we've had a challenge with. And on payment terms, we've been very, very consistent just to give you an analysis over the last week, looking at how much 30-day, how much 45. I actually approve anything over 45 days in the company.\n\nAnd I've seen no uptick in those payment terms over the prior period. So things appear to be very, very strong there. Could we see more of those requests going forward potentially, but have not seen them yet.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGreat. Thank you so much for taking the questions, guys.\n\nJohn Fernandez -- Chief Financial Officer and Executive Vice President of Global Operations\n\nThank you.\n\nOperator\n\nNext up, we have Shaul Eyal from Cowen. Your line is open. Please go ahead.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nThank you. Good afternoon, guys. Fran, I want to go back to that point about the quality of your pipeline and maybe on the heels of Brad's go-to-market question. As you think about your relations with your partners, any changes, any fine-tuning that are also needed on that specific front?\n\nFran Rosch -- Chief Executive Officer\n\nYeah, Shaul. Yeah, let me answer that in turn. When we look at our pipeline, our pipeline comes from three primary sources. And one great source is our partners, and they continue to be really important to us.\n\nWe have great relationships. Some of the big partners like Accenture, Deloitte, PwC, but we also partner with dozens of different identity providers around the world. And they are absolutely bringing us into these accounts as they're working with customers as part of kind of larger initiatives around digital transformation and cloudification. So a good part of our pipeline comes from that -- from those partners, and we love that because it typically comes in more qualified, larger, faster cycles because the partner is already in there developing with us.\n\nAs we've mentioned in the past, we do co-sell once that opportunity gets generated, but our organization is really focused with working partners to identify new opportunities, close those opportunities and then deliver them and work with our partners around customer satisfaction. So that's an important part of our pipeline generation. And what's important in the first half of the year, we expect it to be important in the second half. Our second big part of the pipeline is what we generate ourselves.\n\nPrimarily our marketing organization is focused on new logo pipeline generation, where we create engagement in the market and queue out that flow through to our sales development team. We then set up meetings and opportunities with our MAEs, our account reps. And then our MAEs, our account reps, are also focused on our existing customers, creating new pipeline. So when we look at quality of that pipeline, we do look at its source across those three.\n\nBut then we also look at other factors, as I mentioned, whether it's CIAM or workforce, and we tend to land more in CIAM, our platform is really recognized as much more market leading in CIAM than anywhere else, so we tend to close those at a higher rate. Or right now, our SaaS business is closing at a faster rate, with slightly shorter sales cycle. So we look at quality in a lot of different ways when we look at that pipeline that give us confidence here in what we've provided for the second half of the year.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nUnderstood. Understood. And maybe another tricky question. We've all read about the recent cyberattack on Cisco that took place in late May.\n\nIt does mention a deal that they bought back in 2018. And obviously, I think we know and understand because they gave -- they provided it in a very, very thorough manner that it was really mostly an identity-driven type of attack. What's your thought on that front and maybe have you been seeing anything emanating from that attack that could come in your direction? And I know that you maybe compete on a different front a little bit, but there's, I think, without a doubt, plenty of angle that you could address.\n\nFran Rosch -- Chief Executive Officer\n\nYeah. I'll answer that in two ways, Shaul. You're right, identity continues to be one of the most attacked vectors of cyber criminals trying to break into any enterprise, whether it's on the consumer side, where people will buy or steal user names and passwords and show up, and appear to be legitimate when they're not. Within the enterprise compromised credentials are leading to these type of breaches.\n\nSo we released our breach report just a couple of weeks ago that demonstrates identity-related breaches continue to grow. So it's a real problem for companies out there. And ForgeRock helps them solve that problem with better and smarter identities. So we see that as part of our value proposition, and we're focused on helping companies improve security around identity.\n\nNow we also, obviously, have our own infrastructure, our own products. So we have to invest in our own security here at ForgeRock. We have a great CISO, Russ Kirby. We continue to invest in security at board-level conversation to ensure whether it's with people and technology and better processes.\n\nWe stay protected because our company is obviously counting on us, around our identity services. So for us, it's kind of both a market opportunity and continued investment here at, ForgeRock or in cybersecurity.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nThank you for that.\n\nFran Rosch -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext up, we have Gray Powell from BTIG. Your line is open. Please go ahead.\n\nGray Powell -- BTIG -- Analyst\n\nOK. Great. Thanks for taking the questions. So yeah, maybe just sort of a couple of related ones on my side.\n\nRoughly speaking, it looks like the SaaS product drove about two-thirds of your net new ARR additions in the first half of the year. And then if I look at the guidance, I think the guidance implies that SaaS is going to account for just over 80% of the net adds in the second half. Does that seem about right to you? Am I doing the math correctly there? And then is that factoring in any sort of conservatism on the on-prem side in the second half? Or am I reading too much into that mix?\n\nFran Rosch -- Chief Executive Officer\n\nYeah. I'll touch on kind of our approach to SaaS and then maybe John can provide a little bit more color on that math. But part of what we do is we offer our customers choice on whether they want to consume ForgeRock in our identity SaaS or in a self-managed because we think there continues to be market for both, and we want to capture all of that market. We've seen really rapid adoption of our SaaS.\n\nAs you mentioned, this is only our second full year of having SaaS in the market, and it's a big driver of our growth. And Q2 was no different, with over 50% of our new era coming from new logos coming on that SaaS platform. And we've always talked about some potential kind of quarter-to-quarter fluctuations, but overall, we're going to continue to sell both SaaS and self-managed and see good strength in both.\n\nJohn Fernandez -- Chief Financial Officer and Executive Vice President of Global Operations\n\nThat's right. Yeah. And I think there's a couple of things. Talking about revenue first, there's a lot of revenue coming from our self-managed business that will continue to renew.\n\nWe'll continue to look out toward our pipe. And I think this is right to the core of your question, right on our pipe, it looks good healthy mix of both the SaaS and self-managed. And so we do have a beat and raise model in place, obviously, we have provided a level of conservatism to that. I'd tell you, the 80% is probably on the high range there.\n\nAnd so I think as you look at those factors, we believe it will continue to grow, but it will fluctuate quite a bit from quarter to quarter, that SaaS dollar mix as we move out toward the end of the year.\n\nGray Powell -- BTIG -- Analyst\n\nOK. That's really helpful. Thank you very much.\n\nFran Rosch -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext, we have Rob Owens from Piper Sandler. Your line is open. Please go ahead.\n\nRob Owens -- Piper Sandler -- Analyst\n\nGreat. Thank you for taking my question. I guess following on that, could you then unpack for us the percentage of new customers who are purchasing SaaS versus self-managed? Because it was at a low this quarter, and just customer patterns right now and how they're buying because it seems with other infrastructure stories, they're migrating more toward SaaS than they are the self-managed. So curious why yours went the other way.\n\nFran Rosch -- Chief Executive Officer\n\nWhat I would say is, certainly, we do see that growth in SaaS. As I mentioned, we offer our customers choice and redundancy from fluctuations, order to the next. And again, from an ARR perspective, in Q2, still, it was over 50% were coming off of that tab. So we think that we really appreciate the opportunity to do give our customers choice.\n\nA lot of our customers still want to run identity in the public out of their choice, like AWS or Google, or GCP, along with the rest of their application stack, and we want to support that. but we continue to see great growth in our SaaS what's in our pipeline going forward.\n\nJohn Fernandez -- Chief Financial Officer and Executive Vice President of Global Operations\n\nYeah. And Rob, the other way to see this, as we think about those largest deals I mentioned earlier that were oriented toward the new mix, we had talked about, again, correlated as SaaS has been a great new logo driver for us. So that new being the SaaS obviously impacting that 23%. Yes, I think interestingly, still 53% on the dollar.\n\nSo reaffirming there that when we closed these SaaS deals, they're high ASP. And that's been really, I think, very, very consistent for us and very strong in Q2. But yes, to your point, the new number and the new logo was the slightly lower part in Q2.\n\nFran Rosch -- Chief Executive Officer\n\nAnd we did finish the quarter with 17% of our ending ARR in SaaS, and we continue to reaffirm that at the end of this year, which is only the second year we've had in the market will be between that 22% and 27%. So we continue to feel really great about that SaaS opportunity.\n\nRob Owens -- Piper Sandler -- Analyst\n\nAll right. Thanks, guys.\n\nOperator\n\nIt looks like there are no more questions at this time. I would like to turn the call back over to Mr. Fran Rosch, CEO, for any additional or closing remarks.\n\nFran Rosch -- Chief Executive Officer\n\nGreat. Well, thanks to everyone for joining our call. Thanks to all the great questions. On behalf of the entire team at ForgeRock, we feel great.\n\nWe continue to feel great about our growth opportunity. It's a really incredibly exciting market to be in digital identity today. We feel very confident with our full-scale comprehensive platform, our approach to cloud and the pipeline that we continue to build, that's really going to support our growth in the second half and going forward for the next many years. So thanks again to everyone who joined the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Kang -- Head of Investor Relations\n\nFran Rosch -- Chief Executive Officer\n\nJohn Fernandez -- Chief Financial Officer and Executive Vice President of Global Operations\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nEric Heath -- KeyBanc Capital Markets -- Analyst\n\nAngie Song -- Morgan Stanley -- Analyst\n\nJonathan Ho -- William Blair -- Analyst\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nGray Powell -- BTIG -- Analyst\n\nRob Owens -- Piper Sandler -- Analyst\n\nMore FORG analysis\n\nAll earnings call transcripts"
}