{
  "companyName": "Treace Medical Concepts, Inc.",
  "companyTicker": "TMCI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/treace-medical-concepts-inc-tmci-q2-2022-earnings/",
  "content": "Treace Medical Concepts, Inc. (TMCI -1.92%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome. Thank you for standing by. Welcome to the Treace Medical Concepts second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode.\n\nAfter the speakers' presentation, there will be a question-and-answer session. [Operator instructions] Please note that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Vivian Cervantes. Please go ahead, Vivian.\n\nVivian Cervantes -- Investor Relations\n\nThank you, Kathy. Good afternoon, everyone, and welcome to our second quarter 2022 earnings conference call. Participating from the company today will be John Treace, chief executive officer, and Mark Hair, chief financial officer. During the call, we will offer commentary on our commercial activity and review our first quarter financial results released after the close of the market today, after which we will host a question-and-answer session.\n\nThe press release can be found in the Investor Relations section of our website at investors.treace.com. This call is being recorded and will be archived in the Investors section of our website. Before we begin, we would like to remind you that it is our intent that all forward-looking statements made during this call will be protected under the Private Securities Litigation Reform Act of 1995. Any statements that relate to expectations or predictions of future events and market trends, as well as our estimated results or performance, are forward-looking statements.\n\nAll forward-looking statements are based upon our current estimates and various assumptions. These statements involve material risks and uncertainties that could cause actual results or events to materially differ from those anticipated or implied by these forward-looking statements. All forward-looking statements are based upon current available information, and Treace assumes no obligation to update these statements. Accordingly, you should not place undue reliance on these statements.\n\nPlease refer to our SEC filings, including our Form 10-Q for the first quarter to be filed later today and our Form 10-K for the full year 2021 filed on March 4, 2022, for a detailed presentation of risks. With that, I will now turn the call over to John. John? \n\nJohn Treace -- Chief Executive Officer\n\nThank you, Vivian, and good afternoon, everybody, and thank you for joining us on our second quarter 2022 earnings conference call. We are pleased to report a 45% annual revenue increase in the second quarter and a 50% increase for the first half of 2022, with steady gains in our key operating metrics, driven by the underlying strength of our business and solid execution of our commercial strategies. We are also encouraged that our investments and initiatives laid out earlier this year are starting to pay dividends with our operations poised to scale. Our business is driven by our focus with a disruptive technology and surgical procedure, which we believe is fundamentally changing bunion surgery today.\n\nAnd we are building around this with complementary technologies that address bunion-related deformities such as those of the mid-foot. Our continuing commitment to invest in programs to build clinical evidence and become the standard of care in bunion surgery. From what we can see in the marketplace, we are the only industry participant with a growing body of clinical data demonstrating [Technical difficulty] \n\nOperator\n\nApologies. We're having some audio issues. I think, John, if we could start your prepared remarks.\n\nJohn Treace -- Chief Executive Officer\n\nYes, absolutely, Kathy. Sorry about that. We had a line-drop. I'm going to continue where I believe we left off. \n\nVivian Cervantes -- Investor Relations\n\nMaybe start from the beginning. \n\nJohn Treace -- Chief Executive Officer\n\nOK. Sounds good. \n\nVivian Cervantes -- Investor Relations\n\nThank you. \n\nJohn Treace -- Chief Executive Officer\n\nThanks, everybody. We're pleased to report a 45% annual revenue increase in the second quarter and a 50% increase for the first half of 2022, with steady gains in our key operating metrics, driven by the underlying strength of our business and solid execution of our commercial strategies. We are also encouraged that our investments and initiatives laid out earlier this year are starting to pay dividends with our operations poised to scale. Our business is driven by our focus with a disruptive technology and surgical procedure that we believe is fundamentally changing bunion surgery today.\n\nAnd we're building around this with complementary technologies that address funding-related deformities such as those in the mid-foot. Our continuing commitment to invest in programs to build clinical evidence and become the standard of care for bunion surgery. From what we can see in the marketplace, we're the only industry participant with a growing body of clinical data demonstrating rapid return to weight-bearing in a walking boot with low recurrence rates at 12 and 24 months and interim data demonstrating positive patient-reported outcome scores following our bunion correction procedure. Therefore, we're pleased with the sustained enthusiasm and positive momentum from surgeons through our active training initiatives, as well as patients through our targeted DTC programs.\n\nOf note, our surgeon education and training programs continue to be well received with strong demand, and our regional and national seminars book to capacity for new surgeons, as well as our advanced courses. As such, we're encouraged to see steady gains in our active surgeon user base. As of the second quarter, our active surgeon base, which includes surgeons who performed at least one case in the trailing 12 months, has now reached 20% penetration of the estimated 10,000 foot and ankle surgeons who perform bunion surgery in the U.S. As our surgeon base continues to mature, we look forward to surgeon utilization gains, not only with increasing use of Lapiplasty technology but also our Adductoplasty system and the adoption of our growing portfolio of complementary ancillary products, supported by our expanding direct sales channel, as well as our patient education and awareness initiatives, which we believe help patients learn about our procedures and connect them with knowledgeable surgeons.\n\nWe have a specialized team here at Treace, including a rapidly expanding direct sales force, one that is 100% focused on the bunion and related mid-foot surgery and represents the only such organization that we're aware of in the med tech industry. This has contributed meaningfully to our revenue and market penetration. We continue to invest in this channel and transition to a higher mix of direct revenue over time. In the second quarter, 68% of revenue was generated by our direct sales force, up sequentially from 63% in the first quarter and up from 51% just a year ago.\n\nWe ended the second quarter with 123 quota-carrying direct sales reps, a 52% increase from the 81 direct reps we had at the end of 2021. Including associate sales reps, clinical specialists, and sales management, our employed employee fleet in the field increased 40% to 202 employees in the second quarter compared to 144 employees at the end of last year. We continued to have great success building our sales team here at Treace, and we believe these new reps are joining our team because of our unique growth profile driven by our innovative technologies that are backed by strong clinical evidence and supported by our market-leading patient and surgeon education programs. Our success not only lies with recruiting new experienced reps but also in converting some of our successful independent sales agents into W-2 employee reps.\n\nHaving ended the quarter with 68% of sales coming from our direct channel, we are already trending above our previously announced year-end goal of 70% early on here in the third quarter. In addition, given strong interest from candidates to join our employee sales team, we now expect to exceed our year-end goal of 150 quota-carrying sales reps. Our disruptive Lapiplasty solution was specifically developed to correct the root cause of bunion and address a large and underserved market. We've identified a $5 billion-plus U.S.\n\nmarket of 1.1 million annual surgical candidates, of which only 450,000 undergo bunion surgery each year, mainly due to limitations associated with current standards of care. As a reminder, recurrence rates reported in the clinical literature with the metatarsal osteotomy procedure, which represents 70%-plus of bunion surgeries today are highly variable and have been shown to be as high as 78%. In the second quarter of 2022, we believe we have penetrated approximately 4.6% of the estimated 450,000 annual bunion surgical procedures in the U.S., up from 3.3% in the second quarter of 2021 and representing approximately 1.9% market penetration of the 1.1 million annual U.S. surgical candidates, representing our $5 billion total addressable market.\n\nWe are encouraged by our momentum with positive market feedback and strong execution supporting our conviction for sustained growth and market penetration. Based on our continued rapid growth, we're pleased to note that for the fourth time in the company's history, we are once again in the process of relocating to a larger headquarters facility, which will allow us the capacity to meet our increased requirements for surgeon and sales force training, R&D product innovation, as well as warehousing and other infrastructure needs. Turning now to our Q2 results. Revenue in the second quarter was $30 million, representing 45% growth over the second quarter of 2021.\n\nDuring Q2, we continued to benefit from our commercial strategies and investments. With improving demand trends as the quarter progressed, we're extremely pleased not only with our top-line growth but also sustained positive trends in our key operating metrics, including our expanding direct bunion-focused sales team, which accounted for 68% of our Q2 revenue mix, strong steady increases in the number of new surgeon users ending Q2 with 2047 active surgeons, up 37% year over year. Continued year-over-year increases in surgeon utilization with 10.1 kits per surgeon in Q2, up from 9.8 kits a year ago and strong blended average selling prices of $5,711 per case, representing 5% growth over the prior year due to positive uptake of our newer innovations such as the Lapiplasty Mini-Incision system and our Adductoplasty system for mid-foot correction and as our direct reps leverage their position in the OR and increasingly displaced competitive forefoot products with our complementary ancillary products. Investments in our patient awareness DTC programs, expansion of our direct sales channel, and R&D innovations consistently support our revenue expansion and momentum.\n\nWe remain excited about the positive impact these investments are making on our business, giving us confidence that we have a well-defined proven, and scalable commercial strategy that's fueling our growth. Given these positive trends, we are raising our full-year 2022 revenue guidance to $130 million -- to $134 million, which reflects an increase of 38% to 42% from 2021 revenue. Shifting now to our commercial and market development activities. A key differentiating driver for our business is our commitment to providing peer-reviewed clinical evidence to support the safety and efficacy of our products, which we believe resonates well with both surgeons and patients.\n\nIn May, we announced our 21st peer-reviewed publication supporting our Lapiplasty technology. This recent article published in the Journal of Foot and ankle surgery reported on our positive interim one- and two-year results, including both radiographic and patient-reported outcome scores on 173 patients treated in our flagship ALIGN3D, multicenter prospective study. With our extensive and growing clinical dossier, combined with over six and a half years of clinical use and refinement and over 50,000 patients treated as of Q2, we continue to believe that we are setting a new standard of care for bunion surgery. As mentioned last quarter and consistent with our commitment to provide meaningful clinical evidence to support our innovations -- we continue to make steady progress with our mini 3D Lapiplasty multicenter prospective clinical study.\n\nAs a reminder, this study utilizes our mini-incision Lapiplasty system, which offers a much smaller 3.5-centimeter incision approach to realign the entire first metatarsal bone and address the root cause of the bunion versus just cutting and shifting the bony bump, which is the case with osteotome procedures. During Q2, we continue to treat additional patients and onboard new clinical sites for this study, and we look forward to providing future interim report-outs on the Mini 3D data set. Our Mini-Incision Lapiplasty approach continues to resonate with growing interest from both surgeons and patients. We continue to see steady adoption of our Mini-incision system with positive contributions to our average blended selling prices.\n\nInterest in attendance by new surgeons at our training events were strong during the second quarter, supporting our plans for additional national and local events with expectations for continued strong participation for the remainder of the year. In addition, our advanced training events held both online and in person, where our tenured surgeons can learn new skills and approaches such as our mini-incision and Adductoplasty procedures are on schedule with strong demand throughout the year. As noted, we've been making additional targeted investments this year to accelerate our market penetration by advancing patient awareness, surgeon education, and demand for our Lapiplasty and other related procedures, expanding the footprint and coverage of our bunion-focused direct sales channel and driving more R&D innovations into the marketplace. With our site aimed at driving long-term market penetration, we're very pleased to report increasing traction and early momentum from these initiatives.\n\nOur DTC patient awareness initiatives are a key component of our commercial strategy, designed to educate patients on bunion deformities and our differentiated solution, encourage these patients to seek more information and locate Lapiplasty surgeons in their market, and ultimately to schedule a surgical consultation. We employ social media, Google Search, public relations, and other media, including targeted TV campaigns with strong metrics and performance data that show active patient engagement further supported by feedback from regularly conducted surgeon surveys. We believe we have a highly effective DTC strategy in place. We also have strong conviction in our direct sales force strategy and continue to make focused investments to grow our highly specialized direct field sales team.\n\nOur channel analytics continue to show that, on average, relative to our independent agencies, our direct sales reps penetrate their markets faster, generate higher surgeon utilization levels, and sell at higher blended ASPs. These direct reps typically scale with cost leverage demonstrated within 24 months, primarily because they're 100% focused on Treace products and fully utilize our corporate resources and programs. As our direct sales force matures, we look forward to driving expense leverage over time. Turning to our product development strategy.\n\nWe have an R&D team committed to driving innovation to maintain our industry leadership with programs for both next-generation bunion correction systems, as well as the development of new ancillary products addressing common conditions and IP defense of our technology and innovations. At the end of Q2, we had 36 branded U.S. patents and over 40 U.S. patent applications pending.\n\nOn August 3, we announced the full nationwide commercial release of several new product innovations previewed at the ACFAS Scientific Conference last February. These include the Lapiplasty three-in-one guide, an instrument designed to advance the speed and reproducibility of the lapiplasty procedure. We've been receiving excellent feedback on this product, including a recent surgeon user survey that reported an average 15% reduction in time to perform a Lapiplasty procedure when using this new three-in-one guide. The Lapiplasty S4A Anatomic Plating System, this represents our third-generation Lapiplasty titanium plate fixation technology and provides an advanced anatomic design to address variabilities in the TMT joint anatomy.\n\nAnd the SpeedRelease and TriTome release instruments. These new sterile packaged specialized cutting instruments are designed to provide a more accurate and complete surgical release of key soft tissue anatomy, commonly involved in the Lapiplasty and Adductoplasty procedures. Proper soft tissue releases are important in achieving consistent corrections of the bones involved in both bunion and mid-foot deformities. We look forward to providing additional updates on our new product innovations as we continue to develop our pipeline centered on our core technologies and IP aimed at improving surgeon user experience, patient outcomes and supporting continuing market penetration.\n\nSpeaking briefly to reimbursement for our products. CMS has recently released its proposed 2023 Medicare payment rates for hospital outpatient and ASC services to cover facility costs for surgical procedures, which include supplies and implants used in the surgical case. As a reminder, our products are used in procedures covered by well-established existing CPT codes. And we're pleased to note that the reimbursement rates for these particular codes are slated for mid-single-digit increases in the year 2023.\n\nAssuming the proposed 2023 rates are affirmed, this will continue a multiyear trend of low to mid-single-digit increases in facility reimbursement rates for CPT codes associated with our procedures. In closing, I'm proud of the great execution delivered by our focus team here in Ponte Vedra, Florida, and throughout the country. Based on continued positive feedback we're receiving from the clinical community, we know that we are helping improve the lives of patients suffering from painful lifestyle limiting bunion and related mid-foot deformities. We are executing to plan supported by a strong balance sheet that we believe is adequate to take us into profitability and to fully fund our planned commercial market and product development initiatives.\n\nWe have technologies backed by strong clinical data sets and positive reimbursement trends that are advancing the standard of care in the surgical management of bunions, a commercial strategy of proven DTC and direct sales programs that are poised to scale, and a talented team of over 330 employees with a shared passion for our mission to improve the surgical outcomes of bunion patients. With that, I'll now turn the call over to Mark to review our financial performance. Mark?\n\nMark Hair -- Chief Financial Officer\n\nThank you, John. Good afternoon, everyone. Revenue in the second quarter was $30 million, up from $20.7 million a year ago, representing an increase of 45%, which was driven by increases in procedure volumes and higher blended average selling prices. In the second quarter of 2022, the number of active surgeons performing at least one case in the trailing 12 months increased 37% year over year to 2047, retained 20% penetration of the estimated 10,000 U.S.-based surgical podiatrists and orthopedic surgeons.\n\nSurgeon utilization increased on an average of 10.1 kits, up from an average of 9.8 kits a year ago. As our surgeon base continues to mature, we look forward to surging utilization gains with increasing use of our buy-in and related mid-foot correction systems, as well as our complementary ancillary products, driven by our growing direct sales channel, DTC initiatives, and pipeline of new product innovations. We sold 5,247 Lapiplasty procedure kits in the second quarter, a 39% increase versus the prior year's second quarter. The blended average selling price was $5,711, a nearly 5% increase over the second quarter in 2021, driven by the adoption of our Mini-Incision Lapiplasty and Adductoplasty System, as well as our complementary ancillary products.\n\nGross margin was 81.1% in the second quarter of 2022, compared to 80.9% in the second quarter of 2021, a 20-basis-point increase in gross margin was due to volume and operational efficiency. Total operating expenses were approximately $36.2 million in the second quarter of 2022, which includes sales and marketing expenses of $26.2 million, research and development expenses of $3 million, and general and administrative expenses of $7 million. This compares to total operating expenses of approximately $20.7 million in the second quarter of 2021, which includes sales and marketing expenses of $14 million, research and development expenses of $2.4 million, and general and administrative expenses of $4.3 million. This increase in operating expenses reflects strategic investments in our expanding direct sales channel and overall support for other commercial initiatives.\n\nAs noted earlier, to support our rapid growth, we are in the process of relocating to a larger facility that accommodates our increased capacity requirements for surgeon and sales force training, R&D development, prototyping, warehousing, and other infrastructure needs. Importantly, we continue with these investments to aggressively expand our direct sales force. Now with 123 quota-carrying and direct sales reps at the end of Q2, representing a 52% increase from the 81 direct sales reps we had at the end of 2021, including clinical specialist sales management and field support teams, our entire employee sales fleet in the field increased 40% to 202 sales employees in the second quarter compared to 144 at the end of last year. As John mentioned, we're pleased with the increasing productivity of our direct sales force.\n\nAnd when combined with our seasonally strong fourth quarter, we look forward to driving increasing leverage in the middle of our P&L as we scale up operations over time. The second quarter net loss was $17.2 million or $0.31 per share compared to a net loss of approximately $5.1 million or $0.10 per share for the same period of 2021. Adjusted net loss, which is a net loss attributable to common shareholders, excluding the debt extinguishment loss of $4.5 million reported in the second quarter or $0.08 per share was $12.8 million or $0.23 per share. Cash and cash equivalents were $101.5 million as of June 30, 2022.\n\nIn the second quarter, we announced a new 5-year $150 million loan arrangement that favorably reduced our cost of capital, strengthen our balance sheet, and enhance our financial flexibility. We grew $54 million under the new loan arrangement in part to pay off $30 million of debt outstanding under our previous credit facility. We believe we have sufficient liquidity to fund us into profitability and to fully fund our planned commercial market and product development initiatives. Let me turn to our outlook for the full year of 2022.\n\nAs John mentioned, we remain encouraged by the underlying strength and momentum in our business and are raising our 2022 revenue guidance to $130 million to $134 million, which reflects an increase of 38% to 42% over 2021 revenue. This compares to our prior revenue guidance of $128 million to $133 million. As a reminder, we expect typical seasonal softness in orthopedic elective surgeries during the third quarter and continue to monitor for and execute against procedural headwinds. We expect Q3 revenue to be consistent with revenue reported in Q2, representing strong year-over-year growth.\n\nBefore concluding, I'd like to take a moment to invite you to our surgeon advisor event, which will include presentations from leading Lapiplasty and Adductoplasty surgeons on September 20th at the Nasdaq MarketSite in New York City. Details on the event can be found on the Investor Relations section of our website. With that, let me turn the call over to the operator to open the line for your questions.\n\nOperator\n\nYes, thank you. At this time, we'll conduct the question-and-answer session. [Operator instructions] Please stand by a moment while we compile the Q&A roster. Our first call is coming from the line of Robbie Marcus with J.P.\n\nMorgan. Go ahead. Your line is open.\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nGreat. Thanks for taking the question, and congrats on a nice quarter. Maybe to start, you had a really nice uptick sequentially in the revenue per procedure. Kits were kind of flattish quarter to quarter.\n\nI imagine your reps are probably starting to push. Some of the other procedures within the foot add-on to bunion surgery. How should we think about how the rep time is being spent, how they're getting compensated on adding more to the procedure? You're clearly doing a great job adding on as the revenue is moving up. And how should we think about those two metrics going forward over the balance of the year in the new guidance range?\n\nMark Hair -- Chief Financial Officer\n\nYeah. Thanks, Robbie. Maybe I'll start a little bit on that. You know, first of all, the way we view a lot of the revenue growth is year-over-year sequential and we're really pleased with that growth, 45% over Q2 of last year.\n\nOur sales reps are commission based. And so, it's -- they're commission based on the full blended ASP that's occurred in each of these cases. And so, that's another reason why we report that metric. So, they're encouraged to sell the Lapiplasty kit, as well as all of our ancillary products.\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nAnd how should we think about the cadence over the balance of the year of price versus volume and, you know, what's assumed in the new guidance range?\n\nMark Hair -- Chief Financial Officer\n\nAgain, you know, with what we're talking about as far as the guidance in Q3 being consistent with what we had in Q2, that gives us a really large and year-over-year growth trend that we're very pleased with. Again, we do a lot of things during the course of the year as we prepare for a seasonally larger fourth quarter. And so, we continue to do all the medical education activities and onboarding new active surgeons, which are -- we're really pleased with that. So, we're poised really to benefit from all these investing activities that have been taking place in the first half of this year to the benefit from the back half of this year.\n\nJohn Treace -- Chief Executive Officer\n\nYeah. Mark's right. And Robbie, I will add a little color to that. We've got a very deliberate strategy to keep refining our Lapiplasty system and offering next-generation implants that typically command a higher ASP as we're doing now rolling out our S4A plating system.\n\nWe're also going to continue to keep commercializing additional bunion-focused ancillary products that will continue to contribute to that blended ASP like the SpeedRelease and the TriTome that we just spoke about. So, I think while there could be some quarter-to-quarter mix-related variability in the reported blended ASPs, we generally expect an upward trend in blended ASP to continue over time.\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nGreat. Maybe as a follow-up, you know, you continue to add a good amount of surgeons -- how should we think about where you stand, whether it's top quartile users or so versus, I think you said the average was 10.1% in the quarter, that maybe that was the trailing 12 month. How do we think about where some of your highest users are as we think about where the overall base may migrate to over time? Thanks.\n\nMark Hair -- Chief Financial Officer\n\nYeah. Thanks, Robbie. You know, we do report that on an annual basis, the productivity of all of our surgeons based on the cohort when they started using Lapiplasty. Those that have been Lapiplasty, more than four years are doing more than 20 cases annually.\n\nAnd so, we think it's really a large percentage of their practice. They are utilizing Lapiplasty. So, we know that it grows over time, and that's what, again, gives us confidence as we're adding these additional surgeons, that it's that investment that's going to pay dividends over the years.\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nGreat. Thanks for taking the questions. \n\nMark Hair -- Chief Financial Officer\n\nThanks, Robbie. \n\nJohn Treace -- Chief Executive Officer\n\nThanks, Robbie.\n\nOperator\n\nThank you. Our next question comes from the line of Andrew Ranieri with Morgan Stanley. Go ahead.\n\nAndrew Ranieri -- Morgan Stanley -- Analyst\n\nHey, thanks for taking the questions, John and Mark. Maybe just a follow-up to Robbie's question earlier. But just when you're thinking about utilization and active surgeons increasing, can you maybe go into a little bit more detail on kind of what gets you from point A to point B in terms of driving that utilization higher? Is it really all about the direct sales force? Is it about the ongoing training and education? And John, I think you mentioned that the advanced training for tenured surgeons continues to see strong demand, as well as the initial demand. So, can you maybe walk us through kind of that dynamic of what uptake you do see after a surgeon does an initial course and then maybe what a tenured surgeon does in there following kind of an advanced course?\n\nJohn Treace -- Chief Executive Officer\n\nDrew, great question. You know, I don't know that we measured specific doctor activity following these events. But as a whole, our average user their first year, whether they came in January 1 or December 31 does around four cases a year. By the second year, they're doing around seven, as I recall.\n\nI could have these numbers off by eight, as Mark's saying. And then by year four, they're up to 20 or so. So, that's kind of the culmination of a number of things. And our entire commercial ecosystem is designed to try and accelerate that utilization curve from year one to over 20 cases quicker.\n\nSo, direct sales reps who call on them more, fully utilize our resources, our product innovations, and certainly, the DTC patient awareness that informs more patients to look for them on our locator and go to their office and ask for a consultation, all these kind of build on each other. And then the advanced course is really what they do, they're in a room with a lot of very experienced Lapiplasty users and maybe they're earlier on their utilization curve and just using Lapiplasty for a third of their cases, but now they're in a room of faculty and surgeons that do 50%, 80%, 100% of their bunions with Lapiplasty, and they're learning the advanced technique tips and tricks and preoperative assessment and postoperative management and they're learning about the Adductoplasty procedure and how to do that along with Lapiplasty. So, that sort of helps build utilization further, we believe, making them feel more comfortable and skilled at performing Lapiplasty on a broader range of their patients, and it helps drive that blended ASP, it trains them to incorporate Adductoplasty and some of these other tools into their practice.\n\nAndrew Ranieri -- Morgan Stanley -- Analyst\n\nGot it. Thank you. And maybe more for Mark for this question. But with the guidance keeping third quarter sequentially flat.\n\nJust, I mean, looking at the past few years, at least as a public company, it's been at least kind of mid-single digit at least last year. So, can you talk a little bit more about the flat expectation quarter over quarter? You mentioned seasonal softness in orthopedics, but just curious if you're actually seeing those trends today. Or is it more conservatism? Any issues with staffing shortages?\n\nMark Hair -- Chief Financial Officer\n\nYes. Great question, Drew. You know, we've talked about it in the past that we see the same things that other companies see with respect to some of the staffing shortages and those kinds of things. We really try to focus on what we can control, do those things that we do best growing our sales channels, our DTC programs, and patient education and all those kinds of things.\n\nAnd so, I think we're just looking at the overall macro considerations with what's happening right now, some of the staffing shortages, -- and we also recognize that it's seasonally slower for elective surgeries in orthopedics in Q3. So, when you look at what consistent with Q2 revenue would be, it's still a pretty substantial growth rate year over year. And that's where we're really driving the business is not really on a sequential quarter-to-quarter basis but looking at that growth trend year over year. So, I think it's pretty favorable if you look at it that way.\n\nAndrew Ranieri -- Morgan Stanley -- Analyst\n\nGot it. Thank you. And just one last one for Mark again. But opex came in a bit higher than we expected, and I completely understand the investment that you're making in the direct sales force.\n\nBut how should we kind of think about that about the spend into the back half of the year? Thank you.\n\nMark Hair -- Chief Financial Officer\n\nThank you. Yeah. Thanks for that. That's an important one.\n\nThat's another reason why we spent a fair amount of time on this call talking about some of these investments that we've been making in the direct sales channel. We've been able to make some headway in hiring people, getting the right people, and transitioning some of our independent sales agents into, you know, to fully employed sales reps and all that that it covers. And so, we're really pleased with all that growth, and all that growth comes with some additional expenses and investment into that sales channel. We also had some increase in the DTC investments that we made in the quarter versus Q1.\n\nAnd so, I don't think it's going to be that much different in the back half of the year from what we just saw in Q1 -- or Q2 rather with respect to those investments. But that's why we wanted to make sure that everyone knew how pleased we are with the build that we've made so far very successfully really ahead of schedule and plan. So, we're pleased with all those investments.\n\nJohn Treace -- Chief Executive Officer\n\nThank you, Drew.\n\nAndrew Ranieri -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nOur next call comes from the line of Ryan Zimmerman with BTIG.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nThanks for taking my questions. And, hey, thank you. Happy to be on the call. Maybe just a follow-up on -- thank you, John.\n\nJust a follow-up on some of the other questions on Rob and Andrew. John, you talked about kind of the reimbursement for bunion surgery going up in the mid-single digits. And it's around the pricing topic. And I'm just curious if you can kind of speak to it because if I think about the pricing relative to the growth in reimbursement, I do expect average ASPs to continue to go up.\n\nBut how do we think about that upper bound of pricing potential in your mind, John? I mean, how much can -- how much can it take relative to kind of where reimbursement goes? And do you think about that in that context as a percentage of the total reimbursement as you think about kind of layering on new products?\n\nJohn Treace -- Chief Executive Officer\n\nYeah, Ryan, it's John. Great question. And reimbursement is something that we pay particularly close attention to and work every year to petition and communicate with CMS, our physicians. But obviously, we've had multiple years of positive reimbursement trends in the key bunion codes that are involved in Lapiplasty and other codes that are other procedures performed within a typical bunion case.\n\nAnd a typical bunion case can involve, you know, five or six different CPT codes, some even more. So, our blended ASP of $5,700, that's not just the bunion CPT code, that's involving other CPT codes, and we may have some lower-cost ancillary products that are used in that procedure. So, overall, we do keep an eye on those ratios, and we're cognizant of those ceilings that could eventually occur. But for now, we feel like we're in a pretty good situation given our portfolio of ancillary products, the CPT codes that are involved in those, which have their own separate reimbursement tied to them, as well as our core bunion code, and the cost of our true Lapiplasty core system.\n\nSo, the Lapiplasty system is not the $5,700. It's a fraction of that, and then the other is ancillary products.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nYeah. No, fair point, John. I appreciate the color there. And then, you know, as you layer on some of the ancillary products, Mark, I mean, your gross margins are very strong already, but how do we think about kind of the gross margin impact of those ancillary products? And is there a potential to kind of move the dial a little bit higher on gross margins with the contribution from these newer products?\n\nMark Hair -- Chief Financial Officer\n\nThat's a great question, Ryan. I think there are a lot of things happening all at the same time, right, with inflationary pressures and everything else, supply chain issues, and constraints. And fortunately, we've been able to manage that extremely well. So, we're really focused on maintaining our gross margin in the area where it's at right now.\n\nIf there are opportunities where we're definitely looking for them. Just -- it's going to be unclear -- if it's going to offset some of the other pressures or if there will be an improvement from here. But we're really pleased with where we are at and we're always looking for opportunities to increase.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nAll right. I'll hop back in queue. Thanks for taking my questions, and congrats on the quarter.\n\nMark Hair -- Chief Financial Officer\n\nThank you, Ryan.\n\nOperator\n\nI would now like to turn the call back to Vivian for closing remarks.\n\nVivian Cervantes -- Investor Relations\n\nThank you, Kathy. On behalf of Treace Medical, thank you, everyone, for joining us today. This concludes our call, and we look forward to seeing you at our Surgeon Advisor event at Nasdaq MarketSite in New York City on September 20th and also to provide you with our next update following the close of our third quarter 2022. Thanks, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nVivian Cervantes -- Investor Relations\n\nJohn Treace -- Chief Executive Officer\n\nMark Hair -- Chief Financial Officer\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nAndrew Ranieri -- Morgan Stanley -- Analyst\n\nRyan Zimmerman -- BTIG -- Analyst\n\nMore TMCI analysis\n\nAll earnings call transcripts"
}