{
  "companyName": "Cango Inc",
  "companyTicker": "CANG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/cango-inc-cang-q2-2022-earnings-call-transcript/",
  "content": "Cango Inc (CANG 2.19%)\nQ2 2022 Earnings Call\nAug 29, 2022, 9:00 p.m. ET\n\nOperator\n\nGood morning, and good evening, everyone. Welcome to Cango Inc.'s second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. This call is also being broadcast live on the company's IR website.\n\nJoining us today are Mr. Jiayuan Lin, chief executive officer; and Mr. Michael Zhang, chief financial officer of the company. Following management's prepared remarks, we will conduct the Q&A session.\n\nBefore we begin, I refer you to the safe harbor statement in the company's earnings release, which also applies to the conference call today, as management will make forward-looking statements. With that said, I am now turning the call over to Mr. Jiayuan Lin, CEO of Cango. Please go ahead, sir.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nHello, everyone, and welcome to Cango's second quarter 2022 earnings call.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nDuring the second quarter, especially in May and April, lockdowns in Shanghai and other cities exacerbated supply chain challenges. Despite a series of favorable policies since June, demand in the automotive market has remained sluggish due to COVID's substantial impact on automotive manufacturing, logistics, and retail sales, as well as heightened risk aversion and weakened consumer confidence amid the pandemic.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nFacing these headwinds, we achieved total revenues of RMB 289 million in the second quarter, of which revenues from our car trading transaction business accounted for RMB 219 million or over 75.6% of our total revenues. Revenues from our traditional business lines, including automotive financing facilitation and aftermarket services facilitation totaled RMB 25.14 million. In terms of revenue mix, our business model of car trading transaction platform with multiple monetization avenues is becoming more and more robust.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nNext, I would like to share the progress of both our trading platform business and traditional business lines in the second quarter.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nI'll begin with the car trading transaction platform business. As a one-stop platform serving car dealers nationwide, Cango is committed to providing safe, secure, sustained, and consistent end-to-end professional car trading transaction services for participants in both the upstream and downstream of the industry value chain. While current favorable government policies, including vehicle purchase tax relief and NEV promotion campaigns in rural areas, focus primarily on car purchases, supporting services also need to be improved, so as to truly make car sales easier for dealers and car purchases simpler and more enjoyable for consumers, especially in the lower-tier markets. Based on transaction scenarios, Cango addresses the unmet needs of medium and small-sized dealers by offering an array of services, spanning car sourcing, car supply, including self-owned cars, warehousing and logistics, and car financing insurance.\n\nIn this way, we have not only relieved the stresses of medium and small-sized dealers in the lower-tier markets in sourcing cars, customers, and funds, helping them sell costs faster, but also provide ongoing opportunities for upstream OEMs to expand their market coverage to lower-tier markets. By empowering both the upstream and downstream side of the industry, Cango Haoche enables more efficient and effective car transactions in the lower-tier markets.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nAs of June 30, 2022, Cango Haoche has engaged 8,237 dealers in 31 provinces and 305 cities. There are 22 self-owned vehicle models listed on our platform, including nine car brands and 12 car series. During the second quarter, we sold a total of 2,291 cars, including 1,329 NEVs.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nIt is worth noting that following the debut of Cango Haoche, which had many programs at the end of last May, we launched the Cango Haoche app in mid-June to provide more powerful platform support to dealers with highly aggregated features and functions. By the end of June, only two weeks after the launch, over 1,000 dealers had migrated to or have newly registered on the app, covering all 30 provinces and municipalities nationwide, excluding Tibet, Hong Kong, Mekong, and Taiwan.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nOn top of high-quality car sources, we focus on building user stickiness by standardizing services, as well as further strengthening our supply chain servicing and digital capabilities. As a result, car dealer activity and conversion rates on the platform both improved significantly in the second quarter. Users' daily activity rate rose by nearly 50% quarter over quarter in the second quarter and dealer activity rate increased by nearly 70% from the previous quarter.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nIn the first half of 2022, more than 10,000 car sources and cars search entries were listed on our platform. In the second quarter, the average conversion rate from our merchant service reached 2% and rose month by month in the quarter to 4.6% in June compared with the industry average of around 2.5%. Our current conversion rate is significantly higher than the industry average.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nSince beginning of the year, while under great pressure, we also saw positive development in the industry. With the development of China's automotive market in recent years, new car ownership has increased significantly and consistently, gradually creating the deep need for car replacement, which has led to the continuous expansion of the used car market. However, China's used car market is still in the beginning stage, particularly in those lower-tier markets where Cango has a deep presence. Given this wide gap with the mature markets in Europe and America, China's used car market has tremendous growth potential.\n\nAt the same time, used car [Technical difficulty] an important role in boosting new car sales, encouraging dealers' digital transformation upgrade, and expanding our business scope. Furthermore, the recent release of favorable policies [Technical difficulty] opportunities for used cars and promote a comprehensive and healthy development of both the new and used car markets. Notably, the removal of used car cross-city transfer restrictions will increase used car supply, accelerate used car replacement and advance development of the car trading system. In time, we expect a unified national market for used cars.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nIn view of the above-mentioned market development at the end of April this year, building on our successes in new car transaction facilitation, we expanded our used car management services. Good progress has been made so far. We position Cango's used car business as a smart and reliable service provider. Current facilitation methods for used car transactions such as communication by WeChat bots are riddled with problems.\n\nCar searching messages can be easily buried in the swaths of information and spontaneous communication is not always efficient. In contrast, Cango has a dedicated team to follow up on transactions, both online and offline, effectively breaking down the information barrier. We also provide price quotes across different regions to accurately match supply against demand, enhancing the efficiency of sales leads acquisition and vehicle delivery. As of June 30, 2022, over 1,500 used car dealers have registered on our platform with increasing engagement.\n\nWe will continue to explore further upward and downward along the industrial supply chain to attract more dealers to our platform, create a national delivery network, and develop standardized services.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nGoing forward, we will continue to focus on both new and used car trading as we improve our platform service capabilities and dealer stickiness. Specifically, we will set our own standardization of our supply chain services, leveraging technology and big data analytics to provide innovative and customized services to dealers on the platform so as to improve their stickiness. Healthy growth in the number of registered dealers on the platform and increasing activity will drive up the conversion rate with the continuous enhancement of our online services capabilities and supply chain service system, as well as increasing synergies from our efficient integrated online-offline operations. Our overall logistics abilities will improve as well and eventually realizing a continuous and self-propelling transaction cycle.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nMoving on to our traditional business lines. Based on the reading of the overall macroeconomic trends, we continue to transition our traditional business lines, optimizing the business model and exploring synergies with our car trading business to develop platform supply chain capabilities. Eventually, Cango will transform to an integrated platform model with [Technical difficulty] and monetizing through multiple channels, including finance and insurance services. In the aftermarket services sector [Technical difficulty] focused on offering supporting services for car transactions.\n\nThe insurance service interface, which is ready to be launched in the Cango Haoche app in the third quarter, offering an efficient way for dealers to obtain high-quality insurance services will further unlock the potential of our car trading platform. Apart from that, we will also develop customized products and services for corporate clients and continue our in-depth collaboration with NEV brands to build an aftermarket service ecosystem.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nWith respect to our automotive financing facilitation business, M1+ and M3+ overdue ratios increased quarter over quarter as we proactively scaled back our financing facilitation business, leading to a decline in our outstanding loan balance. As the denominator becomes smaller, the overdue ratios raise. Though we expect the overdue ratios to climb further for some time to come, it is important to note that the new delinquencies have already reached an inflection point. With further strengthening of loan servicing such as collection, we are confident we can keep the overall overdue scale in a relatively safe range.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nWe have strong expertise in financing facilitation and risk control, giving us a first-mover advantage as we pursue our new model. We have not given up financing facilitation business, but [Technical difficulty] by our new strategy of creating a database transaction platform with multiple monetization avenues, including financing and insurance services. We choose to offer high-quality financial services selectively, which will grow to be a key part of our platform's supply chain capabilities and monetization channels.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nWe've noted that policy stimuli such as vehicle purchase tax relief aimed at boosting automotive consumption did not lead immediately to a major rebound in the automotive market. Furthermore, uncertainties stemming from supply chain challenges, chip shortages, COVID resurgences, and a complex external environment continue to weigh on the market and the automotive industry value chain. Therefore, we remain prudent and cautious, and we'll continue to strengthen risk controls across the board.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nDespite these uncertainties, we remain positive about China's NEV and used car markets. China has become the world's largest NEV market with NEV penetration rate exceeding 20% in the first half of 2022. Having undergone significant growth in production and sales, NEVs are undoubtedly a new growth driver for the high-quality development of China's automotive industry. For Cango, NEVs have always been a key component of our business development.\n\nWe are well-positioned to capitalize on the market's fast potential. On Cango Haoche, NEV penetration rate is already above 50% far above the national average. As for used cars, favorable policies are already being implemented. Since August 1, 2022, with the removal of restrictions on used car cross-city transfer, other than Beijing, used cars can be traded nationwide.\n\nAs NEVs and used cars enter a new development stage of fast and large-scale growth and benefit from policy initiatives designed to stimulate market activities, we will make ongoing investments in these two areas to elevate our platform capabilities and realize our goal of building a tech-enabled car trading platform, where we place equal emphasis on new and used car trading and monetizing our finance and insurance services through multiple channels.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nNext, I will turn the call over to our chief financial officer, Michael Zhang, for a review of the company's financial performance.\n\nMichael Zhang -- Chief Financial Officer\n\nThanks, Jiayuan. Hello, everyone, and welcome to our second quarter 2022 earnings call.Before I started to review our financials, please note that unless otherwise stated, all numbers are in RMB terms and all percentage comparisons on a year-over-year basis. During the quarter, macro headwinds and a wave of COVID resurgence across China posed ongoing challenges to the domestic auto industry. Months of pandemic-related disruptions significantly impede our business, resulting in total revenue of RMB 289.2 million in the second quarter.\n\nOur car trading transaction division, which delivered revenues of RMB 218.6 million still plays an essential role in our transformation to our platform model. Now let's move on to our cost and expenses during the quarter. Total operating costs and expenses in the second quarter of 2022 were RMB 643.3 million compared with RMB 933.5 million in the same period 2021. Cost of revenue in the second quarter of 2022 decreased to RMB 272.7 million from RMB 697.8 million in the same period 2021.\n\nAs a percentage of total revenues, cost of revenue in the second quarter of 2022 was 94.3% compared with 73.7% in the same period 2021. The change was primarily due to an increase in car trading transaction share of total revenues. Car trading transactions normally represent a higher cost revenue ratio, thus pushing up the overall ratio. Sales and marketing expenses in the second quarter of 2022 were RMB 41.8 million compared with RMB 60.9 million in the same period of 2021.\n\nAs a percentage of total revenues, sales and marketing expenses in the second quarter 2022 was 14.5% compared with 6.4% in the same period 2021. General and administrative expenses in the second quarter of 2022 were RMB 124.7 million compared with RMB 64.7 million in the same period 2021. As a percentage of total revenues, general and administrative expenses in the second quarter of 2022 was 43.1% compared with 6.8% in the same period 2021. This change was mainly due to the expenses arising from 12 million Class A ordinary shares options granted to the company's chairman, Mr.\n\nXiaojun Zhang; and CEO, Mr. Jiayuan Lin in the second quarter. These share options are granted in consideration of Mr. Zhang and Mr.\n\nLin's role in guiding Cango's profitable investment in the auto, a provider of new energy passenger vehicles in China. Research and development expenses in the second quarter of 2022 were RMB 12.9 million compared with RMB 15.6 million in the same period 2021. As a percentage of total revenue, research and development expenses in the second quarter of 2022 was 4.4% compared with 1.7% in the same period 2021. Net loss on risk assurance liabilities in the second quarter 2022 was RMB 53.1 million compared with RMB 35.9 million in the same period of 2021.\n\nNet loss on risk assurance liability was mainly due to a sequential increase in the default rate since 2021. We recorded a loss from operations of RMB 354.1 million in the second quarter of 2022 compared with an income of RMB 13.2 million in the same period 2021. Net loss in the second quarter of 2022 was RMB 285.8 million. Non-GAAP adjusted net loss in the second quarter of 2022 was RMB 189.6 million.\n\nOn a per share basis, diluted net loss per ADS in the second quarter of 2022 was RMB 2.08, and diluted non-GAAP adjusted net loss per ADS in the same period was RMB 1.38. Moving on to our balance sheet. As of June 30, 202, we had cash and cash equivalents of RMB 1.3 billion compared with RMB 2.1 billion as of March 31, 2022. As of June 30, 2022, the company had a short-term investment of RMB 2.1 billion compared with RMB 1.9 billion as of March 31, 2022.\n\nLooking ahead to the third quarter of 2022, we are now predicting our total revenues to be between RMB 350 million and RMB 400 million. Please note that this forecast reflects our current and preliminary view of market and operational conditions, which are subject to change. This concludes our prepared remarks. Operator, we are now ready to take questions.\n\nOperator\n\nThank you, sir. We will now begin the question-and-answer session to ask the question. [Operator instructions] At this time, we'll just pause momentarily to assemble our roster. And the first question we have will come from Shelley Wang of Morgan Stanley.\n\nShelley Wang -- Morgan Stanley -- Analyst\n\n[Foreign language] Good morning. I'm Shelley from Morgan Stanley. I have three questions. The first question is could you give us more information on the independent app that you mentioned earlier? For example, the position of the app and target customer base, as well as what kind of services do you offer on this app? And second question is about car trading transaction business.\n\nCould you tell us more about the take rate? Has there been any improvement in the take rate? And the third question is also about car trading transaction -- car trading transaction business. So, what size do you expect the car trading transaction business to reach?\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThank you, Shelley. I will take your three questions. Well, the first question first. The Cango Haoche app is the foundation of the company's efforts to build a car transaction service platform and represents a comprehensive upgrade of our original WeChat Mini Program.\n\nThe app is a one-stop B2B transaction service platform for dealers across the country, providing a swift, secure, sustained, and consistent supply chain services with car sourcing, financial, insurance services, and other noncar sourcing, supply chain, sales management, and sales optimization tools. In addition, it offers a complete set of management tools for the upstream and downstream of the automotive industry trend and comprehensively empowering dealers and enabling those who partner with Cango to enhance their competitive advantages. Since the launch of the app just two weeks ago, more than 1,000 car dealers -- I mean, registered car dealers have migrated to, or have been registered on the app, covering 30 provinces and cities nationwide, excluding Tibet, Hong Kong, Mekong, and Taiwan.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nAs a result of our consistent efforts, we have seen continuous improvement in car dealer activity and conversion rates on the platform. Conversion rates from our management services have reached 4.5% in June, well above the industry average of 2.5%.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nGoing forward, in addition to ensuring high-quality car supply, we will further increase user engagement and stickiness, focus on standardizing our services and strengthen our supply chain service and digital capabilities.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nAs for your second question on take rate, well, so far, our car trading transaction business has maintained a gross margin of about 1% as our business model features centralized procurements of vehicles from OEMs before selling to small and medium-sized dealers without any control over the production process, our gross margin is relatively low. Our industry peers have also [Technical difficulty] around 1%. So, we believe this level of gross margin will continue for some time.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nAt the same time, to encourage more dealers to join our platform, we offer sufficient profitability for the dealers to ensure their activity and stickiness. With economies of scale, our bargaining power with both upstream OEMs and downstream dealers will improve. And when that happens, our gross margin will grow accordingly.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nSo, the car trading transaction business is our growth driver, but we will also increase our profit in the margin business, as well as revenues from ancillary financial services such as insurance services for self-owned cars.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nAs for your third question, the size, the expected size of our car trading transaction business. While China is the world's largest auto consumption market with new car sales totaling 20 million units a year plus a used car market of similar size. So, take lower-tier cities, Cango's traditional stronghold as an example. In this market segment, new car sales exceed 8 million units a year, equivalent to the new car sales of Germany, Britain, France, and Russia combined.\n\nOur goal is to capture a considerable market share in the lower-tier markets.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nHere's our development plan. Well, in the initial stages, without expanding our team on a large scale, we will hone our business model in small incremental steps while gradually improving car supply and product services and establishing and validating a profitable and replicable business model and supporting technology-based platform. And thereafter, we can roll out the model rapidly on a national scale. Therefore, looking forward, over the next five years, business scale will remain -- will be relatively steady in the first two years with fast expansion in later years.\n\nWe will fine-tune and adjust our business plan based on the progress of our business development. Thank you.\n\nOperator\n\nAnd next, we have Sophia Xu of Goldman Sachs.\n\nSophia Xu -- Goldman Sachs -- Analyst\n\n[Foreign language]\n\nUnknown speaker\n\nThank you. Sophia from Goldman Sachs. I have three questions. So, the first question is, could you give us more color on the company's plan for the used car business? And also, could you describe to us the competition dynamics in this market segment? And the second question is, could you give us more details on your cost control measures? And the third question is about your collaboration with NEV OEMs.\n\nI mean, how are -- could you tell us more about, you know, what kind of collaboration do you have?\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nOK. I will take your first question on used car market. Well, with the increase -- with increasing new car ownership, we see more demand for car replacement, and this is becoming more and more evident. And this demand actually will lead to the continuous expansion of the used car [Technical difficulty] the recent release of favorable policies will accelerate the development of the used car market as well.\n\nSo, we are optimistic about the future of used car market, especially in terms of NEVs. We see great potential, particularly in the lower-tier markets.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nHowever, a huge market potential and strong development prospects always attract a lot of players into the used car market. So, the market has always seen a fair, fierce competition.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nAnd during the lockdowns, we started to try the used car matching service on our platform, and we have seen a good progress so far. Well, [Technical difficulty] car services, we provide the combined functions and features for our users. And actually, we borrow our expertise from our new car service platforms, such as logistics service. But of course, all these services are provided in view of the special characteristics of used cars.\n\nSo, we are now trying to expand our business in the used car market, both along the upside -- the upstream and the downstream of the [Technical difficulty] and we are expanding our business in a targeted way. And right now, we are building a dedicated used car trading platform. And we -- well, with our efforts, successfully built a national delivery network offering uniform and standardized services. Well, based on the results so far, we believe the used car platform actually will be more active than the new car platform.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThe second question is on cost control measures. Well, to achieve our [Technical difficulty] goal of building a car trading transaction platform, we have taken [Technical difficulty] downsize our staff and restructure our organization and reintegrate the company's human resources so as to maximize our [Technical difficulty] to focus on the goal of building an automotive trading service platform.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nAt the same time, we have increased our investment in IT systems so as to automate and standardize our operations and reduce human resource costs and, as well as operating costs.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nAt the same time, we have also taken steps to plan our fund uses, and we have also paid back some loans, so as to reduce our level of borrowing.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThe third question on our collaboration with NEV OEMs. Well, right now, our collaborations with NEV OEMs cover both new cars and used car markets. So, in the new car segment, we cover new car purchases, corporate retail finance collaborations, as well as insurance services for new cars. And for used cars, we are exploring the possibility of mass procurement of used costs directly from OEMs.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nChina has become the world's largest NEV market. In the first half of this year, NEV penetration rate exceeded 20%. Given the significant growth in both production and sales volumes, NEVs undoubtedly represent a new growth driver for the high-quality development of the China's auto industry. For Cango, NEV have always been an important focus for business development.\n\nAnd so far, our NEV OEM brand partners include [Inaudible] SkyWorth, Dunsen, Iolo, Fanusha, Maple, Polestar, Geometry, Rowe and Xiaopeng among others. On the Cango Haoche platform, NEVs have a penetration rate of over 50% far above the national average.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nWe are currently negotiating strategic partnerships with more NEV brands, which we will disclose in due course.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThank you.\n\nOperator\n\n[Operator instructions] Again, we will just pause momentarily to assemble our roster. Well, it appears that we have -- I actually do apologize, everyone. I do have an additional question and it comes from Brian Leinter of Sachs.\n\nUnknown speaker\n\nGood evening, everyone. Thank you for taking my question. I feel like maybe Sophia got a copy of my notes because she asked pretty much everything I was going to ask. But the one thing I was just wondering if maybe you could clear up for me would be the increase in noncurrent liabilities on balance sheet.\n\nAnd then everything else, I think -- and then I guess, if I'm correct in assuming that you have roughly $70 million open still on the stock repurchase agreement. Those are the two things I just want to clarify. Thank you.\n\n[Foreign language]\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nSo, for these technical questions, I will turn to our CFO, Michael Zhang.\n\nMichael Zhang -- Chief Financial Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThank you, Brian, for your questions. I will take your two questions. First of all, about the increase in noncurrent reliabilities, it is because we recognize the long-term tax item on our balance sheet under the heading of noncurrent assets. And we said the tax item will be realized in two to three years' time.\n\nSo that's my response to your first question. The second question, as for the balance of about $71 million was of share repurchase authorization as of June the 30th. Well, based on our previous -- based on last BoD meetings authorization, these authorizations actually were terminated by August 26. And so actually, last year -- last August, authorization terminates, will terminate -- I mean, will have terminated by August this year.\n\nSo, for this authorization, starting from this August, the size of the repurchase program for the first half of 2022 will be about $50 million.\n\nGreat. Thank you.\n\nOperator\n\nWell, we have no further questions at this time. I will now hand the conference back over to management for any closing remarks.\n\nJiayuan Lin -- Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThank you for joining us, and this closes this earnings call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJiayuan Lin -- Chief Executive Officer\n\nUnknown speaker\n\nMichael Zhang -- Chief Financial Officer\n\nShelley Wang -- Morgan Stanley -- Analyst\n\nSophia Xu -- Goldman Sachs -- Analyst\n\nMore CANG analysis\n\nAll earnings call transcripts"
}