{
  "companyName": "Sophia Genetics SA",
  "companyTicker": "SOPH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/sophia-genetics-sa-soph-q2-2022-earnings-call-tran/",
  "content": "Sophia Genetics SA (SOPH -8.44%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to the SOPHiA GENETICS second fiscal quarter 2022 earnings conference call. [Operator instructions]. After today's presentation, there will be an opportunity to ask questions. [Operator instructions].\n\nPlease note, this event is being recorded. I would now like to turn the conference over to Jennifer Pottage, head of investor relations. Please go ahead.\n\nJennifer Pottage -- Head of Investor Relations\n\nWelcome to SOPHiA GENETICS' second fiscal 2022 earnings conference call. My name is Jennifer Pottage, and I'm the head of investor relations at SOPHiA GENETICS. Joining me today are Dr. Jurgi Camblong, our co-founder and chief executive officer; and Ross Muken, our chief financial officer.\n\nBefore we get started, I would like to remind you that management will make statements during this call that are forward looking within the scope of U.S. federal securities laws. These statements are based on management's current views and assumptions which are subject to material risks and uncertainties that could cause actual results or events to differ materially from those projected. Additional information regarding these risks and uncertainties are included in the section entitled cautionary statement regarding forward-looking statements and Exhibit 99.2 of the report on Form 6-K filed today with the SEC.\n\nExcept as required by law, SOPHiA GENETICS disclaims any intention or obligation to update or revise any forward-looking statements whether because of new information, future events, or otherwise. This conference call contains time-sensitive information and is accurate only as of its broadcast, August 9, 2022. Please note, the replay of this call as well as the earnings release and associated slides will be available on our website in the Investors section. And now I'll turn the call over to Jurgi.\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nThank you, Jen, and hello, everyone. I'm pleased to be here with you today to share the progress of yet another solid SOPHiA quarter with healthy demand across our core platform offerings and key geographies as well as steady momentum in our major initiatives underlying our strategic pillars. Despite the challenging macroeconomic environment, our success as a company continues to be driven by the forward-thinking healthcare institutions and life science leaders that are consistently choosing SOPHiA as their trusted cloud-native analytics platform. But before diving in, I would like to take this moment to thank all the dedicated SOPHiAns whose efforts fuel our success each and every day.\n\nI'm proud to lead this talented team in our ambitious journey to democratize data-driven medicine and build a global network of collective intelligence for healthcare.  On today's call, the narrative for the second quarter will revolve around an overarching team, sustainability. Our core focus today will be on sustainability and highlighting some of the investments and actions we have already made that will keep SOPHiA on its path of consistent and attractive long-term growth, as well as placing us on a clear path toward profitability and cash flow generation. We have been primarily focused on building our core capabilities and infrastructure to drive outside growth momentum and realize our sizable possible addressable market. Now that we believe we have created a solid foundation to build upon, our plan is to transition into a more sustainable investment model as we have always intended.\n\nI am happy to share that many of the crucial capital investments needed to scale our business and support our growth plan over the medium term are being well underway. Given this dynamic, we would expect operating leverage to become increasingly apparent in the upcoming period and the law for an extended cash runway through 2025 and beyond. I am so proud of the many achievements we have made over the past years. We built a broad network of customers globally through a strong product portfolio.\n\nWe computed the tremendous amount of data which can be leveraged by both our clinical and biopharma customers to create meaningful insights. And on top of that, we're also preparing for the deployment of CarePath this year, A new model of our platform that will bring to life our aspirations of providing multimodal longitudinal data to our core customers to support their diagnostic and treatment decisions. The seeds of our long-term success have already been planted, and now is the time for us to begin harvesting the fruits of these efforts. Now let's get into the Q2 highlights.\n\nStarting off with new customer adoption and the expansion of the SOPHiA network. We're hyper-focused on building long-lasting relationships with new customers to increase and diversify the platform's network. Customer growth on a global scale proved to be resilient this quarter despite macro economic and geopolitical challenges, which have primarily impacted us on a reported basis due to the unfavorable FX headwinds generated. While global growth is a priority altogether, we remain concentrated on North America, our largest potential market where we continue to advance our strategy and see positive development.\n\nTo that end, on top of continuing to penetrate leading academic centers, we are also making solid progress which penetrating the centralized lab space in North America. We look forward to sharing more details on our momentum very soon with respect to these efforts. Consumption trends across the board were steady in Q2. SOPHiA's sales strategy revolves around ensuring that new and existing customers recognize the full range of use cases of our platform to broaden and deepen customer relationships.\n\nYou may have heard us talk about SOPHiA's traditional land and expand model on previous earnings calls. Cross application consumption continues to be key to deriving mutual benefit between us and our customers, expanding key customer wins into transformative long-term business relationships. Total recurring platform customers grew to 388 in the second quarter of this year, up from 367 customers in the second quarter of 2021. The total number of platform analysis increased to approximately 66,000 in the second quarter, up from approximately 63,000 analysis in the second quarter of 2021.\n\nYear-over-year, our core platform analysis volume, excluding COVID-related analysis grew approximately 17%, while total analysis volume grew approximately 5%. Overall, global usage has generally tracked according to expectations with the exception of Turkey where we saw a notable decline in the period due to the impact of the lira's continued depreciation and its implication for reimbursement rights. In another Q2 highlight, we recently finalized an additional agreement with GE Healthcare to further integrate data between GE's Edison platform and the SOPHiA DDM platform. We are thrilled to be taking this step with them to deepen our partnership and enable our assured customer base to interpret complex data and generate novel insights.\n\nAdditionally, this past June at ASCO, SOPHiA and GE Healthcare presented together in a joint symposium about the respective efforts to unlock the promise of data-driven medicine in cancer through the use of multimodal data. Our chief medical officer, Dr. Philip Mooney, presented the preliminary findings for DEEP-Lung-IV, the observational clinical study that we launched to validate predictive signatures of response to immunotherapy for patients with advanced non small cell lung cancer. At ASCO, we believe that we showed an initial 80% predictive value for search responses, which is incredibly exciting.\n\nASCO itself was a big success for us, as it resulted in numerous meaningful conversations with customers, especially the biopharma community who recognize the value not only in the rich volume of data we have computed on our platform but also for the value of our algorithms which can help improve the insights and quality of their own data. Additionally, with respect to DEEP-Lung-IV, the insights generated from the study are also expected to accelerate the development of and enhance the capabilities of CarePath, which is still on track to be deployed later this year. CarePath will offer advanced data visualization, cohorting, and ultimately predictive capabilities through a single comprehensive lens throughout the patient journey. We anticipate that this module will complement our biopharma business by helping life science customers select the right patients for the clinical trials and offer them robust patient analytics as well as insight throughout the course of their trial.\n\nWe are encouraged by recent discussions, and it is clear that our value proposition to biopharma companies continues to grow with the expanding scale of our multimodal data and platform capabilities, and continuously improving predictive algorithms. Overall, Q2 was a successful quarter as we continue to execute on our core business while building the foundation for our future. We're optimistic for the second half of the year, and our focus remains on our long-term growth and accelerating our trends to sustainably view the SOPHiA of tomorrow. And with that, I will now hand the call over to Ross to take you through our financial and operating results in more detail.\n\nRoss Muken -- Chief Financial Officer\n\nThank you, Jurgi, and good morning, everyone. We delivered healthy results for the second quarter of 2022 and are reiterating our full year outlook for constant currency revenue growth of 30% to 35%. Second quarter revenue grew approximately 15% year over year to $11.7 million from $10.2 million in 2021 despite significant headwinds on FX which negatively impacted our growth by approximately 1,500 basis points due to a material depreciation of the euro, Swiss franc, and Turkish lira against the U.S. dollar in the period.\n\nExcluding the impact from COVID-related revenues, constant-currency revenue was approximately 36% for the period. Our net dollar retention rate remains above 120% as of Q2 2022. The slight decline in NDR is particularly attributable to the aforementioned FX headwinds, a slightly higher annualized revenue churn of 7%, which is considered standard in the software space, and the decline in COVID-related revenues as our customers are reducing the scale of their COVID-related operations. Platform analysis volumes increased to approximately 66,000 analyses in the second quarter of 2022 compared to approximately 63,000 analyses in the second quarter of 2021.\n\nAnalysis volume grew approximately 5%, reflecting lower contribution from COVID-related products, as well as challenges in our Turkish market that Jurgi referenced earlier. Core platform analysis volume, excluding COVID-related analyses grew a healthy 17% year-over-year. Average revenue per platform customer increased to approximately $92,000, compared to approximately $84,000 for the prior-year period. Gross profit in the second quarter of 2022 was $7.6 million, an increase of approximately 22%, compared to gross profit of $6.2 million in the second quarter of 2021.\n\nGross margin was 65% in the second quarter of 2022, compared to 61% for the second quarter of 2021. Adjusted Gross margin was notably strong at 67% for the second quarter of 2022 compared to 62% in the prior-year period. Total operating expenses for the second quarter of 2022 were $31.7 million, compared to $22.2 million in the second quarter of 2021 on an IFRS bases. R&D expenses for the second quarter of 2022 were $9 million, an increase from $6.4 million in the second quarter of 2021 which underscores our continued investment in technology and product development, particularly as we prepare for the initial deployment of CarePath later this year, and an increase in share-based compensation.\n\nSales and marketing expenses for the second quarter were $8.2 million compared to $7.6 million in the second quarter of 2021. General and administrative expenses for the second quarter were $14.7 million, compared to $8.2 million in the second quarter of 2021. Of note, a majority of the increase in expenditure is related to our scale-up as a public company, public-company-related expenses, an increase in share-based compensation, and the investments we made to achieve CE-IVD certification this quarter. As a reminder, the vast majority of our expenses are headcount related as is typical with any cloud software business.\n\nOperating loss in the second quarter of 2022 was $24.1 million compared to $15.9 million in the second quarter of 2021. Adjusted operating loss in the second quarter of 2022 was $19.6 million, compared to $14.3 million in the second quarter of 2021. Net loss in the second quarter was $24.7 million, or $0.39 per share, compared to $18.4 million or $0.38 cents per share in the second quarter of 2021. Adjusted net loss in the second quarter of 2022 was $20.2 million dollars or $0.31 a share, compared to $15 million or $0.31 a share in the second quarter of 2021.\n\nCash and cash equivalents were approximately $216.6 million as of June 30, 2022. Turning to guidance, we are reiterating our previously presented constantly currency revenue growth range of 30% to 35% for the full year 2022. Demand trends overall remain healthy. And given our high level of visibility, we do not expect a material shift in our underlying fundamentals in the second half.\n\nDespite our continued competence in our core business, FX headwinds have worsened materially since our original guide and in turn our reported range for the full year 2022 revenue now translates to be between $47 million or $49.5 million. Of note, this range is based on June 30 FX rates. Furthermore, following Jurgi's theme of sustainability, I also want to reiterate that we are committed to our shareholders to be diligent with respect to organic and inorganic growth objectives and investments. We have put in place numerous initiatives to enhance productivity and efficiency to maximize our capital runway with an eye toward long-term profitability.\n\nWith that being said, we recently conducted a comprehensive review of our cost structure and are implementing optimization strategies, in particular with regards to our research and development efforts as well as our corporate spend with the aim of extending our cash runway and bridging toward profitability and cash flow breakeven. I am pleased to share that based on our conclusions from our updated planning exercise, we currently envision sufficient capital on hand over the next several years, placing us on the pathway to profitability and cash flow generation and in turn self-sustainability. Our efforts will remain focused on balancing the cadence of investments required to achieve our growth ambitions, while keeping a focused eye on driving superior returns. Fortunately, as Jurgi mentioned earlier, many of the upfront investments we have made in 2022 should aid in our ability to meet this dual mandate.  Thank you for your time this morning.\n\nI am looking forward to seeing so many of you in New York at SOPHiA's investor day next month. And now I will turn the call back over to Jurgi.\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nThank you, Ross.  As we look to the second half of our fiscal year, we are on solid footing. Despite some of the current macro challenges, we believe that the growth and unique capabilities of our platform which we continue to augment with new product launches will continue to drive global customer adoption and increased usage from our customer space. We remain optimistic about SOPHiA's journey and our continued leadership in using the power of data analytics and predictive AI to transform the world of healthcare. While we have accomplished a tremendous amount already, we're just getting started.  Before I open the call to questions, I want to remind everyone that SOPHiA's investor day is taking place on September 20 in New York City.\n\nWe hope to see you there. Thank you again for joining our call today. And, operator, we'll now take questions.\n\nOperator\n\n[Operator instructions]. And our first question will come from Tejas Savant with Morgan Stanley. Please go ahead.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nHi, this is Neil on for Tejas. So last quarter you talked about the strong visibility into the pipeline for net new business wins through the second half of the year. And based on the direction you're seeing with HRD along with other major partners such as AstraZeneca and Ambry, can you break out some of the puts and takes here on the guidance range and how should we should think about revenue phasing through the second half, you know, factoring in the increased FX impact?\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nYes, thank you for the question. I will take your question regarding the bookings, and then I will let Ross comment on any impact you could or not expect on the revenue side. So on the booking side, we've seen the bookings healthy and stable, I would say over the last quarter. And we definitely see more and more demand on applications like the HRD which becomes more and more important in terms of signature in the overall oncology effort.\n\nAnd in particular, we start seeing such type of demand in the U.S. by the central lab. So we have good hope that indeed this should enable us as well to grow revenue in the mid long term. Ross, I don't know if you want to further develop on the revenue side.\n\nRoss Muken -- Chief Financial Officer\n\nThank you. So obviously with respect to the guidance, the material change that we had this quarter was really around FX, right, so that continues to be the biggest swing factor related to reported revenues. If you think about it from a organic or core perspective, I would say we've modeled utilization relatively conservatively for the back half of the year. And so no real expected change in the underlying, I would say demand curve that we had predicted in the first part of the year, albeit I would remind you seasonally Q4 is typically our strongest quarter.\n\nTo your point on the phasing, just given the time it takes to set up HRD clients which is typical for any new start, that was going to push, right, some of the revenue to the back part of the year. We continue to expect that to be the case. I would say from a recognition perspective, we probably have a bit more variability around our biopharma business than we do HRD. It is possible we see a quicker uptake of HRD related revenue relative to the model, but I would say ultimately, pharma is probably where we have the bigger swing point just because of the size of those contracts, right.\n\nAnd so we have a number of things projected for the back end of the year that we're, I would say quite competent on recognizing, and we have a few other elements that could lead us to some degree of upside. And then one last one, and I'm sure we'll get to another piece, we've also, I would say, from your model of Turkey relatively conservatively for the rest of the year, and so we've tried to take that into consideration as that piece of our business is -- as maybe Jurgi will talk to later -- was a bit challenged in the quarter.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nGot it. Thank you. Considering the macro volatility and some of the erosion you're seeing in FX. Are you starting to see any signs of shifting customer demand or signals of tightening budgets, particularly in regions such as Europe.\n\nAnd given the value proposition presented by your platform to enable lower cost bioinformatics? Can you give us some color on how you know those customer conversations are progressing?\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nThank you for the question, Tejas. So overall, if we look at our user trials, which is, it's a proxy of our revenue, right, given we're a consumption-based as a cloud player, so EMEA is being stable this quarter, while Turkey has been down materially because of the impact that Ross was telling about, FX, which impacted basically reimbursement in Turkey, and then like less consumption. So on that, as Ross said, right, we're been prudent in our forward-looking forecast, but we expect EMEA to be stable. And the NorAM, APAC, and LatAm, we continue with stronger growth.\n\nAnd we don't see any sign for this being decelerated. And to your point, I think, given now maybe the markets expects some private leaders as well to be more cautious on cost, Tejas. It may be that this gives us a favor in the adoption of our platform, because we believe that with our platform solution we cannot accelerate the adoption of precision medicine application into the hospital to the central apps, but indeed we can make it as well in a very cost effective way.\n\nRoss Muken -- Chief Financial Officer\n\nI would add one point to that. Obviously, the other advantage of the consumption model is obviously no capex, no significant upfront investments, right? And so we can really allow players to adopt our technology in a pretty capital-efficient way, and then as they scale up and obviously receive revenue for what they are doing, they can increasingly consume. And so again, we'll obviously watch the market closely, but as of now things are, I would say, quite healthy and steady in our core markets. And we've seen no signs relative to what you highlighted on the macro with the exception of Turkey.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nGreat. And one last for me. You know, there are few peers this quarter in the diagnostic space pointing some impacts presented by hospital staffing and labor shortages. While your business is quite geographically dispersed, have you seen any of those impacts in 2Q temporary or ongoing to the business?\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nSo nothing so far, Tejas. And maybe as a recap, right, our clients are primarily core academic centers, right? So the one that are basically treating people who are suffering from severe diseases such as cancer. And so as we have seen in the past as well, right, with COVID. Those hospitals have been very good at equipping themselves so that they could sustain their efforts and serve their patients.\n\nAnd so in a certain sense, maybe this position in these core academic centers is not impacting as widely as you described, maybe others are being impacted while they are serving more of the community hospitals.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question will come from Julia Qin with J.P. Morgan. Please go ahead.\n\nJulia Qin -- J.P. Morgan -- Analyst\n\nHi. Good morning. Thanks for taking the question. Starting with the cash runway, you said you expect the cash runway to extend until at least 2025.\n\nI'm wondering between gross margin, sales marketing, R&D, etc., where do you see the greatest leverage? And for R&D, just wondering what areas are you prioritizing versus deprioritizing? And how do you see that potentially impacting any new product launches or any expansion going forward?\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nThank you, Julia. I will start and let Ross afterwards develop on the gross margin side. On the core investments, as we have mentioned, right, we have already made important investments over a year, it's actually over 10 years in our core platform capabilities. And these capabilities enable us to deploy quite quickly new applications such as HRD.\n\nAnd even on the application side, I think we've made big efforts over the last two years so that we could really get great momentum now in the years to come. So we don't necessarily have any need, if you like, to invest deeply in terms of R&D capabilities to further strengthen our current technology and algorithmic capabilities. So indeed, in that sense, you should expect that our investments will be pretty flat. And then I will let Ross give you some color on the G&A and other sales and marketing aspects.\n\nRoss Muken -- Chief Financial Officer\n\nThanks, Jurgi. So obviously, we made pretty good progress this quarter on the gross margin side and continue to remain very focused there, albeit again dependent on mix and a number of other items that could bump around a bit quarter-to-quarter. But overall, the trend has been favorable. And again, long term, we're aiming for software-like margins in this business, so that will help.\n\nBut I think relative to the operating expenses, Jorge had talked about some of the key projects that we've already put significant investments toward. And so we'll get operating leverage as those projects start to generate revenue like CarePath, and where we're seeing HRD our biopharma efforts. I would also say we're very focused on the G&A line. Obviously, public company costs are not insignificant.\n\nAnd so there we've made some real efforts to continue to bring down that sort of spending level, and I would expect you to see that over the next several quarters. And then I would say the headcount investments we've made, both sales and marketing and R&D should sustain us certainly for a bit. And so as you just think about leveraging, frankly, all three of those lines, that hopefully should yield continued sequential improvement, at least on a trend basis. So again, I think it's going to be fairly balanced across the portfolio.\n\nBut again, I think in any given period, you could see a bit more leverage from one of those lines versus the others, sort of dependent on some of the underlying movements and just the cycling of projects and investments.\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nAnd maybe to last on the G&A. Julia, maybe to last on the G&A. We had, as you may remember, we had invested, say, for us quite significantly on the quality regulatory aspect over the last year, and this was a strategic decision, right? And it's one where we have to recruit an experienced team so that we could set the standards in our industry with the platform being our IVD with plans to go to IVDR and potentially to have the approval path. But as well entertain and develop our conversations with the biopharma industry.\n\nAnd so in that sense, like this investment was strategic as well, we have the headcount we need now in our plan. And so you shouldn't expect a further expansion of this team in the future.\n\nJulia Qin -- J.P. Morgan -- Analyst\n\nGreat. Super helpful. And then in terms of CarePath, I was just wondering if you could give us a little bit more color on what feedback has been within the biopharma community on your DEEP-Lung initial read out at ASCO and how your current biopharma pipeline is trending. And for CarePath, what do you think will be the monetization model? Is this still a paper analysis basis? Or are there other clinical trial enrollment or CDx deal component to it? And how should we think about the revenue ramp?\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nSure. Thank you. I would say, while we are very excited, it's too early to give you any insight on the monetization aspect, Julia, but we will not hesitate to share that with you later during the year or beginning of next year. But indeed, we share a lot of excitement around CarePath and around ASCO.\n\nI would say the level of discussions we have been having with the pharma has been, for me, beyond my expectations. And not only we have been able to demonstrate the value of the data we collect as we are serving a decentralized clinical market, including with CarePass for this DEEP-Lung-IV and the value of this data for the pharma. But as well, and I would say this was almost a positive surprise, although we were expecting that, that was a realization. We confirm as well that our technologies, so our algorithms are being perceived kind of being unique to compute as well the data that the pharma themselves are being producing and where they may want to have our algorithms to revisit their data to see if we can identify anything that they wouldn't have seen so far.\n\nSo very excited and very positive. We will have soon announcement as well regarding DEEP-Lung study, where we're extending the number of sites that are basically joining the effort, and we have already computed the data of about 500 patients with an accuracy of 80% on being able to basically have an idea whether a patient will respond or not respond to the immunotherapy. So this could be an important step forward, I would say, for SOPHiA, but for overall the industry when it comes to leveraging on multimodal data and better [Inaudible] around the world.\n\nJulia Qin -- J.P. Morgan -- Analyst\n\nThat's great. Last one from me. Congrats on the recent CE-IVD approval. Can you maybe talk a little bit about the significance and how much incremental revenue opportunity that unlocks? And in terms of volume mix, do you expect any changes compared to your existing customers with CE-IVD approval and any implications in terms of ASP?\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nYes. Thank you, Julia. So on the revenue side, I cannot share with you any information, but I will explain you the rationale and the importance indeed of this IVD effort. And thank you for highlighting that.\n\nThere have been a big change in the regulation like in Europe where people are expected to move to a new framework which is called IVDR. And given these IVDR standards are pretty high, the first pass has been toward going IVDD and there was a strong deadline for all the players. And SOPHiA is being able, indeed, to fulfill that deadline this summer on the platform but as well on four core applications for primarily, excuse me, oncology applications. And what we are now doing is indeed for some of the customers want to move from RUO to IVDD environment, or a more regulated environment.\n\nWe're helping in this transition. And this is a trend we definitively expect to happen across the board. And so I think we're -- now with the investments we made pretty well-positioned to accompany our customers in this more regulated environment.\n\nRoss Muken -- Chief Financial Officer\n\nAnd maybe just quickly, Julia, yes, to just add. Obviously relative to your ASP question, regulated products, you would expect to have a higher ASP. And I think, frankly, as you look at our results this quarter, we've actually continued to see very nice ASP progress this year. But unfortunately, it's been obviously washed away by currency, right? So obviously something to keep in mind, but you would expect to see that trend continue favorably for us once currency ceases to be such a significant headwind than it is currently.\n\nJulia Qin -- J.P. Morgan -- Analyst\n\nVery helpful. Thank. you.\n\nOperator\n\nOur next question will come from Mark Massaro with BTIG. Please go ahead.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nHey, guys. This is Vivien on for Mark. Thanks for taking the question. So I think you've previously spoken about pursuing additional data modalities such as digital pathology, proteomics.\n\nAny sense of timing or prioritization on these? And maybe how are you sensing customer demand on these fronts from existing customers? Thanks.\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nThank you for the question, Vivien. So I would say, right now we are really focused on our core capabilities, right? So which are basically genomics, radiomics, and combining genomics and radiomics data modalities longitudinally in the CarePath. As I was mentioning, while responding to Julia, this got really a lot of, say, we had a lot of discussions at ASCO around the CarePath capabilities. So in that sense, today, our focus, I think it's very disciplined.\n\nAnd we do see positively as well the evolution of some new players in the sequencing sector. And as you have realized that, now they will be maybe broader sequencers. And with that, we expect, if you like, volumes to go up, but as well the value informatics to go up, right? So I would say, despite indeed as we have said in the past as well, we do see a potential for a tech player gathering multi-model data include pathology and proteomics. Right now, what we see in the industry is more need around the core genomics capabilities that are increasing as well as multimodal capabilities mixing up radiogenomics data.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nPerfect. And maybe just one quick follow-up. From the gross margin improvement, could you just remind us of any targets you have there longer term?\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nRoss, can you take this one?\n\nRoss Muken -- Chief Financial Officer\n\nSure. So obviously, as I said earlier, we're striving for software-like margins in the business. And if you look at data companies across the traditional tech space, obviously you will see numbers sort of at our level to slightly higher. I would say in the medium term, and we'll probably cover more of this at the analyst day, we've talked about sort of the 70% threshold as sort of a target.\n\nObviously this quarter at 67% we're making progress toward that, albeit I would say, again we don't expect it to be a perfect linear trend. And so ultimately, the mix of our business will also determine that somewhat as biopharma, other elements have quite high margins for us as they're traditionally data businesses. But overall, we're very happy with the progress there. And again, we're continually focused on ways to drive leverage in this business.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nGreat. Thanks so much for taking the question.\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nThank you, Vivien.\n\nOperator\n\n[Operator instructions]. Our next question will come from Dan Brennan with Cowen. Please go ahead.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nHey, good morning. This is Kyle on for Dan. I just want to talk about your traction in the U.S. You've been pretty positive about the large opportunity in increasing traction here.\n\nCould you just discuss your traction with large U.S. reference labs and maybe help us think through the future impact on revenue and margins?\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nYes. Thank you, Kyle. So as mentioned, right, the traction has been solid in APAC, LatAm and in NorAm. And stable in EMEA.\n\nAnd NorAm indeed was a market where there were questions regarding our model, which is more decentralized. But every day we execute upon our model, and it's a region where we are nicely growing. And the HRD capabilities we built enable us to grow beyond, I would say, the traditional academic centers, including penetrating some reference labs.\n\nRoss Muken -- Chief Financial Officer\n\nAnd obviously, we can't give you color on sort of the revenue margin impact, but you can assume relative to our existing or current ARPU, these are quite significant new wins as they happen, right? And so we're quite excited about the progress we're making around these customers. And we think the momentum continues to build. And so I would say, stay tuned on that front. Hopefully we will have more to share at a later date.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nGreat. And then maybe just one on clarifying the growth guidance here in constant currency terms. So the 30% to 35% constant currency growth, does that include or exclude the impact of COVID? And then on that note, how should we really think about the COVID impact for the rest of the year?\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nSo first, as a reminder, Kyle, so year-on-year on the core business, putting the FX impact aside and the COVID, we grew 36% year-on-year, so which was a solid performance. And then with COVID, we were -- without COVID or with the COVID going down, right, we're around 30% and 17% with FX. So the business has been solid, and highly impacted, I would say, in terms of reporting currency, but not the constant currency because of the euro and because of the Turkish lira. So on the guidance, Ross, do you want to give some more color on the 30%, 35% growth?\n\nRoss Muken -- Chief Financial Officer\n\nYes. So the 30% to 35% captures the impact of COVID, right? And it ties back to the original guide we gave. I would say, COVID for us, like many, has continued to trend down, and we had assumed that it would trend down to almost no contribution by the end of the year. And that's still reflected, right? So again, we've trended so far year-to-date at the upper end of that range or slightly above.\n\nAnd so we're happy with sort of the underlying performance. And we've talked about again, a number of factors that should help us in the back half of the year, particularly in Q4. And so as you think about the range updated, it was purely FX-related, which obviously has been quite painful for us across the board with a number of the core currencies. And so again, that 30% to 35% captures some of the negative COVID mix and also is consistent with what we've said prior.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nAwesome. Thanks for taking my questions. \n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nThank you, Kyle.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Jurgi Camblong for any closing remarks.\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nSo thank you again all for joining the call today. And as we are getting closer to our investor day in New York in September, we are very much looking forward to see some of you there. Have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJennifer Pottage -- Head of Investor Relations\n\nJurgi Camblong -- Co-Founder and Chief Executive Officer\n\nRoss Muken -- Chief Financial Officer\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nJulia Qin -- J.P. Morgan -- Analyst\n\nMore SOPH analysis\n\nAll earnings call transcripts"
}