{
  "companyName": "Utz Brands, Inc.",
  "companyTicker": "UTZ",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/utz-brands-inc-utz-q2-2022-earnings-call-transcrip/",
  "content": "Utz Brands, Inc. (UTZ 0.38%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Utz Brands, Inc. second quarter 2022 earnings conference call. Please note, today's conference is being recorded. [Operator instructions].\n\nAfter the speaker's remarks, there will be a question-and-answer session. [Operator instructions]. At this time, I will turn the conference over to Kevin Powers, senior vice president, investor relations. Mr.\n\nPowers, you may begin your conference.\n\nKevin Powers -- Senior Vice President, Investor Relations\n\nGood morning, and thank you for joining us today. On the call today are Dylan Lissette, chief executive officer; and Jay Kataria, chief financial officer; and Cary Devore, chief operating officer. Dylan and Ajay will make prepared comments this morning, and all three will be available to answer questions during our live Q&A session. Please note that some of our comments today will contain forward-looking statements based on our current view of our business and actual future results may differ materially.\n\nPlease see our recent SEC filings, which identify the principal risks and uncertainties that could affect future performance. Before I turn the call over to Dylan, I have just a few housekeeping items to review. Today, we will discuss certain adjusted or non-GAAP financial measures, which are described in more detail in this morning's earnings materials. Reconciliations of non-GAAP financial measures and other associated disclosures are contained in our earnings materials and posted on our website.\n\nFinally, the company has also prepared presentation slides and additional supplemental financial information, which are posted on our investor relations website. And now I'd like to turn the call over to Dylan.\n\nDylan Lissette -- Chief Executive Officer\n\nThank you, Kevin, and good morning, everyone. I'm pleased to report that our very strong start to the year continued in the second quarter with record net sales of over $350 million and our organic net sales increased 13.6% as demand from a combination of both our loyal and new consumers remains robust. While we continue to closely monitor consumer behavior and the impact high inflation is having on shopping and purchasing patterns, but continues to execute against our core strategy of reinvesting to accelerate revenue growth. including accelerating our power brand sales, expanding distribution, and underpenetrated channels and customers, continuing our national expansion and increasing our presence in key salty snack subcategories and adjacencies.\n\nLooking at IRI retail sales in the period for the second consecutive quarter we gained a share in the salty snacks category. For the 13-week period ended July 3, our retail sales increased 16% versus category growth of 14.8%, and as we expected, our sales growth was led by higher effective net pricing following pricing actions beginning in 2021 in response to historically high cost of goods inflation. On that note, we continue to see minimal elasticity or trade down in our sales due to price sensitivity and private label once again lost share in our category in the latest quarter. Private label, which represents only about 4.6% of the IRI salty snack category lost share in the most recent 12, 26- and 52-week periods.\n\nTurning to our bottom line results in the quarter. Our gross margins improved versus last year, and adjusted EBITDA increased 18%. We are pleased to see our margins begin to stabilize as the combination of our pricing actions and productivity improvements begin to catch up with the current and ongoing inflation in ingredients, packaging, freight and labor. As costs continue to rise, we are continuing to work closely with our retail partners to implement strategic and selective pricing actions that we've already announced in the second half of the year to help cover inflation and enable us to continue investing in our brands, our people and our supply chain.\n\nIn addition, we continue to invest in critical supply chain and selling infrastructure to support geographic expansion nationally and to support our ongoing key customer wins. These include investments in the southeast of the United States to support our recently announced significant expansion with Publix, along with other large retailers. As noted previously, we recently completed resets that introduced our portfolio across nearly 1,300 public stores, and we are incredibly excited to expand this partnership with this important customer and we remain dedicated to making continued future investments to support our shared category growth. From a productivity standpoint, our programs remain on track, and we continue to expect to deliver approximately 3% productivity in fiscal 2022.\n\nAs we have noted previously, we have built a significant amount of muscle in this area from a talent and process perspective, and we have done a fair amount of work toward our plant optimization efforts as well. In addition, we are very excited about our preliminary pipeline of initiatives that is being developed for 2023 as we look to even further enhance our productivity. These include capital investments to automate seasonal small bag production as well as barrel and box billing equipment and these will provide us with the year-round capabilities for more efficient packing for multipack, variety pack and small-format packages. In addition, we will be ramping up production at our Kings Mountain facility, where our plans continue to remain on track.\n\nWe expect to begin port production there this fall, which should help to alleviate our bottlenecks at our Birmingham manufacturing plant around pork rinds, and we begin to plan for kettle chip production at this facility as well early next year. This will also help us to meet growing national demand for our continued fast-growing ZAP kettle chip brand, especially in the Mid-Atlantic and Northeast where we have been somewhat supply constrained. So wrapping up our key messages, I'll touch on our updated outlook for fiscal 2022. Based on our performance year-to-date as well as our expectations for continued strong consumer demand for our brands, along with what we are seeing currently in regard to limited price elasticities, we are raising our net sales guidance for the year.\n\nWe now expect total net sales to grow 13% to 15% and for organic net sales to grow 10% to 12%. In addition, based on our year-to-date performance and momentum building actions to help mitigate inflation, we now expect adjusted EBITDA to grow 2% to 5% versus our previous guidance of modest growth. Importantly, we are maintaining our prudent approach to our full year outlook given the environment, and we remain dedicated to investing in critical brand building programs across the company. Briefly touching on our second quarter financial results.\n\nTotal net sales grew approximately 18%, which reflects our strong organic growth of nearly 14% as well as the contribution benefit from our acquisitions. Adjusted gross profit grew about 20% and adjusted EBITDA increased over 18% as margins are beginning to stabilize, and we expect this to continue for the remainder of the year, building a stronger foundation from which to build on in fiscal 2023. Turning to our retail sales results in more detail. For the 13-week period ended July 3, our power brand sales increased 17.3% versus the category of 14.8%.\n\nThis was our third consecutive quarter of share gains for our power brands with double-digit growth in the US on the border, Boulder Canyon and tortillas brand. Turning to our growth drivers in the quarter. We delivered double-digit growth in retail sales across four of our five major sub categories, representing approximately 80% of our retail sales. In addition, we once again drove share gains in potato chips and pretzels, which represent approximately 50% of our retail sales.\n\nIt's important to note that while our tortilla chips grew a healthy 13% versus last year. Our power brand of on the border grew 15.4%, and our power brand of tortillas, grew 17.2%. I will note that our on the board or tortilla chip sales in the quarter were impacted by the timing of promotional features versus last year in the mass and club channels. We expect some of these timing dynamics to continue into the third quarter, but these promotional features are being scheduled for later in the year and will provide a tailwind to sales in the fourth quarter.\n\nOn that note, we remain extremely excited about the entire on the border brand portfolio. When you include the on the border sauces and dip retail sales, on the border as a whole grew over 22% versus last year in the 13 weeks of IRI sales. In total, on the Border has eclipsed over $350 million in retail sales over the past 52 weeks, and we continue to invest in manufacturing and distribution assets to better support the growth opportunities for this incredible brand. I will also note that our Pork Rinds, which only represent about 5% of our retail sales were primarily impacted by supply chain challenges in the quarter.\n\nOur team is actively working to address these opportunities to unlock their full potential. And to that end, as I mentioned earlier, as we ramp pork rind production capabilities in our Kings Mountain facility, which again is expected to come online in the second half of 2022. This should help to address these challenges. In the quarter, we also continued to make great progress driving geographic expansion, while also continuing to improve our execution in our core markets.\n\nWe delivered double-digit retail sales growth across all geographies, and this was our second consecutive quarter of share gains in the core. In our core, which represents over 60% of our retail sales, we registered approximately 17.5% growth versus a category of 15% with our flagship its brand up nearly 23% and on the border to TORTIYAHS chips up over 30%. Beyond the core, we continued our momentum with double-digit sales increases in emerging and expansion. Consistent with the earlier context for our on the border TORTIYAHS chip sales performance, our relatively minor gap versus the category was impacted due to this same dynamic given that 75% of our on the border sales occur in these outline geographies today.\n\nImportantly, our Utz brand was up over 30% in both our emerging and expansion geographies. And as a reminder, Florida is a key emerging state for our company and our public launch will help to drive higher market share gains in this important geography over the coming years. Consistent with our strategy, as we entered the year, we are significantly shifting our legacy marketing spend from multiyear sponsorships to a much more dynamic, nimble and active marketing plan. And this shift will result in an increase of approximately 40% in consumer poll marketing spend versus 2021, with most of that spend growth actually occurring in the second half of the year.\n\nAnd per IRI, we've added 4.6 million buyers of its products since February 2020, and we are focused on buyer retention, and maintaining our strong repeat purchasing rates. We are also investing in exciting brand ideas, including our family crafted flavor campaign from us that reinforces our quality and our people like Utz campaign that reinforces our brand equity. Family crop flavor provides campelling creative that messages deliciousness and taste and speaks to our family heritage and our legacy. While people like us celebrates the loyal legion of Utz Brands, sharing primarily user-generated content across our various social media platforms.\n\nIn addition, we are extending our voice to the consumer through both advanced targeting of media and earned reach, and we are finding success in connecting and engaging with our fans on high attention platforms. Our social media following of both the Utz brand and the apps brand has more than doubled since the start of this year. And we are connecting in a deeper way with consumers through driven marketing to provide the right message to the right consumer at the right moment, at the right place and then measuring the impact. From an innovation perspective, we have an exciting slate of new products coming in the second half of the year across key power brands and subcategories.\n\nTo touch on a few. First, we are introducing Zapp-flavored pretzel twist, this iconic potato chip brand, known for bold and distinctive flavors will now extend into flavored pretzels, where the flavored segment is 40% of the pretzel subcategory sales and grew over 25% in the last 52 weeks. This segment is all about flavor, and that's exactly what Zapp delivers, along with its fun and exciting brand personality that consumers find irresistible. To that note, we are planning a multichannel launch, supported by a comprehensive consumer marketing program this fall.\n\nAnd we have seen a tremendous amount of retailer acceptance around this introduction, and we are excited to present these snacks to our loyal Zapp consumers. In addition, this Halloween season, we are introducing even more innovation for fun and festive holiday snacking. Our Utz brand, which is Brew, and our on the border brand, Halloween TORTIYAHS chips, our classic snacks with a unique Halloween twist that are perfect for sharing at Halloween events and tricker tree. This innovation and expansion of our product lineup is helping to drive future sales.\n\nAnd overall, we expect our holiday seasonal sales to drive growth in the third quarter, driven by expanded offerings and our ability to better satisfy demand versus last year, which is supported by an improved supply chain. Finally, we are expanding our multipack offerings for incremental occasions. Our Utz brand multipack retail sales have grown nearly 37% over the past 52 weeks, while our share is just 1.5% of this high-growth category. We have a huge opportunity to gain our fair share of this segment of the category, and we will look to continue to find ways to expand our offerings.\n\nBefore I turn the call over to Ajay, I just want to reiterate my confidence in how well positioned it is to navigate the current environment. First, we are a pure-play snacking company competing in traditionally recession-resistant categories. Our growth is and has been supported over the decades by a very resilient salty snacks category with consistently healthy fundamentals. Second, and as I mentioned earlier, the salty snacks category has very little private label exposure with only 4.6% market share.\n\nBrands that consumers love, matter in salty snacks, and that has been the case through multiple economic cycles, and we believe that this continues to be the case today. Third, we have strong brand equities across our entire portfolio, and we participate in this sector with historically low price elasticity relative to the broader food category. That said, while elasticity price has been limited to date this year, we are expecting more in the second half of the year as consumers make spending choices in the face of high inflation. Fourth, as we continue to have significant white space opportunities that will drive top line benefits today, our household penetration is still less than 50% across the entire U.S.\n\nand our market share outside of our core geography is still only about 3% of the salty snacks category. Big customer wins like Publix and the purchase of DSD third-party distributors will help to drive share gains even further. And finally, while net leverage is currently above our targeted long-term range, our liquidity remains strong, and we have the ability to maintain investments in our growth and to keep M&A optionality open for highly accretive opportunities. You'll continue to see us being opportunistic in this market, as we remain one of the leading logical consolidators in the salty snack category.\n\nAnd with that, I'd now like to turn things over to Ajay Kataria, our CFO. Ajay?\n\nAjay Kataria -- Chief Financial Officer\n\nThank you, Dylan, and good morning, everyone. I want to build on Dylan's comments and say how proud I am of our team's ability to continue to navigate a dynamic operating environment to deliver another quarter of record net sales performance, while our margins begin to stabilize, and we return to year-over-year profit growth. Our strong management and support teams and our incredible frontline sales, manufacturing and supply chain teams are working well together to execute our playbook. Thank you to all our associates.\n\nNow I will review a very high-level summary of our second quarter financial performance, and then we will discuss our net sales and margin drivers. Our second quarter 2022 net sales increased 17.5% to $350.1 million. We delivered organic net sales growth of 13.6%, which excludes the impact of acquisitions and the impact of converting company-owned DSD routes to independent operators. As a reminder, when we convert routes IOs certain selling expenses moved to sales discounts, thereby benefiting selling, distribution, and administrative expenses and reducing net sales and gross profit.\n\nAdjusted gross margins expanded 63 basis points to 36%, and this includes an approximate 120 basis points of negative impact from our IR conversions. In addition, adjusted SD&A expenses improved by 30 basis points to 24% of sales. I will note that in the second quarter last year, there were certain miscellaneous nonoperating income and expenses that are now factored into COGS and SD&A this year. This is consistent with our reporting change that began in the first quarter of fiscal 2022.\n\nA more apples-to-apples comparison would show adjusted gross margin to be 47 basis points better in the second quarter of this year versus last year and adjusted SD&A expenses as a percent of net sales to be 40 basis points higher in the second quarter this year compared to prior year. Furthermore, our gross margins would have expanded about 167 basis points when you also account for the impact of our IO conversions. Our adjusted EBITDA increased by 18.2% to $42.2 million or 12.1% of sales, which was slightly better than the second quarter of last year and a sequential improvement of 140 basis points relative to our first quarter 2022 results. Adjusted net income slightly decreased to $18.4 million.\n\nThe decline in adjusted net income reflects strong operating profit performance, offset by higher net interest expense due to higher interest rates and incremental debt and also higher core depreciation expense as we have added new manufacturing assets through several acquisitions in the last 12 months. Lastly, adjusted EPS was $0.13 based on fully diluted shares on an as-converted basis of approximately $141 million. Now turning on to cash flow and the balance sheet. For the 26 weeks through July 3, cash used in operations was $26.3 million.\n\nAs we discussed on our first quarter earnings call, our cash performance was primarily impacted by working capital as a use of cash, which is in line with our normal seasonality. And and the $23 million of buyouts of multiple third-party DSD distribution rights in the first quarter that were treated as contract terminations and booked as an expense in adherence to gas. Our working capital performance modestly improved in the second quarter and consistent with normal seasonality, we expect this to improve further and become a source of cash in both third and fourth quarters. Year-to-date, capital expenditures were $60.3 million.\n\nAs a reminder, on April 28, we announced and closed the transaction for our Kings Mountain facility. In accordance with GAAP, the $38.4 million purchase cost of this facility has been booked on our  statement of cash flows as a capital expenditure and not as an acquisition. Excluding the purchase of Kings mounted facility, capital expenditures would be $21.9 million. The transaction was funded with approximately $10.4 million in cash and $28 million of proceeds from the issuance and sale of 2.1 million shares of Class A common stock to the affiliates of Benestar brands in a private placement.\n\nWe are very excited to add this facility to our manufacturing footprint as it will play a critical role in supporting growing demand for our brands in the Southeast, Northeast and Mid-South regions. Moving to the balance sheet. At the end of the second quarter, our cash and cash equivalents were approximately $20 million, and we had $83 million available on our revolving credit facility, providing close to $103 million in liquidity. Liquidity was primarily impacted by the drivers that impacted cash flow from operations.\n\nMoving down the balance sheet. Net debt at quarter end was $891.3 million, or 5.1 times normalized adjusted EBITDA of $174.9 million. While leverage is above our long-term target of three to four times, we are committed to generating stronger EBITDA, improving free cash flow conversion and paying down debt. Our goal remains to begin approaching the upper end of our targeted range by the end of fiscal 2023.\n\nWe remain focused on operating the business, integrating acquisitions, and delivering synergy targets, all of which will continue to improve adjusted EBITDA performance. Also, just as a reminder, we have a well-priced credit structure with covenant-light debt instruments, which provides significant EBITDA headroom, while we work on reducing leverage. In addition, more than 60% of our long-term debt has a nominal interest rate swap through September 2026 at a rate of 1.39%. Moving back to the P&L for some additional details, starting with net sales.\n\nOur net sales growth in the quarter was 17.5%, driven by organic growth of 13.6%, acquisitions-related growth of 5.1% and a negative impact from the conversion of RSP routes to IOs, which reduced the net sales growth by 1.2%. Our organic net sales growth of 13.6% was driven by price/mix of 13% and volume growth of 0.6%. Pricing was in line and volume performance was slightly better than our expectations as we continue to execute our planned pricing actions to offset inflation. As we had anticipated, volume was proactively impacted by approximately 300 to 400 basis points due to our strategic SKU rationalization activities focused on private label and certain partner brands that are meant to simplify our portfolio, optimize mix and increased focus on our power brands.\n\nWe are also lapping some promotional features and distribution gains from last year that are temporarily impacting volume growth as we expected. Lastly, price elasticities continue to be better than our expectations. In the second quarter, adjusted EBITDA increased 18.2% and margins modestly expanded to 12.1% of sales, which was ahead of our expectations. Decomposing the change in the adjusted EBITDA margin for the quarter, positive drivers include price/mix of 13% as we continue to take pricing actions to offset inflation and productivity improvement of 190 basis points.\n\nPartially offsetting these positive drivers where unfavorable margin impact of 13.7%, driven by higher inflation, including transportation costs and selling and administrative expense of 100 basis points. Our inflation impact versus last year was comprised of elevated labor and transportation costs as well as higher commodity input costs. Selling and administrative expense, which excludes distribution expense, increased primarily as a result of investments in our team and infrastructure to support growth in our key geographies and customers. Looking ahead to the rest of the year, we continue to expect gross input cost inflation, including of raw materials, labor, fuel and freight to be a mid- to high teens percent increase versus the prior year.\n\nIn response to these rising costs, we have been implementing inflation-justified pricing actions, and you have been seeing these build in our sales results as we implemented new actions in February and May this year. We continue to expect to deliver about 10% price this year to help cover our inflation expectations. As we lock in our commodity contracts for the rest of the year, we are closely monitoring inflationary trends in fuel, freight and certain packaging costs that are tied to the market, and we are implementing strategic and selective pricing actions in the second half of the year that are meant to close gaps in parts of our portfolio and to address new inflation pressures. In addition, we continue to expect to deliver productivity of approximately 3% in fiscal 2022, which will also help to offset gross inflation.\n\nOur primary areas of focus this year are manufacturing efficiencies, logistics and packaging and product design. In addition, we are transforming how we approach our demand and supply planning, which is critical to support our growth and become more efficient. We are making great progress in our productivity programs, and I'm confident that these actions along with strategic price pack architecture initiatives will result in structural improvements that will drive meaningful long-term margin benefit to the company. Now turning to our full year outlook for fiscal 2022.\n\nGiven our stronger-than-expected year-to-date performance, continued strong consumer demand and better-than-expected price elasticity, we are raising our total net sales growth outlook to 13% to 15%, and our organic net sales growth outlook to 10% to 12%. Within our net sales growth outlook, we continue  to assume that sales volumes will soften in the second half of the year, but given our first half volume performance, we now expect for full year 2022 volumes to modestly grow versus the prior year. Our volume outlook assumes continued incremental and strategic SKU rationalization as we optimize our portfolio with an enhanced focus on our power brands, including prioritizing production of branded products to unlock additional capacity for growing brands such as on the border. In addition, we are also anticipating more price elasticity in the second half of the year as we continue to expect spending patterns of our consumers to be impacted by the inflationary environment.\n\nGiven our stronger net sales outlook, unchanged assumptions for gross input cost inflation and the building benefits from pricing and productivity, we are raising our adjusted EBITDA growth outlook from modest growth to a growth of 2% to 5%. Importantly, this outlook also assumes increased working media spend behind our power brands and investments to support key customer growth and geographic expansion. Wrapping up our outlook. We continue to expect capital expenditures of approximately $50 million.\n\nOf note, our capex guidance excludes the purchase price of the Kings Mountain facility, which in accordance with GAAP has been treated as a purchase of property and equipment and not as an acquisition. In addition, we continue to expect an effective tax rate of approximately 20% and net leverage at year-end to be consistent with year-end 2021. Finally, on our quarterly cadence assumed in our guidance, as the benefits of our pricing actions and productivity continue to ramp up, we continue to expect adjusted EBITDA margins to sequentially improve throughout the year. But with the fourth quarter margins below the third quarter in line with our typical seasonality.\n\nGiven the strong second quarter performance, the weighting of adjusted EBITDA in the first half of the year versus the second half of the year, is now expected to be more balanced at approximately 49% and 51%. From a sales perspective, we continue to expect that our first quarter sales growth will be the highest quarterly year-over-year growth rate of the year, followed by the second quarter. In addition, we continue to expect net sales dollars to be slightly more first half weighted given our strong first and second quarter sales performance and the expected impact from strategic SKU rationalization, and price elasticity in the second half of the year. Before I open the call up for questions, I would like to revisit our long-term margin opportunity and our confidence in returning to margin expansion and mid-teens margins over time.\n\nThese drivers have remained consistent. We believe that our inflation-justified pricing actions will help to cover higher input costs and enable continued investments in our brands, people, and supply chain. Our supply chain is improving as we enhanced our manufacturing, logistics and planning capabilities to increase throughput and unlock efficiencies. Our recent acquisition integrations are on track and are allowing us to scale our manufacturing capabilities to efficiently support strong demand for our power brands portfolio.\n\nOur recent investments in technology are helping to unlock insights that enable several margin-enhancing work streams. Finally, we continue to enhance an already strong management team with new talent and more importantly, Utz's team members across the company are executing nicely. With that, operator, you may open the call up for questions.\n\nOperator\n\n[Operator instructions]. Your first question comes from the line of Andrew Lazar with Barclays.\n\nUnknown speaker\n\nGood morning. This is Josh Peter on for Andrew. So even with the upwardly revised full year guidance range, organic sales are expected to decelerate from about 17% in the first half to around 5% or so in the back half, which is actually even a little bit lower than the Street is currently looking for. So we were just hoping you could discuss the drivers of this deceleration.\n\nAnd if the company's expectations for the second half have changed at all? Or if this is more just a flow-through of the 2Q beat. And as part of that, as mentioned on the call, that price is expected to be about 10% for the year, which is actually a little bit lower than what it delivered in the first half, but also discussed implementing some strategic pricing actions in the second half. So I was just trying to get an understanding of the slowdown, if that's just lapping some of the prior actions or what's happening there?\n\nAjay Kataria -- Chief Financial Officer\n\nJosh, thanks for the question. So yes, we are very pleased with our second quarter performance, and I'll touch on pricing a little bit first before talking about volume. So pricing is expected to build from where we are now into the second half, but we are also going to start to lap second half of last year pricing. So we are modeling that in when we say we're going to deliver about 10% price for the year.\n\nAnd then as far as volume is concerned, we have already seen the impact of SKU rationalization and some prior year lapse in our second quarter results. Price elasticity in the second quarter was negligible. So really, the change in second half versus second quarter, is around price elasticity assumptions. So what we are modeling is the fact that consumer pullback in the second half due to the economic environment is going to be slightly greater than what we saw in the second quarter.\n\nAnd that's what you see in our outlook. Now I will say that we are being prudent, and we have not seen an environment like this before, this level of inflation, that said, this could prove to be conservative. And the category that we are in is pretty resilient to recession. And we are growing our distribution with national customers.\n\nSo we are optimistic, but we have to be cautious and we have to be prudent.\n\nOperator\n\nYour next question comes from the line of Jason English with Goldman Sachs.\n\nJason English -- Goldman Sachs -- Analyst\n\nHey, good morning, folks. Congrats on solid results here. Two quick questions. First, you mentioned SKU rationalization as a headwind to volume.\n\nApproximately how much of a headwind was it in the second quarter? And how much are you expecting in the back half of the year?\n\nAjay Kataria -- Chief Financial Officer\n\nSo second quarter, just for the quarter, it was about 300, 400 basis points of sales growth, and we are expecting similar levels in the second half. It should be -- it should translate to our 200 to 300 basis points for the year with the three quarters, we had 300 to 400.\n\nJason English -- Goldman Sachs -- Analyst\n\nGot it. That's helpful. And your results in your core market are really stellar. So this is -- it's a bit of a high-quality problem, but I was somewhat surprised to see that emerging and expansion markets are actually lagging core, especially given that Florida's big stay Publix is a big account, and it's entirely incremental year-over-year.\n\nSo why is it lagging? And what does the growth look like if we were to strip Florida out?\n\nDylan Lissette -- Chief Executive Officer\n\nJason, thanks for the question. As you know, we agree. The core is very strong. The category itself is the strongest in the core as well, which is beneficial to us since most of our sales are current actually in the core.\n\nIf you think about the core plus the emerging markets together, that actually represents about 85% of our sales. And both of those, I mean, that's a fantastic category results to show 15% and 14.5% category growth, and we outstripped both of those with the Utz brands and with the Utz power brands. If you think about Florida and Publix, which is in the emerging, as I'm sure you can see from the index in the appendix where we have the state map. If you strip that out, we really didn't enter into the public until mid-May to late May.\n\nSo we had a little bit of benefit in in the second quarter from that. But as we look into the future, those 850 to 1,300 new stores that we're expanding into for space we'll really start to resonate in our numbers as we see that continuing to grow into the future. So we're pretty bullish that the areas of the states that are most important to us, again, core emerging 85% of our sales that's really where our focus is today on growing sales.\n\nJason English -- Goldman Sachs -- Analyst\n\nGot it. Good step. Thanks a lot, guys. I'll pass it on.\n\nDylan Lissette -- Chief Executive Officer\n\nThanks, Jason.\n\nOperator\n\nYour next question comes from the line of Michael Lavery with Piper Sandler.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nGood morning. Thank you.\n\nDylan Lissette -- Chief Executive Officer\n\nGood morning, Michael.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nI just wanted to touch on the border. It's a case where the revenue synergies are pretty real with complementary geographies and channels. Obviously, we're seeing some of that momentum come through. But can you just give us a sense maybe of the state of the union there, sort of what the -- maybe what inning we're in, in that trajectory? I know it takes a little while for that to play out.\n\nBut how should we think about some of the trajectory of the momentum for those revenue synergies there?\n\nDylan Lissette -- Chief Executive Officer\n\nYes. Sure. Michael, this is Dylan again. As we said in our script, we're very bullish on the on the border brand.\n\nIf you think about TORTIYAHS as well as the dips and sauces, we went into a little bit more detail on dips and sauces, which were up 51% in the quarter on a $22 million retail sales for the quarter base, we're very bullish on it. It's now a $350 million retail brand. That's up sequentially from when we acquired the brand a little less than 2 years ago in late 2020. The core markets are growing off the charts in terms of, I think, 30-plus percent gains for the brand in our core market.\n\nWe're expanding the brand into food and grocery and convenience and drug in all of these different avenues. We're expanding the ACV for the brand significantly across the U.S. So we're very bullish on it. In terms of the inning, not a really big baseball fan, but maybe we're in the second or third or fourth inning.\n\nI think we can easily grow this brand over the next couple of years to $430 million, $450 million in a couple of years. That's just a relatively moderate compounded growth for this brand. And because of all that white space that we have, I think this is going to be a very strong brand as part of our portfolio as we look forward into the future.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nOK. Great. That's helpful. And just on the cost side, can you give a sense of maybe how covered you are for the rest of the year cooking oils, for example, have come in from peak levels.\n\nIf those continue to moderate. How much benefit or favorability might there be in the back half?\n\nCary Devore -- Executive Vice President and Chief Operating Officer\n\nMichael, this is Cary. Great question. We're pretty much covered on cooking oils for the year. So we're about 95% covered.\n\nSo it might benefit a little bit if the board has continued to come down, but supplier basis is still relatively robust. So not much benefit will be felt this year. But we would expect to see, obviously, a benefit next year if costs continue to come down.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nAnd sorry if I missed this, but coverage just broadly kind of across all commodities, would it be similar to that nearly completely covered level?\n\nCary Devore -- Executive Vice President and Chief Operating Officer\n\nIt's about 90% when you blend everything together.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nOK. Great. Thanks a lot.\n\nOperator\n\nYour next question comes from the line of Bill Chappell with Truist Securities.\n\nBill Chappell -- Truist Securities -- Analyst\n\nThanks. Good morning.\n\nDylan Lissette -- Chief Executive Officer\n\nGood morning, Bill.\n\nBill Chappell -- Truist Securities -- Analyst\n\nIf I go back to kind of last year, I think on the comparison, it was the costs were picking up, but it was really supply chain. It was getting freight. It was kind of renewing contracts is force majeure, all type of issues. How much of that -- where are we versus a year ago in terms of are we 80% back to normal? Are we 90% back to normal in terms of those type of costs that really were kind of unforeseen, but also ones you couldn't really hedge or do anything about?\n\nAjay Kataria -- Chief Financial Officer\n\nSo I think the way -- I'll repeat the question back to you the way I understood it. I think you're talking about supply chain disruptions and the environment we were in last year. I think things are getting better there. We are not out of the woods, but things have stabilized, and we have built a lot of muscle around how to tackle that in our supply chain, manufacturing, logistics, distribution, we made people investments.\n\nAnd we are also optimizing enhancing our manufacturing footprint. So all of those things, all the actions that we have taken have really helped us from a cost and financial standpoint. The second quarter results really show that we delivered pricing and productivity to offset inflation. And those two things are working now in tandem.\n\nAnd from here on out, we should expect sequential growth in our margins in the next couple of quarters.\n\nBill Chappell -- Truist Securities -- Analyst\n\nOK. And then -- and I guess in line with that, I mean it seems for some companies, certainly, diesel spiked intra-quarter, freight spiked in that started to come down into quarter. So is that another way of saying those things hopefully have passed us and that's part of your guidance in the back half?\n\nAjay Kataria -- Chief Financial Officer\n\nYes, we have modeled all that in. We have good visibility into our cost structure. So we are able to model in. In fact, we did that back in Q1 earnings, and we call mid- to high teens inflation back in Q1, and I think we are still there with pluses and minuses, freight and fuel being a benefit, and then there are other offsets there.\n\nBill Chappell -- Truist Securities -- Analyst\n\nGot it. And then one kind of maybe random -- not random, but a question on elasticity. I mean I understand that snacks in general are fairly inelastic and Europe, even though you're taking a kind of conservative stance going to the back half. But as you look within potato chips, potato chips, to all others.\n\nDo you find that there are some areas that are more elastic or less elastic just because there are other brands or private label offerings or are they all fairly similar?\n\nDylan Lissette -- Chief Executive Officer\n\nYes. Bill, I mean, I think we haven't really dug into subcategory by subcategory is it more elastic and pretzels versus TORTIYAHS or something like that. I mean it's it's so sort of inelastic to some extent from what we've seen in the private label, as we detailed in the script in our presentation is such a small percentage of it. And the route to market that most of the snack manufacturers take to get to the stores to service the customers and put product on the shelf is kind of unique in  our industry as well.\n\nSo I don't think it's going to be where we're overweight to certain subcategory and it's going to affect us any differently than just the overall trends.\n\nBill Chappell -- Truist Securities -- Analyst\n\nGot it. Thanks so much.\n\nDylan Lissette -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Peter Galbo with Bank of America.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Good morning. Thanks for taking the question.\n\nDylan Lissette -- Chief Executive Officer\n\nGood morning.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nAjay, I just wanted to ask a clarification. You mentioned in terms of quarterly cadence in the back half, I think 3Q EBITDA margins up sequentially and down kind of seasonally. Is that the same case on the gross margin line as well? Just you saw a nice expansion in 2Q, I would think from here, you would continue to kind of see that sequential improvement. But just wanted to ask on the quarterly gross margin cadence?\n\nAjay Kataria -- Chief Financial Officer\n\nYes, I believe that gross margin should be -- should follow a similar trajectory.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nSimilar trajectory to the EBITDA margin.\n\nAjay Kataria -- Chief Financial Officer\n\nCorrect. Sequential improvement into Q3 and then a step down, slight slip down in Q4.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And then, Dylan, maybe just stepping back, kind of a broader strategy question. it's nice to see the slides included on innovation and on marketing spend ramping up. And just it seems like this would be very different from when you were operating as a private company and knowing you haven't been in the public markets that long, who just frame for us, how much different is how you're attacking marketing and innovation today versus even a few years ago when you were still operating as a private company?\n\nDylan Lissette -- Chief Executive Officer\n\nYes. Sure. Peter, great question. I honestly would say that I don't think that we're operating much differently today as a public company than we would have been two-plus years ago as a private company.\n\nWhat I will say is that we have a higher drive to create productivity, that productivity and sort of the virtuous cycle of how we operate the company will drive earnings at which we can reinvest and then our target is to reinvest more into areas like marketing and innovation, and that's a sort of virtuous cycle. So I'd say that as a public company, we are more driven toward the productivity, and we're utilizing that productivity to fund more innovation because we historically and have done amazingly well as a 100-year plus company. We have historically spent very little in terms of marketing and media to drive our brands. and we want to look for ways that we can increase that over time.\n\nSo not much difference between public and private, but we're definitely looking forward to being able to spend more on innovation, on pull marketing, branding and all of the things that will drive top line results long term.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nThanks very much, guys. We're looking forward to try the Zapps pretzels.\n\nAjay Kataria -- Chief Financial Officer\n\nGreat. Thank you.\n\nOperator\n\nYour next question comes from the line of Ben Bienvenu with Stephens. Ben, your line is open. Your next question comes from the line of Robert Moskow with Credit Suisse.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nHey, I was just curious if -- in the years that you've been operating the business, have you had moments where you've had to lower list prices because of commodity deflation or competitive intensity in the category? It's a question I get a lot not just your category, but a lot of categories. And I was wondering just a history lesson, if that's something that occurs?\n\nDylan Lissette -- Chief Executive Officer\n\nRobert, great question. The -- I've been at it for 25 years. So I've been through many different economic cycle, and I've basically been involved in sales and marketing, my entire life. And at one point, that was my job to do all of the pricing.\n\nSo I've got a real history in this. Typically, I would say that there is a very long evolution of pricing. You do not see a reduction in list price per se, meaning we don't take something that was $1 move it to $1.10 and then a year or two later, move it to $1. What you do see is a movement in the migration in the depth and the frequency of your promotional activity over time and on a very longer time frame, you then see sort of the reintroduction of different PPGs or price pack groups where something may sort of go down in size over a couple of years and then the commodity seeing changes in companies are competitive and then five or six years out, there's a new size introduction of a value pack or something else.\n\nAnd that's been going on much longer than I've been at us at least in the salty snack category. It's very competitive. We all want to be competitive. We want to reward our customers.\n\nWe want to work with our retail partners to drive their category growth as well as our growth -- and so it's a very long-term process that typically does not to answer your question succinctly, does not create a list price reduction that is more of a change in sort of the promotional schematics of how you go to market.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nNot succinctly, but you did answer the question. So thank you for that. Maybe a follow-up here. You're pushing for more distribution with these big national customers, is part of the sale that you are providing lower-priced alternatives for consumers in certain subcategories.\n\nAnd how is that resonating with retailers, if true?\n\nDylan Lissette -- Chief Executive Officer\n\nYes. No, not at all. We've never positioned ourselves as a lower price alternative to any of the more national brands. We are in a very -- what we consider to be a fantastic category, salty snacks, grows 3%, 4%.\n\nI mean the fact that we're looking at markets, and I think one of the earlier gentleman asked me Jason asked me about salty snack sales. I mean we're looking at markets that are up 15% salty snacks. And it's a fantastic category. We are offering to a retailer, an alternative in terms of a unique brand and a unique quality.\n\nSo if you look at OTB, is top-notch quality, it's been around for 25 years. It's grown significantly. It's an alternative to the national brands that we're offering. Zapp is a fantastic frame we bought in 2011 and have only grown every single year since we acquired it and brought it to a much more national size.\n\nThe Utz brand itself, 100 years into it producing double digit, 20%, 30% growth, where an alternative because of the uniqueness of the quality and uniqueness of the brand. And I think just like there's 10 different major car manufacturers and brands there's room in our category for brands like ours that have a unique route to market, a unique legacy and unique history to really continue to take that white space that we talked about in our summary page about geographic channel growth, subcategory growth, etc.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nGot it. All right. Thank you very much.\n\nOperator\n\nYour next question comes from the line of Rupesh Parikh with Oppenheimer.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood morning. Thanks for taking my question. So I just wanted to touch on performance by channel. So just given some of the changes out there in the consumerdynamics.\n\nI was just curious if you guys are seeing any shifts of note by channel?\n\nDylan Lissette -- Chief Executive Officer\n\nNo, not really. I mean, our food channel is very fantastic. It'd be interesting to see what happens in the second half of the year where the consumer goes to will they move more toward mass and club for value or size pack or larger-size packs. Right now, our convenience is really doing well.\n\nWe continue to see great results in convenience. So across the different channels, we are seeing a good result and the category itself is, of course, strong almost across every single channel as well.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nOK. Great. And then maybe just one follow-up question. I know there's been a number of questions on the call to sign cost pressures.\n\nBut just based on your current visibility, as you guys look toward 2023, would you expect relief on the cost side? Or just any thoughts at this point where your forward outlook could look like next year?\n\nAjay Kataria -- Chief Financial Officer\n\nThis is Ajay. That's a good question. And I think the simple thing to note here is costs have stepped down in the last couple of months from all-time highs, but they're still pretty elevated. So we do expect that inflation is going to continue into 2023.\n\nIt's going to take some time for costs to come back down to pre-COVID levels, which is when this cycle started. So let's see what '23 looks like, but there will be inflation there.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nOK. Great. And then maybe just one housekeeping question. On the interest expense line, would you expect to step up for the next few quarters just on your variable rate debt?\n\nAjay Kataria -- Chief Financial Officer\n\nWe don't because two-thirds of our debt is locked at 1.9% LIBOR. So I think we are at a good level that we saw in second quarter for interest.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nOK. Great. Thank you.\n\nDylan Lissette -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Mitch Pinheiro with Sturdivant and Company.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nGood morning. Most of my questions have been asked. I do have just just a quickie for the back half here. So it looks like we're looking for say, 7% type of sales growth in the back half.\n\nYou have about -- if you have double-digit pricing, obviously, that implies a 3% or 4% volume decline. Is that math -- is my math correct there?\n\nAjay Kataria -- Chief Financial Officer\n\nYes. I think that's good math.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. And does does the volume decline have any impact on your fixed cost efficiencies in your plants? I mean, are we going to -- is it a margin pressure? Or is it offset by your SKU rationalization and some of the inefficiencies of some of these SKUs being rationalized out will offset that fixed cost leverage issue?\n\nAjay Kataria -- Chief Financial Officer\n\nSo we have modeled all that in. But the way I would describe that is we are doing. We are working both sides of that equation as volume comes out, private label, et cetera, that we start reducing deleverage. But then we start producing power brands.\n\nSo there is -- the mix is optimized and margin is optimized. Those two things offset each other. So we have sort of modeled that out. We are in-sourcing on the border, that is a higher-margin product than private label, etc.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. And then one last question, just sort of on the back-to-school season. Anything different this year versus last year?\n\nDylan Lissette -- Chief Executive Officer\n\nYes. I don't really -- I mean, we obviously have -- 2022 is different than 2020/2021. We were still dealing a little bit in late 2021 with some of the sort of ancillary effects of COVID and different dynamics. We referred to it in our script and our notes as well about really seeing a holiday resurgence of especially Halloween and some of the more call it oriented products that we're putting out there.\n\nA lot of that is because our a, our supply chain is better this year than it was last year. In some of just those ancillary dynamics around things like Halloween and COVID in late 2021. The buyers from our customers have really rebounded and put in advanced orders for higher audits. So we look for back-to-school holidays, Halloween to all be more robust than last year.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nYour next question comes from the line of Ben Bienvenu with Stephens.\n\nJim Salera -- Stephens, Inc. -- Analyst\n\nHey, guys. Jim Salera on for Ben. Are you able to hear me?\n\nDylan Lissette -- Chief Executive Officer\n\nYes.\n\nJim Salera -- Stephens, Inc. -- Analyst\n\nPerfect. I had a little difficulty before. I wanted to ask a two-part question on sales. First of all, if you look at -- you guys talked about volume decline in the back half but we would look at salty snacks as already being kind of a trade down indulgent category.\n\nWhere does the consumer have to go below you guys given that salty snacks are already in indulgent and you've already mentioned there's very low private label penetration. What does that look like from the consumer perspective? Where do they go?\n\nDylan Lissette -- Chief Executive Officer\n\nInteresting question. So we do think that we are very recession-resistant as a category, salty snacks. To your point, we have very low private label penetration. It is probably one of the least expensive high reward products that you can buy in terms of a salty snack, a bag of chips or a bag of TORTIYAHS or something.\n\nI think as people make their decisions around what they're going to buy. That is probably -- salty snacks is probably one of the least affected. I think I read recently something where household cleaning household goods are one of the areas at which people don't buy as much of when they're making their decision in salty snacks and food in general and beverage are areas that they go to. So I think we are in a pretty good spot as an industry as we've seen over at least the decades I've been here.\n\nJim Salera -- Stephens, Inc. -- Analyst\n\nOK. Great. And then second part on that, obviously, you guys have a big win with public -- in terms of just your available capacity, if you were to get -- I know there's not many public out there, but if you were able to get a bigger regional chain like an HEB in Texas or something like that, how long would it take for you guys to be able to ramp up on that? Or what's your available capacity to support getting another big distribution gain?\n\nCary Devore -- Executive Vice President and Chief Operating Officer\n\nYes, we have the capacity -- this is Cary. Great question. We have capacity to take on additional distribution. It's a key part of growth opportunity that we're executing on.\n\nKings Mountain is a big part of that, and which is why we did that plant acquisition. That will be our -- when it's done, the highest volume, most efficient plant we have. So Kings will bring on a significant amount of capacity. We have flexibility between the different plants we have today to make many different things in many different places, and we can use co-man partners to the extent we need to supplement demand in specific product subcategories.\n\nSo it all depends on what product subcut you're talking about. But we don't see any issues and being able to bring on new distribution and support it.\n\nJim Salera -- Stephens, Inc. -- Analyst\n\nPerfect. Thanks, guys.\n\nOperator\n\nAnd at this time, there are no further questions. I'll now turn the call over to Dylan Lissette, CEO, for any closing remarks.\n\nDylan Lissette -- Chief Executive Officer\n\nThank you again for joining us today on our second quarter earnings call. I'm extremely proud of all of our associates with the collective actions that have helped to deliver such continued positive momentum for the company. We appreciate your continued support as we approach the second anniversary of going public later this month, and I thank you again for your time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKevin Powers -- Senior Vice President, Investor Relations\n\nDylan Lissette -- Chief Executive Officer\n\nAjay Kataria -- Chief Financial Officer\n\nUnknown speaker\n\nJason English -- Goldman Sachs -- Analyst\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nCary Devore -- Executive Vice President and Chief Operating Officer\n\nBill Chappell -- Truist Securities -- Analyst\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nJim Salera -- Stephens, Inc. -- Analyst\n\nMore UTZ analysis\n\nAll earnings call transcripts"
}