{
  "companyName": "Palantir Technologies Inc.",
  "companyTicker": "PLTR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/palantir-technologies-inc-pltr-q3-2022-earnings-ca/",
  "content": "Palantir Technologies Inc. (PLTR 0.31%)\nQ3 2022 Earnings Call\nNov 07, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. Welcome to Palantir's third-quarter 2022 earnings call. We'll be discussing the results announced in our press release issued prior to the market open and posted on our Investor Relations website. During the call, we will make statements regarding our business that may be considered forward looking within applicable securities laws, including statements regarding our third quarter and fiscal 2022 results, management's expectations for our future financial and operational performance, and other statements regarding our plans, prospects, and expectations.\n\nThese statements are not promises or guarantees and are subject to risks and uncertainties which could cause them to differ materially from actual results. Information concerning those risks is available in our earnings press release distributed prior to market open today and in our SEC filings. We undertake no obligation to update forward-looking statements except as required by law. Further, during the course of today's call, we will refer to certain adjusted financial measures.\n\nThese non-GAAP financial measures should be considered in addition to, not as a substitute for or in isolation from, GAAP measures. Additional information about these non-GAAP measures, including reconciliation of non-GAAP to comparable GAAP measures, is included in our press release and investor presentation provided today. Our press release, investor presentation, and SEC filings are available on our Investor Relations website at investors.palantir.com. Over the course of the call, we will refer to various growth rates when discussing our business.\n\nThese rates reflect year-over-year comparisons unless otherwise stated. Joining me on today's call are Alex Karp, chief executive officer; Shyam Sankar, chief operating officer; Dave Glazer, chief financial officer; Ryan Taylor, chief business affairs and legal officer; and Kevin Kawasaki, global head of business development. To begin today's call, we'll open with a few highlights from FoundryCon, where you'll hear from Alex, as well as representatives from Jacobs, Tyson Foods, Lilium, Apache, Swiss Re, and Space Systems Command.[Commercial break]\n\nI'll now turn the call over to Ryan.\n\nRyan Taylor -- Head of Investor Relations\n\nWe generated 478 million in revenue this past quarter and 37 million in adjusted free cash flow, marking our eighth consecutive quarter of positive adjusted free cash flow. Despite significant geopolitical and macroeconomic uncertainty, our government business surpassed the 1 billion revenue mark on a trailing 12-month basis, and our U.S. commercial business grew for the ninth quarter in a row, raising 53% year over year. The number of customers using our software, including leading commercial and government enterprises in the U.S.\n\nand overseas, also increased substantially this past quarter, rising 66% from this time last year. We increased our U.S. commercial customer count to 132 at the end of Q3, a 124% increase year over year. Our expanded footprint within the market is a reflection of our ability to both reach additional customers and grow existing relationships.\n\nIn particular, we closed 273 deals this past quarter, representing an increase of 63% year over year. Nineteen of those deals were at least $10 million in total contract value. Thirty-two were at least 5 million, and 78 were at least 1 million. We have come as far as we have by consistently engaging with some of the hardest problems that the world and our customers have faced since our founding.\n\nFor example, our work in supply chains, which is increasingly scaling into ecosystems, is powered by Foundry's data integration capabilities. This year alone, we have started 25 supply chain projects. This includes the expansion of our work in shipbuilding at Hyundai Heavy Industries, bringing the partnership to over 45 million, and the expansion of our work with the FDA to modernize food supply resilience to preclude shortages like the one we experienced with infant formula earlier this year. The total value of contracts that we have closed in the third quarter reached 1.3 billion, a new milestone for us, which includes nearly $1 billion of contract awards from the U.S.\n\ngovernment alone, such as our most recent contract worth up to 229 million with the U.S. Army Research Lab to deliver AI/ML capabilities across the DOD. We recognize that our path to growth is not always linear, but with the opportunity that lies ahead, we continue to recruit and retain the top talent at a time when other companies in the technology sector are slashing their plans and cutting workforces. I'll hand it over to Shyam for further discussion regarding our business and product strategy moving forward.\n\nShyam Sankar -- Chief Operating Officer\n\nThanks, Ryan. We've spent the last two decades building our products for the world in which we actually live. The disruption and uncertainty that we're seeing around us, from Ukraine, the pandemic, and inflation, it's driving customers toward us and to our software. As the world continues to struggle with concurrent supply chain and energy crises, Palantir customers have been able to use Foundry to connect and integrate decision-making within their value chain, from their suppliers to their customers, to instantly trade off possible courses of action.\n\nYou just saw highlights from two flagship events we held in Palo Alto and London for our customers to share their experiences with each other. Customers underscored the significant impact our software is having across industries. Executives at Tyson Foods shared how they generated $200 million of annualized savings in 24 months. Jacobs Engineering shared how our software has reduced energy consumption by one-fifth at its first wastewater plant running on Foundry, with the potential to generate $90 million of annualized savings across their 300 plants.\n\nSwiss Re shared that they saved more than $100 million in the first year of use alone. More than 35% of employees at Swiss Re use our software on a regular basis. Our [Audio gap] moment of macroeconomic uncertainty, that differentiation has never been more valuable to the market than today. These customers consistently focus on our Ontology as the decisive factor in delivering results quickly.\n\nOur strength, particularly in the U.S. commercial market, has also received increasing recognition across the industry. Gartner ranked us as a visionary in data integration. IDC ranked Palantir as the number one AI software platform worldwide by 2021 market share and sales, beating Microsoft, IBM, Amazon, and Google.\n\nForrester named Palantir as the leader in artificial intelligence and machine learning platforms. And there is no place where time to kinetic impact is more important than on the battlefield. In the government sector, Gotham has become the choice for U.S. and allied defense organizations around the world.\n\nWe have now officially received DOD IL6 accreditation, a critical milestone for our broader government business, further enabling our SaaS offering on secret networks. And our new Fed [Inaudible] offering builds on Apollo to enable software companies to achieve FedRAMP authorization in record time and at a fraction of the cost. In addition, we had our Titan vehicle on display at the annual AUSA conference, where it was met with positive reactions from the U.S. government, partner nations, and the industrial base.\n\nFrom the kill chain to the supply chain, our products ensure that there are no missing links. I'll turn over to Dave to take us through the financial results from this quarter.\n\nDave Glazer -- Chief Financial Officer\n\nOur U.S. business continues to be the most significant driver of our growth. U.S. revenue grew 31% year over year to 297 million, and on a trailing 12-month basis, U.S.\n\nrevenue grew to 1.11 billion. Our commercial revenue in the United States grew 53% year over year to 88 million. And our core U.S. commercial revenue, which excludes our strategic investment program, grew 47% year over year and 7% sequentially.\n\nU.S. government revenue increased 23% year over year to 209 million. On customer count, our net new U.S. commercial customers grew 124% year over year and 11% quarter over quarter, marking seven consecutive quarters of sequential growth greater than 10%.\n\nTurning to our global top-line results. Third-quarter total revenue grew 22% year over year to 478 million, ahead of our prior guidance, even when factoring in an additional 1.4 million currency headwind since we issued guidance. Overall net dollar retention was 119%, remaining constant quarter over quarter. Commercial revenue increased 17% year over year to 204 million.\n\nOur international commercial business was roughly flat year over year and continues to be affected by both macroeconomic conditions and the strengthening dollar. A number of our customers in the United Kingdom, Europe, and Asia entered into contracts denominated in U.S. dollars, and as a result, the strong dollar has been a significant headwind for them. Government revenue increased 26% year over year to 274 million.\n\nWe saw our government business cross another major milestone this quarter as we generated 1.02 billion on a trailing 12-month basis, surpassing the billion-dollar mark for the first time. Our customer count continues to increase at a significant rate. We added 33 net new customers in the third quarter, bringing our Q3 2022 customer count to 337, a 66% increase year over year and an 11% sequential increase. We added 25 net new commercial customers, which represents 98% growth year over year and 12% quarter over quarter.\n\nOur revenue within our existing customers also continues to expand. Trailing 12-month revenue from our top 20 customers increased 15% year over year to 48 million per customer. Third quarter billings were 509 million, up 47% year over year. In the third quarter, total contract value, or TCV, was 1.3 billion.\n\nU.S. TCV booked was 1.1 billion, 90% of which was attributable to our U.S. government business. The third-quarter TCV figure was driven significantly by renewals and expansions of existing U.S.\n\ngovernment contracts, a portion of which have already been funded to date. For total remaining deal value, we ended the third quarter with 4.1 billion, a 17% increase quarter over quarter. The quarter-over-quarter growth in total remaining deal value was driven by our unusually strong performance in TCV. As I previously mentioned, the TCV of our U.S.\n\ngovernment contracts accounts for both funded and unfunded contract value, and we're seeing this pass through to our total remaining deal value. We saw headwinds to remaining deal value as a result of executing on our previously announced plan to cancel all remaining unfunded strategic investment commitments. We ended the third quarter with 1.3 billion in remaining performance obligations, up 43% year over year. As a reminder, RPO is primarily comprised of our commercial business as it does not take into account contracts with initial term of less than 12 months and contractual obligations that fall beyond termination for convenience clauses, both of which are common in our government business.\n\nTurning to margins and expense. Adjusted gross margin, which excludes stock-based compensation expense, was 80%. Third-quarter adjusted expenses were 397 million, up 9% sequentially. The sequential increase was driven primarily by headcount-related expense as we had 450 net headcount additions in the quarter, our largest hiring quarter of the year, and including 141 new graduates who joined in the quarter.\n\nThird-quarter adjusted income from operations, excluding stock-based compensation and related employer payroll taxes, was 81 million, representing adjusted operating margin of 17%, 600 basis points ahead of our prior guidance. Our adjusted operating margin significantly exceeded our guidance as a result of several factors but primarily driven by cloud and deployment efficiencies, representing around 9 million of outperformance, and the elimination of certain discretionary spend across the business, particularly in G&A, representing approximately $14 million of outperformance. We expect to continue to see efficiencies in the fourth quarter and will remain disciplined in our approach to discretionary spend in this macroeconomic environment. Third-quarter adjusted earnings per share was $0.01, which includes a negative $0.02 impact driven by losses on marketable securities.\n\nWe generated 47 million in cash from operations, and our adjusted free cash flow was 37 million, representing a margin of 10% and 8%, respectively. This marks our eighth consecutive quarter of positive adjusted free cash flow. On a trailing 12-month basis, we generated 231 million in adjusted free cash flow and 238 million in cash flow from operations. We ended the third quarter with 2.4 billion in cash and cash equivalents and no debt.\n\nWe retain access to additional liquidity of up to 950 million through our 500 million revolving credit facility and 450 million delayed draw term loan facility, both of which remain entirely undrawn. Our balance sheet leaves us well positioned to capitalize on opportunities that may arise in the current macro environment. Now turning to our outlook. For the full year 2022, despite a negative 6 million currency impact since our prior quarter's guidance, we are reaffirming our revenue guidance of between 1.9 billion and 1.902 billion.\n\nExcluding such impact, we'd expect full-year 2022 revenue of between 1.906 billion and 1.908 billion. We are raising our outlook for adjusted income from operations for the full year. We now expect adjusted income from operations of between 384 million and 386 million. For the fourth quarter, after factoring in a negative 5 million currency impact since our prior quarter's guidance, we expect revenue of between 503 million and 505 million.\n\nExcluding such impact, we would expect fourth-quarter revenue of between 508 million and 510 million. We expect adjusted income from operations of 78 million to 80 million. With that, I'll turn it over to Ana to start the Q&A.\n\nOperator\n\nThanks, Dave. We'll begin with two questions from our shareholders before we open up the call. Our first question comes from Ryan, who asks, \"Can you speak about the current competitive landscape and elaborate how Palantir products stand out against the newly launched Microsoft data platform, Salesforce Genie, and the Snowflake platform that are attempting to offer an all-in-one solution like Foundry?\n\nRyan Taylor -- Head of Investor Relations\n\nShyam, you want to take this?\n\nShyam Sankar -- Chief Operating Officer\n\nSure. Well -- well, thanks, Ryan. The answer is really the Ontology. It's why our platforms remain far ahead of the competition.\n\nAnd that's because the Ontology, it's the missing link in terms of what you need to realize value from all of these investments. It's the component in the architecture that's required to get data apps to actually deliver value on top of cloud data warehouses, or to get AI to scale throughout the enterprise, or to turn your digital twin into something that's actionable and operational within the enterprise. And we've spent 15 years investing in a road map that's deep and built upon the Ontology, and it continues to be the focus of all the core investments that we're making around product. We're deepening the capability that we're offering our customers here.\n\nAnd that's happening against the backdrop where the competition has yet to understand what the Ontology really is. But they will. And that's really my main conclusion from our FoundryCon events in Palo Alto and London is that our customers were so clearly articulating the role of the Ontology, the value. They credited it as really the decisive factor in delivering results quickly.\n\nAnd there are two things there that should not be taken for granted, results that are quick. And so that's, I think, a key focus here. You -- you heard from Deutsche Telekom. They talked about how they don't even bother connecting to data sources that won't be modeled in the Ontology because they see so much of value in a reduced effort and increased outcome for the use cases that they're able to build on top of the Ontology.\n\nWe heard that from Rio Tinto, where they talked about at the Oyu Tolgoi mine in Mongolia how they actually originally modeled risk in operations. But because they didn't know the Ontology, for free, they got an opportunity data set that helped them drive increased production, which is obviously the front end of the business there. In Palo Alto, we heard from Tyson Food where they were able to use the Ontology to quickly go from an initial use case around COVID response to a set of use cases that got to $10 million of value, then quickly to 40 million, and then finally to $200 million worth of value.\n\nAlex Karp -- Chief Executive Officer\n\nTo -- to -- just a slightly different augmentation of which Shyam was saying that maybe a different rift of -- that, like, underscores, you know, the success of people using our product is people think these products are easy to build. And by the way, and this is whether it was PG; Nexus Peering; GAIA; or Foundry; Foundry 1, data integration; Foundry 2, kind of Ontology decisions driven. You know, a lot of people, even at big, otherwise successful companies, go from PowerPoint to thin technology under the assumption you can just take Ontology, you can spell it slightly differently, you can spell it the same way, and you can impose it on your, honestly, not very strong software offering that was last year's technology with this year's salespeople. And it doesn't work.\n\nThat's why we are powering the USG. That is why we are powering war efforts. That's why Foundry was used in -- it saved probably 500,000 lives in America, mostly people who are from the underclass and would have -- would have died during COVID. It's -- and it's why there are -- we need our competition to explain to the world, OK, you need this.\n\nBut -- but they gravely underestimate the difficulty in doing this. We've been doing this for 15 years. There are thousands of hidden problems that really I don't think any other company understands, whether it's the kill chain, the supply chain. It's like -- and it's wonderful that people are discovering this.\n\nIt's going to take decades to build this stuff. Even if you can build it as well as we can, you have to discover the problems. And that's why our clients, you know, on the Evangelism tour primarily in the US, are galvanizing the market and leading to these results. But -- but the difficulty is just completely underestimated.\n\nOperator\n\nThank you, Shyam and Alex. Our next question comes from Gaurav, who asks, \"What are Palantir's plans to grow the business in this challenging macro environment?\"\n\nAlex Karp -- Chief Executive Officer\n\nI mean, other people should -- we -- we've -- we've been predicting a even more challenging macro environment than this for the last 20 years. I mean, how long have we been in the trenches together?\n\nShyam Sankar -- Chief Operating Officer\n\nSeventeen, yeah.\n\nAlex Karp -- Chief Executive Officer\n\nSeventeen years in the trenches. The products are built for a disjointed world, a world where you need horizontal and vertical integration, where you -- in a military context, or actually, you know, we have low latency, where your systems -- underlying systems actually don't work even though on the PowerPoint they say they do, where you have to deliver results overnight, where your business totally effed and you got to make it work in a quarter. That's what our business is built for. By the way, that's why we -- we prepared and that's the technical thing.\n\nWhy do we have a quarters of free cash flow? Do you think it's a coincidence we were preparing for this? We have -- why do we have $2.4 billion in the bank and no debt? We weren't living in the meta sphere. We were living in this world in the way we thought it would be. And we -- we've been essentially -- you could even look at us as a prep -- we're a prepper company, we've been preparing. It's like -- preppers have their rucksack and the rifle.\n\nWe have PG, GAIA, Foundry, and $2.4 billion in the bank and no debt. That's our company.\n\nOperator\n\nThanks, Alex. Our next question is from Brent with Jefferies. Brent, please turn on your camera and then you'll receive a prompt to unmute your line.\n\nBrent Thill -- Jefferies -- Analyst\n\nMorning. Dr. Karp, on the government business, at the end of the year, you had a -- a bigger aspiration for deals to come into the pipeline. I think you brought that as close assumption down.\n\nI'm curious where you see the pipeline of government transactions for the back half of this year into -- into '23.\n\nAlex Karp -- Chief Executive Officer\n\nIt was a little bit -- OK, that, breaking up, but I think you were saying where do we see the government revenue going. Look, we're -- we're positing to the world purely financially. Palantir has a CAGR of 35% in the USG. It's -- that CAGR includes two years -- I think three years that we're flat.\n\nSo, we tend to have kind of lumpy growth and flatness, which no one likes. You don't like it, we don't like it. We're positing that the future will look more like the traditional baseline of 35% than the baseline of this year of, what, in upper 20s. What is the proof of that? OK, I can tell you how our products are being used on the front line.\n\nYou can read the news. You can probably surmise that things like Nexus Peering, Foundry, GAIA are -- are powering events that you may be reading about. And then, there's our massive TCV. It's like -- it's like, yeah, TCV in the USG is just under $1 billion.\n\nThis is massive. We -- there's a legitimate question, when do you capture that in the form of cap revenue? That's a legitimate question to which we have no answer. But we will capture -- we will capture it because the -- the contracts have been concluded and because we are sitting on the most important missions in the world. And those missions are going to end up being fully funded.\n\nAnd you see that in our contractual relationships.\n\nOperator\n\nThanks, Alex. Our next question is from Mariana with Bank of America. Mariana, please turn on your camera and then you'll receive a prompt to unmute your line.\n\nMariana Perez Mora -- Bank of America Merrill Lynch -- Analyst\n\nMorning, everyone. So, my question is on --\n\nAlex Karp -- Chief Executive Officer\n\nBy the way, we don't see you. Not that that's inherently...\n\nMariana Perez Mora -- Bank of America Merrill Lynch -- Analyst\n\nOh, I don't know how to fix that. Fine, I'll go ahead with the question. \n\nAlex Karp -- Chief Executive Officer\n\nOK.\n\nMariana Perez Mora -- Bank of America Merrill Lynch -- Analyst\n\nSo, with increased expectations for global recession next year, I understand it's probably too early to discuss specifics about 2023 outlook, but would you mind discussing how you're thinking about the positive and negative catalysts from a global recession or a potential recession? Because the -- I think -- the way I think about it is -- is a positive catalyst for disruption and increased needs for operational efficiencies and for Palantir demand, but also, probably lower corporate profits are a challenge. So, how are you thinking about that?\n\nAlex Karp -- Chief Executive Officer\n\nThe -- the -- we disambiguate the world into America, Canada, U.K., and then, what -- what has -- what has historically been a very large market for us, Europe, driven by Germany. What I think you see happening is that disruption is helping us in the U.S. It's driving results that are outsized in U.S. commercial.\n\nOur LTM in the last 12 months is, you know, $327 million, roughly 102% growth. You see the TCV number in USG. You can surmise what that means. So -- and then the positive side of it is that, you know, the integral of U.S.\n\nrevenue for us is growing at 61%, used to be 40 -- 49% two years ago. It will be in the 70% range fairly shortly. And so, the -- the impact of the disruption is much greater and the -- slash the disruptive, negative effect of Europe, especially sluggishness in Europe's motor, Germany, will impact us less. However, what I believe, and other people should talk about, is that we are going to see negative impacts because of strong dollar, because of sluggishness to adopt new technologies in Europe that will impact our business, is impacting our business.\n\nIf you took those results, the LTM for -- for our globe -- for our U.S. business is still just under 40%. If you took out our European market, this would be -- I mean, obviously, results are strong, but they would -- would be flying in like a, you know -- so -- and those are going to impinge on us -- they're going to continue to impinge us. It's just the amount of impinge is going to be less.\n\nI do think it's particularly dangerous for most people in tech. This environment is not an environment where flimsy, thin, nonvaluable -- essentially, you churn your data and you show your PowerPoint to somebody who barely understands it. Technology is going to work just because you've got a great steak dinner and white teeth, that's not going to work. And Americans do expect a lot more than that, both in government and in commercial.\n\nNow, the rest of the world may not expect more than that, and that -- that's a problem for the rest of the world long term and a problem for us in the near term. But -- but, yeah, we see this as a huge opportunity also, both because other people fail and we'll succeed. I don't know what -- what --\n\nShyam Sankar -- Chief Operating Officer\n\nLook, disruption has always been a huge opportunity for us, and I think that's exactly right. And those -- those geographies are where we're focused.\n\nOperator\n\nThank you, Shyam and Alex. Our next question is from Gabriela with Goldman Sachs. Gabriela, please turn on your camera, and then you'll receive a prompt to unmute your line.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nHi, good morning. Thank you. We appreciate the case studies at FoundryCon about the tens of millions of savings that some of your customers are realizing. So, two questions on my end.\n\nOne is, how are you thinking about evolving the pricing model toward value-based pricing? Give us an update on how you're thinking about capturing the upside from value-based pricing while also giving customers flexibility with their initial price points. And then, the second question is forward deployed engineering model, how is that evolving as start supplying lower customer -- lower-commercial-value customers on the ACV side? Does that essentially shift your mix away from the forward-deployed engineering model over time?\n\nAlex Karp -- Chief Executive Officer\n\nAnyone else want to...\n\nShyam Sankar -- Chief Operating Officer\n\nYeah. So, on the pricing side, I mean, value-based pricing is where we started. That's -- that's kind of our -- our jam, so to speak. And I think what we've had to evolve over time is pricing models like usage-based pricing that enable enterprise customers to start on smaller use cases, nibble into it, kind of figure out where it's going to fit in their enterprise, come experientially to realize the power that the Ontology unlocks and then scale that across their operations.\n\nAnd you can kind of see that playing out in the case studies where, you know, Tyson starts with COVID response and then scales to, you know, SNOP plus, plus, plus, you know, so, like from a small use case to the breadth of the enterprise here. And that's -- that's been very helpful for us. And then we have customers who kind of migrate models from usage base to large enterprise contracts as they go. I think really for us has been showing the flexibility to meet the customer where they're at.\n\nIn terms of our forward deployed engineering models, like our -- I really think about that as much more in terms of R&D from our shoes, like, you know, how many people are spending time at the coalface asking the hard question of is my software working. And I don't mean does it work as in, like, is there an OOM, is there a bug. I mean, like, does it effing matter to this institution. And in this time of immense macroeconomic challenge, like, am I saving the institution? Am I doing anything that's going to move the needle, or is my little churning the data just moving deck chairs on the Titanic? And those are the people who actually have that sensibility, and they're the ones who come up with the ideas of what are we going to build next, what can we do now, how do we inflect the product road map so it matters. And so, we're always going to modulate how we deploy those folks between USG, things that are happening in Europe, things that are happening at the front lines of our customers' operations, the engineers looking and seeing what we're doing on in large-scale mining operations in Mongolia as it relates to driving our R&D road map forward.\n\nOperator\n\nThanks, Shyam. Alex, we had a lot of individual investors on the line who submitted questions. Is there anything you'd like to say before we end the call?\n\nAlex Karp -- Chief Executive Officer\n\nYou know, we -- we built this company for really tough times. The times are tough and they're going to get worse. We feel that Palantir -- we know Palantir shines, whether it's in the anti-terror context, the war context, the COVID context, or the U.S. commercial context, when times are bad, that this is a long-term play.\n\nWe are watching the -- our products and how they're absorbed in the market. And -- and I really appreciate your support. You know, our individual investors mean a lot to us and to me. And we are planning to continue to, like, go into battle every day.\n\nWe are living in this world, not in some meta-fake world that, you know, you may enjoy until you wake up and you are poorer, your brain works less well, and you hate your neighbor. We -- we are -- you know, the size and depth and quality of our revenues matter to us and to you. We believe we are making the West a stronger and better country. We see in America an ability to adapt like no other country, to be open to people who present things in the ways that look batshit crazy, and if they work, they don't really care and they give you an ability to buy in.\n\nWe celebrate that. We -- we are enormously proud of our work defending the West, especially the U.S. military and its allies. I wish I could tell you more about what we're doing and how much it's transforming the world to be a better place, how much it scares our adversaries, what we deliver scares our adversaries, how much we were underestimated by our adversaries because of the informational technology and products we've built over decades, the quality of the people we have here, the pain we go through to deliver, and our commitment to win.\n\nOperator\n\nThank you, Alex. That concludes today's call.\n\nDuration: 0 minutes\n\nRyan Taylor -- Head of Investor Relations\n\nShyam Sankar -- Chief Operating Officer\n\nDave Glazer -- Chief Financial Officer\n\nAlex Karp -- Chief Executive Officer\n\nBrent Thill -- Jefferies -- Analyst\n\nMariana Perez Mora -- Bank of America Merrill Lynch -- Analyst\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nMore PLTR analysis\n\nAll earnings call transcripts"
}