{
  "companyName": "Spectrum Pharmaceuticals",
  "companyTicker": "SPPI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/spectrum-pharmaceuticals-sppi-q2-2022-earnings-cal/",
  "content": "Spectrum Pharmaceuticals (SPPI -0.97%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Spectrum Pharmaceuticals 2Q 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question and answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Michael Grabow, senior vice president of corporate strategy and operations. Please go ahead.\n\nMichael Grabow -- Senior Vice President of Corporate Strategy and Operations\n\nThank you, operator. Good morning to everyone. Thank you for joining us today for Spectrum Pharmaceuticals' second quarter 2022 financial results conference call. Our second quarter financial results press release was sent out earlier this morning and are available on our website at www.sppirx.com.\n\nJoining me on the call today from Spectrum Pharmaceuticals will be Tom Riga, president and CEO; Dr. Francois Lebel, chief medical officer; and Nora Brennan, chief financial officer. Before we get started, I would like to reference the notice regarding forward-looking statements included in today's press release. This notice emphasizes the major uncertainties and risks inherent in the forward-looking statements that we will make this morning.\n\nThese statements are not guarantees of future performance and undue reliance should not be placed on them. These forward-looking statements necessarily involve known and unknown risks and uncertainties, which may cause the actual performance of financial results and future periods to differ materially from any projections of future performance, or results, expressed or implied by such forward-looking statements. With that, let me turn the call over to Tom Riga, CEO of Spectrum.\n\nTom Riga -- President and Chief Executive Officer\n\nGood morning and thank you for joining us on the call today. This is a pivotal time for Spectrum as we work toward FDA approvals in the coming months for our late-stage assets Poziotinib and Eflapegrastim. Both of which are under active review at the agency. Since the beginning of the year, we have continued to focus on the following three key business objectives.\n\nOne, gaining FDA approvals and further advancing our two late-stage assets, two, reducing our operating cash burn, and three, ensuring we are prepared to successfully launch both products. Let me provide highlights starting with Eflapegrastim. Our BLA is under active review with the FDA with a producer date of September 9th, less than a month from today. The preapproval inspection of Hanmi's drug substance manufacturing facility in South Korea has been conducted by the FDA.\n\nAs I've stated previously, this inspection was a critical step for our approval. The preapproval inspection was completed in early July with a comprehensive examination of GMP practices, quality management system, manufacturing processes, and overall state of process control. The inspection resulted in two observations which were resolved. We have subsequently had labeling discussions with the FDA and await the final regulatory action.\n\nWe appreciate the diligent effort that the FDA is making in their review process, and we look forward to their final decision. Let me shift to Poziotinib. Our NDA is under active review and the agency has set a producer date of November 24, 2022, with an initial indication for the treatment of patients with previously treated, locally advanced, or metastatic non-small cell lung cancer harboring HER2 exon 20 insertion mutations. This product is a fast-track designation and is on an accelerated approval pathway.\n\nIn the second quarter, we advanced the global confirmatory study in support of our application. This is an important and required step in the approval process. We are actively preparing for the upcoming ODAC meeting. That will include a discussion of the Poziotinib data package that supports the NDA.\n\nWe anticipate that the ODAC discussion will be centered around the overall risk-benefit, dosing, the clinical relevance of the NDA, the data in the NDA package, and the context in the current treatment landscape. We look forward to the opportunity to highlight the role that Poziotinib can play in addressing an important unmet medical need. The ODAC meeting is scheduled for September 22nd, and we will share additional information regarding the Poziotinib discussion when it becomes available. In anticipation of two FDA approval later this year.\n\nWe have kicked off our commercial readiness efforts in our enthusiasm to enter these markets is high. Our commercial leadership infrastructure is in place and we are ready to engage key customers through purchasing organizations, specialty pharmacies, and third-party payers to ensure we optimize the launch trajectory. We are ready to launch both Eflapegrastim and Poziotinib upon their respective approvals with a fully integrated commercial infrastructure. This includes sales, access and reimbursement, marketing, commercial operations, and medical affairs.\n\nWe will launch both products with one sales force and believe we have the resources needed to successfully achieve our goals. We have been strategic in our approach with FTEs and have built a scalable infrastructure that is now in the process of expanding to support our commercialization efforts. Moving to our operations. We have made a concerted effort to minimize our operating cash burn while optimizing our investments in late-stage assets.\n\nAs you will see in the second quarter financials, we are holding ourselves accountable for reducing the cash burn of the organization. While there will be an increase in SG&A and expenses post product approvals, you can expect to continue to see financial discipline as we become a lean, effective and successful company. In May, we announced the appointment of Ms. Nora Brennan as the new CFO in Spectrum.\n\nThis is Nora's first time on our call and she will be reviewing the financial highlights. After Dr. Lebel's prepared remarks. In a short period of time, Nora's impact on the organization is already being felt.\n\nHer deep knowledge of the company as the previous audit chair to the board of directors and her familiarity with the team has allowed her to hit the ground running in her new role. With that, I will now turn the call over to Dr. Lebel for a more detailed update on our clinical development progress.\n\nFrancois Lebel -- Chief Medical Officer\n\nGood morning, everyone. I'm glad to be with you on today's call and pleased to report on our latest achievements. The Poziotinib NDA is currently under active review at the FDA. This is a major step toward advancing the treatment of non-small cell lung cancer patients with referred to exon 20 mutation.\n\nThe finding is based on our positive data from Cohort 2 of this ZENITH20 clinical trial. The R&D team is actively supporting the FDA review, preparing for the ODAC meeting, and advancing the PMR. These are major undertakings and we have strong internal and external teams that are fully engaged in bringing a successful outcome. We intend to confirm that Pozi is a safe and effective treatment for a patient population with a clear unmet medical need.\n\nWe have generated extensive exposure-response data that confirms our dosing at 16 milligrams per day as an effective starting dose. The adverse event profile is familiar to lung cancer specialists with extensive experience with TKI class side effects. Lung cancer patients harboring HER2 exon 20 insertion have limited treatment options and Pozi would be a welcome addition to the treatment landscape. Our randomized confirmatory study is underway.\n\nWe have leveraged our team with the extensive experience of PPD, one of the largest international CROs to conduct the study in as many as 20 countries targeting up to 150 sites. I just returned from the World Lung Cancer Meeting where we had multiple interactions with highly interested international investigators. We look forward to continuing our active engagement with investigators at the ESMO upcoming meeting, study 301 or PINNACLE is designed to enroll 268 patients with previously treated non-small cell lung cancer harboring HER2 exon 20 mutations. Patients are being randomized two to one into this global multicenter study to receive 8 milligrams of Pozi administered BID versus 75 milligrams per meter square of docetaxel administered IV every three weeks.\n\nThe patient will be evaluated at week six and every six weeks thereafter. Following progression on docetaxel patient will be allowed to cross over to the Pozi arm. The primary endpoint is progression-free survival with OS, ORR, duration of response, and disease control rate and safety as secondary objectives. This design will provide a power of 95% to test the hypothesis that Pozi is superior to docetaxel for the algebraic ratio of equal or smaller than 0.58 using two-sided log ram sets.\n\nSeparately, I would like to highlight that our Poziotinib clinical program has now achieved two positive Cohorts in first-line and second-line HER2 exon 20 mutated lung cancer, a rare disease. We now have the largest data set for HER2 exon 20 insertions in patients and have well-characterized the safety profile of Pozi. We will be presenting new data at ESMO 2022 being held in September in Paris. The data shows a high level of activity for Pozi in patients with a G778-P780 duplication mutation, the second most prevalent mutation in HER2 exon 20 non-small cell lung cancer.\n\nMore to come on this so stay tuned. As you can see, we continue to make solid progress on our two late-stage development programs and regulatory strategy. We will keep you posted as we achieve additional key milestones. I will now turn the call to Nora to review our financials for the quarter call.\n\nNora Brennan -- Chief Financial Officer\n\nThank you, Francois. And thank you, Tom, for your kind introduction. I'm truly excited to be a member of Spectrum's leadership team. For the second quarter of 2022, total research and development expenses were $16 million, as compared to $29.1 million in the same period in 2021.\n\nThe decrease of $13.1 million is primarily related to deprioritized programs, streamlined spending on both Efla and Pozi, and a decrease in personnel expenses due to the strategic restructuring. Selling general and administrative expenses were $9.4 million in the quarter, compared to $15 million during the same period in 2021. The decrease of $5.6 million was primarily due to a decrease in employee compensation, benefits, and other headcount-related expenses. The net loss in the quarter was $29 million from continuing operations or $0.17 per share, compared to a net loss of $49.9 million or $0.32 per share in the comparable period in 2021.\n\nOperating cash burn was approximately $23.4 million in Q2, as compared to $29.7 million in the same period last year. The decrease was due to reduced overall expenses. This is part of our ongoing strategic leverage to reduce the overall cash burn of the company while optimizing our investments in late-stage assets. We ended the second quarter with approximately $68 million in cash plus marketable securities, which extends the company's runway into 2023.\n\nThat concludes our prepared remarks and I'd like to open the call for questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from Maury Raycroft with Jefferies. Your line is now open.\n\nUnknown speaker\n\nHi. This is --\n\nNora Brennan -- Chief Financial Officer\n\nGood morning.\n\nUnknown speaker\n\nHi. It's actually -- it's Kevin on for Maury. Yeah. Congrats on the update today, and thanks for taking our questions.\n\nSo just with starting with Pozi, you said the ad com would focus on a number of topics, including dosing. I guess just for the 8 milligrams, BID dosing, can you speak to the totality of data you've gathered there in Cohort 5? And are you proactively sharing that with the FDA and/or have they requested it?\n\nTom Riga -- President and Chief Executive Officer\n\nYeah. Thanks, Kevin for the question. Francois do you want to handle that one?\n\nFrancois Lebel -- Chief Medical Officer\n\nSure. So, as a reminder, we did file on the basis of Cohort 2, which was 60 milligrams QD. Having said that though, we have shared all the data that we had essentially up to May of this year with the agency and have had a number of discussions as to the attributes of the BID dosing versus QD. So I think the FDA has a full view of what we have, we have conducted also extensive modeling of exposure-response, which the FDA also has.\n\nAnd that discussion continues and we suspect that -- we don't know for sure, but we expect that that topic will come up during ODAC and we're fully prepared to address any further questions.\n\nUnknown speaker\n\nOK, thank you Francois, and then just for the confirmatory Phase III, can you just talk about what your latest thoughts are on what the docetaxel arm might do, I know there are some other Phase IIIs set to read out soon using this as a control arm in lung cancer? And then, what sort of PFS difference with Pozi would you consider to be a success in this trial?\n\nTom Riga -- President and Chief Executive Officer\n\nSo, I'm not sure what the -- the first part of your question was what regarding the control arm?\n\nUnknown speaker\n\nJust what the control arm might do in terms of PFS, what are your expectations, I guess, based on recent or historical data?\n\nTom Riga -- President and Chief Executive Officer\n\nRight, so I mean, the largest study randomized in [Inaudible] I think talks about a PFS of the order of 3 months to 3.5 months and we expect the PFS with our dosing to potentially nearly double that. But obviously, you have to do the study fully randomized to see the results, but that's the expectation.\n\nUnknown speaker\n\nOK. Great. Thanks and sorry, just the last one on Efla. Congrats on getting the reinspection done.\n\nCan you just say if there are any other gating factors that remain prior to the PDUFA date next month?\n\nTom Riga -- President and Chief Executive Officer\n\nYeah, Kevin, obviously the last gating factor is FDA holds the final decision. But from our perspective, the inspection has been closed. All documentation has been provided. We've had subsequent and active discussions on labeling.\n\nAnd there are no outstanding issues from our standpoint, and we know it today, and we're looking forward to the action date on September ninth.\n\nUnknown speaker\n\nGreat. Thanks, Tom. I'll hop back in the queue. Thank you.\n\nTom Riga -- President and Chief Executive Officer\n\nAppreciate it.\n\nOperator\n\n[Operator instructions] The next question comes from Ed White with H.C.  Wainwright. Your line is now open.\n\nTom Riga -- President and Chief Executive Officer\n\nHey, Ed.\n\nEd White -- H.C. Wainwright -- Analyst\n\nHey, Tom. Good morning. So just a couple of questions perhaps on the two potential launches that you have upcoming. You gave us a little comment on the sales force leadership going in, I just wanted to ask about how we should be thinking about the ramp up for SG&A and expenses into the second half of the year as you build up the field sales force team.\n\nWell, maybe I'll just stop there and ask the next question later.\n\nTom Riga -- President and Chief Executive Officer\n\nYeah. So and we're actually here in Boston and the commercial leadership team has spent their time deep in preparation and enthusiasm was really, really excellent and -- our expectation is day one the commercial leadership team is in place. They're strategically located around the country. Their day one plan has been set.\n\nWe've also begun the expansion of the front-line salespeople. The plan there would be an incremental 25 FTEs taking their total commercial infrastructure to 40. That obviously won't happen overnight. But we've had time and I've done a lot of extensive work in strategic geographies around the country to identify those folks.\n\nSo as it relates to your question of SG&A and overall cash burn, I think -- the way I would be thinking about this is if you look at our historical performance, I think it's in line with what we've guided toward. We had a strategic focus to reduce the operating cash burn of the company by 20% to 25% is what we said in January. I think you see this quarter we have delivered on that. If you look at the line items for R&D, I would expect that to be pretty stable moving forward.\n\nI think you'd see a modest increase in SG&A and especially during that launch timeframe. But I fully anticipate our mantra is going to be a disciplined and lean organization that enables us to achieve our goals. So I would look at this quarter and I would put some modest increases for SG&A during the launch period.\n\nEd White -- H.C. Wainwright -- Analyst\n\nOK. Thanks, Tom. And then, perhaps if you can just give us your thoughts on the G-CSF market. I know it's been changing since you first filed for approval.\n\nSo how are -- what are your thoughts on the market as we head into the launch?\n\nTom Riga -- President and Chief Executive Officer\n\nI was thrilled to enter this market. We still see it as a $2 billion market. We have no delusions of how competitive it will be, and we think we're uniquely qualified to do it, both based on FTE know-how, and experience, as well as we have a novel asset that we think will bring a unique proposition to the market. I think to your question, the most recent data actually increases our enthusiasm because the share of the on-pro device, which is a bit different in its delivery mechanism, has come down by over 20% over the last three quarters.\n\nAnd I look at that as opportunities for the prefilled syringe business, which we will have. And I think having a unique product will enable us to compete with the innovator, with the on-pro, with the Biosimilars. And we will go at this market assertively in each of the core segments. We've taken the time to study the real drivers of the business in each of the key segments, as well as the key stakeholders.\n\nAnd after spending time with our commercial leadership team, I think I'm more confident in their ability to execute.\n\nEd White -- H.C. Wainwright -- Analyst\n\nThanks, Tom. And now, if I could move over to a couple of Pozi questions. If you get approval by the PDUFA date, you'll be launching into a holiday season. How should we be thinking about 2022 sales versus 2023? Are you expecting a sort of slow ramp as you launch into the holiday season, and then expect an uptick at the beginning of 2023, just how should we be thinking about that? And then the other question is just your thoughts on the European outlook for Pozi, what's the potential there and your strategy? Thanks.\n\nTom Riga -- President and Chief Executive Officer\n\nYeah. So let me take those one at a time. So the holiday outlook for launching -- I think your question was with Pozi that's a small molecule. So getting through our channel is much faster than that of a biologic.\n\nWe will be out in force, but inevitably the time between Thanksgiving and Christmas is always a difficult time. So and I think the ramp of a rare mutated lung cancer product, there is a slower ramp with a therapy -- with a therapeutic that's focused on a very niche population. So I would anticipate that ramp to be slower, especially during the down period of the holiday season. But we will be out in force in launching that product if it gets approved on the 24th.\n\nAs it relates to Efla, I think that one, assuming an approval or an action date that's positive on the 9th of September, then you would have the cycle time of call it 5 to 8 weeks for the drug to get in the channel. We would be out on day one with our team, working with key stakeholders, working with contracts, and engaging key customers. But the actual launch of the product would be aimed in the October timeframe and that would be a bit more clear of a situation depending on when the product becomes available to the channel. I think your other question, Ed, is around Europe.\n\nSo Europe for Poziotinib, just by way of reminder, we have rights -- worldwide rights, less China and Korea for the asset. We've had initial discussions outside the US, specifically in Japan, given the prevalence of the mutation in that particular population. Our focus today is about ODAC prep and gaining initial approval in the US as a primary strategy. But we do see a vehicle for areas outside the US that would become more of a business development opportunity.\n\nIf you're asking about -- very specifically, I think that conversation post-approval would need to be had, assuming it's an accelerated approval in the US to see what the receptivity is there for Europe. And we largely think that it's an opportunity for licensing post-approval. So our first mission here is to prepare for ODAC, gain US approval and then capitalize on the other territories through the lens of business development.\n\nEd White -- H.C. Wainwright -- Analyst\n\nOK. Thanks, Tom, for taking my questions.\n\nTom Riga -- President and Chief Executive Officer\n\nAnytime.\n\nOperator\n\n[Operator instructions] Our next question comes from Reni Benjamin with JMP Securities. Your line is now open.\n\nReni Benjamin -- JMP Securities -- Analyst\n\nHey, Tom and gang. Thanks for taking the question --\n\nTom Riga -- President and Chief Executive Officer\n\nHey, Ren.\n\nReni Benjamin -- JMP Securities -- Analyst\n\nAnd congrats on the completion of the FDA inspection. I'd love to get maybe just some more color on that inspection. I know you mentioned that there were two observations there. They're now solved or they're no longer issues.\n\nCan you just give us a sense, have you gotten, since you've already gotten into the labeling discussions? It seems like that is the last step. Seems like all the boxes have been checked and almost -- I hate to say it is a formality but is it kind of my senses that it almost seems like it's a foregone conclusion that approval is coming? Is there anything that's remaining, with the review outside of continued labeling discussions? And did you get feedback that the inspection is like 100% down? Like, that's that like that said, everything is all the issues have been resolved.\n\nTom Riga -- President and Chief Executive Officer\n\nYeah. So let me address this one at a time. So I'm much more conservative. I don't think anything about the formalities.\n\nAlthough I appreciate that you're confident. I think ultimately the ninth is the key date. But as it relates to the inspection, there were two observations that were addressed with the inspector on-site. In the example of those observations, there was one temperature mapping that needed to be done.\n\nAnd in one of the storage areas, there was an in-process labeling procedure that needed to be updated. So from our perspective, relatively minor. After a full comprehensive inspection, we provided the data both at the end of the inspection and then subsequently in writing to FDA. So from that standpoint, there's been no additional conversation at FDA, always have the right to come back and ask questions should they want.\n\nI don't think there's going to be something that says absolutely final until you gain the approval. The labeling discussions from our perspective, we believe, have been comprehensive, but the agency can come back and have discussions if they like. So we're obviously optimistic, but I call it kind of cautiously optimistic right up until the point I see that approval in hand.\n\nReni Benjamin -- JMP Securities -- Analyst\n\nGot it. All right. Thanks for that color. And then just kind of building on Ed's question, putting in a sense of the current market dynamics, you're a month away, you're going to hit the ground running, pretty much on day one.\n\nCan you just review for us kind of what does this current $2 billion market look like? And where do you initially start to gain market share? And then ultimately, let's say, a year or three years from now, where do you continue to gain market share? And I guess where [Inaudible] internally, how are you viewing like your peak opportunity?\n\nTom Riga -- President and Chief Executive Officer\n\nYeah. So let me try -- let me see if I can offer some assistance. And you tell me if you need more. So the way we think about this is there are about 1.1 million units of long-acting G-CSF that are administered in the United States every year.\n\nWe break that out into three specific classes of trade, there are clinics, there are non-340B, and 340 B hospitals. So we've spent a lot of time both on the experience and customer know-how from the leadership team that we've got. But equally as important, spending time qualitatively and quantitatively to really understand what drives the decision. Because any time you enter a competitive market and things are relatively equal on the surface, you ask yourself what ultimately drives the decision.\n\nAnd as it turns out, there are differences in what ultimately drives decisions in each of those classes of trade. So we've spent time understanding where our product offering is in totality, it resonates with the decision drivers of each of those classes of trade, and that's going to ultimately garner the beginnings of our strategy. So as it relates to share and how we calculate P, we haven't really gotten into that publicly and I won't here today. But when we take a look at what's ultimately driving decisions in this marketplace today, there are a lot of stakeholders and it's relatively complex.\n\nAny time you have a market of this size with this number of competitors, I think details matter and I think the team has done a thorough job in their assessment. So what I've reviewed this week is both the specific -- not only the specific doors that we're going to walk in, the specific customers that ultimately drive those decisions, and how we intend to engage them. And I think the team has put together a pretty comprehensive plan that we look forward to competing with.\n\nReni Benjamin -- JMP Securities -- Analyst\n\nGot it.\n\nTom Riga -- President and Chief Executive Officer\n\nI hope that's helpful. I know, I didn't answer your question on peak share and peak sales but hopefully, that gives you some insight.\n\nReni Benjamin -- JMP Securities -- Analyst\n\nNo, no, it definitely does. Just maybe some housekeeping ones. Can you just remind us, what's the patent expiration for Efla? How are you thinking about pricing? And then, how should we think about any sort of growth from that sort of adjustment?\n\nTom Riga -- President and Chief Executive Officer\n\nSo the patent for Efla goes well into the 30s. So that's, I think it's north of 35 is where that goes. There are some extensions that are available to us. So the way we think about this is there is the initial approval phase that we will launch the product, and I think the pricing dynamics in the market, I think that's publicly, we have not made public our strategy.\n\nWe'll do that upon approval if we're so fortunate. But as we think about the trajectory and lifecycle of the asset, we are going to develop and try to find the ultimately the clinical answer around same-day dosing because we do see -- we saw the initial signal in a relatively small number of patients. We intend to expand that cohort and see if that signal remains. And we think that could be a long-term differentiating attribute of the asset that will certainly help through the balance of the IP.\n\nSo we have both a near-term plan that I think is very specific at this point to commercialize out of the gate with the non-inferiority label that we expect if we should be approved. And then a lifecycle management plan that will put us in a position to optimize the duration and lifecycle of the asset.\n\nReni Benjamin -- JMP Securities -- Analyst\n\nGot it. OK. And then another one, just a clarifying point again off of Ed's question regarding the ex-US kind of opportunity. And of course, the funding the company going forward.\n\nCan you kind of give us an update as to how, or if like BD discussions are ongoing and how you're thinking about monetizing the opportunity for both Efla and/or Pozi, in regions where you just you're not interested in and don't have the bandwidth for?\n\nTom Riga -- President and Chief Executive Officer\n\nYeah. So business development is -- that's in our fabric. So it's always a topic in our company. And I think there are a number of areas where those conversations are active and ongoing today.\n\nBut as it relates to licensing of non-US territories, I think the answer is different depending on the asset. So Ed asked a question earlier about Poziotinib and I think there is -- with an assumption of approval which I think is got our focus today. There are absolutely discussions to be had and we will continue to have for business development for the rights outside the United States. I think when you look at Efla, just as a reminder, we have worldwide rights, less China, Korea, and Japan, so Japan is the difference.\n\nWe have rights with the Pozi. We don't have rights with Efla. But I think the conclusion is the same for Efla. As we look at the ex-US dynamic, as it relates to the growth factors, it's a very different world in terms of how those products are brought to market, and how they're reimbursed.\n\nIt's just an entirely different business and we don't believe that that business is in our interest to bring forward. So our business development efforts for non-US territories with these assets will be focused on Poziotinib.\n\nReni Benjamin -- JMP Securities -- Analyst\n\nExcellent. Thank you very much for the color, and obviously, good luck going forward.\n\nTom Riga -- President and Chief Executive Officer\n\nI appreciate Ren.\n\nOperator\n\n[Operator instructions] The next question is from William Wood with the BRS. Your line is now open.\n\nWilliam Wood -- B. Riley Securities -- Analyst\n\nHi, this is William Wood on for Mayank Mamtani at B. Riley Securities. Appreciate you taking our questions and congratulations on the very nice progression that you've had this quarter. We're just curious.\n\nSpecifically, on how you're preparing for the ODAC meeting and maybe what might be the key topics that you're expecting the FDA to bring up, given that they're giving their cautious commentary on granting accelerated approvals? And then maybe also how much you think the split data -- dose data gets reviewed by the committee members.\n\nTom Riga -- President and Chief Executive Officer\n\nYeah. So I think your question. I think we're spending a good bit of time on preparation because I think it's warranted. I think the FD -- we are about we're aware of the kind of macro environment of FDA comments on accelerated approvals.\n\nBut we believe that Poziotinib has addressed a real unmet medical need, the kind of macro environment of FDA comments on accelerated approval. But we believe that Poziotinib has addressed a real unmet medical need. I think it's got a well-characterized profile as it relates to safety. It's been demonstrated in its effectiveness.\n\nAnd today, we have the largest database in the world of this particular mutated cancer. So we look forward to representing that, but we are looking at the macro environment here. So your point is well taken and we are preparing as such. And the team is spending a great deal of time to make sure that this gets the attention that it deserves.\n\nWilliam Wood -- B. Riley Securities -- Analyst\n\nThank you. That was very, very helpful. And then additionally, you've mentioned that you're going to have additional -- you've got your abstract coming as well. Just curious if we could get a little extra color on what we might be expecting.\n\nAnd then, how that might be incorporated into the approval process, if at all?\n\nTom Riga -- President and Chief Executive Officer\n\nI'll let Francois comment on as more data. But I think that the approval process -- I don't know that that data has anything to do with it. This is about Cohort to this population. So our NDA has been filed and is under review, which will be the topic of the NDA.\n\nI think this data that Francois will speak about here will be interesting, but as it relates to an approval process, it's not part of that topic, although it's in the dataset. Francois, you would like to comment.\n\nFrancois Lebel -- Chief Medical Officer\n\nYeah, sure. So that's correct. The ESMO data shows high activity against a second most common mutation in the HER2 exon 20 worlds. So that's of interest when you have high activity.\n\nBut that is not in itself, as Tom has just said, it's not subject to the discussion for the NDA. I mean, that data is in the NDA but, there was a lot of investigators who were interested in understanding the activity of Pozi against various mutation and that's what we're going to be showcasing at ESMO in one particular common mutation. As to I think you've asked a little bit about a little more about the ODAC and what we are expecting. We don't know for sure what the FDA will have as specific questions, or what the ODAC members will ask us, but obviously, we are preparing for a high number of different questions.\n\nWe suspect that the overall risk-benefit of the drug will be a subject of discussion, as you pointed out dosing. The filing is done on QD we have provided extensive data on BID dosing. So we suspect that that will be also a subject of discussion. And obviously, we monitored carefully the treatment landscape as it is evolving and we think we're in a good position and patient, let's face it, needs options, and we certainly believe that Pozi would present a very attractive option for patients.\n\nWilliam Wood -- B. Riley Securities -- Analyst\n\nExcellent. Thank you very much. I think I'll leave it there. I appreciate your answering our questions, and congratulations again.\n\nTom Riga -- President and Chief Executive Officer\n\nThanks, William.\n\nOperator\n\n[Operator instructions] Our next question comes from Prakhar Agarwal with Cantor Fitzgerald. Your line is now open.\n\nPrakhar Agarwal -- Cantor Fitzgerald -- Analyst\n\nHi. Good morning Tom and team. Congrats on the quarter, and congrats, Nora. So the first question is on [Inaudible].\n\nSo it seems that the manufacturing issues have been resolved. So I have a follow-up on commercialization here. The pricing and G-CSF market are more or less in a freefall right now, with net pricing declining 20% plus year on year, and will probably continue to decline for the foreseeable future based on commentary from other players in this market. So maybe what's your strategy on pricing and how it may evolve in this market? Is there a scenario where you can keep pricing stable? And then I had a follow-up on Pozi.\n\nThank you.\n\nTom Riga -- President and Chief Executive Officer\n\nYeah, hey Prakhar. Nice to chat with you. So we have not given our final price, but the comment that I would make on this particular issue is today's dynamic, is a situation where there is one innovator product in all Biosimilars that have gone through the 351 k pathway. So inevitably their reimbursement in the dynamics that they are trying to compete with is subject to the behavior of each other.\n\nWe will be bringing the first novel asset to the market in over 20 years, and that will offer some distinct advantages and opportunities to have an offering that provides a bit more stability and predictability. And we think that is advantageous to the end user. And we will operate that way. So we are tracking that very closely.\n\nBut we see the behavior within the market as an opportunity because we don't need to enter as one of the players that ultimately is competing with each other, whose reimbursement is inevitably tied to one another. I hope that makes sense.\n\nPrakhar Agarwal -- Cantor Fitzgerald -- Analyst\n\nNo, that's really helpful, Tom. And a follow-up on Pozi. So maybe on a confirmatory Phase III, how many sites are active right now? What percentage of your target patients have been enrolled in Phase III? And where do you need to be on enrollment to satisfy FDA's focus on substantial enrollment by the PDUFA date? Thank you.\n\nTom Riga -- President and Chief Executive Officer\n\nFrancois, do you want to talk about this?\n\nFrancois Lebel -- Chief Medical Officer\n\nSure. So we're -- again, we are very active in opening sites, but as I'm sure you know, it takes a long time to open sites We have some sites open, but I am not going to give you numbers today. I'm not going to speak directly to enrollment today. And so we're moving as fast as we can internationally, as well as in North America, So I can't remember the second part of your question was what?\n\nPrakhar Agarwal -- Cantor Fitzgerald -- Analyst\n\nWhat do you need to be on enrollment on FDAs substantial --\n\nFrancois Lebel -- Chief Medical Officer\n\nRight. So we have discussed directly with the agency if there was a particular threshold that we had to achieve by PDUFA day, and the information we got from the agencies that this would be a multifactorial judgment, that there's not a single number they want us to achieve. And that -- we believe that on the basis of that discussion, is that we have to demonstrate a true active program here that as over the years, the last few years, the number of company, maybe we're not quite as serious as they probably had to be. And we believe that we will be able to show unequivocally that we're taking this commitment very seriously and are moving forward as fast as we can.\n\nPrakhar Agarwal -- Cantor Fitzgerald -- Analyst\n\nGot it. Thank you, Francois. And maybe just lastly on Pozi, any updates on plans for moving into earlier lines [Inaudible] have you had any discussions with the regulators on what might be required? Thank you.\n\nTom Riga -- President and Chief Executive Officer\n\nYeah. Thanks for the question. We have a lot of aspirations for the asset of what it could potentially be beyond the initial indication. But we are really taking a disciplined approach here to focus on gaining the initial approval.\n\nWe see the unmet need, patients' needs, and physicians' need for therapeutic options for this particular population. So right now, the focus of the company is to make sure we're optimally prepared for our ODAC meeting and gain a positive nod here in November. And once we get to that point, then we will look to share in advance our development efforts, both to what you mentioned because of the positive cohort for data, but in other interesting areas of medical need that we believe would advance the program as well.\n\nPrakhar Agarwal -- Cantor Fitzgerald -- Analyst\n\nThanks for taking my questions, and looking forward to the next update.\n\nTom Riga -- President and Chief Executive Officer\n\nAppreciate it.\n\nOperator\n\nAt this time I am showing there are no more questions. I would now like to turn the conference back to Tom Riga for closing remarks.\n\nTom Riga -- President and Chief Executive Officer\n\nThank you, everybody, for your active participation and all your questions on today's call, and for your interest in Spectrum. If you have additional questions, as always, feel free to contact us at any time. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Grabow -- Senior Vice President of Corporate Strategy and Operations\n\nTom Riga -- President and Chief Executive Officer\n\nFrancois Lebel -- Chief Medical Officer\n\nNora Brennan -- Chief Financial Officer\n\nUnknown speaker\n\nEd White -- H.C. Wainwright -- Analyst\n\nReni Benjamin -- JMP Securities -- Analyst\n\nWilliam Wood -- B. Riley Securities -- Analyst\n\nPrakhar Agarwal -- Cantor Fitzgerald -- Analyst\n\nMore SPPI analysis\n\nAll earnings call transcripts"
}