{
  "companyName": "Core Laboratories",
  "companyTicker": "CLB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/core-laboratories-clb-q3-2022-earnings-call-transc/",
  "content": "Core Laboratories (CLB 1.81%)\nQ3 2022 Earnings Call\nOct 27, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Core Laboratories third quarter 2022 conference call. [Operator instructions] Please note, that this event is being recorded. I would now like to turn the conference over to Mr. Larry Bruno, chairman and CEO.\n\nPlease go ahead.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nThanks, Faizan. Good morning in the Americas. Good afternoon in Europe, Africa, and the Middle East, and good evening in Asia Pacific. We'd like to welcome all of our shareholders, analysts, and most importantly, our employees to Core Laboratories third quarter 2022 earnings call.\n\nThis morning, I'm joined by Chris Hill, Core's chief financial officer; and Gwen Gresham, Core's senior vice president and head of investor relations. The call will be divided into six segments. Gwen will start by making remarks regarding forward-looking statements. We'll then have some opening comments, including a high-level review of important factors in Core's Q3 performance.\n\nIn addition, we will review Core's strategies and the three financial tenets that the company employs to build long-term shareholder value. Chris will then give a detailed financial overview and have additional comments regarding shareholder value. Following Chris, Gwen will provide some comments on the company's outlook and guidance. I'll then review Core's two operating segments, detailing our progress and discussing the continued successful introduction and deployment of Core Lab's technologies, as well as highlighting some of Core's operations and major projects worldwide.\n\nThen we'll open the phones for a Q&A session. I'll now turn the call over to Gwen for remarks on forward-looking statements.\n\nGwen Gresham -- Senior Vice President and Head of Investor Relations\n\nBefore we start the conference this morning, I'll mention that some of the statements that we make during this call may include projections, estimates, and other forward-looking information. This would include any discussion of the company's business outlook. These types of forward-looking statements are subject to a number of risks and uncertainties that could cause actual results to materially differ from our forward-looking statements. These risks and uncertainties are discussed in our most recent annual report on Form 10-K, as well as other reports and registration statements filed by us with the SEC and the AFM.\n\nWe undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise. Our comments also include non-GAAP financial measures. Reconciliation to the most directly comparable GAAP financial measures is included in the press release announcing our third quarter results. Those non-GAAP measures can also be found on our website.\n\nWith that said, I'll pass the discussion back to Larry.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nThanks, Gwen. For the third quarter of 2022, Core Lab achieved sequential improvement in revenue, operating income, operating margins, free cash flow, EPS, and EBIT margins. Year over year, revenue increased by 7%. For the full company, EBIT margins for the third quarter grew to 11% and operating margins improved sequentially in both business segments.\n\nFollowing Q2's strong 43% sequential incremental EBIT margins, even after accounting for currency devaluations of the euro and the British pound, full company sequential incremental EBIT margins for Q3 grew to over 55%, once again reinforcing the operational leverage available to Core Lab as global activity improves. Sequentially, EPS grew by 50% to $0.18 per share, ex items. In the third quarter, we saw a modest sequential improvement in demand for lab work in our European, Ukrainian and Russian operations as global trade patterns continue to realign. While we anticipate this trend will continue, the situation does pose uncertainties and potential volatility for both lab services and product sales in the company's Russian, Ukrainian and European markets.\n\nAside from these uncertainties, we expect continued improvement in both business segments across international arenas and in the U.S. for the remainder of 2022 and into 2023. Core continues to execute on its key strategic objectives by, one, introducing new products and services in key geographic markets; two, maintaining a lean and focused organization; and three, maintaining a commitment to delevering the company. Now to review Core Lab's strategies and the financial tenets that Core has used to build shareholder value over our 26-plus year history as a publicly traded company.\n\nThe interest of our shareholders, clients, and employees will always be well served by Core Lab's resilient culture, which relies on innovation, leveraging technology to solve problems, and dedicated customer service. I'll talk more about some of our latest innovations in the operational review section of this call. While we navigate through the current challenges and pursue growth opportunities, the company will remain focused on its three long-standing, long-term financial tenets, those being to maximize free cash flow, maximize return on invested capital, and returning excess free cash to our shareholders. Before moving on, I want to thank all of our employees for their dedication, loyalty, and adaptability in meeting all of our clients' needs and for the commitment that many have shown as we navigate the moment and prepare for a more active market.\n\nI'll now turn it over to Chris for the detailed financial review.\n\nChris Hill -- Chief Financial Officer\n\nThanks, Larry. Before we review the financial performance for the quarter, the guidance we gave on our last call and past calls specifically excluded the impact of any FX gains and losses and assumed an effective tax rate of 20%. So accordingly, our discussion today excludes any foreign exchange gain or loss for current and prior periods. So now looking at the income statement.\n\nRevenue from continuing operations was $126 million in the third quarter, up over 4% from $120.9 million in the prior quarter and up almost 7% year over year. The sequential increase in revenue was driven by growth in both the U.S. and international markets. However, nice growth in the underlying operations in multiple international regions has been partially offset by the devaluation of the euro and British pound, which I will expand on later in the discussion.\n\nAdditionally, although we have seen some improvement, the Ukraine-Russia conflict continues to adversely impact service revenue in the affected regions. Of this revenue, service revenue, which is more international, was $87.9 million for the quarter, up 3% sequentially from $85.4 million last quarter. The growth in service revenue this quarter has come from multiple international regions, including some recovery from disruptions caused by the conflict in Ukraine. While underlying activity continues to grow, our international service revenue was negatively impacted by foreign currency exchange rates versus the U.S.\n\ndollar. Using a constant U.S. dollar, international service revenue would have been translated into an additional $1.5 million when compared to last quarter and an additional $4.3 million when compared to Q3 of last year. The impact of these currency movements during the first nine months of 2022 was approximately $9 million compared to the same period in the prior year.\n\nProduct sales, which are more equally tied to U.S. and international activity, were $38.1 million for the quarter, up over 7% sequentially and up 15% from last year. U.S. product sales for the quarter were up over 22% sequentially and up over 13% year over year.\n\nOur energetic product sales into the U.S. markets continues to be the primary driver, and we're up over 19% sequentially and up over 27% year over year. International product sales, which are typically larger bulk orders and can vary from one quarter to another, decreased approximately 4% sequentially, but were up over 16% when compared to third quarter last year. Moving on to cost of services, ex items, for the quarter were a little below 77% of service revenue, which improved from 80% last quarter and 79% from last year.\n\nCost of sales, ex items, in the third quarter was 82% of revenue and also improved from 84% last quarter. The improvement this quarter was primarily driven by gains in manufacturing efficiencies and higher U.S. sales. We anticipate improvement in the manufacturing absorption rate in future quarters to be in line with projected growth in product sales.\n\nG&A, ex items, for the quarter was $10 million, relatively flat compared to last quarter. G&A, ex items, is anticipated to be approximately $40 million for the full year of 2022. Depreciation and amortization for the quarter was $4.2 million and down a little from $4.4 million last quarter. EBIT, ex items, for the quarter was $13.3 million, up from $9.6 million last quarter, yielding an EBIT margin of 11% and up over 260 basis points sequentially.\n\nThis quarter marked the company's highest sequential incremental margin since the COVID-19 pandemic. On a GAAP basis, EBIT was $14.6 million for the quarter. Interest expense, ex items, was $2.9 million, up from $2.7 million in the last quarter. GAAP interest expense was $3.1 million, which includes writing off $210,000 of unamortized debt costs associated with renewing our credit facility during the quarter.\n\nIncome tax expense, ex items, at an effective tax rate of 20% was $2.1 million for the quarter, and on a GAAP basis was $3.9 million for the quarter. Higher tax expense for the quarter was largely impacted by foreign currency gains, primarily in the U.K., where unrealized foreign currency gains associated with U.S. dollar-denominated receivables are subject to tax locally. The company has taken additional steps to further mitigate this type of foreign currency risk to reduce future tax expense associated with foreign exchange rates.\n\nEffective tax rate will continue to be somewhat sensitive to the geographic mix of earnings across the globe and the impact of items discrete to each quarter. However, we continue to project the company's effective tax rate to be approximately 20%. Income from continuing operations, ex items, for the quarter was $8.3 million, up $2.8 million or over 50% from the last quarter. On a GAAP basis, we recorded income from continuing operations of $7.6 million for the quarter.\n\nEarnings per diluted share from continuing operation, ex items, was $0.18 for the quarter, up from $0.12 last quarter, and GAAP earnings per diluted share was $0.16 for the quarter. Turning to the balance sheet. Receivables were $100.2 million and up slightly from $99.1 million in the prior quarter. Our DSOs for the third quarter were at 67 days, which improved from 69 days last quarter.\n\nInventory was $54.8 million as of September 30, up approximately $2.2 million from last quarter end. Inventory turns for the quarter were at 2.3, compared to 2.4 in the last quarter. As previously highlighted, the company continues to experience an increase in cost that go into inventory. Additionally, challenges in the supply chain persist, so we continue to carry a larger amount of the inventory to help mitigate disruptions.\n\nWe anticipate inventory turns will remain at similar levels with some improvement as we progress through the remainder of 2022 and into 2023. On the liability side of the balance sheet, our long-term debt was $185 million at the end of the third quarter. And considering cash of $14 million, net debt was $171 million or a slight decrease from last quarter. At September 30, our leverage ratio improved slightly and was 2.42, compared to 2.47 at last quarter end.\n\nWe are projecting our leverage ratio to continue improving through year end with a more significant improvement in the first quarter of 2023. Our debt is currently comprised of our senior notes at $135 million, as well as $50 million outstanding under our bank revolving credit facility. Looking at cash flow for the third quarter of 2022, cash flow from operating activities was $5.8 million. And after paying for $2.7 million of capex in the quarter, our free cash flow was $3.1 million or up $5.7 million from the last quarter.\n\nWe expect the growth in working capital to moderate cash from operations to strengthen and for the company to generate positive free cash flow in future quarters. We will continue managing capital expenditures to be in line with activity levels for the remainder of 2022. For the full year of 2022, we expect capital expenditures to be in the range of $11 million to $12 million. Core will continue its strict capital discipline and asset-light business model with capital expenditures primarily targeted at growth opportunities and operating efficiency initiatives.\n\nCore Lab's operational leverage continues to provide for the ability to grow revenue and profitability with minimum capital requirements. Capital expenditures have historically ranged from 2.5% to 4% of revenue even during periods of significant growth. That same level of laboratory infrastructure, intellectual property, and leverage exist in the business today. We believe evaluating a company's ability to generate free cash flow and free cash flow yield is an important metric for shareholders when comparing and projecting company's financial results, particularly for those shareholders who utilize discounted cash flow models to assess valuations.\n\nI will now turn it over to Gwen for an update on our guidance and outlook.\n\nGwen Gresham -- Senior Vice President and Head of Investor Relations\n\nThank you, Chris. As the fourth quarter of 2022 unfolds, Core anticipates the crude oil commodity price to remain near current levels but may fluctuate in response to the crude oil supply and demand uncertainties related to slowing global economic growth, inflationary pressures, and government-imposed COVID-19 lockdowns in China. Over the long term, crude oil supply is projected to tighten as production growth faces limitation due to prolonged underinvestment in many regions around the globe. As a result, Core expects operators to expand their upstream spending plans into 2023, supporting Core's outlook for continued improvement in international onshore and offshore activity with projects emerging across most regions.\n\nThese crude oil fundamentals are leading indicators for what Core sees as a strengthening multiyear international recovery. Turning to the U.S. Core expects U.S. onshore activity to remain steady and modestly grow in 2023, as operators remain focused on capital discipline and availability of additional frack crews and drilling rigs may be constrained.\n\nAs a result, for the fourth quarter of 2022, Core's reservoir description segment revenue is projected to be flat to up slightly. While momentum in international activity continues to build, near-term growth may be affected by two factors: volatility associated with the Russia-Ukraine geopolitical conflict and client-driven project delays. Production enhancement segment revenue is estimated to increase by mid- to high single digits as U.S. land activity is projected to remain steady and international growth continues.\n\nFor the fourth quarter of 2022, Core projects U.S. activity to remain stable and the recent improvement trends in international offshore and deepwater markets to continue. Core projects fourth quarter revenue to range from $126 million to $131 million and operating income of $13 million to $15 million, yielding operating margins of approximately 11%. EPS for the fourth quarter is expected to be $0.17 to $0.21.\n\nThe company's fourth quarter guidance is based on projections for underlying operations and excludes gains and losses in foreign exchange. Fourth quarter guidance also assumes an effective tax rate of 20%. Now I'll pass the discussion back over to Larry.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nThanks, Gwen. First, I'd like to thank our global team of employees for providing innovative solutions, integrity, and superior service to our clients. The team's collective dedication to servicing our clients has been very visible during the current challenges and is the foundation of Core Lab's success. Turning first to reservoir description.\n\nFor the third quarter, revenue came in at $79 million, up 4% compared to Q2. When looking at growth in revenue for reservoir description, it is important to consider the sharp devaluation of the euro and the British pound. These currency devaluations, lowered reservoir description revenue when translated into U.S. dollars by approximately $1.5 million for the quarter as compared to Q2 and year to date by approximately $9 million for 2022 compared to 2021.\n\nOperating income for reservoir description, ex items, was $8.4 million, and operating margins were 11%. Even after accounting for the currency devaluations I just mentioned, quarterly sequential incremental margins for reservoir description were still over 70%. As we look ahead, while still well below pre-COVID levels, we see the growing international rig count as a harbinger of an improving landscape for reservoir description, a trend that we project will play out for the next several years, particularly in the Middle East, North and South America and most other regions. Now for some operational highlights from the third quarter.\n\nCore continued to leverage its global reach, expertise, and proprietary technologies to evaluate core and reservoir fluid samples from a multi-well exploration program in the deepwater, Orange Basin, located offshore Namibia. Conventional core recovered from targeted stratigraphic intervals were scanned using Core Lab's Non-Invasive Technologies for Reservoir Optimization, branded as NITRO. A wide range of critical petrophysical parameters for pay delineation were generated using Core Lab's innovative measurement and modeling techniques, allowing for rapid delivery of data and early time assessment of the recovered strata. Selected samples are now progressing through the traditional, time-honored program of physical laboratory measurements.\n\nRecent successes in Namibia have generated renewed interest in Core Lab's regional study of reservoir and seal rocks from offshore Namibia. This study, conducted in collaboration with the National Oil Company of Namibia, includes geological analysis of samples from more than 20 wells. This study is just one of 22 multi-well, multi-company studies that Core Lab has conducted on sedimentary basins offshore Africa. In other developments, Core Lab is pleased to announce that during the third quarter of 2022, Quantum Energy Partners and Trace Midstream Management joined Core's Carbon Capture and Sequestration Consortium, bringing total membership to eight participants.\n\nThese new members enhance the consortium's exposure to both private equity engagement and midstream operations expertise in the emerging carbon capture and sequestration market. The objective of the consortium is to analyze geologic risks and challenges associated with carbon sequestration, leveraging Core's expertise and subsurface characterization. Regulatory entities that govern carbon sequestration projects require extensive site evaluation. Core's technologies ensure that the models for simulation and monitoring of CO2 injection and sequestration are built on robust data sets and are applicable for the permitting process.\n\nMoving now to production enhancement, where Core Lab's strengths in both energetic systems and completion diagnostics helped customers optimize their well completions. Revenue for production enhancement came in at $47 million, up 4% sequentially and up 20% year over year. Operating income, ex items, was $4.7 million. Operating margins were 10% for the third quarter of 2022 and sequential incremental margins were 44%.\n\nDuring the third quarter of 2022, Core Lab continued to build on the success of its proprietary Plug and Abandonment Perforating System called PAC, which is used for oil and gas well abandonment programs. Core Lab provides solutions that leverage its expertise in energetics as an alternative to traditional casing milling, which is slower and more costly. Thus far in 2022, Core successfully deployed its PAC technologies in over 30 wells in the North Sea. Core's PAC energetic solutions are often used in Perf, Wash, Cement applications.\n\nThis technique enables the operator to selectively establish circulation in the annular space between casing strings, thereby creating pathways for setting the permanent cement plugs required for well abandonment. Over on the service side of production enhancement, operators continue to leverage Core's expertise in completion diagnostics for offshore wells during the third quarter of 2022. Core SpectraStim, SpectraScan, and PackScan downhole imaging technologies were utilized in deepwater Gulf of Mexico Miocene wells to evaluate single and dual zone frack pack completions. In addition to those technologies, Core's FLOWPROFILER oil diagnostics were used to assess the production in ultra-deepwater Gulf of Mexico reservoirs involving multi-zone completions.\n\nThe costs associated with completing multiple wells in these high stakes, deepwater wells necessitates confirmation that each frack pack is properly configured and each targeted zone is contributing oil production as per the completion plan. Recently, Core's production enhancement team was tasked to deploy a unique FLOWPROFILER diagnostic tracer in each of four frack pack completion zones. Core's proprietary laboratory analytical techniques on produced oil samples confirmed that all four zones were contributing to production. FLOWPROFILER also helped the operator understand how the reservoir was responding, allowing them to adjust flowback procedures to achieve the drawdown pressures that would optimize production without damaging the reservoir.\n\nCore's completion diagnostics are a critical tool for determining whether planned completion programs were successfully executed downhole, many thousands, or even tens of thousands of feet away from the wellhead. That concludes our operational review. We appreciate your participation, and Faizan, we'll now open the call for questions.\n\nOperator\n\nThank you very much. [Operator instructions] The first question comes from Stephen Gengaro from Stifel Financial Corporation. Please go ahead.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nThanks. Good morning, everybody. I think two questions from me, if you don't mind. And if we could start on the reservoir description side, and I understand the FX issues and headwinds.\n\nWhen we -- what we are kind of consistently hearing from other service companies and even large E&Ps is we're on the cusp of kind of pretty strong international growth in '23 and '24 likely. How should we be thinking about the RD business in that environment? Should we start to see consistent double-digit year-over-year growth in that business? I'm just sort of trying to get a sense for how the growth rate should look. And I mean, looking at history, that would seem to be reasonable, but I'm trying to put together the puts and takes here.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nYeah, Stephen. I think that's right. It's -- we're -- we agree that we're starting off for -- heading into a multiyear up cycle that is going to really benefit reservoir description. As we've talked about with you and with other analysts and investors, reservoir description, by its nature, tends to lag directional trends.\n\nWe've been saying that for a while. It held in very well when COVID hit, and a lot of the -- service companies that were more exposed to well construction and all really went down sharply. Reservoir description held in very well. And now those leading indicators of an increased activity, the international rig count being a very good bogey for that is gaining traction.\n\nWe see that going forward. That aligns very well with our client discussions. And so reservoir description is going to start making headway there in terms of its margins, which were, what 11% or so for Q3. And we think it may not be as linear as any of us would like, but we think that it's the beginning of a nice upcycle and getting back into some nice double-digit margins.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks. That's helpful. And obviously, the quarter was really strong on the margin side.\n\nWhen we look at the Energetics business in the U.S. land market, it sort of seems to have evolved. And there seems to be a lot of offerings on sort of the integrated side, but you had a really good quarter there. Can you talk about some of the underlying positives that sort of drove the product sales in North America in the third quarter?\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nSure. Gwen, why don't you get into some of the details here?\n\nGwen Gresham -- Senior Vice President and Head of Investor Relations\n\nYeah, Stephen. So in spite of the completion activity, I mean, increased a bit, but it was a little bit anemic compared to other quarters. With our energetic sales, though, we outperformed the activity, both completions and frack spreads kind of as our markers there. And so with our U.S.\n\nsales, we were up about 19% sequentially and 27% year over year. So that's penetration into the market with our existing energetic products that we have. And then we also did pretty well internationally. And as you recall, those are pretty -- those can be bulky, and they can move quarter to quarter.\n\nAnd so in Q3, we had some nice shipments there as well.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nAnd just real quickly on that front, anything on the pricing front around the Energetics business right now in North America?\n\nGwen Gresham -- Senior Vice President and Head of Investor Relations\n\nYes, getting some pricing improvements. As you know, that area of the market was hit pretty hard during COVID. And we've been working with operators, wireline company since, and we've seen some nice, let's say, modest pricing improvements to date.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks for the color.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nOK. And, Stephen, I might add to that that we are seeing really nice penetration and demand for our premium energetics, which has always been sort of the bulwark of our products business.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nRight. OK. That's helpful. Thank you.\n\nOperator\n\nThank you. The next question comes from John Daniel from Daniel Energy Partners. Please proceed.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nHey, John. Good morning.\n\nJohn Daniel -- Daniel Energy Partners -- Analyst\n\nHey, guys. Thanks for putting me on. Just two questions for you this morning. You noted renewed interest in some of the studies.\n\nAnd I'm curious and you look back historically, as you've seen interest rise for reviewing and study purchases, how long does that translate into more business, whether for you or just for the industry at large?\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nYeah. So interesting model that we have on those, John. We collaborate on their international studies. We collaborate with national oil companies.\n\nAnd the -- we deliver those to the original participants when we complete the analytical program. And then we retain a resale right on that data. So it was a cabin off-the-shelf sale, which yields some pretty high margins when we do that. We're usually sharing those with our collaborative partner with the national oil companies.\n\nBut what we see on those is, I would say, after a quiet several years of interest in these offshore studies from the Africa -- offshore Africa market, all of a sudden, that's picked up pretty nicely in the last quarter or so. So we think we're early in the reconnaissance phase where people are starting to reengage and look at opportunities that they might have had on the shelf during a period of turbulent activity in the industry.\n\nJohn Daniel -- Daniel Energy Partners -- Analyst\n\nOK. Fair enough. And then you also noted the success of the PAC system. And as I read the commentary on that, it sounds like it's more of a system design for offshore wells in the P&A process.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nPrimarily that's correct. Yeah, we do have some offerings that we would use in land business. But the big market and what we focus our efforts on the sort of the big upside for us on the well abandonment and plug and abandonment programs is on the complex offshore wells, but there's multiple casing strings. And I referred to this at times is there's an energy transition aspect to this.\n\nIt's going to take decades to plug and abandon all of the offshore wells that are -- that have been drilled. And so we're still adding new ones. The rig count is going up, new wells are being added. It's going to be a very nice long horizon.\n\nAnd so we focused some efforts on to making sure that we are well represented there with our innovative technologies.\n\nJohn Daniel -- Daniel Energy Partners -- Analyst\n\nOK. The reason I ask about it is when I -- a lot of times since you drive around the field and talk to folks, they'll say, in the onshore market, the E&P company typically just goes low bid when it's time to P&A well. And I'm curious, just kind of given the emphasis these days on ESG and doing things right. If you see somehow greater adoption of technology or sophistication when it comes to onshore P&A moving forward.\n\nThat's a big-picture question. What's your thoughts?\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nYeah. I think that's still going to have to evolve a bit on the design of the onshore wells, and I hate to use the word simple because there's certainly not. But compared to a very complicated offshore well with multiple strings of casing and multiple completion zones. It's a much more complicated task.\n\nI don't disagree with your assessment that there is a highly priced approach to doing these costs effectively. And that's what we focused our efforts on the -- like on the PAC system and our other plug and abandonment offerings. We saved the client substantial dollars and rig time from going in and trying to mill out some very hard steel, and all those casing strings and then having the pull the casing by using our energetic systems to create those communication pathways to allow those cement plug to be set. So yes, you're right, cost is a priority, and we're using our technologies to help lower costs and save time.\n\nJohn Daniel -- Daniel Energy Partners -- Analyst\n\nOK, awesome. Thanks, Larry.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nYeah. You're welcome, John.\n\nOperator\n\nThank you. Next question comes from Don Crist from Johnson Rice. Please proceed.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nHey, Don. Morning. How are you?\n\nDon Crist -- Johnson Rice and Company -- Analyst\n\nI'm good. I wanted to ask about just the geographic leverage. I mean, obviously, we're seeing activity pick up in Brazil, West Africa, Middle East, etc. Is there one area that you have more geographic leverage to than another? And should we monitor where rigs are going into Brazil might be better for you all versus West Africa, etc.?\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nNot particularly, John. I mean, I think we have a really broad international footprint. And so we have operations in Brazil. We have operations in multiple countries throughout the Middle East.\n\nWe have operations in Asia Pacific. And so -- and in Africa. So we are well-positioned. Now during tough times, that works against you.\n\nYou've got that kind of sprawling infrastructure. But during good times, that's when you really harvest the benefit of holding in there during turbulent times in the industry. And so I would say, to give you a little more color, I would say the Middle East is at the forefront of what we're seeing as a pickup in activity. Now we are in four different countries.\n\nI don't get into too much detail about those because, in some of those countries, I only have one client. And so you can do a little geographic assessment and figure out where those are. But I'd say the Middle East is an earlier mover and a bigger mover than we're seeing in other places. Certainly, the South Atlantic margin has been very good for Core Lab for the last number of years, and it looks like it's improving.\n\nWe actually expanded operations in Brazil. I would also maybe also keep an eye on both sides of the Gulf of Mexico. I think there is some opportunity there. And as I mentioned in the call earlier, West Africa has been kind of quiet for us for a while.\n\nAnd I think renewed interest as people start to reevaluate opportunities, particularly offshore, but also some onshore Africa plays.\n\nChris Hill -- Chief Financial Officer\n\nYeah. The only other thing I would keep in mind is that the rocks and fluids are mobile. So it's pretty often that they'll come to one of our advanced technology centers for the more advanced testing.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nThe hub and spoke structure has served us very well. So we want to be close to where the activity is. And then to maximize our utilization of our technologies, we'll ship those samples around to the -- our major centers.\n\nDon Crist -- Johnson Rice and Company -- Analyst\n\nI appreciate all that detail. And just one final one for me. Obviously, there's still a lot of tension in Europe with the Russia situation. And we're coming up on a decision point here on December 5.\n\nBut the assay work on Russian crude, is that completely out of your model today, i.e., if Russia quits exporting crude, that will not hurt you going forward? Is that a correct statement?\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nNo. I don't think that's correct. I mean, we still have clients that -- European clients included in that that want us to be part of their activity. That includes Russian crude.\n\nI guess I'd take a perspective that the -- I think both sides, the Russians need to keep their crude flowing, and the rest of the globe needs that oil that's going to come out of Russia. If not, we're going to see a spike in oil prices. And so I think the -- I think what will happen is there'll be some accommodation there to keep things flowing. But we are -- we've tried to risk assess some of the uncertainties that we see that potentially could impact us.\n\nBut it's a crystal ball question for what's going to happen in the kind of the near to midterm, but I think we're kind of optimistic that the realities of supply and demand for crude oil don't allow for Russian oil to be excluded from that for very long.\n\nDon Crist -- Johnson Rice and Company -- Analyst\n\nOK. I appreciate the color. I'll turn it back. Thank you.\n\nOperator\n\nThank you. The next question comes from Simon Galligani from Awilco. Please proceed.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nHey, Simon.\n\nSimon Galligani -- Awilco AS -- Analyst\n\nGood morning. Hi. Just a brief question. You announced the ATM in early June and then later, you announced the debt refinancing.\n\nCan you guys elaborate on your current thoughts on the ATM? Thanks.\n\nChris Hill -- Chief Financial Officer\n\nSure. This is Chris. We have not sold any shares under the ATM. I would say we're not planning to sell any shares, unless we need to.\n\nSo that was put out there with what happened, I think, during the first quarter, and you see how that impacted us, the conflict and whatnot, but we've recovered partially from that. But keep in mind, we do have $75 million of notes that are come in due next year. And we're working to improve the liquidity in the company and how we're going to retire that or sort of refinance those. So we're keeping multiple options open, but we're going to try to do it without utilizing the ATM.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nAnd just to expand on one point, that $75 million note that comes due next September was a 12-year note. So set up in a different time, but it just happens to be coming due now. And so I wanted to have options and if we needed to. But as Chris mentioned, we have not sold the shares under the ATM.\n\nSimon Galligani -- Awilco AS -- Analyst\n\nOK. Thank you very much.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. The next question comes from Dan Kutz from Morgan Stanley. Please proceed.\n\nDan Kutz -- Morgan Stanley -- Analyst\n\nMorning.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nGood morning, Dan.\n\nDan Kutz -- Morgan Stanley -- Analyst\n\nSo I just wanted to kind of follow up on the kind of capital allocation, a lot of questioning. I guess, considering that you have the maturity next year, if you put the leverage target out there of 1.5 times. So appreciating that those two are factors. I was just wondering if you could help us think through your calculus and thoughts around potential increases in shareholder returns, what you would need to see to feel comfortable starting to consider that.\n\nAnd what would kind of be your presence between raising the normal dividend or buybacks or some kind of special dividend? Just generally your thoughts around shareholder returns would be great.\n\nChris Hill -- Chief Financial Officer\n\nSure. I don't think that has really changed. We've tried to message that consistently. So I think when we think about raising the dividend, we want to do that in a way where we think it's sustainable.\n\nSo I think as we get into a recovery, what the way we would return cash to shareholders is through our buyback program. Initially, it does provide a little bit more flexibility, if you will, versus committing to a dividend. But I think once we get the leverage ratio down and that's sort of not consideration with respect to that and we're comfortable with the forecast, you would see us start to consider to raise the dividend.\n\nDan Kutz -- Morgan Stanley -- Analyst\n\nGreat. That's really helpful color. And then I saw in the press release that you guys making progress in the CCS Consortium added two members, I think. Just wondering if you could give us an update in terms of the opportunities that you're seeing in the CCS space for Core Lab.\n\nAnd if you could remind us anything you've said kind of on the -- what the medium- or longer-term prospects could be in that market? Thank you.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nYeah. I think it's very early in the process. I think Core Lab focused on maybe not getting out over our skis in this. We wanted to wait until we were actually generating revenue profitably on this activity.\n\nAnd so we took a multipronged approach. If you go back and look at the earnings release from a little while ago, you'll see we signed a strategic alliance with Talos. I think Talos is well-positioned to be a leader in CCS projects going forward, and we had a great relationship with them through our activity on their upstream production, oil, and gas production side. And so that was a natural fit for us.\n\nAnd then we put together this consortium in collaboration with the University of Houston to really focus on where Core Lab has its applicable expertise, and that is an understanding what happens when we -- when people try to put for 30, 40, 50 years or longer, try to put large volumes of CO2 in the ground, it's going to react with the poor fluids, it's going to react with the rocks. If you bubble CO2 through water, the water gets more acidic, and that's going to create rock-fluid and fluid-fluid compatibility issues. So that's kind of the technical side of what we're focusing our engagement on evaluating the seal rock and the containment and formation sensitivity to injecting the CO2. So from a dollar perspective, we're still saying that as this matures, we see that this could become 5% to 10% of Core Lab's business over time, not there yet.\n\nBut I think we are in a more concrete position than some companies that are talking about future engagement there. We're actually doing projects and see more projects building. We've got more projects on our board now than we've done to this point, let's put it that way.That's great to hear. Thanks, Larry, Chris, and Gwen.\n\nI'll turn it back.\n\nOK, welcome. Thanks, Dan.\n\nOperator\n\nThe next question comes from David Smith from Pickering Energy Advisors.\n\nDavid Smith -- Pickering Energy Partners -- Analyst\n\nHey, good morning.\n\nGwen Gresham -- Senior Vice President and Head of Investor Relations\n\nHey, David.\n\nDavid Smith -- Pickering Energy Partners -- Analyst\n\nGood morning, Gwen. Thanks for taking my question. So apologies, I jumped on the call a little late. Sorry if I missed this.\n\nDid I hear that U.S. production enhancement revenue was up 19% sequentially? Or was that just a reference for Energetics?\n\nGwen Gresham -- Senior Vice President and Head of Investor Relations\n\nThat was a reference for Energetics.\n\nChris Hill -- Chief Financial Officer\n\nThe U.S. product sales were up 20-plus percent sequentially.\n\nGwen Gresham -- Senior Vice President and Head of Investor Relations\n\nYes.\n\nDavid Smith -- Pickering Energy Partners -- Analyst\n\nYeah. I was just wondering if you gave any details on the total U.S. growth sequentially because that -- even that level of product growth would kind of suggest a decline in total international for the segment. And I was just wondering if that maybe lines up with just the FX impact.\n\nChris Hill -- Chief Financial Officer\n\nYeah. So this is Chris. So U.S. was up over 20% sequentially.\n\nBut international product sales out of PE were down this quarter. And when we talk about that, those are larger bulk orders, and they can be a little lumpy from quarter to quarter. So -- and those are not as subject to the FX impact, like our service revenues that are coming through Europe and whatnot. Those are usually billed in dollars.\n\nSo they don't -- there's not as much currency impact in our production enhancement segment. Just to put that in perspective, the international product sales were up 16% year over year. They're just down and can be a little lumpy quarter to quarter when you're looking sequentially.\n\nDavid Smith -- Pickering Energy Partners -- Analyst\n\nGot it. Makes perfect sense. Thank you. And the follow-up question is solid incremental margins for production enhancement this quarter.\n\nIs that a function of a better mix with the Energetics growth? Is that just the segment getting to the kind of incremental margins you would normally expect?\n\nChris Hill -- Chief Financial Officer\n\nWell, I think we had a really nice pickup in the U.S., which is the primary market for the manufacturing, so some nice manufacturing efficiencies, and we have had some pricing traction. I would say the pricing isn't keeping up with inflation, but it's a combination of manufacturing efficiencies as product manufacturing expands, but then also some benefits from some pricing picking up. We don't model that kind of incremental margin going forward. But when we have a nice quarter, it can get up to those levels.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nI think more consistently, we would look at margins on the manufacturing side. On the product side of the company, which is almost entirely in PE, look at that for 25% to 35% incremental margins.\n\nChris Hill -- Chief Financial Officer\n\nRight. And our services side of that segment also had some nice growth, too. So when they start to pick up, we talk about on the service side, the incremental margins can be stronger, so it can actually improve the sequential incremental margins for the segment as well, right?\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nRight. So to be clear, on production enhancement, the incremental margin is a blend of the manufacturing margins and the service margins.\n\nDavid Smith -- Pickering Energy Partners -- Analyst\n\nGot it. Thank you. If I could sneak one more in.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nSure.\n\nDavid Smith -- Pickering Energy Partners -- Analyst\n\nDid you provide any characterization of the SA work in Q3 relative to Q2? I mean, I saw the modest improvement referenced in the press release. But just wanted to ask if you could provide any rough numbers on the revenue improvement.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nYes, up mid-single digits.\n\nChris Hill -- Chief Financial Officer\n\nRight.\n\nDavid Smith -- Pickering Energy Partners -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThank you. The next question comes from Samantha Hoh from Evercore ISI. Please proceed.\n\nSamantha Hoh -- Evercore ISI -- Analyst\n\nHey, guys. Just a quick for the housekeeping. The capex guide, I mean, it seems like kind of just work this way down from the initial $15 million to $18 million guide for the year. Can you maybe talk to what is driving that? Is it a timing issue? And just some of it roll into next year? And just also where your capex is going toward these days?\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nYeah. So I don't think any major change there. It's maybe a little bit lighter. We are trying to -- we -- I think at Core Lab, we are extremely thrifty when it comes to capital investment.\n\nWe have to see a very rational reason and appropriate returns to make us move forward. But that being said, having sort of grown up through the lab network in Core Lab is my sort of my responsibilities approved, no good idea never goes -- no good idea goes unfunded. And so there are -- we have also rationalized our geographic footprint. And with that, consolidated some locations, so that's helped to reduce some of the capex that we might have had to put into facilities.\n\nAnd so I think no big change in that as we -- it's one of the benefits of staying asset-light. We don't have a lot of rusting metal to replace over time compared to some other types of oilfield service businesses. And so I think it's a combination of our natural thoughtfulness about capital expenditure, trying to be cognizant of free cash that we're trying to generate as we focus on delevering the company and also some operational efficiencies that have come through reorganizing and restructuring and regeographically balancing our footprint around the world.\n\nGwen Gresham -- Senior Vice President and Head of Investor Relations\n\nAnd, Sam, when you look at the numbers, you could -- in terms of modeling, if you want in terms of where the dollars go, to Larry's point, with no good idea going unfunded, there's about two-thirds of that goes toward new technology and maybe about one-third that goes toward things that lose their life in the laboratory environment.\n\nSamantha Hoh -- Evercore ISI -- Analyst\n\nOK. That's super helpful. And then, OK, maybe switching to some of the newer stuff that you're doing. On the CC U.S.\n\nConsortium, it's really interesting to see that you're adding private equity and midstream partners. Curious if this is sort of like -- if this is something that has happened in the past with some of your other studies where sort of non-upstream partners or members get involved early on? Or do they tend to get involved later after a field starts to -- projects start to mature and you're actually bringing that project online there?\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nYeah. So to be clear, this is the first non-upstream consortium project that we've done. Everything else that we've done, the hundreds of multi-company studies that we've done over decades have all been focused on subsurface reservoir characterization, seal evaluation. Some have had implications on completion design, say, in the in the Permian Basin and all evaluating the rocks and fluids and how to get the most out of that.\n\nThis is the first one that's not focused on some upstream application. So like, for example, EOR in unconventionals, that was a technology study, but it was still focused on upstream oil and gas production. The CCS Consortium is not focused on upstream oil and gas production. We're very happy to see a, I would call it a very nice blend of some very well-known and respected nameplates on the oil and gas operator side that are seeing CCS opportunities either for their own initiatives or to become a player in that arena, but also getting some private equity in midstream engagement here, I think broadens the discourse for us on how companies are going to develop effective economic models for CCS projects.\n\nChris Hill -- Chief Financial Officer\n\nYeah. The only thing I would add is that historically, with our traditional projects there, I don't remember any midstream type companies buying in, but as assets were changing hands, private equity firms have bought those studies in the past.\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nThat's correct.\n\nSamantha Hoh -- Evercore ISI -- Analyst\n\nAll right. And then one thing that I'm kind of surprised I haven't heard you guys mention is a geothermal. That just seems to be a trend that I would think would fit into your wheelhouse. Can you maybe elaborate? And is there work that -- is there an opportunity there for you guys to get involved in that space?\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nSure. So this could be a long conversation. We only have a few minutes left. But there's really two broad categories of geothermal.\n\nThere's what I would call the hot rock, hot fluid ones, and the warm rock, warm fluid ones, most of the ones over time, say, like the Geysers in California, pretty long-term geothermal project. Those are very hot rock projects. So shallow areas where -- that are relatively shallow, and by this, I mean, hundreds to thousands of feet deep, not tens of thousands of feet deep, and they provide hot fluids from the earth that allow for warming of water to create a steam environment and generate electricity. We do, on occasion, get involved in those hot rock projects.\n\nThey tend to -- so we've done some, for example, in Indonesia. They tend to be in tectonically active areas where those hot rocks are close to the surface. One of the complications there is it's pretty tough to core wells when you're talking about 700 or 800 degrees temperature. And so not a whole lot of coring sometimes they'll core on the flanks of those projects, and we'll evaluate the rocks.\n\nWe do -- so we do have some offerings in there looking at fluid and rock compatibility, but not a big business for us. OK. I think we'll wrap up there. In summary, Core's operational leadership continues to position the company for improving client activity levels in both the U.S.\n\nand international markets for the remainder of 2022 and beyond. We have never been better operationally or technologically positioned to help our client -- global client base optimize their reservoirs and to address their evolving needs. We remain uniquely focused and are the most technologically advanced, client-focused reservoir optimization company in the oilfield service sector. The company will remain focused on maximizing free cash and returns on invested capital.\n\nIn addition to our quarterly dividends, we'll bring value to our shareholders via growth opportunities, driven by the introduction of problem-solving technologies and new market penetration. In the near term, Core will continue to use free cash to strengthen its balance sheet while always investing in growth opportunities. So in closing, we thank and appreciate all of our shareholders and the analysts that cover Core Lab. The executive management team and the board of Core Laboratories give a special thanks to our worldwide employees that have made these results possible.\n\nWe're proud to be associated with their continuing achievements. So thanks for spending time with us, and we look forward to our next update. Goodbye for now.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLarry Bruno -- Chairman and Chief Executive Officer\n\nGwen Gresham -- Senior Vice President and Head of Investor Relations\n\nChris Hill -- Chief Financial Officer\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nJohn Daniel -- Daniel Energy Partners -- Analyst\n\nDon Crist -- Johnson Rice and Company -- Analyst\n\nSimon Galligani -- Awilco AS -- Analyst\n\nDan Kutz -- Morgan Stanley -- Analyst\n\nDavid Smith -- Pickering Energy Partners -- Analyst\n\nSamantha Hoh -- Evercore ISI -- Analyst\n\nMore CLB analysis\n\nAll earnings call transcripts"
}