{
  "companyName": "Canadian Imperial Bank of Commerce",
  "companyTicker": "CM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/canadian-imperial-bank-of-commerce-cm-q3-2022-earn/",
  "content": "Canadian Imperial Bank of Commerce (CM -0.32%)\nQ3 2022 Earnings Call\nAug 25, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the CIBC quarterly financial results call. Please be advised that this call is being recorded. I would like to turn the meeting over to Geoff Weiss, senior vice president, investor relations. Please go ahead, Geoff.\n\nGeoff Weiss -- Senior Vice President, Investor Relations\n\nThank you, and good morning. We'll begin this morning's presentation with opening remarks from Victor Dodig, our president and chief executive officer; followed by Hratch Panossian, our chief financial officer; and Shawn Beber, our chief risk officer. Also on the call today are a number of our group heads, including Mike Capatides, U.S. commercial banking and wealth management; Harry Culham, capital markets and direct financial services; Laura Dottori-Attanasio, Canadian personal and business banking; and Jon Hountalas, Canadian commercial banking and wealth management.\n\nThey're all available to take questions following the prepared remarks. [Operator instructions] As noted on Slide 2 of our investor presentation, our comments may contain forward-looking statements, which involve assumptions and have inherent risks and uncertainties. Actual results may differ materially. With that, I'd like to turn the meeting over to Victor.\n\nVictor Dodig -- President and Chief Executive Officer\n\nThank you, Geoff. Good morning, everyone, and thank you for joining us today. My remarks this morning will include comments about our third quarter results and the operating environment as well a summary of our key strategic priorities, which we outlined to you on Investor Day. Hratch will then provide a more detailed review of the quarter, followed by Shawn, who'll cover our credit performance, after which all of us will be happy to take any questions you may have.\n\nAgainst an increasingly challenging macro environment, our CIBC team delivered solid third-quarter results with earnings of CAD 1.7 billion. Revenue growth of 10% was underpinned by strong net interest income and fee growth as well as a 19% year-over-year increase in our connectivity revenue. Our asset quality remains very strong with a net write-off ratio that is well below our pre-pandemic levels. Our earnings generated a return on equity of 15.1%, and our capital position remains strong with a CET1 ratio of 11.8%.\n\nThe results were driven by organic growth in all of our businesses. We delivered solid volume growth in both consumer and commercial loans and deposits and higher fee income. We also had strong contributions from direct financial services, a key differentiator for CIBC, which I'll speak to later. Let me turn now to our business segment highlights, starting with personal and business banking.\n\nOur consumer segment continues to see good momentum as we remain focused on executing against our strategy. Our priorities are to gain market share in the high-growth, high-touch affluent segment, while delivering exceptional client experiences to all of our clients through leading-to-edge technology. As a proof point, our strategic investments in providing personalized advice are contributing to solid client acquisition growth. On a rolling 12 months basis, and excluding our Costco acquisition, we've added over 300,000 clients, 25% of which are in the affluent segment, and this compares to our baseline of 11% our current book of business.\n\nThe continuous improvements we're making to our online banking platform have also been recognized with three awards this quarter, the No. 1 ranking from J.D. Power for online banking customer satisfaction; and two leadership awards in the Digital Bankers 2022 Global Digital Client Experience banking awards. Our commitment to making our clients' lifetime ambitions a reality led to our recently announced partnership with Willful, an online platform for world creation.\n\nWith this collaboration, we can offer our clients peace of mind through a convenient and affordable online estate planning tool. Going forward, we will continue to seek new and innovative enhancements to our digital banking platforms as we advance our digitization strategy and build our business with the affluent segment. So turning to our North American commercial banking and wealth management platform. We see continued solid loan and deposit growth on both sides of the border in commercial banking.\n\nDespite economic uncertainties, entrepreneurs remain cautiously optimistic about near-term growth opportunities. As a result, we expect to see continued growth with our clients across our commercial business -- banking business. Our wealth management segment also performed well. The market declines in AUM were offset by positive net sales.\n\nWe remain focused on growing our private wealth business to generate stable fee-based revenue as well as increasing connectivity with the rest of our bank to drive referrals and to deepen client relationships. Our capital markets business performed well in a volatile market, with top-line growth in all business segments, benefiting from increased advisory services, higher foreign exchange trading revenue and growth in our direct financial services business. The latter was helped by rising interest rates, robust volume growth and new client relationships in both Simply Financial and in our alternate solutions group. We also increased currency transactions, which arise from a recovery in travel and continued growth in our international student banking offer.\n\nAs we enter the second half of this year, the geopolitical tensions and macroeconomic challenges from the first half are expected to continue, leading to more tempered outlook for second-half GDP performance in both our operating regions. Now despite the economic uncertainties, our CIBC team remains confident in our ability to navigate the market, serve our clients and create long-term value for our shareholders while maintaining a disciplined approach to risk. We have a client-centric growth strategy, a disciplined leadership team and an ability to manage the pace of our investments as economic environment evolves. As presented at our Investor Day in June, our client-focused strategy consists of three priorities: the first of which is to focus on our growing our share of high-growth, high-touch segment, where we're well-positioned.\n\nWe have close to 4,000 CIBC professionals dedicating to building our business with the affluent and high-net-worth client segments. And we have continued -- a unique colocation of our commercial and wealth management professionals to drive long-term relationship opportunities in the private economy. Our second priority is to continue to elevate the CIBC banking experience for our clients through investments in digitization, cloud-based technology and further increasing connectivity across our businesses. We're focused on continuously adapting to the evolving financial services landscape.\n\nAnd our third priority is to continue to invest in our future differentiators that will make a difference to the growth profile of our bank. These differentiators include our direct financial services business comprised of Simply Financial Investors Edge and our Alternate Solutions Group, all of which are well-positioned to reach higher growth, digital savvy and value-conscious clients. Another differentiator is our innovation banking franchise, which supports early stage companies in technology, life sciences, healthcare and clean tech sectors. We're also focused on modernizing our payments platform, to better serve our clients' attitudes, behaviors and preferences of consumers and retailers evolve and our leading renewables and energy transition platform to support our clients on their journey to a low-carbon economy.\n\nSo in closing, we're mindful of the challenges in the current operating environment, and we're confident that we have a strategy and a foundation in place to deliver sustainable value consistently to all of our stakeholders. Our CIBC team has demonstrated our resilience in challenging environments in the past, and we'll continue to demonstrate that resilience going forward. And with that, I'll turn the call over to Hratch.\n\nHratch Panossian -- Chief Financial Officer\n\nThank you, Victor. And good morning to all of you. Our team delivered yet another successful quarter in Q3, resulting reported net income of $1.7 billion or diluted earnings per share of $1.78. Excluding items of note, adjusted EPS was $1.85.\n\nWhile provisions for credit losses against performing loans trended higher, driven by the negative shift in the economic outlook, credit performance remains strong as evidenced by an impaired loan loss ratio of 12 basis points. Shawn will cover credit provisions in further detail later in our presentation. The balance of my presentation will refer to adjusted results, which exclude items of note starting with Slide 8. Executing against the strategic priorities we outlined at our recent Investor Day, we maintained the strong growth momentum across our bank.\n\nPre-provision pre-tax earnings of $2.5 billion and revenue $5.6 billion were both up 10% from the prior year, supported by broad-based balance sheet growth, improving margins as well as higher trading and investment gains. The strength of our Canadian P&C franchise underpinned this quarter's results, delivering revenue and pre-provision pre-tax earnings growth of 16% and 19%, respectively, over the prior year. Total bank expenses were up 2% sequentially or 10% from the prior year as the impact of inflation and increased strategic investments begins to stabilize. As highlighted on Slide 9, net interest income growth continues to be strong, up 14%, excluding trading compared to the prior year.\n\nNII was helped by diversified loan and deposit growth across our franchise, up 16% and 12%, respectively, over the prior year. Total bank NIM was stable sequentially and up four basis points, excluding trading. Canadian personal and commercial banking NIM was up 13 basis points, mainly due to product margins, which benefited from higher interest rates, partly offset by lower margins on new mortgage originations. Growth in higher-margin assets and elevated mortgage prepayment activity also supported margin expansion.\n\nNIM in our U.S. segment was down three basis points over the quarter, primarily due to lower prepayment and investment gains, partly offset by higher product margins. We anticipate NII growth momentum to remain strong in the medium term, supported by volume growth and higher rates but expect some offsetting pressure from mortgage origination spreads in the short term. As shown on Slide 10, we continue to be positioned to benefit from rising interest rates.\n\nWe've included additional disclosure this quarter to provide more color on our interest rate sensitivity. Over 80% of the benefit from a 100 basis point rate increase relates to the structural repricing of capital and deposit balances across our various segments as depicted on the slide. The Canadian P&C businesses account for approximately 65% of this NII increase, primarily due to expansion of deposit margins. Turning to Slide 11.\n\nNoninterest income of $2.3 billion was up 8% from the prior year. Trading income as well investment management and custodial fees were up from the prior year despite market-driven sequential declines. Market-related fees excluding these items faced headwinds from market conditions this quarter, which negatively impacted assets under management and commissions on securities. Transaction-related fees were up 6% from the prior year, benefiting from credit as well as deposit and payment fees.\n\nClient card activity continued to improve and purchase volumes now exceed pre-pandemic levels. Turning to Slide 12. Expenses were up 10% over the prior year or 11% excluding performance-based compensation, resulting in relatively neutral operating leverage. Ongoing strategic investments contributed 5% to year-over-year expense growth with investments in our U.S.\n\nplatform and in our Canadian affluent strategy through the acquisition of the co-brand portfolio accounting for over half of the increase. Excluding strategic investments, in addition to business-as-usual growth, expenses were impacted by higher inflation and normalizing travel business development costs. We expect inflationary factors to start stabilizing over the next few quarters and we're proactively managing the pace of our strategic investments to deliver against our operating leverage targets in the context of a moderating market environment. Turning to Slide 13.\n\nOur capital and liquidity position remained strong this quarter as we continue to deploy balance sheet resources toward organic growth across our client franchise. We ended the quarter with a CET1 ratio of 11.8%, up four basis points from the prior quarter as a result of internal capital generation, partly offset by organic growth in risk-weighted assets. We continue to expect internal capital generation and organic deployment to be largely balanced going forward, and our current capital level positions us well to withstand any emerging risks. Starting on Slide 14, we highlight our strategic business unit results.\n\nNet income and Canadian personal and business banking for the quarter was $637 million. Reflecting our continued progress in strengthening our consumer and business franchise, pre-provision pre-tax earnings of $1.1 billion were up 14% from the prior -- and 11% from the prior quarter. Revenues of $2.3 billion were up 13% year over year, supported by a 17% growth in net interest income and stable noninterest income. Expenses of $1.3 billion were up 6% sequentially and 12% from the same quarter last year, driven by higher strategic investments, including costs related to the co-brand portfolio and employee-related expenses.\n\nMoving on to Slide 15. Net income in Canadian commercial and wealth management was $484 million. Pre-provision pre-tax earnings of $668 million were up 13% from a year ago, benefiting from strong results in commercial banking, partially offset by the impact of unfavorable markets on the wealth management business. Commercial banking revenues were up 27%, driven by double-digit loan and deposit growth, increased client transaction activity and favorable margins.\n\nWe expect lending and deposit growth to continue but to moderate from current levels over the next few quarters. Wealth management revenue was comparable to the prior year as higher fee-based revenues and net interest income in our brokerage and private banking businesses was offset by the impact of 5% lower AUM, driven by market depreciation as well lower commissions due to decreased transactional activity. Increased expenses were in large part due to the higher performance and continued investments. Net income in U.S.\n\ncommercial and wealth was USD 162 million, down 28% from the prior year due to normalizing credit provisions compared to a reversal of provisions last year. Pre-provision pre-tax earnings of $225 million were marginally lower than the prior year. Revenues were up 8% over the same period, supported by strong growth in loans and deposits and stable margins, excluding the impact of lower prepayment activity. Expenses were up 4% sequentially and 18% from the prior year, partly due to our ongoing investments in infrastructure and client-facing capabilities across our U.S.\n\noperations. We expect expenses to stabilize starting next quarter as we complete the ongoing investments. Slide 17 speaks to our diversified capital markets business. Net income of $447 million was down 9% from the prior year, while pre-provision pre-tax earnings of $606 million were comparable.\n\nRevenues of $1.2 billion up 5% from last year as stronger trading, direct financial services and corporate banking revenues were partially offset by lower underwriting investment banking. Expenses were up 12%, driven by employee-related expense as well continued investments. Slide 18 reflects the results of corporate and other segment. A net loss of $50 million in the quarter compared to a net loss of $74 million in the same quarter last year.\n\nRevenue was comparable year over year, while expenses were lower due to timing of strategic initiatives and lower enterprise costs retained in the center. Consistent with our prior guidance, we anticipate quarterly losses in this segment to remain in the $75 million to $125 million range. To close, we're proud of the results our team delivered this quarter. We maintained strong revenue momentum across the business in a less constructive environment.\n\nWhile our disciplined resource allocation framework allowed us to proactively manage execution of our strategic initiatives and drive improving operating leverage despite continued investments. As we look forward, we remain confident in our strategic plan and are well positioned to continue delivering value for our stakeholders in a broad range of economic outcomes. And with that, I'll turn the call over to Shawn.\n\nShawn Beber -- Chief Risk Officer\n\nThank you, Hratch, and good morning. Our overall credit performance remained strong this quarter, reflecting the resilience of our portfolio, notwithstanding various headwinds impacting the overall economy. We've continued to support our clients while proactively managing our underwriting activity in response to the evolving environment, and we remain comfortable with our risk levels and coverages. Slide 21 details our provision for credit losses.\n\nOur PCL was $243 million in Q3, compared with a provision of $303 million last quarter on a reported basis or $209 million on an adjusted basis. Provision on impaired loans was $156 million in Q3. Impaired provisions were down quarter over quarter across our businesses. Other than in Canadian commercial banking and wealth management, we've had a small provision this quarter versus a recovery last quarter.\n\nThe relatively low level of impaired provisions this quarter is partly driven by a few provision reversals in business and government loan portfolio. Impaired provisions in retail remained stable quarter over quarter and continue to perform better than pre-pandemic. Provision on performing loans was $87 million this quarter, driven by deterioration in our forward-looking indicators from last quarter and other portfolio movements. Turning to Slide 22.\n\nOur allowance coverage ratio remained flat at 58 basis points in Q3. Allowance dollars were up quarter over quarter, mainly due to an increase in performing allowance as mentioned earlier, partially offset by a decrease in the impaired allowance. We continue to be comfortable with our coverage ratios, which remain above pre-pandemic levels. Slide 23 details our lending portfolio mix.\n\nConsistent with previous quarters, our portfolio reflects good diversification and strong overall credit quality. Our total loan balances were $517 billion, of which 56% is real estate secured lending. Our variable rate mortgage portfolio accounts for a little over a third of our mortgage portfolio and show strong credit quality and performance. The average loan-to-value for our uninsured mortgage portfolio has decreased further this quarter and is now at 45%.\n\nRecently published data indicates a small drop in the housing price index. And should that continue, we would expect average loan-to-value increase somewhat over future quarters, but still provide strong coverage. I'll provide more comments on our mortgage portfolio in a few slides. The business and government portion of the portfolio has an average risk rating equivalent to a BBB and continues to perform well.\n\nSlide 24 details our gross impaired loans. Overall gross impaired balances were down in Q3. Retail impaired balances were up slightly, while the business and government portfolio experienced a decrease principally due to write-offs of two loans. Despite the slight increase quarter over quarter, new formations remained stable and low from a historical perspective.\n\nAnd both the impaired -- the gross impaired loan ratio and new formations remain lower than our pre-pandemic run rate. Slide 25 details the net write-off and 90-plus day delinquency rates of our Canadian consumer portfolios. Net write-off dollars trended higher in Q3 as expected, as client activity continues to revert toward pre-pandemic spending patterns. Overall, retail 90-plus day delinquency rates remained flat in Q3, with a delinquency dollar increase in credit cards and personal lending.\n\nAs I've noted in prior quarters, we continue to expect an increase in retail delinquencies and write-offs from the lows experienced in fiscal 2020 as clients' liquidity and spending patterns normalize over coming quarters. Slide 26 provides an overview of our Canadian real estate secured personal lending portfolio. Our business strategy has been to focus our origination efforts with clients where we have deep and balanced relationships and we've seen that in our results. Almost three-quarters of our mortgage originations over the last two years have been with clients where we have those relationships.\n\n88% of mortgages are owner-occupied with the balance being principally investor mortgages. Investor mortgages are subject to heightened credit qualification and, as shown on the slide, demonstrates strong performance that compares favorably to owner-occupied mortgages. Our late-stage delinquency rates across these portfolios continue to remain low and stable with the Vancouver and Toronto portfolios outperforming our Canadian average. We'll continue to take a prudent approach and are closely monitoring as interest rates rise and markets evolve.\n\nOn Slide 27, we've included additional disclosure on the portion of our mortgage portfolio that we'll be renewing in the next 12 months. Over that period, $19 billion of fixed rate and $7 billion of variable rate mortgages contractually come up for renewal. Almost all of our variable rate mortgages have fixed payments during the term and are, therefore, impacted by rising rates through an extension of amortization rather than an immediate change to the monthly payment renewal mortgages are reverted to the original amortization schedule, which may require additional payments. At this time, we see only a small portion, less than $20 million of mortgage balances with clients that we see as being at higher risk from a credit perspective and those LTVs are in excess of 70%.\n\nWe actively monitor our portfolios and proactively reach out to clients who are at higher risk of financial stress, and we don't expect to see material losses from our portfolios. Slide 28 shows our FICO score and LTV distribution in our Canadian uninsured residential mortgage portfolio. Only 4% of our uninsured mortgages have a current FICO score of 650 or less and 3% of the portfolio have LTVs over 75%. And less than 1% of our uninsured mortgage portfolio has both a score of 650 or less and an LTV over 75%.\n\nIn closing, we continue to see good overall performance this quarter. Our portfolios exhibit strong credit quality, driven by our disciplined underwriting through the cycle, and we're pleased with credit performance to date. We continue to expect a return to more normalized credit losses over time and maintain prudent allowance coverages. And as economic conditions evolve, we work proactively with our clients who are more at risk to provide solutions that ultimately drive positive outcomes.\n\nI'll now turn the call back to the operator.\n\nOperator\n\n[Operator instructions] And the first question is from John Aiken from Barclays.\n\nJohn Aiken -- Barclays -- Analyst\n\nI was hoping that you could give us a bit of an update in terms of the Costco portfolio, how the performance has been working through system and whether or not you can speak to any early wins in terms of cross-selling into that customer base?\n\nLaura Dottori-Attanasio -- Head, Canadian Personal and Business Banking\n\nJohn, it's Laura. Happy to take that question. Maybe I'll just start from a financial perspective to say that we do continue to track within our expectation of delivering positive net income within two years. So that's good.\n\nI'd tell you, we're really pleased with our strategic investment. As we've talked about, it really is a key part of our strategy to grow in the mass affluent segment. So when we look at the early client results, we're really encouraged. I'd tell you that the portfolio has performed well above our expectations and that's in terms of client migration, engagement, purchase volumes and new client acquisition.\n\nWe're actually about two times greater than we had expected when it comes to new client acquisition. So feeling really good about that. And when it comes to the strategic, if you will, value of this acquisition, it was all about franchising these affluent clients. What I'd tell you is, while the bulk of our activities really start to kick off this fall.\n\nWe've already made some pretty encouraging progress. So we've franchised about 20,000 clients so far. So early days, we're only five months in, but we're really pleased with our momentum when we think how early on we are. So thanks for the question, John.\n\nJohn Aiken -- Barclays -- Analyst\n\nIf I can just do a quick follow-on. With the plans that you have later on in the year, should we continue -- should we expect to see continued expenses to pursue that strategy?\n\nLaura Dottori-Attanasio -- Head, Canadian Personal and Business Banking\n\nI would tell you, yes, over the next few quarters. So we did show, I think, in our disclosures. So Costco contributed about 3.5% increase to our expenses. And so you can expect to see that in the next few quarters.\n\nVictor Dodig -- President and Chief Executive Officer\n\nI think the most important thing, John, just to reaffirm what Laura was saying is, we strengthened our hand in the credit card segment, and we're a strong No. 3 and we're chasing No. 2 and No. 1.\n\nWe've got an opportunity here with a very, very attractive client base. Things have gone really well. And the growth prospects over the medium term are what we're particularly encouraged by, especially with the franchising opportunities. This falls into the heart of our affluent segment growth strategy that we laid out at our Investor Day.\n\nOperator\n\nThe next question is from Ebrahim Poonawala from Bank of America.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nI guess maybe Hratch can just spend some time in terms of the margin outlook. A twofold question. One, when we think about the margin at top of the house, give us a sense of the outlook for the trading NII. Is that inherently liability sensitive? So as rates keep going higher, that $141 million should continue to go down? And then just give us some color around the trajectory for the margin and the puts and takes both in Canadian and US P&C and the deposit pricing pressure that you're seeing in the U.S.\n\nparticular?\n\nHratch Panossian -- Chief Financial Officer\n\nThank you, Ebrahim. Thanks for the question. In general, we feel very good about NII trajectory, as I said in my remarks, as well the NIM outcomes over time a bit of color. And in terms of total bank, as you know, the mix across the business can affect that.\n\nAnd so the mix this quarter on a sequential basis was actually a positive to total bank margins as was the P&C increases that we saw in the Canadian business. The trading side was negative. That's why we'd like looking at it from a nontrading perspective, right? Because the trading, what happens is between NII line and the other income line, depending on what markets are doing and how our desks are positioned in terms of what the client flows are and the underlying and then what hedges on some of those trades would be sometimes the hedges are in the money, sometimes underlying is more profitable. And so it can move around between those two.\n\nYou have to look at trading overall. And so trading, I look at the results this quarter, which are more than $60 million up year over year. So a strong result there, and we expect to see good trading volume going forward. Now let me go about non-trading side.\n\nOn the non-trading side, the two big components are what we always highlight for you, the Canadian margin and the U.S. margin. Both of them will have long-term positive -- long-term and medium-term positive trajectory, benefiting from good strong margins in the product and rising interest rates. What we're seeing in Canada, as we said, is there's a few basis points positive per quarter is the underlying momentum from interest rates.\n\nWe have some mix elements that helped us this quarter. We had some mortgage prepayments that helped this quarter. So some of those elements may moderate, but that upward trajectory of a few basis points over the medium term, I would expect, in the short term, it might be a little more stable. And that's because we're expecting some of that prepayment activity to be lower.\n\nAnd because some of the mortgage origination margins in the short term are looking a little bit tighter than what we would have usually had. So those are the elements of the Canadian one. The U.S. margin -- our U.S.\n\nmargin strategy is very similar to the Canadian one. We hedged the U.S. interest rate exposure. We have a structural and straight hedging program.\n\nWe have a longer duration of equity that we set on those. And we do that deliberately to protect margins to create stability in NII. And when you go back to pre-pandemic levels now and you look at our margins relative to what you may see in U.S. mid-market banks or other U.S.\n\nunits of other banks, we've had tremendous stability and we compare the current margins where they are in the U.S. better than they would have been if we had hedged. But on the flip side, you'll just see slower participation in the rising interest rates. So we'll see the same thing.\n\nWe'll see margins rising over time, but they'll be a little bit more stable in the short term.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nJust as a follow-up, if you can talk to what you see in terms of deposit spreads and pricing both in U.S. and Canada.\n\nHratch Panossian -- Chief Financial Officer\n\nYes. Maybe I'll start with that and maybe the businesses can jump in as well, Ebrahim. So we are seeing very strong momentum on margins on deposits. So most of the benefit from rising rates comes in on the deposit side.\n\nYou would have seen overall disclosure we provided. We have 25% of our deposits are noninterest-bearing. Those benefit from rising rates. If you look at the interest-bearing part of the portfolio, that's not term, that 50 basis points, it splits half and half, right? Half sort of mid -- what we would call mid beta, so sensitive to betas and half of it really indexed and so not that much sensitivity to betas.\n\nWhere we have beta sensitivity, we've held very well. I would say, at least as good as the assumptions in our interest rate sensitivity disclosures. And so we don't see anything in the short term that would change that. When you look at the U.S., particularly -- the U.S.\n\nmix is even better than that 35% of our deposits in the U.S. are noninterest-bearing, and that's been pretty stable. Balances have been growing, percentage has been pretty stable. And again, our betas seem to be holding.\n\nSo if you feel comfortable about deposit margins going forward.\n\nOperator\n\nThe next question is from Gabriel Dechaine, National Bank Financial.\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nI've got three great questions, but I'll stick to one, it's not that great. I just want to delve into the expense commentary a little bit. If I look at the first half, excluding variable comp, it was a 10% growth this quarter. And I'm including the initiative spending all that of Costco, that we're at 11%.\n\nAnd it sounds like we could be running at that rate for the next little while. Just if you can kind of give me the glide path over the next four quarters because I figure some of that should fade if only because we've got easy comps.\n\nHratch Panossian -- Chief Financial Officer\n\nGabe, it's Hratch. Happy to take that. Let me backtrack for one second. Our approach to investing in investing in our bank, our strategy and the financial targets we're striving for it.\n\nIt remains consistent. It's done that for the last couple of years. We have a well-thought-out strategic plan we outlined in our Investor Day. We're executing against that plan, and we're getting the results as you see.\n\nSo financially, we've guided that, that will translate to accelerated revenue growth, share gains, 7% 10% pre-provision earnings growth, positive operating leverage over the medium term. And we've been delivering on all of that. You mentioned some the results on the expense side. But I would look at all of it, right? I'll have over the 12-month period, if you look at the last four quarters trailing, we've delivered revenues and that's been 10%.\n\nAnd we've been delivering expenses 11% on a 12-month basis, 10% this quarter, right? In terms of this quarter, happy to give you a little bit of color. Our increased expenses are a large part, as we highlighted in the presentation, still impacted by the investments as well as inflation piece. In the quarter, 5% of it was the investments. About half of that, as we've highlighted, was Costco and the U.S.\n\nAnd so the number Laura gave 3.5%, Costco, call it, 3.5% of the PBB expenses on a total bank basis, it's about 1% and change and combined U.S. and Costcos at 2.5% we show. Both of those are plateauing. So I would look at those.\n\nWe have a full quarter of expenses related to Costco this quarter. There's some variability going forward, but largely stable. And our U.S. investments are plateauing.\n\nAnd so we expect starting in Q4, the sequential expenses in the U.S. to also plateau. And so those will contribute to the stabilization. We are proactively managing the remaining part of the portfolio in order to solve for our operating target -- operating leverage targets.\n\nAnd the inflation elements as well we see over the next few quarters, that's probably about a third to a half of the remaining expenses we've highlighted there on the slide, and we see that moderating over time. So where do we go? We're focused on delivering what we've committed to. We've guided to high single-digit this year and new relish operating leverage. We feel very good about delivering the pre-tax pre-provision and we continue to work on the operating leverage.\n\nThis quarter, we delivered near-neutral operating leverage despite some pressures on revenue from the markets that were unanticipated and we're focused on continuing on that positive operating leverage actually next quarter and going forward. And getting to that mid-single-digit expense growth over time that we've talked about at Investor Day as we get into next year.\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nInto next year?\n\nVictor Dodig -- President and Chief Executive Officer\n\nIt's well outlined. And Gabriel, just -- we have, as a leadership team, an overarching view on growth, growth, profitable and we need to invest to generate that growth across all our businesses. We have the goal of being top of class in everything that we're doing. Everything that we laid out for you on Investor Day, being No.\n\n1 in affluent client growth, being No. 1 in client experience, investing in our future differentiators. All of these investments are driving the kind of results that you're seeing in our bank, market share gains, top line growth, margin expansion. And we will continue along that path.\n\nFrom time to time, you may see operating leverage lag in the U.S. business, that's the case. And I'm going to hand it off to Cap in a second. The bottom line is that our view on growth in the U.S.\n\nis quite optimistic, but our focus is organic growth. And we're gearing up for more organic growth in the commercial bank, which is why we're investing. We're gearing up for more growth in our wealth management segment, which is why we're investing. So Cap, maybe you can just give a flavor as to what is going on in the U.S.? Why we -- where we're going into the new year when it comes to our financials and our strategic growth priorities?\n\nMike Capatides -- President and Chief Executive Officer, CIBC Bank USA\n\nSo thank you, Victor. Again, as we outlined on Investor Day, we're simply making investments in our people, our technology, product offers and our infrastructure teams in the U.S. And we're doing all that to fuel organic growth and -- that we've achieved and planned for, for the coming quarters and years. As Hratch mentioned, starting next quarter, we expect those expense levels to plateau.\n\nAnd combined with our robust revenue growth in all of our U.S. businesses, we hope to achieve in the U.S. commercial and wealth segment positive operating leverage by mid next year.\n\nOperator\n\nThe next question is from Scott Chan from Canaccord Genuity.\n\nScott Chan -- Canaccord Genuity -- Analyst\n\nMaybe for Harry on capital markets, generally resilient on a segment basis. But one of your peers yesterday took a write-down on the leverage loan book. And I was wondering if you can comment on your kind of book in the U.S. and if you see any issues near term?\n\nHarry Culham -- Head, Capital Markets\n\nWell, thank you for the question. As I mentioned in the past at Investor Day and other calls, we really do have a differentiated platform that is highly connected with the rest of our bank. And we're building a true client-centric North America business that delivers relatively lower volatility pre-provision earnings. So with that backdrop, we're highly selective and disciplined with respect to the area you're referring to.\n\nIt's a very small area, essentially a material part of our business, and we're really focused on our client needs. And so we experienced no losses due to this exposure in Quarter 3 and we really feel comfortable with our platform as we move forward in that respect.\n\nOperator\n\nThe next question is from Meny Grauman from Scotiabank.\n\nMeny Grauman -- Scotiabank -- Analyst\n\nJust a question on your estimate of the impact of the Canada recovery dividend based on the drop that was just made public, I believe, on August 9. I'm just wondering how much certainty do you have in that number given that it's a draft is the fact that you gave the number, I guess, a good indication that you don't see this changing too much by the time it gets finalized?\n\nHratch Panossian -- Chief Financial Officer\n\nThanks for the question, Meny. I wouldn't read that into it. In terms of how much certainty we have in the number, calculating the number is pretty easy given the draft legislation. So we have lots of certainty in the number given the draft legislation, as we said in our disclosures.\n\nBut it's draft legislation. It's still up for public comment. And if the legislation changes, then the number will change. But we felt it was important since we can calculate the number to disclose that to our shareholders at this point in time.\n\nAnd I will say our capital position, we're very comfortable can absorb that, right? If that were to come in all at once and impact capital, it's 18 to 20 basis points of capital and it still allows us to stay around the capital levels that we discussed at Investor Day, continue to invest in our business. So it's not going to be that significant to us. And so we disclosed the number, we thought it was the right thing to do.\n\nMeny Grauman -- Scotiabank -- Analyst\n\nAll right. That makes sense. So just to clarify, it's reasonable to assume that it could still change though, right? Is that a fair assumption?\n\nHratch Panossian -- Chief Financial Officer\n\nI know as much you do on that, it's draft legislation, and it will, at some point, presumably get finalized.\n\nOperator\n\nNext question is from Sohrab Movahedi from BMO Capital Markets.\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nJust a quick one for you. I think you had some interesting stats here, one of which was the average credit quality of the business and government book is investment grade at BBB. Do you have a sense of what it would have been 5 or 10 years ago? And is there any reason to believe that in the next cycle, then because of the improving credit quality there? Also in retail, I suppose, being more secured that your through the cycle kind of PCL shouldn't be lower than would have been over the last 5 to 10 years?\n\nShawn Beber -- Chief Risk Officer\n\nSohrab, thanks for the question. So we're very comfortable with the business and government portfolio across the board. Obviously, over the last several years, we had the acquisition of the private bank, now CIBC Bank U.S.A. And so its profile is very strong.\n\nWe're very comfortable with the portfolio that we acquired. It's performed in line with our expectations. We've continued to maintain our underwriting discipline through cycles, including recent originations. We feel good about those originations across the commercial and corporate banking platforms.\n\nAnd similarly, with our retail portfolios. Again, strong and steady and consistent underwriting discipline. Our clients are in good shape coming into this -- whatever this new period may ultimately unfold, having come through the pandemic. We saw good client behavior.\n\nWe saw deposit balances and investment balances and bureau scores all improve. So from an overall perspective, we've given some guidance during the Investor Day as to what we would expect our impaired losses to be over the coming years. And we don't -- we're not changing that perspective today.\n\nOperator\n\nThe next question is from Nigel D'Souza from Veritas Investment Research.\n\nNigel D'Souza -- Veritas Investment Research -- Analyst\n\nI had a couple of questions for you on your forward-looking variables if you could bear with me that you outlined on Slide 37. The first was on your household debt service ratio outlook. It looks like that was revised lower this quarter relative to the last quarter. I'm wondering what led to that downward revision in the outlook.\n\nHas there been a change in the outlook for interest rates? Just trying to get a sense of why you expect the DSR to be lower?\n\nShawn Beber -- Chief Risk Officer\n\nSo, yes, there was a small change in the interest rate outlook in the outer years. And so that really impacted principally on the mortgage DSR calculations in the model. So that's really what's driven that change quarter on quarter.\n\nNigel D'Souza -- Veritas Investment Research -- Analyst\n\nOK. And I assume that you're assuming or your revision which is a lower pace of interest rate hikes on interest rate costs, is that correct?\n\nShawn Beber -- Chief Risk Officer\n\nYes.\n\nNigel D'Souza -- Veritas Investment Research -- Analyst\n\nOK. And then sticking with the theme here. Looking at your downside scenario, or the HBI, you have a decline in the first 12 months, which makes sense. That's typical.\n\nBut you also have a sustained decline in the remaining forecaster. So wondering what your rationale was there for the HBI to continue decline, not just in the near term but over the medium term in your downside scenario?\n\nShawn Beber -- Chief Risk Officer\n\nAgain, it's a downside scenario. So it anticipates a longer period of low growth. In fact, this quarter more of a recessionary sort of profile than it was in prior quarters. So over that the period that the FLI cover, we saw some reduction there.\n\nAnd it's outlook from our macroeconomics department. We build that into our models and incorporate that as part of our overall assessment of the quarter. But that's really what's driving the change quarter on quarter.\n\nNigel D'Souza -- Veritas Investment Research -- Analyst\n\nOK. And last question for me on this, comparing Canadian versus U.S. GDP. Across all the scenarios, you have Canada GDP growth outperforming in the U.S.\n\ntrying to get a sense of, again, what's the rationale there? I mean, what we're actually seeing right now is perhaps more interest rate sensitivity in the Canadian economy. So why do you expect Canada outperform even your downside scenario you have U.S. in a mild recession, but Canada not entering a recession, at least from a GDP standpoint?\n\nShawn Beber -- Chief Risk Officer\n\nI think there's a few things that the economists have been looking at, including sort of the starting point from where the recovery happened between Canada and the U.S. Canada was slower to recover. So we've got a bit of that, I would say, relative tailwind, if you would, between the geographies. We also have certain elements within the Canadian economy from a commodities perspective and strong employment that they continue to, I'd say, provide some level of cushion to the Canadian economy relative some of the other headwinds.\n\nAnd so it's a bit of a relative call based on those factors that result in a bit of a different perspective on where GDP goes from here.\n\nOperator\n\nThe next question is from Mario Mendonca from TD Securities.\n\nMario Mendonca -- TD Securities -- Analyst\n\nCould you help me reconcile two things that you've offered on this call so far, it's hard for me to see how they come together. One, you said that you don't expect a lot of margin improvement in Canada and the U.S. in those personal and business banking segment in the near term and fairly modest going forward. But your sensitivity suggests this is in your presentation, but there is meaningful upside in NII from changes in rates.\n\nIs the reconciliation of those two concepts really that the margin and the NII benefits will accrue to the center of the house in treasury and not the segment? Is that right way to reconcile those statements?\n\nHratch Panossian -- Chief Financial Officer\n\nI wouldn't say so, Mario. So if you look at the sensitivity and you run numbers on the $354 million plus $100 million, remember, that's over four quarters in the first year. And if you run math on basis points to the total bank, right? So total bank NIM, that's four basis points. And so if you look at that on a segment basis and you look at it on a quarterly basis, you get to something that's again in that modest quarter-over-quarter impact perspective as that ramps up, right? And so when you look at even to date.\n\nIf I look at what's happened from an interest rate perspective, if I look at quarter-over-quarter trajectory purely isolating the impact of interest rates as those have started coming up. That's what we've seen, a few basis points positive contribution to the margins in P&C to the margins overall the bank. So that's what we expect from interest rates. And that's part of the gradual repricing of the balance sheet as we manage that interest rate sensitivity to our targets.\n\nSo over time, it does add up, but we do expect good healthy momentum. It just comes slowly quarter over quarter.\n\nMario Mendonca -- TD Securities -- Analyst\n\nAnd then the year two sensitivity, would you offer a similar and that it might just be slightly better in year two, but it's entirely consistent with your guidance then on what margins can do?\n\nHratch Panossian -- Chief Financial Officer\n\nYes. That's right. And actually, what happens, right, is you get -- it's slower the year two part. Because if you look at the first year, the amount of that we disclosed, that's due to short-term rates.\n\nThat's basically the short resets that happens within a quarter even. And then the rest of it is the longer-term repricing that takes several years to price through. Once you get to the second year in that interest rate sensitivity, it's just assumed that you get this 100 basis point increase and then rates stay there. So there's no more short-term impact.\n\nSo it's just that ongoing repricing of the long exposure. So it's even more gradual when you get into the second year.\n\nVictor Dodig -- President and Chief Executive Officer\n\nI just add one other point is that our ability to grow market share is not factored into that. So if you actually look at the money in at CIBC, we're No. 2 in the market today. And our goal is to be No.\n\n1. So we are focused on continuing to grow deposits from our client base, continuing to grow investment management business from our client base. And as we go forward and we see the balance shifting perhaps away from loan growth and more continued deposit growth, we are going to be driving those numbers going forward, Mario, and just watch out for that across all of our businesses.\n\nMario Mendonca -- TD Securities -- Analyst\n\nAnd, Victor, do you -- now that you mentioned, do you believe CIBC's 11.8% capital rates can support that type of markets they're going?\n\nVictor Dodig -- President and Chief Executive Officer\n\nI think deposit growth actually contributes to capital origination as does investment management. We're very focused on that.\n\nOperator\n\nThe next question is from Lemar Persaud from Cormark.\n\nLemar Persaud -- Cormark Securities -- Analyst\n\nI'm just going to come back to some more detailed question on the soft pack, so page -- if I go to Page 6, noninterest income that other. Can you talk a bit about what drove that increase $114 million this quarter? Typically, it's below $70 million.\n\nHratch Panossian -- Chief Financial Officer\n\nYes. Thank you for the question, Lamar. Happy to take that one. So I'll say there's a little bit of accounting noise here and technicality between the different line items.\n\nSo let me try to decompose that for you and leave you with the punch line. So the large fluctuation in that line this quarter, if you dig underneath it, it's specifically the subline that's gains and losses on non-trading derivatives. And that's where we had $76 million quarter-over-quarter increase, $53 million year-over-year increase. So that's basically the movement.\n\nThere's two things that impact that. One is a lot of our treasury activities related to non-trading derivatives used for hedging and that's hedging of interest rate positions, hedging or funding that we issue both on the interest rate and the currency side. And then also financing activities in capital markets. So sometimes derivatives are used in those structures where we're financing securities positions providing leverage to clients.\n\nAnd so that through that line item. And so the noise part, there's about $30 million to $35 million of that number, whether you look at it on a year over year or quarter over quarter, that's actually noise that's offset in other line items. So this is similar to what I was saying on the trading thing. Sometimes you've got an underlying position and that comes through NII and then there's a hedge on it with a derivative and that comes through this line item.\n\nSo $30 million to $35 million of this is offset either in NII declines or declines in the FX other than trading line. So that I would consider as there's no net impact to our revenues. The remainder of it is real. And really, if you look at it quarter over quarter, about $40 million of that, that's related to our treasury hedging activities, which had a positive impact.\n\nSo that's the only real net revenue benefit that I would highlight the rest of it is noise.\n\nLemar Persaud -- Cormark Securities -- Analyst\n\nOK. That's understood. And then just sticking with that same schedule and noninterest income, the card fees. I know this has come up in the past, but the lowest level in two years, you've added on the Costco portfolio, purchase volumes are increasing.\n\nSo can you talk to me a little bit about why is that card fees line not increasing? And the number I'm referring to is the $98 million?\n\nHratch Panossian -- Chief Financial Officer\n\nYes. Thanks, Lamar. And good question on that one as well. So the Costco portfolio has come in, it actually put some pressure on the card fees in PBB.\n\nAnd remember, we talked about this a little bit in the past. The way the revenue on that program works, there's revenue in the fee line item, but there's also expenses that go as a contra revenue on that line item related to points and so forth on the cards. So the Costco program on its own, as it came in, it's put about, call it, around a $30 million pressure on the fee line item. That's in now.\n\nOn a go-forward basis, I don't expect it to put -- it's going to be neutral on the fee line item. So going forward quarter over quarter as we grow the program, no contribution to fees but also no further pressure. So that puts pressure on that line item if you look at it now relative to prior quarters, but it won't going forward. And on the NII side, it more than offsets that, and that's how the revenues of that particular program come in.\n\nSo hopefully, that's helpful.\n\nOperator\n\nThe next question is from Mike Rizvanovic from KBW.\n\nMike Rizvanovic -- Keefe, Bruyette and Woods -- Analyst\n\nFirst question, just a couple of numbers questions, maybe for John. Just looking at the Canadian wealth. So I'm just taking your adjusted numbers. And correct me if I have the numbers wrong here.\n\nBut when I calculate Canadian wealth on its own. It looks like you had a pretty sizable decline quarter over quarter in the adjusted earnings number. It looks like it's all revenue driven. Can you comment on Canada Wealth specifically this quarter?\n\nJon Hountalas -- Head, Canadian Commercial Banking and Wealth Management\n\nYes. So the flow piece of the Canadian wealth business was very good. On a retail mutual fund basis, we're in line with the industry. The industry is soft.\n\nIn Gundy, we had our record flow. So we've had record flows in the third quarter, record flows year over year. What you see there is just market fluctuations. It's a Canadian business.\n\nMarkets were choppy in Q3. And that's the -- nothing else but the market and reasonable flows within that market.\n\nMike Rizvanovic -- Keefe, Bruyette and Woods -- Analyst\n\nOK. I guess I'm just surprised by the magnitude. Just based on my numbers, it's $94 million this quarter, down from $139 million. It just seems like a sizable decline just even given the market conditions.\n\nAnything else in that? Is there anything related to mix or what the flows have been?\n\nJon Hountalas -- Head, Canadian Commercial Banking and Wealth Management\n\nThe close -- it's market. There's nothing else in there.\n\nMike Rizvanovic -- Keefe, Bruyette and Woods -- Analyst\n\nOK. So no difference in the flows that are coming in being maybe a little less profitable type or type?\n\nJon Hountalas -- Head, Canadian Commercial Banking and Wealth Management\n\nSo again, the industry and retail mutual funds, those are the best margin flows. The industry is negative on flows in Q3. I think we ranked No. 2 in the industry, less redemptions than most.\n\nAnd our Gundy flows are at record levels. Now Gundy flows are always -- full-service brokerage flows are lower margin. But that would not explain any of the drop. The drop is market.\n\nMike Rizvanovic -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Appreciate that. And then a quick one for Laura. I just wanted to ask about the Canadian residential mortgage book.\n\nAnd if you look at Page 34 of your report to shareholders, it shows that 22% of your book is greater than 35 years on amortization. And I think that was 12% last quarter. It was zero at the end of last year. And I don't know off the top of my head, I'm guessing that's probably higher than peers.\n\nBut is there any reason to look at this and think that maybe CIBC's borrower base on the mortgage side in Canada, are just more highly levered than what we see with the peers. Any color on that would be appreciated.\n\nLaura Dottori-Attanasio -- Head, Canadian Personal and Business Banking\n\nYes, Mike, I'm happy to answer that, and Shawn can add on if he likes. Yes, I don't see any issue with that. As you know, and Shawn talked about it with the rise in rates and the variable rate mortgages with how our book functions, you see increased capitalization as rates rise because our clients' payments that are under variable rate mortgage doesn't change until they hit a threshold. And so that's why you see higher amortization.\n\nShawn talked that what we're seeing is our clients proactively start to make payments. So that's why you see increased amortization, but nothing to worry about, as Sean pointed out. and a lot of that will get reset at renewal time from our clients. So not concerned.\n\nI don't know, Shawn, if you wanted to add. Go ahead, Mike.\n\nMike Rizvanovic -- Keefe, Bruyette and Woods -- Analyst\n\nSorry. So -- sorry, go ahead, Shawn.\n\nShawn Beber -- Chief Risk Officer\n\nLook, I'd just say that this is a function of, as we talked about, it's a fixed payment, but the more -- as interest rates rise, more of the fixed monthly payment goes toward interest rather than principal, which then just mathematically extends the amortization. So -- and if that continues to a level, then clients can start to capitalize that interest, which we're not seeing at current rates, but the rates continue to rise, you could see some of that happen. And then as we've talked about in prior discussions, if that capitalization continues to a level it hits what we call the designated amount, which is 105% of the original principal amount, then they did need to be an immediate payment to deal with that. But at this point, the 22% of the portfolio that has the amortization beyond is really the mathematical outcome of more monthly payment going toward interest rather than principal and automatically, therefore, extending out what the calculated amortization would be based on that payment.\n\nMike Rizvanovic -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Got it. And then just to your knowledge, Shawn or Laura, would you be -- would you think that CIBC have a higher number than peers? Because the structure on that variable product is pretty similar for most of the banks. I'm just wondering if it's something that's maybe a bit more elegant at CIBC and why that would be? It would suggest potentially maybe borrowers taking on a bit more leverage at least with respect to the most -- more recent originations.\n\nAny thoughts on that?\n\nShawn Beber -- Chief Risk Officer\n\nYes. I haven't seen the other results. I'd just say that this is the way the product would work given that we've got the fixed monthly payment that doesn't adjust with interest rates. And as Laura said, we are seeing some clients just proactively making payment flat.\n\nBut we don't have concerns based on what we're seeing to date in terms of credit quality or issues building.\n\nOperator\n\nThe next question is from Doug Young from Desjardins Capital Markets.\n\nDoug Young -- Desjardins Capital Markets -- Analyst\n\nHopefully, this will be relatively quick. Victor, at the very beginning, you talked about the addition of 300,000 clients. I think that was in Canadian banking and you gave some stats around that. What I'm particularly interested in is where those clients are going? Are you having success attracting them into core deposit accounts where paychecks are going into? Is this more mortgage origination? Is it across all of it? And how much and how many of these clients would be multiple product clients? And how is the cross-selling on that side? Just trying to get a sense, could you talk about growth is obviously an important part of that.\n\nSo just color would be much appreciated.\n\nVictor Dodig -- President and Chief Executive Officer\n\nThanks, Doug. And if you go back to first principles and our key strategic priorities to grow within the affluent segment and over-index there. So as we took you through the data on Investor Day, in Laura's presentation, she outlined our current portfolio of clients, 11% of our households are in the affluent segment. Our strategy is to over-index on that and to grow our market share in that affluent segment.\n\nAnd when you see us bring in 300,000 clients, 25% of which are in the affluent segment, that strategy is on track. Overall, clients in the affluent segment tend to have deeper relationships with us. They go through the CIBC GoalPlanner platform. They tend to have business on both sides of the balance sheet.\n\nThat is exactly the kind of business we're focused on. That is highly aligned with strategy that Laura outlined at Investor Day and we continue to deliver on that. Laura, I don't want to add anything to it. But we're highly encouraged that one of our key priorities is well on track, and we plan on delivering on that after quarter after quarter.\n\nLaura Dottori-Attanasio -- Head, Canadian Personal and Business Banking\n\nWell said, Victor. I would state that to your question, where we're seeing it, it's across all of our products, but really leading the way, and this is great is in the deposit side. so with everyday banking products. And so that is how we real engagement with our clients.\n\nSo we're really happy with how we're leading in that regard. So thanks.\n\nDoug Young -- Desjardins Capital Markets -- Analyst\n\nOn the deposit side, is this more on the term side? Is this more a checking account? Can you give a little more granularity on that side?\n\nLaura Dottori-Attanasio -- Head, Canadian Personal and Business Banking\n\nYes. It's across the board that we're seeing it. So again, very solid, and we continue to see really impressive new client acquisition and retention in our everyday banking account. So those are our transactional accounts.\n\nOperator\n\nLadies and gentlemen, this is all the time we have for your questions. I will now turn the call over to Victor.\n\nVictor Dodig -- President and Chief Executive Officer\n\nThank you, operator, and thank you all for your very insightful questions, and we hope we answered them to your satisfaction. I just want to close by saying a couple of things. The solid results we reported this quarter demonstrate our strength and agility and a challenging economic environment. As we've laid out to you at Investor Day, we have a strategic plan that's built for sustainable growth and our continued capital strength enables us to focus on targeted high-return investments to deliver value to shareholders over the long term.\n\nOur leadership team at CIBC is highly focused on delivering against these objectives. We're going to continue to take a disciplined approach to our risk and expense management -- we're going to proactively calibrate our growth investments to changes in economic conditions. If things get better, we'll continue on the path. If things soften up, we'll adjust accordingly, but we're always focused on strategic growth for the long run.\n\nAnd we're going to continue to leverage technology improve efficiency and the banking experience we offer to our clients. So in closing, I'd like to thank our entire CIBC team for being on purpose as we deliver for all of our stakeholders and I want to thank you for your continued interest in our bank, your investments in our bank, and we look forward to speaking with you at the next quarter call and certainly in between then. Take care. Enjoy the rest of the summer.\n\nLaura Dottori-Attanasio -- Head, Canadian Personal and Business Banking\n\nThank you. The conference has now ended. Please disconnect your lines at this time, and we thank you for your participation.\n\nDuration: 0 minutes\n\nGeoff Weiss -- Senior Vice President, Investor Relations\n\nVictor Dodig -- President and Chief Executive Officer\n\nHratch Panossian -- Chief Financial Officer\n\nShawn Beber -- Chief Risk Officer\n\nJohn Aiken -- Barclays -- Analyst\n\nLaura Dottori-Attanasio -- Head, Canadian Personal and Business Banking\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nMike Capatides -- President and Chief Executive Officer, CIBC Bank USA\n\nScott Chan -- Canaccord Genuity -- Analyst\n\nHarry Culham -- Head, Capital Markets\n\nMeny Grauman -- Scotiabank -- Analyst\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nNigel D'Souza -- Veritas Investment Research -- Analyst\n\nMario Mendonca -- TD Securities -- Analyst\n\nLemar Persaud -- Cormark Securities -- Analyst\n\nMike Rizvanovic -- Keefe, Bruyette and Woods -- Analyst\n\nJon Hountalas -- Head, Canadian Commercial Banking and Wealth Management\n\nDoug Young -- Desjardins Capital Markets -- Analyst\n\nMore CM analysis\n\nAll earnings call transcripts"
}