{
  "companyName": "Catalent",
  "companyTicker": "CTLT",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/29/catalent-ctlt-q4-2022-earnings-call-transcript/",
  "content": "Catalent (CTLT -0.55%)\nQ4 2022 Earnings Call\nAug 29, 2022, 8:15 a.m. ET\n\nOperator\n\nGood morning. Thank you for attending today's Catalent, Inc. fourth quarter fiscal year 2022 earnings call. My name is Forum, and I will be your moderator for today's call.\n\n[Operator instructions] It is now my pleasure to pass the conference over to our host, Paul Surdez, vice president of investor relations. Mr. Surdez, please proceed.\n\nPaul Surdez -- Vice President, Investor Relations\n\nGood morning, everyone, and thank you for joining us today to review Catalent's fourth quarter and full fiscal year 2022 financial results. Joining me on the call today are Alessandro Maselli, president and chief executive officer; and Tom Castellano, senior VP and chief financial officer. Please see our agenda for today's call on Slide 2 of our supplemental presentation, which is available on our investor relations website at investor.catalent.com. During our call today, management will make forward-looking statements and refer to non-GAAP financial measures.\n\nIt is possible that actual results could differ from management's expectations. We refer you to Slide 3 for more detail on forward-looking statements. Slides 4 and 5 discuss Catalent's use of non-GAAP financial measures, and our just-issued earnings release provides reconciliations to the most directly comparable GAAP measures. Please also refer to Catalent Form 10-K that will be filed with the SEC today for additional information on the risks and uncertainties that may bear on our operating results, performance, and financial condition.\n\nNow, I'd like to turn the call over to Alessandro Maselli, whose opening remarks will begin on Slide 6 of the presentation.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nThanks, Paul, and welcome, everyone, to the call. Fiscal '22 was another extraordinary year for Catalent. During the year, we achieved the strong results both financially and operationally, while also making a positive impact on our global community by delivering our mission to develop and deliver products that help people live better and healthier lives. Some of the top highlights since July 21 include significantly investing in capacity and infrastructure in both North America and Europe, particularly focused on servicing the high-demand segments of the market, adding another growth engine to the company through our entry in consumer-preferred dosage gummy dosage forms for nutritional supplements, which we continue to aggressively expand; agreeing to acquire a new capacity that will accelerate our ability to handle demand in the attractive category of highly potent compounds; expanding and deepening one of our best-selling tools in the industry; intensifying our long-standing commitment to sustainability, accelerating our growth strategy; and delivering record financial results despite the difficult inflationary environment and ongoing supply chain challenges.\n\nFiscal '22 net revenue was $4.83 billion, which grew organically in constant currency at 20% compared to prior fiscal year. This growth was primarily driven by broad demand for our biologics offering, including the demand for COVID-19-related products, increased demand for our customer prescription products, and a rebound in demand for our consumer products. Adjusted EBITDA for the year was $1.29 billion, reflecting constant currency organic growth of 28% compared to fiscal '21. We also increased our adjusted EBITDA margin to 26.6%, up 110 basis points from 25.5% we recorded in fiscal '21.\n\nFiscal '22 adjusted net income was $694 million, or $3.84, per diluted share, up from $3.04 per diluted share in fiscal '21. Now focusing on the fourth quarter, I am pleased to report that we have closed out the year with the strong results as our robust business momentum more than offset headwinds from inflation and unfavorable exchange translation. As shown on Slide 7, our fourth quarter revenue was $1.31 billion, increasing 10% as reported, or 15% in constant currency, compared to the fourth quarter of fiscal '21. When excluding acquisitions and divestitures, organic growth was 10% measured in constant currency.\n\nThis growth was primarily driven by our biologics segment, which grew double digit despite lower year-on-year revenue in the quarter from COVID-19 programs. Our fourth quarter adjusted EBITDA was $384 million, an increase of 10% as reported, or 16% on a constant currency basis, compared to the fourth quarter of fiscal '21. When excluding acquisition and divestiture, organic growth was 15% measured in constant currency. Our adjusted net income for the fourth quarter was at $150 million or $1.19 per diluted share, up from $1.16 per diluted share in the corresponding prior-year period.\n\nAs you know, we put in place new organizational structure effective July 1st, the start of fiscal '23, which was also the same-day transition to my current role as a CEO. Our new structure will allow us to better manage the business as it has grown over the last few years, while also enabling a value creation by giving the customers easier access to a broader array of our services. The reorganization has reduced our number of operating segments from four to two, with one focusing on biologics and the other on pharmaceuticals and consumer health. Each segment represents roughly out of the total company revenues illustrated on Slide 8.\n\nWe will begin reporting results under this new structure starting with our first quarter earnings call in early November. We will also issue a restatement of recent historical results under the new structure in the coming weeks. The new pharma and consumer health segment includes the offering of three of our prior segments: softgel and oral technology, oral and specialty delivery, and clinical supply services; and overwhelmingly, services small molecule programs. Notable offerings in pharma and consumer health segment include our market-leading capabilities for complex oral solid, softgel formulation, Zydis fast-dissolve tablets, gummies and soft chews, and clinical development and trial supply services.\n\nWe have established dedicated teams focused individually on pharmaceutical, consumer health, and clinical development and supply offerings. Our long-term revenue growth expectation for the pharma and consumer health segment is 6% to 10%, which is a 200 basis points higher at the upper end than the combined growth rates of the three previous segments not included within this new segment. This is due to the commercial synergies unlocked by our new go-to-market strategy enabled by this organizational structure and greater exposure to higher-growth sectors of small molecule markets as a result of recent investment and acquisitions. The new biologics segment is essentially the same as the biologics segment we reported in fiscal '22, with some internal organization adjustment to better service the new modalities employed by many of our biopharma customers.\n\nOur respective long-term growth net revenue growth rate for the biologics segment remains at 10 to 15%. There are several benefits to this important structural change: first, the simplified reporting structure enable us to be more agile in meeting and anticipating customer needs and expectations, as well as adapting to evolving customer in those events; second, creating a more integrated offering to make it easier for customers to do business with Catalent, leading to an enhanced customer experience and minimized barriers for existing and potential customers to access multiple services, thereby enabling a commercial synergies. Finally, it allows for even greater operational excellence as a result of quality and operations oversight that bolsters accountability across the network. Importantly, based on our confidence in the long-term growth expected across both segments to our continued investment in synergies resulting from our reorganization, we're in a comfortable position to raise the top end of our projected consolidated long-term growth rate to 12% compared to the previous 10% as shown in Slide 8.\n\nLooking to fiscal '23, while Tom will review the details of our guidance later in the call, I would like to make some high-level remarks on our revenue outlook. I indicated that on our last earnings call in May that we were comfortable projecting a fiscal '23 organic growth in line with our previous long-term organic revenue growth rate of 8% to 10% despite our forecast for a considerable decline in revenue from COVID-19-related programs. Since then, given the more pronounced seasonality we project in customer ordering for these programs, as well as the pacing of our fiscal year, we have further decreased the level of COVID-related revenue in our guidance model. The new model used for the guidance we are sharing today fixing to account the updated timing of the switch to single-dose formats and forecast a roughly 2/3 decrease in COVID vaccine-related volumes in fiscal '23 compared to fiscal '22.\n\nAfter accounting for these additional derisking of COVID revenue, we still expect the fiscal '23 organic growth at the midpoint to be around the low end of our long-term range on a constant currency basis. Our projection of fiscal '23 revenue growth is driven by our non-COVID business, which is expected to grow organically by more than 25% at constant currency due to several factors, including: growth expansions of existing assets that came online in the past year, such as our new drug substance lines in Madison and drug product lines in Bloomington in Europe; maximizing efficiencies in other areas of our global network, including those that manufacture our gummy format in previously announced buildouts; our cell therapy and plasmid offerings in Europe and U.S.; adding a new capacity in the next two quarters, including the opening of eight previously announced gene therapy suites in BWI; and additional drug substance capacity in Bloomington; the large commercial drug transfer programs in our drug product assets we discussed on our last earnings call; and later in fiscal '23, our two new facility currently completing construction, our commercial cell therapy facility in Princeton, and our drug substance facility in Knoxville will start to generate meaningful revenue. Additional growth, not reflected in the fiscal 2023 guidance we are issuing today is anticipated the following the closing of our recently announced agreement to acquire Metrics Contract Services, a full services specialty CDMO with a 330,000 square foot facility in Greenville, North Carolina for $475 million from Mayne Pharma is summarized on Slide 9. The acquisition of this business and facility, which has ensured well over $100 million in capital improvements in the last five years will enable Catalent to accelerate existing plans to meet increasing demand for fit-for-scale, high-drug manufacturing.\n\nOf course, the acquisition remains subject to customary closing conditions, including antitrust clearance. We expect to close the acquisition before December 31st. One reason for our enthusiasm about the Metrics business is the growth in the number of potent compounds in the oral solids market, driven by strong growth in the oral oncology pipeline, where more than 80% of programs require potent handling, as well as the industry shift to in-silico discovery, which often yields more potent and less soluble molecules. In the last several years, Catalent has seen numerous opportunities to work with the highly potent compounds, which we can now service after we completed the acquisition of Metrics.\n\nMetrics' Greenville facility generated revenue of more than 90 million during our fiscal '22 from services from third-party customers, including large pharma and emerging biotech customers, as well as manufacturing services for several Mayne Pharma own products. I note that our deal with the Mayne Pharma includes a long-term supply agreement to manufacture certain of its product at the Greenville facility after closing. Once acquired the Metrics business will become part of our pharma and consumer health segment and is expect to deliver revenue growth comparable to the segments projected overall long-term growth of 6% to 10%. Metrics EBITDA margin is accretive to the PCH margin.\n\nAnd we intend to drive this margin in above 30% over time by increasing utilization. Adding potent handling capabilities in first-for-scale capacity through Metrics represent a continuation of our strategy to maintain a balanced portfolio of offerings that closely matches the industry pipeline, which includes a growing number of innovative small molecules that are complex to formulate or require specialized handling. While innovation in the biologics market is more frequently mentioned in the headlines, oral delivery is still the foundation of the description drug pipeline with almost a 6,000 oral compounds currently in development, up approximately 10% from last year. And that's been the focus of recent substantial pharma M&A activities.\n\nThe combination of our strategic acquisitions like Metrics and our organic investments has positioned our overall portfolio for long-term success, including being in a strong position to meet our long-term targets. As I present my remarks this morning, let me add the goals and objective for fiscal 2023 set by me and the rest of the executive team lay the foundation for executing on our long-term strategy, and also help position us to deliver another strong fiscal year as we navigate the obstacle facing our industry today, which include the continuing supply chain challenges, inflationary pressures, energy supply issues in Europe, the uncertainty in the biotech funding, a lower and more seasonal demand for vaccine as we exit the pandemic. I am energized by our strategy for growth ambitions, the roadmap we have in place, and the Catalent team working together to deliver for patients who rely on us. We continue to be in a strong position to succeed in the attractive markets we serve.\n\nFinally, I would like to congratulate Karen Flynn, who was elected by our board of directors last week to become the board's newest member effective September 15. Karen recently retired after a long distinguished career in pharma service industry with her most recent role at Catalent's senior vice president and chief commercial officer. And we are delighted to be able to continue Karen's involvement with the company. Now, I would like to turn the call over to Tom.\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nThanks, Alessandro. I'll begin this morning with a discussion on segment performance where commentary around segment growth will be in constant currency. I'll start on Slide 10 with the biologics segment. Biologics net revenue in Q4 of $667 million increased 14% compared to the fourth quarter of 2021.\n\nThis strong net revenue growth was driven organically by increased demand in our cell and gene therapy, drug product and drug substance offerings, which more than offset lower year-over-year revenue from our COVID-19-related programs. Our fiscal 2022 third quarter marked the peak in our COVID-19-related revenue with Q4, down both sequentially and year over year. When looking at the bar graph on Slide 10, you will see that biologics commercial revenue declined year on year. The driver of the year-over-year decline is the conclusion of the COVID-19 program that was classified as a commercial product for revenue recognition purposes.\n\nThis program is not expected to generate future revenue. The segment's EBITDA margin of 32.8% was up more than 210 basis points year over year from the 30.9% recorded in the fourth quarter of fiscal 2021 and up 170 basis points sequentially over the third quarter. Year-over-year margin expansion was fueled by strong operational efficiencies, which more than offset the impact of remediation activity in Brussels. Note that remediation-related costs were lower in Q4 than in Q3, and remediation activity continues at the site in fiscal 2023.\n\nIn addition, market was aided by a mix shift away from lower-margin component sourcing revenue, which, as mentioned on past calls, represents approximately 25% of total COVID vaccine revenue. As COVID-19 revenue continues to decline, so will the related diluted margins from component sourcing that we have recently experienced. As shown on Slide 11, softgel and oral technologies, net revenue of $350 million increased 22% compared to the fourth quarter of fiscal 2021, with segment EBITDA increasing 9% over the same period last fiscal year. The October 1, 2021 acquisition of Bettera contributed 18 percentage points to SOT's net revenue growth and 13 percentage points to the segment's EBITDA growth during the quarter.\n\nThe operational performance of the acquired Bettera business continues to exceed our expectations and remains an important driver for continued margin expansion for the company. SOT organic net revenue increased 4% and was driven by continued growth in development revenue, as well as demand for both prescription products and consumer health products. However, supply chain challenges, inflationary pressures, and unfavorable mix weighed on overall organic results, muting the impact of increased product demand. Slide 12 shows the results of the oral and specialty delivery segment.\n\nNet revenue grew 11%, and segment EBITDA was up 27% over the fourth quarter of last year. Overall demand for our Zydis offerings reached a record level, fueling significant growth. This strong demand was further supplemented by revenue from a royalty agreement related to our Zydis platform, which was a primary driver of the segment's strong EBITDA margin. As shown on Slide 13, our clinical supply services segment posted net revenue of $104 million, representing 4% growth over the fourth quarter of fiscal 2021, driven by growth in our storage and distribution services.\n\nSegment EBITDA declined 2%, driven by unfavorable mix. As of June 30, 2022, backlog for the segment was $540 million, up from $529 million at the end of last quarter and up 10% from June 30, 2021. The segment recorded net new business wins of $132 million during the fourth quarter compared to $119 million in the fourth quarter of the prior year. The segment's trailing 12-month book-to-bill ratio is 1.1 times.\n\nMoving to our consolidated adjusted EBITDA on Slide 14, our fourth quarter adjusted EBITDA increased 10% to $384 million or 29.2% of net revenue, which was roughly in line with the fourth quarter of fiscal 2021. On a constant currency basis, our fourth quarter adjusted EBITDA increased 16% compared to the fourth quarter of the prior year. For the full year, adjusted EBITDA increased 26% to $1.29 billion over fiscal '21 and 28% on a constant currency basis. Adjusted EBITDA margin increased 110 basis points to 26.6% in fiscal '22 from 25.5% in fiscal '21.\n\nAs shown on Slide 15, fourth quarter adjusted net income was $215 million or $1.19 per diluted share compared to adjusted net income of $209 million or $1.16 per diluted share in the fourth quarter a year ago. For the full fiscal year, adjusted net income was $694 million or $3.84 per diluted share compared to adjusted net income of $549 million or $3.04 per diluted share in fiscal 2021. Slide 16 shows our debt-related ratios and our capital allocation priorities. Catalent's net leverage ratio as of June 30, 2022, was 2.9 times, slightly below our long-term target of 3.0 times.\n\nThis compares to net leverage of 2.6 times on March 31, 2022, and 2.2 times on June 30, 2021. Our combination, our combined balance of cash, cash equivalents, and marketable securities as of June 30, 2022, was $538 million compared to $880 million as of March 31, 2022. Note that our free cash flow has been negatively impacted the last two years by our strategic decision at the onset of the pandemic to increase inventory levels, which continue to allow us to have the inputs we need to meet our supply obligations to our customers and their patients in a timely manner. When we feel the time is appropriate and are more comfortable with the stabilization of our supply chain, we will begin to reverse course, which will have a future positive effect on free cash flow.\n\nSimilarly, the realization of contract assets will also drive a favorable impact on future free cash flow after negatively impacting our fiscal 2022 results. As of June 30, 2022, our contract asset balance was $441 million, an increase of $260 million compared to June 30, 2021. The overwhelming majority of this increase is related to some notably large development programs, such as for some of the COVID vaccines, where revenue is recorded based on a percentage of completion versus entirely on batch release as it is for commercial programs. This difference in approach affects when we are able to invoice customers, thereby delaying cash realization and negatively affecting free cash flow.\n\nMoving on to capital expenditures. We added a new slide in the appendix that illustrate our annual capex spend. In fiscal 2022, capex as a percentage of revenue was 14% compared to 17% in fiscal 2021. Capex as a percent of revenue was a bit lower than we initially expected for fiscal 2022, driven by higher-than-expected revenue growth, as well as some supply chain-related delays and longer lead times than initially anticipated for some of our capital projects.\n\nFor fiscal '23, we expect capex to be in a similar range as fiscal '22, or approximately 13% to 15% of net revenue. Now, we turn to our financial outlook for fiscal 2023 as outlined on Slide 17. The midpoints reflected in our outlook assume the challenging macro environment remains stable. We expect full year net revenue in the range of $4.975 billion to $5.225 billion, representing growth of 3% to 8% on an as-reported basis compared to fiscal 2022.\n\nCurrent FX rates, which we use in this forecast, are forecasted to have a negative impact of approximately three to four percentage points on our revenue and adjusted EBITDA growth. We project that inorganic revenue, which basically reflects one remaining quarter of the Bettera acquisition until the first anniversary of that acquisition on October 1st, will positively impact our annual growth rate by less than one percentage point. So, after taking into account these two considerations, our expected organic constant currency net revenue growth rate in fiscal 2023 is approximately 8% at the midpoint of our guidance range. The acquisition of Metrics will be factored into updated guidance we will share during the first earnings call following the close of the transaction.\n\nFor full year adjusted EBITDA, we expect a range of $1.31 billion to $1.39 billion, representing growth of 2% to 8% at reported rates compared to fiscal 2022. I would like to remind you of the seasonal name of our business, where revenue and EBITDA generation is historically more weighted to the back half of the year with roughly 60% of fiscal 2023 adjusted EBITDA expected to be generated in the second half of the year. Now, we expect limited EBITDA margin this year on a constant currency basis. While we're still on track to achieve our fiscal 2026 EBITDA margin target of 30%, there are a number of factors impacting margin expansion in fiscal '23 including: headwinds from COVID-related volume declines that we have been anticipating; inflationary and supply chain pressures; start-up costs related to our acquisitions of Princeton and Oxford, which we are absorbing in our organic assumptions because neither asset generated substantial revenue prior to its acquisition, and foreign exchange translations as our margin profile is higher outside of the U.S., while the majority of our corporate costs are domestic.\n\nNote that swings in the euro have a greater impact on FX translation than the pound. Moving to adjusted net income. We expect full year ANI of $660 million to $730 million, representing a range from a decline of 5% to an increase of 5% compared to fiscal 2022. However, ANI is negatively impacted by FX translation of more than four percentage points.\n\nIn addition, ANI growth in fiscal 2023 is being impacted by all of the items affecting adjusted EBITDA, as well as the following items; first, an expected higher effective tax rate in the 24% to 25% range, compared to 23.4% in fiscal 2022, given the year-on-year increase in the waiting of earnings in higher tax jurisdictions; second, an increase in interest expense due to servicing the full year of new debt we raised in part to fund the Bettera acquisition, as well as other interest-related increases in the current rising interest rate environment; and finally, increased depreciation expense due to our significantly larger asset base, which is also more heavily weighted in the U.S. The last piece of our guidance is the fully diluted share count. As in the past years, we offer guidance on share count on a diluted weighted average basis, which is the number needed to compute our adjusted net income per share or adjusted EPS. For fiscal 2023, we expect our share count to be in the range of 181 million to 183 million shares.\n\nOperator, this concludes our prepared remarks, and we would now like to open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Tejas Savant with Morgan Stanley. Tejas, your line is now open.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nHey, guys, good morning. So, maybe just following up there, Tom, on your remarks on the margin that headwinds. You know, outside of that 300 to 400 bps FX hit on both the top line, as well as EBITDA, can you share some color on the moving pieces here in terms of the facility remediation, the new facility ramps, and COVID contributions normalizing? And I think you also called out some inflation dynamics. So, if you can just share some color and help build a bridge from where you finished fiscal 2022 and the mid-point of the guide next year on EBITDA margin, that would be helpful.\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nYeah. Sure, Tejas. So, thanks for the question. Yes.\n\nSo, your numbers are spot on in terms of FX, we did talk about FX impact of three to four points on revenue in EBITDA. We do see a little bit more of an impact to the to the bottom line from FX than we do it in the top line just given the geographic I would say mix of earnings there. So, the -- I would say the EBITDA impact to FX is more toward the top of that range, where the revenue impact, I would say, is more toward the low to the midpoint of that range. So, figure somewhere between 0.5 basis point difference between revenue and EBITDA there.\n\nOther items, I did mention in my comments that we do have remediation efforts continuing in Brussels here into our fiscal '23. And that obviously is reflected into our guidance for sure. From a COVID standpoint, we mentioned in our prepared remarks that we have -- taking a 2/3 haircut to the volumes we saw in fiscal '22. In our fiscal '23 guidance, that's further de-risking from what was assumed as part of our May comments on our third quarter call here.\n\nAnd, you know, just given that decrease in volume and the absorption impact related to running at high levels of utilization on COVID dedicated lines, there is a relatively, you know, impact -- relative impact to our overall margin profile as a result of that. Supply chain and inflationary pressures, you know, I would say continue to be a challenge. And in some cases, even I would say more of a challenge now than they were in terms of how we've talked about this in the past. We've seen more supply chain impacts to our SOT segment, specifically more recently around our ability to get our hands on active ingredients and other key inputs related to consumer health volumes.\n\nSo, that will play a role into the a little bit of the margin story here. And then just from an inflationary standpoint, I mean, look, just given the environment we're in, we're looking at impact related to wages that are probably about two times what we would've seen in a normal year. And that doesn't take into account what we're seeing on just the material side of things as well. You know, obviously, we're able to pass those off to customers.\n\nWe're doing that. We're going after price where we can as well to help offset some of these pressures. But, you know, giving all of these moving pieces here to be sitting in a position on a constant currency basis where we are seeing modest margin improvement is a pretty good position to be in and what I would consider the most challenging macroeconomic environment, I've seen in my career. Lastly, I would just say we continue to be on track from a long-term margin target year, Tejas.\n\nAlthough, we're not going to see the margin expansion of a 100-plus basis points like we've seen over the last several years, we remain committed to our 28% EBITDA margin by -- I'm sorry, by our 30% EBITDA margin by fiscal 2026.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nGot it. That's super helpful, Tom. And then one for Alessandro, just in terms of the impact of the new operating structure from a customer standpoint, what changes versus before? Any color there on the commercial synergies that you alluded to? And as you think about, you know, the segment growth rates that you had pointed to embedded in your prior long-term target, where do you expect to see the biggest uplift?\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nSure, sure. Look, this is very simple in many ways although not easy as it's required a little bit of organizational adjustment. Look, when you look at the percentage of our customers, which are buying more than one service from Catalent, this is still a relatively low percentage. And when you look at where the customer base is going with the more and more customers, which are more on the small side, the biotech type of customers, clearly, they have the need of way more than just one service out of Catalent.\n\nAnd there is an opportunity there to significant increase the share of existing customers, which and the new customers will enjoy more than one service out of a Catalent offering. In the past, our previous organization was creating some internal barriers from that web, both from a go-to-market strategy and from an execution standpoint. And by combining all of these together, three of those barriers have been removed. There are incentive plans allowing people to benefit from across cross-offering wings.\n\nAnd we are already seeing, since the onset of these new organization, some very good trends in these regards. So, with regards of the increased guidance for this segment, look, we have made the rights investments in the gummy business. We already said that this gummy business is growing significantly above the average of this segment. We also have expanding and resolved some bottleneck we have in the capacity on the complex or solid the business in North America, which were constraining in the past little bit growth was a self-constrained.\n\nWe did demand that we see demand. And we couldn't really enjoy the whole demand that we were seeing there. And lastly, the fact that we are now both organically and inorganically opening up our offering to high potent, which is the fastest growing sub segment of oral solid, primarily driven by oncology pipeline, all of that combined really has an impact on the expected growth rate of these segments. So, in many ways, these are -- these were things in the making over the last two years unlocked by these new organization.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nGot it. Very helpful. Appreciate the color.\n\nOperator\n\nThank you for your question. Our next question comes from the line of Luke Sergott with Barclays. Luke, your line is now open.\n\nLuke Sergott -- Barclays -- Analyst\n\nGood morning, guys. Thanks for the question. To jump in real quick here on the guide. Can you help frame us what the range of COVID is down based in the guidance for '23? So if the midpoint is down two-thirds on the volumes, what the worst case scenario would be and best case for you guys.\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nSo, Luke, I would maybe just start here by saying, I don't know that there's a significant variation around COVID volume to the low end here. You know, I would say, the levels that we've taken COVID volume down is reflective of contractual obligations that we have with key customers and decreasing at 2/3 from where we were in fiscal 2021, puts it down to a relatively much smaller, smaller level than it has been contributing in the past. I would say, you know, that's not an assumption that I would say is really the variability here in terms of the guidance range. Now, there's obviously if we see any significant increases here related to COVID demand that, you know, can factor into the high end or outside on the high end of the range.\n\nBut I wouldn't say that there's material swing and the assumption around COVID throughout the range of guidance. I would say, the real variability here in terms of our range is just a lot of the supply chain-related challenges that we saw. And are we going to have any difficulty in getting our hands on, you know, materials there. As I mentioned, the midpoint of the range assumes that the macroeconomic environment we're in today remain steady.\n\nIf that were to get worse, that would be more of a potential impactor to the -- to getting us toward the lower end of that range versus any further movement on the COVID side, which as I said, we feel pretty good around and is, you know, a pretty much a firm outlook here based on contractual obligations.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nYes. The other piece I would add Luke here is, during the spring, we have said many times that, you know, there was still a number of variables significant -- significantly impacting the potential outlook on COVID vaccine demand. And those variables were primarily related to what is our second half for our fiscal year, meaning the first half of next calendar year. So, some of those variables have settled now in our [Inaudible] primarily with the regards of how the vaccine are going to behave from a seasonal standpoint.\n\nWe made the reference in our script that now, you know, we have a pretty good outlook around the seasonality of the vaccines and so forth. And so, we are in a better position to forecast the second half of the -- our fiscal year, which is the first six months of next year. So, I believe that this is a solid outlook we are providing today.\n\nLuke Sergott -- Barclays -- Analyst\n\nAll right. Great. And then just a quick follow-up on that. So, I mean, you guys are talking about the offsets coming from all the capacity expansions that you've done in Bloomington and Indianapolis, and then the suites coming on in Princeton and elsewhere.\n\nCan you just help us think about when there's these supply chains -- you know, is there a particular indication that it's hitting hardest, or is it just broad-based? And then can you give us a sense of how you're thinking about these easing?\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nLook, when it comes to these new assets, these new assets, where is a combination of several assets which were meant to meet demand in a number of therapeutic areas, which we have seen over the last three years potentially in high demand. One of this is diabetes, which combines now with some obesity as well. Neurological disorders and surely oncology, the new approved cell therapies for the oncology pipeline are pretty remarkable. And this is an area where we see opportunities.\n\nSo, all these assets were primarily built to meet this demand coming from these indications and therapeutic areas.\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nYes. And I would just add to that, Luke, as I highlighted earlier in my comments to Tejas, a lot of the supply chain challenges that we've been seeing more recently have been impacting our SOT business and particularly on the consumer health side. So, not, you know, geared toward those large molecule biologics assets that you are referencing, yes.\n\nLuke Sergott -- Barclays -- Analyst\n\nAwesome. Great. Thank you.\n\nOperator\n\nThank you for your question. Our next question comes from the line of Julia Qin with J.P. Morgan. Julia, your line is now open.\n\nJulia Qin -- JPMorgan Chase and Company -- Analyst\n\nHi, good morning. Thanks for taking the question. So, just a couple to clear up the guidance. First, regarding fiscal '23, I heard you on [Inaudible] guidance to de-risk COVID revenue and FX.\n\nHow about the outlook for the other nonvaccine businesses? Has there been any changes? And in light of the inflationary pressures you started earlier, how much pricing contribution are embedding in the guidance?\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nSure. So, look, I would say, just with the de-risking here from a guidance standpoint, you broke up a little bit during the second part of your question, Julia, so I'll do my best here to answer it. But in terms of the first part, you know, we did mention that we are seeing the base business here growing in excess of 25% in the fiscal year. That's going to be a significant offset to the 2/3 reduction in COVID-related volume that we have in our fiscal '23 guidance.\n\nAnd that does contemplate growth across all of our technology offerings. I would say, from a biologics standpoint, we are seeing x growth -- x COVID growth on the drug product side. But obviously, cell and gene therapy is a significant contributor to the fiscal '23 growth story. That was a business that was not significantly impacted by COVID-related demand.\n\nOur drug substance business out of both Madison and Bloomington, as well as capacity that we'll be bringing online in Europe as a result of the Oxford facility, that was another business that is obviously not significantly impacted by COVID-related demand that we will be seeing growth from in fiscal '23. I think there may have been a part of your questions around COVID therapeutics in here. I would say, COVID therapeutics are not a significant growth driver as we've talked about. The bulk of our COVID-related revenue has been from more vaccine-related revenue.\n\nAnd in terms of -- I think the second part of your question was related to supply chain challenges and what the impact there is. And, you know, I think we've talked about that already mostly impacting our -- the consumer health side of the business in terms of inflationary pressures. We are seeing wages up two times to what they would be in a normal year, as well as seeing increases for many suppliers on the vendor side. And then we're looking to be active in terms of being able to recoup that through our customers where our contracts give us the ability to, as well as, I would say, driving off cycle price increases where we're able to from customers to ease that impact.\n\nBut again, despite all of those challenges, we are looking at modest margin expansion at the midpoint of our fiscal '23 guidance on a constant currency basis.\n\nJulia Qin -- JPMorgan Chase and Company -- Analyst\n\nOK. thanks. And on the long-term guidance, you're raising the high end of that. On the PCH, incremental revenue synergy, can you talk about, you know, how long do you think it will take for you to achieve the full potential and push toward the high end of that 6% to 10% growth? And then on the biologics side, has there been any improved outlook on that side given, you know, what's happening on the new modalities and around the biosimilars? Or are we still maintaining kind of, you know, the midpoint of that 10% to 15% growth? Thanks.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nSure. Look. Clearly, we don't give very short-term indications of guidance by single segment. But in terms of answering broadly to your question, we are already seeing the transition of that segment accelerating toward the new growth that we have projected as I said, that is driven.\n\nIf you look at the factors that I did mention, which are behind that acceleration some of them were already in play in the last couple of years, right? So, the addition of the gummy business will be completely organic this year. There is only one quarter where it's going to be inorganic. So, not only now we have a full ownership of the asset, but we are very much accelerating on expanding capacity to meet the high demand in that area. Our expansions and acceleration on complex are all solid North America as well has been quite executed well by the team and is coming available for executing on programs, which we have secured over the last few years.\n\nAnd I would say in general, there is a continued rebound in our consumer product with specifically out of cough and cold categories and pain relief which is another area where we are seeing significant demand. If anything there, we're trying to overcome some supply challenges. So, when you look at all of these dynamics, which I did mention these are dynamics that have been, you know, in play already in the last few quarters and coming to fruition. On top of that, we are confident that they accelerated commercial synergy.\n\nSo, we are going to enable with the new organization will allow to further accelerate these growth.\n\nPaul Surdez -- Vice President, Investor Relations\n\nNext question, operator?\n\nOperator\n\nThank you. Our next question comes from the line of Jacob Johnson with Stephens. Jacob, your line is now open.\n\nJacob Johnson -- Stephens, Inc. -- Analyst\n\nHey. Good morning. Maybe starting off with just a higher level question, $2.5 billion, I think of biologics revenue in FY2022, you've got the BWI expansion, Master Cell, Princeton, Oxford a number of -- and Bloomington a number of capacity addition there. I know capacity is hard to define or quantify.\n\nBut can you just talk about the amount of capacity you added to your biologics segment over the last couple years and what that could mean for growth as we look out the next several years?\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nYes, sure. Look, as you pointed out, it's quite remarkable, the capacity that we have added. And with the remaining execution that we're going to do -- what I can tell you is that by continuing on that execution and the plan we have, you know, in the last next 18 months -- 18 to 24 months, we are very well-positioned to deliver our fiscal '26 target, if you like. So, in many ways we have already created a significant amount of the capacity that once getting utilized that will deliver the fiscal '26 target.\n\nSo, probably this is giving you a little bit of quantitative measure of the capacity being created. But, you know, another way to look at that, look, when it comes to drug product, we've been primarily focusing complementing the offering with the syringes on top of vials. And when it comes to drug substance, we've been just doing expansion, identifying our production, production schedule. And when it comes to gene therapies, we'll be essentially going from a 10 suites to 18 suites in BWI.\n\nSo, this again gives you a little bit of a measure of what is the potential of this capacity going forward.\n\nJacob Johnson -- Stephens, Inc. -- Analyst\n\nGot it. Thanks for that, Alessandro. And then just one on the COVID kind of roll off. Can you just talk about how quickly you can transition the drug product assets to new kind of non-COVID applications? Is there any lag period or downtime associated with switching those lines over? And maybe how should we think about the timing of that transition throughout 2023? Is that something where maybe there could be a little softness early in the year? Is your transitioning or not so much?\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nLook, you know, the transition is mostly seamless, meaning that is happening in parallel. One thing that, you know, is happening is that mostly the lines in which we are transferring new products, we've been transferring and onboarding new programs are lines which were built in parallel of the COVID lines. We always wanted to have the possibility to serve new customers and new programs while still leaving enough capacity to satisfy the COVID vaccine demand, which, in many ways, is still not totally predictable, although we're now getting to a much better visibility on it. So, I would tell you that the transition has been pretty seamless.\n\nYou don't have to think about these like stopping vaccine and starting something new, but is mostly things that are happening on different formats and on different production lines. With regards of some of the ones that are in fact going to be served out of the current COVID vaccine lines, which are going to -- remember, on the entirety of the current of all vaccine supplies made in vials for some of these programs to a large extent we can onboard them and validate them on the line, while still making the vaccines. So, it's a kind of phase-in, phase-out type of dynamic as opposed to having a gap in between.\n\nJacob Johnson -- Stephens, Inc. -- Analyst\n\nGot it. Thanks for taking the questions.\n\nOperator\n\nThank you for your question. Our next question comes from the line of Derik De Bruin with Bank of America. Derik, your line is now open.\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nHi, good morning. Thank you for taking my questions. So, I've got a few, which I'm just going to shoot off here. One, what's the embedded organic revenue growth guide by segment for the biologics and PCH? That's the first one.\n\nThe second one is going to be when you talk about a 2/3 volume reduction for your COVID vaccines, are you also implying the 2/3 revenue reduction? I assume that you have some take or pay contracts. And then the third one is, you talked about a 28% adjusted EBITDA margin for 2024. Is that still something there? I mean, I realize you're backing your 30% number by 2026. Just wondering if that 28% number is that's how we should sort of think about the rebound for next year.\n\nThank you.\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nSo, I'll start here. Alessandro, feel free to jump in. So, I'll start with your last question first, Derik. Look, we're not in a position at this point to give guidance around fiscal '24.\n\nAnd I think, you know, there's still a lot to understand in terms of what the macro environment looks like today and what that -- you know, where that heads over the next year. What I have said is we're absolutely on track and continue to be confident about our ability to deliver on the 30% EBITDA margin target for fiscal 2026. In terms of the organic revenue growth on a segment-by-segment basis, I would say, you know, that's not something we've talked about here specifically. We did make comments in our prepared remarks that we're seeing 25% business -- a 25% growth across our business excluding COVID demand.\n\nI think you can do some math and come based on disclosures we've made here, as well as based on customer concentration related disclosure, that will be in our 10-K and be able to estimate in a pretty tight demand what the COVID-related impact is here. And I would say, you know, as you take that into consideration, it's very difficult to have a 2/3 related volume headwind on COVID and be able to see growth within biologics, including that in the 10% to 15% range. So, I think you can maybe take from that where we are there. And from a SOT-OSD basis, we'll obviously be reporting those out as our pharma and consumer health segment starting in next quarter.\n\nAnd that is a business that's growing outside of here in 2023 guidance, that 6% to 10% long-term outlook here, obviously considering we're seeing 25% growth across the business on the next COVID basis.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nYes. So, look with regards of your question around the take of pace has been kind of a routine question over the last few months. Again, year to date, what I've already shared while we feel strong about our take of pay commitment and so on. We'd also very mindful of being partners with our great clients and making sure that we listen them to the needs.\n\nAnd we try to find a win-win solution for a landscape that is very hard to read for everyone. So, in many ways, you know, the breadth of the offering of Catalent gives us optionality in sometimes to trade some of the -- what is due volumes in these contracts with something else. I believe that part of the success we are having in non-COVID business, which is growing at more than 25% is also due to this approach, which have been very, very successful in securing long-term, good outlook on non-COVID or non-COVID business as leveraging those relationship and our partnership approach. So, we feel good about our approach so far.\n\nWe believe that's created a momentum in non-COVID business and is part of our -- is partly behind our confidence in the long-term prospects of the company.\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThank you for your question. Our next question comes to the line as Jack Meehan with Nephron Research. Jack, your line is now open.\n\nJack Meehan -- Nephron Research -- Analyst\n\nThank you. Good morning. Wanted to kind of continue along that line of questioning as it pertains to the guide. Is there any help you can provide around seasonality? You know, you talked about some of the seasonality of the business this year.\n\nJust help with pacing in terms of maybe expectations, especially anything for the first quarter would be helpful.\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nYeah. Look, Jack, we're going to fall short of giving specific quarterly guidance here, but let me just give you some directional commentary. I would say as we did make a point here to reference seasonality that we see in this business. And I would say, what we're seeing in fiscal '22 probably feels a little bit more like what we've seen in fiscal '20 and prior to that, given that fiscal -- I'm sorry, I'm referring to fiscal '23 now, feeling more like fiscal '21 and fiscal '20 from a seasonality perspective, more so than what we saw fiscal '22, which was obviously a year that was significantly skewed by COVID-related increases through sequential quarters until we got to our fourth quarter where the volume declined here.\n\nWe did mention about 60% of our absolute-dollar EBITDA being generated in the second half of the fiscal year; bring 40% of that for the first half of the fiscal year. And I would say, in terms of the quarterly phasing, again, going back to what Q1, Q2 splits looked like in that in that 2019, 2021 time period is probably a close proxy to how you can see the year play out from a quarterly phasing standpoint in '23.\n\nJack Meehan -- Nephron Research -- Analyst\n\nGreat. That's helpful. And then on Metrics. So, you disclosed the over $90 million of trailing sale.\n\nWith the supply agreement, what's the annualized revenue contribution we should expect upon close?\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nSo, we'll get more specifics around the guidance here of Metrics when we do close the transaction, which we're hoping to do by the end of the calendar year here. We did talk about growth rates that we expect to see from that business being very closely aligned to that, of what the new pharma and consumer health business of 6% to 10% would look like. And you can use that $90 million as a base, knowing that obviously this will only be a partial year contribution that we would see in fiscal '23. And again, that exactly how much will depend on the timing of the close and the transaction.\n\nSo, we'll give some more specifics around the revenue and EBITDA contributions, the fiscal '23, once that deal closes in the first call post close.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nI would just add one comment more general. One reason why we do like the space. So, prescription on a solid is that you normally have a pretty good visibility on the revenues for a fairly good horizon, given the prescription nature of the business and the strength of the pipeline.\n\nPaul Surdez -- Vice President, Investor Relations\n\nNext question, operator?\n\nOperator\n\nOur next question comes from the line of Paul Knight with KeyBanc. Paul, your line is now open.\n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nHi. Yes, Alessandro, thanks for the question. The -- where are you in the go-to-market strategy? Are you halfway there in the productivity you expect? Could you give us some metrics around where we are today with this strategy?\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nThat's a great question. I believe, we are in a pretty good place. I believe -- look, we've been always very happy about our sales machine, which has been producing consistent organic growth over the last four, five years, I would say. Here is more in terms of making sure that when one of our sales rep engages with the customer, and we do have relations with the customer, we take the full advantage of the relationship and try to offer more than just one service.\n\nSo, I would say that look, the, I cannot point to a specific percentage of completion of the plan, but we are pretty advanced in what we are trying to implement here. Our basics and foundations, so our sales machine remain very, very strong and what they drove, you know, really success in the last few years. And this is the way you need to see is not a revolution, but an enhancement of the good market strategy so that we can unlock value where the value was blocked by our internal barriers.\n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nAnd you raised your long-term growth guidance by 200 basis points. Is that due to your increased optimism around single-dose fill-finish outlook? Or is it that plus cell therapy? What are the components of that 200-basis-point increase or the big drivers I think is the best way to ask that?\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nYes. Yes, sure. Look, I believe that on the Biologics side, our outlook remain pretty much the same that was before. That's really not what is driving at this increase.\n\nWe remain very bullish on the Biologics story at 10% to 15%. What is driving the overall increase in the growth expectation from the company is if you like the assets, which were a little bit behind in the growth story of the company, dragging down the overall growth rate perspective for the company, which were more in the small molecule side. And the refashioning of the small molecule footprint, we were able to implement through the pandemic, which went a little bit under the radar. I understand that, you know, during the pandemic, everything that was making the news was related to biologics, vaccines, and so on.\n\nBut we were working very, very hard in the background in addressing some of the gaps we had in the small molecule portfolio to enable faster growth there. And I will point out again, primarily in the consumer health, getting on top of these very high demand of dosage form of gummies and soft chews, which is, again, is a significant contributor to that acceleration. The fact that we've been investing organic and in our Kentucky facility, in our Florida facility, which are serving the complex, oral solid market in the United States, which is very, very healthy at this point in time, as well as leveraging some of the dynamics in the consumer health after an initial period of if you like a crisis at the beginning of the pandemic came back pretty, pretty strong. So, it's more on the PCH side that you need to see the increase, we have increased 200 basis points of the top end on the PCH side compared to the past.\n\nAnd this is really what is driving our most -- more comfortable outlook about the company and really putting us in a comfortable position to raise our long-term guidance for the organization.\n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nThank you for your question. Our next question comes from the line of Dave Windley with Jefferies. Dave, your line is now open.\n\nDave Windley -- Jefferies -- Analyst\n\nHi. Thanks. Good morning. Have a couple of clarifications and then more strategic question.\n\nSo, am I right in calculating these Zydis-related royalty in the quarter would be about maybe $10 million? Is that a fair estimate?\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nDavid, we hadn't disclosed exactly what the contribution was there. We did point to the fact that it was a significant driver of margin profile. So, I think, you know, if you were able to do that math and triangulate something in that range, I think that's directional.\n\nDave Windley -- Jefferies -- Analyst\n\nYeah. OK. And secondly on, Tom, you talked about lower component sourcing with COVID, but then on the other hand, kind of lower absorption from lower COVID volumes. I guess I'm wondering if kind of the bottom-line margin impact from the lower COVID assumptions in 2023 is margin-dilutive or margin-accretive, taking those two impacts together?\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nYeah, look, I think it's -- I think you're right. We did mention both here. We mentioned that with the declining COVID-related revenue that we will see the component sourcing dynamics start to normalize here in the year. And then obviously, in talking about some of the margin pressure opportunities here -- you know, we talked about the -- we've talked about the absorption related items-driven volumes.\n\nI would say, the point of referencing the component sourcing piece is really more material for the biologics segment than I would say it is for the company overall. Meanwhile, the absorption piece does have a more meaningful impact on the company overall here that they've just given the fact that we're talking about dedicated capacity that was running at very high levels of utilization and being replaced, whether on the same asset or in other assets that we've brought online during that period here. You know, I'm not quantifying each of those for you. But I would say they essentially offset each other.\n\nBut there's probably a little bit more impact to the bottom line here from an absorption standpoint just as we start to ramp up other assets that we brought online during the COVID pandemic that, you know, are, I would say, slow on the uptake here, right? You don't plug in a new syringe line and be operating at 85%, 90% utilization and start to see that full absorption, right? There's a ramp-up period here that we see that takes into consideration. But I would say, the fact that we're in, again, in a position where we are seeing modest margin expansion despite a lot of these moving pieces and challenging macroeconomic environment is something we're pleased with and we're obviously going to look to maximize the margin expansion opportunity that we have here in fiscal '23 on our path toward the 30% by fiscal '26.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nAnd as a follow-up comment on this, I would tell you, clearly, as the vaccines for COVID the transition from pandemic to endemic use, they will resemble a little bit more the fact that no other vaccines, which means that you're going to produce a significant amount of volumes in a shorter timeframe and the rest of the area you're essentially in a much lower production mode. So, that is a little bit more challenging to manage from an absorption and profitability standpoint is something that takes some time to organize yourselves for. And that's why I believe we have a very good plan. We are discussing this also with our partners, but it's a dynamic that needs to be taken into account as you move from the pandemic where you essentially running flat out through the 12 months.\n\nYou move into a more traditional vaccine manufacturing, which has that challenge, always had and will always have.\n\nDave Windley -- Jefferies -- Analyst\n\nSo, the last question I wanted to ask is around your long-term growth and the raised guidance there. So, 2023 will start off -- I don't know if we want to think about a four-year period since you do have '26 targets in the public. Maybe a four-year period is a reasonable period to think about. You're starting that four-year period a couple points lower than the long-term guide.\n\nShould we think about this as a kind of a midpoint 10% CAGR target where, at some point, over that horizon, you'll grow faster than the 10%? Or do you think of it as getting to 10% after fiscal '23? Thanks.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nSo, look, clearly, we see these -- with these fiscal '23 a little bit as a transition year from a strategic standpoint. You know, it's notable the fact that, you know, we are reducing two thirds our expectation from COVID vaccines. And at the same time, we are, you know, in line with expectations. And that will point you toward, the -- you know, what we shared around the non-COVID business and the strength there, right? So, we have highlighted that that is above 25%.\n\nI believe you guys can make some math and be a little bit more accurate on that. We provided all the relevant information to be -- to do so. But that that is telling us that all the moves we've done refreshing, retooling our portfolio on the remaining business, put us in a very strong position as we transition outside the pandemic.\n\nDave Windley -- Jefferies -- Analyst\n\nThank you. That's great.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nThanks, Dave.\n\nPaul Surdez -- Vice President, Investor Relations\n\nNext question, please.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Christine Rains with William Blair. Christine, your line is now open.\n\nChristine Rains -- William Blair and Company -- Analyst\n\nHi. Yes. Thanks for the question. Just one for me.\n\nSo, we've noted a slowdown in FDA approvals in the first half of the year over last year. Any insight into the dynamics playing out here? And do you see this is having any near-term impact on Catalent's business? Thanks.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nWell, look, from our perspective we've been pretty pleased with the approvals that have been impacting our pipeline and we see further opportunities going forward. So, look, it's a little bit not necessarily the macrodynamic of the approvals that happens out there significantly impacts Catalent. It depends -- you know, it's very discreet, right, and very, very much focused on some products. But I am going to tell you, we've been seeing some good success of the products in our pipeline in the last few quarters.\n\nChristine Rains -- William Blair and Company -- Analyst\n\nThank you.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nOK.\n\nOperator\n\nThank you for your question. Our next question comes from the line of John Sourbeer with UBS. John, your line is now open. It looks like we've lost connection with John.\n\nOur next question comes to the line of Justin Bowers with Deutsche Bank. Justin, your line is now open.\n\nJustin Bowers -- Deutsche Bank -- Analyst\n\nThank you, and good morning. I'll keep it jiffy with the call running long. But just in terms of the new capacity, specifically, U.K. and Princeton, when does that really start coming online in the fiscal year? And then by year-end, what percentage of the capacity will be have built out with respect to the footprint of those facilities?\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nSure. So, very different answers for those facilities. So, with regards to Princeton, commercial cell therapy capacity is mostly already online. And in fact, there is already one product there, which is late stage running there.\n\nWe've seen very, very strong interests out of the gate after we announced it. And, you know, it's more related to the time for us to onboard these programs than the capacity. So, the constraining factor in Princeton is really around our ability to close these deals and onboard these tech transfers and these activities into facility, which, again, I remember everybody, is skewed more toward the late stage. So, we are talking about mature cell therapy programs, which are trying to find home for the commercial phase 3 commercial needs.\n\nSo, that's Princeton, cell therapy serving mostly oncology therapies. With regards of Oxford, there is a little bit of a different story. The buildout is proceeding at pace. I believe that we are very closer to open our PD side of the house where we're going to start working on if you like of the scale-up of these cell lines.\n\nSo, this facility will be mostly serving messenger RNA and proteins to a large extent. And then the larger-scale bioreactor will come a little bit later in the year. We expect that these assets to start generating revenues as we said in the last past of the fiscal year. We believe that Princeton is going to be a little bit fasting index.\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nYes. And I'll just add, Justin, to that related to Oxford specifically. This was a pivot for us here in terms of building out capacity for European drug substance originally in our Anagni facility, and then we were able to accelerate that with the acquisition of Oxford. So, our original drug substance plan didn't have revenue contribution until probably midway through our Fiscal 2024 year, if not later.\n\nAnd as Alessandro said, as a result of this acceleration through what we've -- what we acquired, as well as the capacity we're deploying in that site, we would be in a position to be able to see revenue contributions laid in fiscal '23.\n\nJustin Bowers -- Deutsche Bank -- Analyst\n\nYeah, that's a great point, Tom. OK, thanks. That's it for me.\n\nOperator\n\nThank you for your question. Our next question comes from the line of John Sourbeer with UBS. John, your line is now open.\n\nJohn Sourbeer -- UBS -- Analyst\n\nHi, can you guys hear me now?\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nYes.\n\nJohn Sourbeer -- UBS -- Analyst\n\nHi. Thanks for taking the questions. Just one for me. Can you just talk a little bit more on the M&A outlook, I guess, how are you seeing the valuations tracking? And then, you know, after the metric transaction, do you see potential for additional activity in 2023? And any areas within the biologic portfolio that could present inorganic opportunities? Thanks.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nSo, look, I believe that the first -- before the summer we didn't see significant moves in the evaluations and so forth. As if the space was still waiting to factoring the new reality of multiples into the assets. I believe we are still -- we are starting to see some early signs of a more, catching up with the -- the current environment, especially when it comes to cost of capital and macro economical uncertainty of the next couple of years, as well as private funding. So, I believe that, you know, as we move in the next few quarters, I do expect some correction there.\n\nI will add though that the premium assets in our space are still kind of expensive because they have a, you know, pretty good strategic prospecting front of them. So, I believe it's a little bit of a mixed bag. I would tell you that of course multiple can constitute an [Inaudible]. But for Catalent, it's probably never only an evaluation of multiple and primarily our financial evaluation, more of a strategic evaluation, and how we're going to make sure that when we add an asset to Catalent, we can also accelerate growth and generate synergies out of these.\n\nAnd not only enable more growth out of Catalent, but we can also accelerate growth into these assets. This is what we believe for Metrics. We believe that by inserting the premium asset in our much larger commercial engine, we'll accelerate pipeline creation and tech transfers. On the other end, we expect that, you know, this offering -- completing this offering in downstream, high-potent capacity will create additional opportunities for some of our assets, which are more early stage, which didn't have necessarily a downstream capacity prior.\n\nSo, Metrics is a squarely in the definition of that in terms of M&A. Catalent is always having a pretty healthy portfolio of M&A opportunities as we explore the market. And whenever we see an opportunity to accelerate growth and expand margin through what I just described, we definitely are interested in exploring that opportunity.\n\nJohn Sourbeer -- UBS -- Analyst\n\nThanks for taking the question.\n\nOperator\n\nThank you for your question. Our next question comes from the line of Sean Dodge with RBC Capital Markets. Sean, your line is now open.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nYup. Thanks. Good morning. Well, on the organizational changes, Alessandro, you mentioned that the revenue synergies from that.\n\nHow should we think about the cost impact? Does realigning the commercial organization, is it something you need to invest or add headcount to do? Or do you think there's, some cost efficiencies that you think can drive longer term along with those? I guess their revenue growth enhancing. Are they also intended to be margin percentage-enhancing?\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nSure. Look, as I said on the commercial side, most of the foundations were already there. We needed to tweak a little bit our incentive plans and so forth to make sure that we drive the right behaviors and remove some artificial P&L internal barriers, which were not really, you know, enhancing our opportunities to sell across our portfolio offerings to our customers, which by the way, we'll buy them anyway, either from us or from others. So, better they buy all of them from us.\n\nSo, on that side, I don't believe that there will be any cost impact on the commercial side of the house. We did point toward that this organization is a little bit linear in terms of management and surely enables us to drive operational excellence across the board more effectively that we used to do before, sharing some best practices and surely avoiding some duplication. When you think about, for instance, you know, managing a program, which is both giving the customer formulation development, clinical material, and, at the same time, distributing the clinical trials for their own trials, clearly, there is some synergy there in the way you manage this project across, while before you had to manage different PCC slides, when in fact you had the different slides, which, as I said, was not as common as could have been. So, clearly, in that regard, we see an opportunity here to continue to drive operational excellence and efficiency and linear approach.\n\nSo, bottom line is that yes, we do expect that these, this not only to drive accelerated top-line growth but also provide us a little bit of productivity and efficiency.\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nYeah. And I would just add, Sean, you know, this gives us even more confidence than we already had around being able to achieve our fiscal 2026 long-term EBITDA margin of -- target of 30%.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nOK. That's clear. Thank you.\n\nOperator\n\nThank you for your question. Our final question comes from the line of Evan Stover with Baird. Evan, your line is now open.\n\nEvan Stover -- Robert W. Baird and Company -- Analyst\n\nHey, thanks. Appreciate it. Just one for me, obviously, I wanted to relate the long-range capex outlook to your updated long range kind of revenue growth plan today. We're at the point where we've doubled the revenue growth goal since the IPO, can you talk about how that would relate to capex after we get past kind of the bolus of projects? That's elevating the number higher here, what that equates to a longer-run percent of your revenue spent on capex.\n\nBecause you're kind of getting to the point on your long-range revenue plan where it feels like some of this higher capex is structural rather than transitory. So, anything you can provide on a longer-range settling of that number would be helpful.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nSo, I will let Tom to provide some more color around how you should think about it. What I can tell you is that the fact that now, this overall organic growth expectation is accelerated by the PCH segment as opposed to the biologics segment. It's good news in that regards because our PCH segment is significantly lower in terms of capital intensity toward biologics. And again, that was very, very intentional from us.\n\nWe recognize that our biologics segment is very capital-intense, specifically when it comes to assets like protein, drug product, you know, gene therapies, and so forth. But when you look at complex oral solid, when you look at gummies, when you look at the softgels, when you look at, you know, early stage formulation development assets, and so forth, these are assets we come without a lower capital intensity as a percentage of revenues. So, as we accelerated that growth and that part continues to have a significant share of the portfolio of Catalent, overall, this is good news in terms of capital intensity of the organization. With the specifics of biologics, I will let Tom to respond.\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nYeah, I think it's a great point, Evan. And, you know, I think we historically have been spending capital at the clip of somewhere between 8% to 10%. We were, at that time, somewhere between a 4% and 6% grower, maybe 4% and 8% tops. And with the capital that we've deployed over the last couple of years into biologics, I think it's been pointed out to me that many of our peers that are more heavily biologics-weighted than we are spending something like 20%, 25% of revenue.\n\nLook, I think Alessandro's points here around what we're seeing on the pharma and consumer health side of the business being less capital intensive, but yet seeing the growth is accurate. This year we've talked about spending something in that 13% to 15% of range. I don't think that a normal year for us is 8% to 10% any longer, given the mix shift of assets we now have in the portfolio. It feels like the normal for us now, just given how much maintenance we have across 50-plus rooftops, feels more like about 10%.\n\nSo, we do need to get back down to that 10%. I don't know that we get there exactly next year, but we'll obviously get some more specifics around how this phases out. But I would expect 13% to 15% this year, probably a step-down from that level of next year, probably not quite to the 10% normal run rate. But then, you know, thereafter, we're getting close to if not at that 10%.\n\nAnd that being the new sort of base capex level of deployment to expect.\n\nEvan Stover -- Robert W. Baird and Company -- Analyst\n\nAppreciate it. Thank you\n\nOperator\n\nThank you for your question. This concludes our Q&A session for today's call. I will now pass the call back to Alessandro Maselli for any closing remarks. Thank you.\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nThank you, everyone, for taking the time to join our call and your continued support of Catalent. We were pleased to deliver record result in fiscal '22, and we are fully committed to deliver another strong year in fiscal '23 and beyond. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPaul Surdez -- Vice President, Investor Relations\n\nAlessandro Maselli -- President and Chief Operating Officer\n\nTom Castellano -- Senior Vice President and Chief Financial Officer\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nLuke Sergott -- Barclays -- Analyst\n\nJulia Qin -- JPMorgan Chase and Company -- Analyst\n\nJacob Johnson -- Stephens, Inc. -- Analyst\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nJack Meehan -- Nephron Research -- Analyst\n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nDave Windley -- Jefferies -- Analyst\n\nChristine Rains -- William Blair and Company -- Analyst\n\nJustin Bowers -- Deutsche Bank -- Analyst\n\nJohn Sourbeer -- UBS -- Analyst\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nEvan Stover -- Robert W. Baird and Company -- Analyst\n\nMore CTLT analysis\n\nAll earnings call transcripts"
}