{
  "companyName": "Occidental Petroleum",
  "companyTicker": "OXY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/occidental-petroleum-oxy-q3-2022-earnings-call-tra/",
  "content": "Occidental Petroleum (OXY 1.14%)\nQ3 2022 Earnings Call\nNov 09, 2022, 1:00 p.m. ET\n\nOperator\n\nGood afternoon and welcome to Occidental's third quarter 2022 earnings conference call. [Operator instructions] Please note, today's event is being recorded. I would now like to turn the conference over to Jeff Alvarez, vice president of investor relations. Please go ahead, sir.\n\nJeff Alvarez -- Vice President, Investor Relations\n\nThank you, Rocco. Good afternoon, everyone, and thank you for participating in Occidental's third quarter 2022 conference call. On the call with us today are Vicki Hollub, president and chief executive officer; Rob Peterson, senior vice president and chief financial officer; and Richard Jackson, president of operations, U.S. onshore resources and carbon management.\n\nThis afternoon, we will refer to slides available on the investor section of our website. The presentation includes a cautionary statement on Slide 2 regarding forward-looking statements that will be made on the call this afternoon. We'll also reference a few non-GAAP financial measures today. Reconciliations to the nearest corresponding GAAP measure can be found in the schedules to our earnings release and on our website.\n\nI'll now turn the call over to Vicki. Vicki, please go ahead.\n\nVicki Hollub -- President and Chief Executive Officer\n\nThank you, Jeff, and good afternoon, everyone. We delivered another strong quarter operationally and financially, enabling us to further advance our shareholder return framework as we made meaningfully -- meaningful progress toward completing our $3 billion share repurchase program. We achieved our goal of reducing the face value of our debt to the high teens and planned to continue repaying debt through the remainder of this year before allocating a higher percentage of cash flow to shareholder returns next year. The excellent operational performance of our businesses was a key driver of our strong financial results, including generating the cash flow required to advance our shareholder return framework and further strengthen our balance sheet.\n\nOxyChem delivered strong earnings following a record second quarter, while our Gulf of Mexico, International, Rockies, and Permian teams set new operational records. This afternoon, I will cover our third quarter operational performance and the exciting progress our low-carbon business has made since our investor update in March. Rob will cover our financial results, as well as our updated guidance, which includes an increase in full year guidance for all three of our business segments. Our businesses all performed well in the third quarter, enabling us to generate $3.6 billion of free cash flow before working capital, with total companywide capital spend of approximately $1.1 billion.\n\nOur oil and gas business delivered production of nearly 1.2 million BOE per day, exceeding the midpoint of guidance by approximately 25,000 BOE per day. Our performance from the Rockies and Gulf of Mexico were key drivers of our production exceeding third quarter guidance. The Rockies' success was driven by better-than-expected base production and higher NGL recoveries. In the Gulf of Mexico, we benefited from unseasonably calm weather during most of the third quarter and better-than-expected performance from Horn Mountain West.\n\nOur ability to generate substantial free cash flow, even as oil prices declined compared to the previous quarter, positioned us to complete approximately $2.6 billion of our $3 billion share repurchase program through November 7th. Over the last 12 months, we have returned approximately $3.21 per share to common shareholders, moving us closer to potentially being able to begin redeeming the preferred equity in 2023. We also repaid approximately $1.5 billion of debt in the third quarter and in the period ending November 7th. Providing commodity prices remain supportive, we intend to reduce the face value of our debt approximately $18 billion by the end of this year, meaning that we will have repaid over $10 billion of debt in 2022.\n\nAs we enter 2023, we expect that our free cash flow allocation will shift significantly toward shareholder returns. We intend to reward shareholders with a sustainable dividend, supported by an active repurchase program; continued rebalancing of our enterprise value in favor of common shareholders; and a reduction in our cost of capital as the preferred equity is partially redeemed. Turning to OxyChem and midstream. Both businesses benefited from supportive market conditions during the third quarter.\n\nOxyChem exceeded its guidance as chlor-alkali prices continued to strengthen and the expected softening in the PVC markets did not materialize to the extent that we had forecast. We continue to be highly encouraged by well performance across our portfolio. In the Delaware Basin, we delivered our best quarter to date for early well performance with the 46 wells online averaging 30-day rates of over 3,600 BOE per day, demonstrating the superior quality of our inventory and subsurface expertise. And in the Texas Delaware, we recently brought online a new Silvertip well with the highest initial oil production of any horizontal well previously drilled in the lower 48.\n\nThe Python 13H well poses a three-stream IP of almost 20,000 BOE per day and averaged over 11,000 BOE per day over its first 30 days online, which we believe to be the strongest performance ever for a Permian well. Overall, the Python development has outperformed expectations, and we're looking forward to developing the offsetting areas over the next few months. We're beginning to see additional progress in Colorado's new permit approval process. In August, we received approval from the Colorado Oil and Gas Conservation Commission for the state's first comprehensive area plan under the recently implemented regulations.\n\nThis plan has paved the way for us to complete more than 200 new wells in Weld County over the next few years. Also, several drilling permit applications that had been pending for a period of time were recently approved, allowing us to add back a rig in the DJ Basin after reallocating one earlier this year. With the purpose we have in hand and our expectations for future approval, we have enhanced our flexibility as we formulate our activity for next year. Last quarter, we celebrated first oil from our new discovery field in the Gulf of Mexico, Horn Mountain West.\n\nWhile it's exciting to realize production from new discoveries, our existing fields have abundant potential that we continue to unlock with innovative technical solutions like subsea expansions. For example, our Caesar-Tonga field recently reached a production milestone of 150 barrels of cumulative oil production that's a start-up 10 years ago. Caesar-Tonga is a subsea tied back to the Constitution's part and is one of the largest fields in the Outer Continental Shelf. This impressive achievement is a result of the collaboration and hard work across Oxy's Gulf of Mexico business unit, including the asset development teams and offshore personnel who focus on delivering safe and efficient barrels every day.\n\nIn the years ahead, we plan to continue maximizing production capacity through projects like this one. The Caesar-Tonga subsea expansion, which is scheduled for start-up in the first quarter of next year, will address facility bottlenecks and maximize production capacity from the field while signaling a transition into the next phase of field development. In the second quarter, I highlighted new production records at Al Hosn in the UAE and Block 9 in Oman. I'd like to congratulate our Al Hosn and Oman teams again this quarter for breaking those recently set records.\n\nWe're beginning to benefit from incremental production from Al Hosn and are pleased the expansion project is on track for completion in the middle of 2023. Turning to our low-carbon business, I'm pleased to share that we broke ground on the world's largest direct air capture plant in Ector County, Texas. The first stage of construction, which includes site preparation and road work, began in September. That start-up is expected in late 2024.\n\nDuring our March LCV Investor Update, we provided an overview of the expected revenues and costs for both direct air capture and point source capture projects. Since then, we have experienced progress on legislative and commercial fronts. Congress passed the Inflation Reduction Act, which contains several enhancements to the 45Q tax credits that will incentivize the development of carbon capture projects. Additionally, strong interest from potential customers has provided us with a clearer picture of the market for carbon dioxide removal credits, or CDRs, and net-zero oil, in addition to other products.\n\nWe believe our low-carbon strategy, combined with the ability to leverage direct air capture, or DAC, for the benefit of ourselves and others, uniquely positions us to lead the market in supplying CDRs to the thousands of businesses that have established net-zero ambitions. We are encouraged by the passage of the IRR -- IRA and previously highlighted the potential for the 45Q enhancements to accelerate our low-carbon strategy. We expect the 45Q enhancements to jump-start the voluntary market for CDRs, which gives us confidence to increase the number of DACs in our current development scenario from 70 online by 2035 to approximately 100. Equally as important, we expect the accelerated development the direct air capture will enable us to reduce plant capital and operating costs at a faster pace.\n\nIn March, we provided a capital cost for the first DAC plant of $800 million to $1 billion. Given the inflationary pressures felt across the economy, especially for construction materials and labor, we now expect the first plant to cost approximately $1.1 billion. The current inflationary environment will not last forever, and we will leverage our supply chain and major projects expertise wherever possible to lower the cost of our first direct air capture, as well as the ones to follow. The U.S.\n\nhas taken a leadership role in moving toward net zero, making it more accessible for companies to meet their net-zero commitments through the utilization of CDRs. Our long-term view on the potential of direct air capture has not changed. But to reach the net-zero development scenario of 135 DACs described in our March update, the rest of the world will need to rise to the challenge in the form of global policy support. We're already seeing evidence of this, such as the PACE program recently announced in the UAE, which will catalyze $100 billion in financing and investment.\n\nThe Permian location of our first direct air capture will provide us multiple options to maximize the value of captured CO2. We have the ability to inject the CO2 into a saline reservoir producing CDRs or to utilize the captured CO2 to produce net-zero oil from our enhanced oil recovery assets. Our conversations with many corporate partners and potential clients have highlighted the significant demand for CDRs generated through CO2 sequestration. To meet this demand and advance our own net-zero ambitions, we plan to develop several hubs along the U.S.\n\nGulf Coast, where we will have the option to develop direct air capture, provide point source capture and sequestration or industrial emissions, or offer both solutions. To advance our ability to provide sequestration services and generate CDRs, we have filed applications for two Class VI sequestration permits and planned to file applications in the near future. We recently secured two new locations for the large-scale development of sequestration hubs. The first location covers 65,000 acres in southeast Texas, with up to 1.3 billion tonnes of CO2 sequestration capacity that could support up to 20 DACs.\n\nWe also reached a lease agreement with King Ranch, the largest privately held ranch in the U.S., to build up to 30 DACs and develop point source capture infrastructure. Our agreement covers approximately 106,000 acres, which is about 166 square miles, with the capability to safely and permanently sequester approximately 3 billion tonnes of CO2. We expect to develop our second DAC at King Ranch and plan to start the pre-FEED before year-end. These two new locations are in addition to the three hubs focused on point source capture that we're also developing.\n\nWe have secured almost 100,000 acres in southeast Texas and Louisiana, capable of safely and permanently sequestering approximately 1.9 billion tonnes of CO2. In total, we have secured over 260,000 acres, capable of sequestering almost 6 billion tonnes of CO2, compared to the target we communicated in March of securing approximately 100,000 acres by the end of the year. NET Power recently announced their plan to develop and build the world's first utility-scale natural gas-fired power plant with near-zero atmospheric emissions. The plant will be located close to Oxy's operations in the Permian and will supply our operations with clean, low-cost, on-demand power.\n\nCO2 generated by the power plant will be used -- will be captured and permanently sequestered underground using our existing CO2 infrastructure. This plant will accelerate Oxy's plans to reduce carbon emissions to help us achieve our net-zero ambition. This first utility-scale plant will enable both Oxy and NET Power to develop best practices that use NET Power's technology to provide emission-free power for our Permian operations and future direct air capture sites. I'll now turn the call over to Rob, who will walk you through our third quarter results and guidance.\n\nRob Peterson -- Senior Vice President and Chief Financial Officer\n\nThank you, Vicki, and good afternoon. In the third quarter, our profitability remains strong as we posted an adjusted profit of $2.44 per diluted share and reported a profit of $2.52 per diluted share. Even as commodity prices declined for their recent high set in the second quarter, the difference between adjusted reported earnings was primarily driven by a gain on sale and a tax benefit related to foreign restructuring, partially offset by early debt extinguishment costs and mark-to-market adjustments. As Vicki mentioned, we made substantial progress toward completing our $3 billion share repurchase program in the third quarter.\n\nWe have repurchased almost 42 million shares through November 7th for approximately $2.6 billion, with a weighted average price below $62 per share. We intend to complete the share repurchase program by year-end and allocate any additional cash flow this year to reducing debt further. During the quarter, approximately 7.4 million publicly traded warrants were exercised, bringing the total number exercised as of September 30th to almost 12 million, with approximately 104 million remaining outstanding. Warrants are a cash exercise instrument, meaning Oxy receives a cash payment from the warrant holder upon exercise, which provides with an additional source of cash for purchase shares and reduced debt.\n\nWe are very pleased that we completed our near-term debt reduction goal of lowering debt to the high teens. In addition to having repaid approximately $9.6 billion of debt year to date, we also retired $275 million of notional interest rate swaps in the third quarter for approximately $100 million in cash. We exited the third quarter with approximately $1.2 billion of unrestricted cash on the balance sheet, and as of November 7th, have reduced the face value of our debt below $19 billion. We have provided notice that the $340 million note due in February will be called on November 15, meaning that we have less than $23 million of debt due next year.\n\nWe also intend to retire the remaining $450 million of notional interest rate swaps this year, which we expect will require approximately $150 million in cash at the current interest rate curve. As I mentioned on a previous call, we believe reducing the base value of our debt to the high teens will accelerate our return to investment grade. We have made outstanding progress over the past two years to meet this objective, but understand that we cannot determine the timing of any potential ratings change. The combined impact of improving our balance sheet and reducing debt this year alone is estimated to result in a total annual interest and financing cost savings of over $350 million on a go-forward basis.\n\nDebt reduction will remain a priority, but we intend to notably redirect our cash priorities next year from proactively reducing debt to turning additional excess cash flow to shareholders. Over time, we intend to reduce gross debt below $15 billion. As Vicki mentioned, we are raising our full year guidance across all three business segments due to our performance in the third quarter and improved expectations for the remainder of the year. Starting with oil and gas, we have raised our full year production guidance by 5,000 BOE per day to 1.16 million BOE per day for 2022, while our full year capital guidance remains unchanged.\n\nBut we continue to expect to finish the year on the high end of our capital range. Our production has increased steadily each quarter this year, which has always been the expected outcome of our 2022 plan, in part, through the ramp of activity and scheduled turnaround in the first quarter. We expect this trajectory will continue in the fourth quarter, with production exceeding 1.2 million BOE per day. Our Permian operations were impacted by higher-than-expected third-party downtime and lower OBO volumes during the quarter.\n\nOur strong well performance continues to exceed our expectations, but due to third-party issues in the quarter, our Permian production came at the low end of our guidance range. We have revised our fourth quarter Permian guidance down slightly from the implied guidance we provided last quarter as our third quarter exit rate was lower than anticipated. We expect strong performance in the Gulf of Mexico and Rockies to more than offset the updated Permian projection. As our 2022 plan anticipated an increase in activity throughout the year, our fourth quarter capital spend is expected to be higher than prior quarters this year.\n\nThe activity that was added in the second half of this year will place us in a strong position for 2023 as our Permian production will grow by over 100,000 BOE per day in the first quarter. Our fourth quarter production is expected to grow approximately 18% from the fourth quarter of last year. OxyChem continues to perform well, and we raised our full year guidance to reflect third quarter results, as well as an improvement in our expectations for the fourth quarter. Fundamentals in the caustic soda market continue to be supportive, while softening in the PCV market has occurred at a slower pace than previously expected.\n\nWe expect the fourth quarter to reflect seasonal trends that are typical for this business but did not materialize in 2020 or 2021. The seasonal slowdown in construction activity toward the end of year typically reduces demand for chloro-vinyl products, which we have reflected in our guidance. I will now turn the call back over to Vicki.\n\nVicki Hollub -- President and Chief Executive Officer\n\nThank you, Rob. As we said during our March Investor Update, achieving our net-zero ambitions will require funding outside of Oxy's historical capital allocation program. As the construction phase and technology of our first DAC project advances, we will continue to consider strategic capital partnerships and structures to address financing. While we are prepared to fund the first DAC plant ourselves, if necessary, we are working to de-risk the construction phase and commercialize the technology to attract financing structures that will retain the most value for our shareholders.\n\nFinally, we understand that there's a high level of interest in our 2023 capital and activity plans, which we will communicate on our next call once our plans are finalized and approved by the board. As we formulate our plans for 2023, we will focus on retaining a high degree of flexibility in our capital and spending plans, allowing us to adapt and maximize opportunities in a changing macroenvironment, as we do each year. Before we go to our Q&A, I'd like to thank Jeff Alvarez for his leadership with our investor relations. I'm sure you would all agree, he's done a tremendous job to not only share our story and to help you all understand our strategy and results, he's also provided critical support to our leadership team.\n\nWe appreciate what Jeff has done with investor relations and what he will do for us in his new role that he's recently accepted, a role is to become president and general manager of sequest. In this role, Jeff will lead the efforts to build our CO2 sequestration business. As you've heard in my script, this is a growing and important part of our low-carbon strategy. Jeff's 30 years of engineering and leadership experience working in domestic and Middle East operations and his proven track record of creating value will be needed for this emerging business.\n\nI'm happy to announce that Neil Backhouse will replace Jeff as vice president of investor relations, reporting to Rob. And you all know, Neil, in addition to investor relations, his diverse expertise includes experience in treasury, finance, and banking. Prior to joining Oxy, Neil worked as a corporate banker, focused on oil and gas clients for two high-profile international banks. He holds a B.S.\n\nfrom Colorado State University, a postgraduate degree in financial services, and a master's degree in international business, both from the University of Manchester. I give tremendous thanks to Jeff Alvarez for his highly favorable contributions he's made to the finance organization. And please join me in extending your support to Neil and wishing him success as he transitions to his new role. We'll now open the call for your questions.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] Today's first question comes from Doug Leggate with Bank of America. Please go ahead.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Good afternoon, everyone. Appreciate all the commentary. Vicki, I know you don't want to give too much away on the capital program for next year, but I wonder if you could help us with the starting point.\n\nWe ask you often, I guess maybe you get a little tired of the question, but on what your sustaining capital is for your upstream business? But obviously, there's a lot of moving parts, particularly inflation, and then, of course, your higher productivity that you showed with the Python well this quarter. So, as a starting point, where do you see your sustaining capital going as you look into 2023?\n\nVicki Hollub -- President and Chief Executive Officer\n\nThe challenge with that, Doug, is that we really don't know what 2023 is going to look like from an inflation standpoint. And we could talk a little bit later about what we expect the inflation to be if people are interested in that. But the way you should think about our capital, all we can tell you is kind of what we see from an activity standpoint. And that would be -- we've mentioned before that we're not going to try to grow our oil and gas production from 2022 to 2023.\n\nWe're going to hold that flat. We've -- for the past couple of years, there have been a couple of business units where we weren't at their sustaining capital, so we're going to return to the sustaining capital of Permian EOR and the Gulf of Mexico. And I think you've heard that number for Gulf of Mexico before is around $500 million, and that means $500 million on an annual basis. And for EOR, it's $400 million on an annual basis, at least.\n\nIt could be closer to 450. So, those are two assets that we'll need to increase more in 2023. In addition, you will see higher than sustaining capital with a couple of projects that we find very interesting for next year. One being the membrane conversion project at the Battleground plant because, as you know, we talked about it last quarter.\n\nIt increases the capacity of Battleground by 80% and delivers about 250 million to 350 million incremental EBITDA while generating a strong return. And we have the expansion of Al Hosn to 1.45 in 2023. So, adding those projects, also, will impact our sustaining capital to some degree on a go-forward basis. But both of those projects generate pretty good returns.\n\nBut if you add the final thing, the inflation part of it, that's where, for us, it gets very murky because we're really not sure what inflation's going to be next year. And not knowing that, it's really hard to now give out what a sustaining capital would be until we get closer to that.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nOK. I understand it's a tough one, but thanks for framing it for us. My second -- my follow-up question is, and I guess it would be appropriate to thank Jeff also for all the field trips we had over the years to the Permian. But I do want to reference a couple of slides in your deck, one on Slide 23 and one on Slide 25.\n\nAnd what I'm trying to understand is, I mean, there's a remarkable continued improvement in productivity of your well portfolio. But should we think of what we're seeing in Slide 23 as kind of the new normal that's consistent with the inventory that's on Slide 25? I'm just trying to reconcile those two, and I'll leave it there. Thank you.\n\nVicki Hollub -- President and Chief Executive Officer\n\nOK, I'll pass that to Richard.\n\nRichard Jackson -- President, Operations, U.S. Onshore Resources and Carbon Management\n\nThanks, Doug. This is Richard. I'll try to answer that and kind of start, like you said, with the well performance and then translate that into the inventory, which we wanted to bring back up. You know, I think, in total, this year has been a good year.\n\nI think we noted in our prepared remarks, you know, the growth trajectory of near 100,000 barrels a day from Q1 to Q4. And certainly, the second half of this year has been pronounced. But the best part of that has been the well performance. And so, both from a total year basis, that represents 200 wells in the Delaware that's really been drilled across our acreage from north Loving up into New Mexico and to the multiple development areas there.\n\nAnd then even the third quarter results that we showed, you know, that was across, I think, around 45 wells across southeast New Mexico, on Loving. And so, I say that, really, to say that, you know, the consistency, we do believe, is becoming the new normal as we continue to improve. And I think, you know, the pipeline well is exciting to disclose. But it's really -- what's interesting about that is that entire north Loving development area has been consistently good.\n\nAnd even that DSU, where we had that record well, you know, it had offset wells that had been drilled in a similar formation. And so, being able to come back where we can develop a DSU with offsets that are job wells, if you like, and be able to have this sort of record performance, I think is a real testament to the way we do our sort of subsurface development. You know, from an inventory perspective, I mean, I think the slide speaks for itself. We've got a lot of inventory that we've accumulated across a good acreage position.\n\nAnd the only thing I would add to that is, you know, we continue to have strong, what we would consider, secondary bench. They're not really secondary because some of these are performing as well as the primary. So, I'd point you to, you know, so second Bone Spring in the Delaware Basin. And then even the Barnett appraisal that we noted in the highlight.\n\nYou know, both of those have moved themselves up to really top tier in our development plans. We have optionality in terms of when we develop that and co-develop it, but it's good to see those secondary benches add to that inventory.\n\nOperator\n\nThank you. And our next question today comes from Neil Mehta at Goldman Sachs. Please go ahead.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nYeah. Thank you. Vicki, I guess the first question is around the production profile. And as you talked about the plan for now, as you think about '23, is to keep volumes on the oil side relatively flat.\n\nWhat would you look for in order to change that viewpoint and actually grow volumes? Is it a price signal from the market or is it a view on where you want your balance sheet to be?\n\nVicki Hollub -- President and Chief Executive Officer\n\nYes, it's mostly around creating shareholder value and doing it in a way that ensures that it's sustainable over time. And, you know, part of our value proposition is to provide a growing dividend, which we, as you know, had to impact and we're trying to now resume. So, what we really want to do is make the best decisions around how do you allocate capital. We don't feel like we necessarily need to grow cash flow at this point because we have significant cash flow at almost all price ranges.\n\nWe're breakeven below $40. So, currently, the way that we see to increase shareholder value the most and in a sure way and it's sustainable and it also enables us to grow the dividend is to buy back shares that -- in addition to enabling us to grow the dividend over time. But we do believe that, at this point, we're significantly undervalued. So, that's the best value decision and the best use of our capital dollars there.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nAnd that's the follow-up, Vicki, which is just around the authorization you get, did a great job in the third quarter and knocking off a decent part of that share buyback authorization. Do you need to come back into the market and how should we think about the timing and sizing there?\n\nVicki Hollub -- President and Chief Executive Officer\n\nWell, we'll finish the 3 billion for this year, and then any cash that's left available this year will go to further debt reduction. Starting next year is when will be significant -- have significantly more capital available to buy back shares. So, essentially, any free cash flow that's available next year will be allocated mostly to share buybacks. And we really want people to understand that this is not something that we're doing on a temporary basis.\n\nWe do believe that share buybacks, where we are today and where our capital needs are and our cash flow potential, that share buybacks is a part of our value proposition, as is a growing dividend. And the two worked so well together as a combined value proposition. So, that's what we're essentially trying to do. We will occasionally, in the near term, do some projects that are not oil and gas that do increase value.\n\nSo, we are increasing value and cash flow and earnings with the membrane development at Battleground and also with Al Hosn expansion. So, when we see projects that are -- or kind of opportunistic, we'll take advantage of that to increase cash flow. But we think the better value is to buy back shares and increase shareholder value that way.\n\nOperator\n\nThank you. And our next question today comes from Paul Cheng of Scotiabank. Please go ahead.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nThank you. Good afternoon. Maybe that this is for Rob. Rob, with the rising interest rate, and potentially, for the next several years, it's going to be much higher than what we've seen in the past 10 years, how would that change the LCV business model, if any? Given the project financing, the economic return may not be as good as before.\n\nAnd also, in your chart, when you're showing from 2022 to '24, the revenue and cost seems to match. So, is that means that, currently, before we see further improvement, that the EBITDA would be zero for that business? That's the first question. The second question is, can you tell us the mechanic of the we -- the preferred redemption? Look like next year, you will start to that partial redemption. How that work? And also, that warrant related to buffer the preferred, how those is going to get exercised? Thank you.\n\nVicki Hollub -- President and Chief Executive Officer\n\nOK. We'll start with the LCV question. And first, I'll just say that we really don't know yet what the inflationary environment is going to be. We don't expect -- or at least at this point expect that it would be a long-term inflationary period.\n\nWe know the Federal Reserve is doing all they can to manage that. So, what we'll do is we have to continue our business. And on the first direct air capture, it's really important for us to build it and to operate it before we can understand how to optimize it. And so, as we go forward, we'll always keep in mind what our costs are with respect to what the potential returns are.\n\nAnd we'll make decisions on that. But based on what we think we can do with it, it's more prudent to continue to invest at this point, preferably with other people's dollars, but with ours, if need be, to ensure that we can get the technology tested up and running and improved. Do you have more to add, Richard?\n\nRichard Jackson -- President, Operations, U.S. Onshore Resources and Carbon Management\n\nYeah, maybe just a few things. I kind of -- I think what Vicki says is exactly the way we're thinking about it. Important to de-risk what we can control, which is really innovation and cost. And so, you know, we have our innovation center that we continue to progress.\n\nObviously, getting started on these projects, especially that we have line of sight to multiple projects, will help our costs down as we improve our engineering and our construction. And so, that will be important. The pace of development, very supported by the policy, really gives us an accelerant. I think we're well positioned for some DOE grants that we've talked about, I think, with you in the past.\n\nSo, when we think about near-term capitalization, those are options. Longer term, want to get the cost in the market in place to really support the sustainable business. And at that point, capitalization options are wide open. And so, that sort of how we have thought about that, but very focused on getting really the cost down on this first point, really advancing the innovation pathways that we see to really move this development forward.\n\nRob Peterson -- Senior Vice President and Chief Financial Officer\n\nIf I -- I'll take the other part of your questions. So, the -- within the preferred redemption mechanics, so we cannot voluntarily redeem the preferred shares before August the 29. After August 29, we can voluntarily redeem those preferred shares at a price of 105 or a 5% premium to par. However, the agreement includes a mandatory redemption provision that obligates us to redeem preferred at a 10% premium or 110% on a dollar-for-dollar basis for every dollar we distribute to common shareholders above $4 on a trailing 12-month basis.\n\nAnd so, building off of Vicki's script today is if you -- at the end of the day, we would take all the cash spent on share repurchases, dividends all issued to shareholders from November 10th of last year through November 9th of this year and add that up on a previous day share count and get a total for that. And so, as she mentions in her opening remarks, that will be $3.21 today. If that number added up to over $4 and everything that we distribute to shareholders above would go on a dollar-for-dollar basis to shareholders and equivalent would be redeemed on the preferred on a 50-50 basis. So, if it had been $4.10, we would take $0.10 times the current outstanding share through the dollar amount and apply that toward the redemption of the preferred at 110%.\n\nAnd so, we're going to continue that. Once you are above that, you continue with that every day. And if you distribute more value to shareholders, if we buy more shares back or pay a dividend, an equivalent amount will be applied toward the Berkshire preferred as long as we're above that threshold. If you fall below the threshold, we discontinue it until you come back above the threshold, and you do it again.\n\nAnd that's the mechanics of how the Berkshire redemption would work. In the case of the warrants, so the warrants could be exercised at any time. And so, when we get warrants exercised to us, that warrant holder pays us $22 per share in exchange for a warrant or a stock being issued in their place. And so, we'll take the cash-in on that.\n\nWarrant holders do not participate in dividends. And so, any dividend growth, as Vicki outlined in her earlier remarks and question discussion, they would be not included in that. And so, if that -- if the dividend were to increase, etc., that could drive additional warrants to be exercised. As we mentioned, we've had about 12 million of the 116 million roughly exercised to us.\n\nOperator\n\nThank you. And our next question today comes from Raphael DuBois with Societe Generale. Please go ahead.\n\nRaphael DuBois -- Societe Generale -- Analyst\n\nHello. Thank you very much for taking my questions. I have a couple of questions on OSCV. The first one is on the financing of the first DAC.\n\nI understood that you might benefit from the Infrastructure Art -- Act. Sorry. Could you maybe give us an update on whether we can expect you to benefit from those subsidies? And then I will have a follow-up question.\n\nVicki Hollub -- President and Chief Executive Officer\n\nYeah, the plant will be operational in 2024, and then the ability to claim the CDRs would be available at that time.\n\nRichard Jackson -- President, Operations, U.S. Onshore Resources and Carbon Management\n\nAnd maybe I'll just add to that. I mean, in addition, obviously, 45Q in addition to the uptake with the carbon dioxide removals, which are sold to businesses that are looking to reduce their emissions. But also, as I mentioned briefly, you know, well-positioned for some potential grant for direct air capture that is available from that Infrastructure Act. So, we want to put a competitive program together and show how those can really catalyze our business, which will allow us to reach commerciality quicker, and then we'll become self-sustaining and -- as a business to go forward.\n\nVicki Hollub -- President and Chief Executive Officer\n\nAnd as a reminder, we have said in the past that we do have a contract for 400,000 tonnes per year of CDRs from that first plant.\n\nRaphael DuBois -- Societe Generale -- Analyst\n\nAnd speaking about CDRs, it's a little bit opaque, the value of those CDRs. Can you maybe refer us to some transactions that would have been closed already at the sort of price levels that we can guess from what you show in your Slide No. 8?\n\nRichard Jackson -- President, Operations, U.S. Onshore Resources and Carbon Management\n\nYeah, perfect. I want to quickly just frame the market a little bit. I think what's happening as this market takes shape, carbon dioxide removals, which are uniquely capable to reduce atmospheric CO2, are becoming very appreciated. And so, being able to have an engineered solution like direct air capture that monitors, that capture that atmospheric CO2, and then places it safely and securely underground, that's a unique part of this evolving carbon reduction market.\n\nAnd so, I want to say that first. Our position in that is really to be large scale. And we think we can be competitive on cost. When you look at all the alternatives to reduce emissions, we think we can be quite competitive given those two things.\n\nAnd so, while we're not in a position to disclose some of the contracts that we've been working around that, there are some that get publicized. Those are generally smaller volumes and higher costs than what we show in our revenue slide. But we think, in the way this works from a revenue standpoint, in addition to the 45Q or a policy like that that gives you support on revenue, we're able to then attach the environmental attribute, which is the carbon removal on top of that, which gives you a total revenue against the cost that we showed in that slide. And so, we're pleased with the market acceptance.\n\nWe're working with some great partners that realize this is a very cost-effective way for many industries and many businesses to reduce their emissions as we look out over the next 10 to 20 years.\n\nOperator\n\nThank you. And our next question today comes from Neal Dingmann with Truist Securities. Please go ahead.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGood afternoon. Thanks for taking my time. First question is around your '23 traditional activity. I'm just wondering specifically, do you all anticipate continuing to run, I don't know, I guess it's around 23 or 25 rigs next year? Could we see maybe a bit of efficiencies allowing for less? And, you know, if that's around the number, do you anticipate those rigs running in kind of approximately the same areas as this year?\n\nRichard Jackson -- President, Operations, U.S. Onshore Resources and Carbon Management\n\nI can start and then Vicki can add any context that she needs to. But I think that rough number is about right in terms of where our activity is. We made note of the rig that we picked up in the Rockies. I think the success that we have had with our permitting have given us a strong runway on those very competitive projects in our portfolio.\n\nAnd we also have a rig that we picked up in the second half of this year in enhanced oil recovery, which is a great add to our business as we have low decline production to kind of add to the mix. So, those are the two I would point to. We do have flexibility in the program. We have staggered terms in terms of contracts so we can adjust to the macro or as Oxy needs us to.\n\nWe can adjust with flexibility. And then the final two variables I'd give you is, obviously, working interest. We fluctuate between 90% to even 50%, 60% in terms of working interest, say, in a business like the Delaware. And so, where we have rigs and frac corps, sometimes that can look a little lumpy from a capital perspective, but it's simply working interests.\n\nAnd the same can be said really for OBO. And maybe the last thing to note is just our JV. So, we're able to extend our Ecopetrol JV into the Delaware, which is a great opportunity for us to accelerate this high-quality inventory, brings a great partner along with us. And so, that is another lever that will not be transparent when you're just trying to look at activity versus capital.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGot it. Then just a second question. Maybe it'll stay with you. It's around that strong Python well, I just wondered, could you comment as to the magnitude of future locations you all have seen in that area and any plans, you know, near-term or maybe even next year to, obviously given the success there, maybe boost activity in that area?\n\nRichard Jackson -- President, Operations, U.S. Onshore Resources and Carbon Management\n\nYeah. What's great about them, it is certainly in a very rich geologic area for us, but that area, in total, is north Loving. And for those of you who don't know, they are positioned in sort of the Texas Delaware that's quite a large acreage position. And so, near some of the Silvertip wells, which had some of the records in the past.\n\nBut in the near term, we have two or three DSUs that will be coming online over the next couple of quarters. But in total, that's a, you know, that's a large acreage position that we've picked up. And just excited about prosecuting that. Again, not to challenge our team too hard, but we do continue to find ways to improve.\n\nAnd so, you know, whether it's the primary ventures like the Wolfcamp Y, which it's well was in our secondary in the Bone Spring, I'm looking forward to seeing what our teams can do.\n\nOperator\n\nThank you. And ladies and gentlemen, our next question today will come from John Royall with J.P. Morgan. Please go ahead.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nHey, good afternoon. Thanks for taking my question. On chemicals, can you talk a little more about the drivers of the better-than-expected results in both 3Q and I think 4Q? And how does 2023 set up relative to the run rate in 2H? I mean, I know the housing market is likely to become kind of more and more challenged with rates where they are, but that business does seem to continue to do well.\n\nRob Peterson -- Senior Vice President and Chief Financial Officer\n\nSure, John. You know, I would say that, you know, as we kind of described in the opening comments and we've talked about before is, you know, the macroeconomic conditions continue to drive the demand in our vinyls business. And so, interest rates, housing starts are slowly trending down unfavorably. So, as you know, in the fourth quarter, what we're seeing is continued softness in the PVC domestic market due to that housing sector slowdown.\n\nPVC buyers are also adjusting inventories due to the pricing changes. And we're also seeing a fair amount of imports from Asia now into the market due to continued COVID lockdowns in China. So, you're seeing a displacement regionally of where PVC typically is. But what's slowing that pace of decline and partially responsible for the beat in Q3 and our improved guidance for the fourth quarter is, first of all, there's still a tremendous cost advantage for U.S.-based chemical production versus Europe and certainly Asia.\n\nSo, the export business that is ramped up, we have a much better competing position from the U.S. And if you look at U.S. exports are actually up 28% year to date through September versus prior year. In addition, I would say also, despite the headwinds from interest rates, there still is a pretty significant pent-up demand in construction overall in the U.S.\n\nthat's still pulling through a fair amount. The other key factor I would say is that were slowing demand in PVC, we'll see the flip side, and we've seen this many times historically, is when the chlorine side of the molecule slows down through the PVC chain. It naturally makes caustic soda availability much more difficult to come by and tightens up the marketplace. So, we've seen steadily increases in caustic soda values much greater value than we originally anticipated.\n\nAnd so, those two collectively are the two main drivers of our improved performance in the third quarter and our higher guidance for the fourth quarter. Certainly, when you factor those macro conditions and then look at the factor we're in a seasonally slow period, that's the reason why you see fourth quarters sequentially down versus the third quarter. We really don't have a window yet at 2023 yet. I mean, it's very key factors that are going to drive that would be, you know, the length of the impact of housing starts from interest rates, how long is COVID shutdowns in China going to persist because once China reopens, similar to the oil and gas market, it's going to draw a lot of that demand that we're seeing or competition we're seeing from Asian-produced products go right back into China as it has historically.\n\nAnd then just this period of time typically is a low-demand period as it once we go through winter. So, really, we don't have a really good viewpoint on what's going to happen in chemicals into that February, March time frame when we start looking at construction season. So, not a lot of guidance on '24 by -- on '23 at this point, but it's certainly the key drivers of what's going to really impact us in '23 and beyond is going to be for that PVC demand construction sector, general kind of durables and construction, coupled with also what happens in China in terms of when they reopen their economy.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you. That's really helpful. And then on the King Ranch deal, it's -- obviously, it's a very large amount of facilities that you can put on top of it.\n\nBut can you just talk to the pros and cons of building units on that site versus where you're developing DAC 1 in the Permian and maybe some of the other acreage you've secured? And then is there an incremental spend number we should be thinking about over the next couple of years to develop these sites?\n\nRichard Jackson -- President, Operations, U.S. Onshore Resources and Carbon Management\n\nYeah. Let me start. Really excited about the King Ranch. And thanks to the King Ranch for working with us on, really, you know, a different way of looking at a great asset.\n\nReally, the unique things for us in that position is obviously a very large contiguous acreage position. So, that's -- you know, like oil and gas, that contiguous position allows us to be very smart with the way that we develop. But really, the uniqueness, great geology in South Texas, lots of [Inaudible] space per acreage position, access to water being on the Gulf Coast with our aqueous fluid design for direct air capture, the ability to grow zero-emission power to support this larger build out of direct air capture, and then proximity to point source emissions. You know, one of the things we talk about, while this is a great place to capture and build direct air capture, you know, proximity to the Gulf Coast, to be able to also think about point source emissions and bring that, gives us some economies of scale to share that cost.\n\nSo, you know, advantages versus the Permian, they're just different. I think, you know, Permian has the proximity to our CO2 infrastructure, has the ability to both do sequestration and, you know, net-zero oil through our enhanced oil recovery process. And so, depending on where the customer's preferences are for sequestration or net-zero oil, we have the ability to do both. And I think, on that point, we get asked a lot, you know, how do we think about that? And I think our ability is they both reduce emissions.\n\nAs you think about net-zero oil or CDRs, you're lowering the atmospheric CO2. And so, start there. But the other thing is, you know, the ability to grow our market for both allows us to deploy more of this technology and bring the cost down, making it very competitive when you look at other cost of -- cost abatement for emissions. So, that's how we think about it.\n\nI think, again, PACE, I would point you back in terms of how we should think about incremental capital. It -- that'll be a function of getting our costs down and improving innovation, how fast the CDR market grows, and we anticipate it will and actually value will over the next 10 years. And then in the early time, you know, support from something like the DOE grant could really help catalyze and allow us to move more in parallel. And then, again, once we get a sustainable commercial business, capitalization options are wide open.\n\nVicki Hollub -- President and Chief Executive Officer\n\nAnd I would just add to that that we have quite a bit of interest in partnerships and even people investing in the project itself or directly in our low-carbon business. So, there's there's no lack of interest. There's -- for us, it's a matter of choosing the right partners as we begin this process. And really, it's just about, as Richard said, starting the process, making the technology better and less expensive over time, improving it up.\n\nThat's when we'll have even more options about how to finance.\n\nOperator\n\nThank you. And our next question today comes from David Deckelbaum with Cowen. Please go ahead.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nThanks for the time today. I wanted to follow up a bit on just a direct air capture plan and some of the incentives around the IRA. Just given the increased hour between sequestering CO2 versus utilizing it, has this changed the way that you think about the amount of DAC that would be used for EOR or just the EOR business in general? And I guess when we think about the acceleration, I presume that this would all be toward sequestration-oriented projects.\n\nRichard Jackson -- President, Operations, U.S. Onshore Resources and Carbon Management\n\nI think I can start. I think the markets are evolving. You know, again, I think our view is that both products, whether that be net-zero oil or sequestration, are valuable products of the future. And so, when you look at that hour, it's hard to determine exactly, you know, where that's going to land.\n\nThe good news is we think it's commercial for both. And certainly, when you take into account, you know, our ability to produce a low decline, now very low-carbon barrel of oil, that's a tremendous potential market for the future. And so, I think we'll let the markets determine where we go. The good news is we've got options for both.\n\nAnd, you know, again, the challenges, we want to deploy this technology to get the costs down. And so, where commerciality is supported, this will allow us to do it across both products.\n\nVicki Hollub -- President and Chief Executive Officer\n\nAnd I would add that my view is that the world cannot afford a climate transition without -- by cutting out completely oil and gas production. Oil production is going to be needed from decades to -- for decades to come. And using CO2 and enhanced oil recovery as a way to produce a net-zero-emission oil and to have that as the fuel source. It's low cost, lower cost than other options.\n\nIt would help with the transition. It would help to fund the transition. So, I think that oil is needed for us. For our company, in particular, we have 2 billion barrels of resources available for further development in our enhanced oil recovery assets.\n\nAnd we would like to use either anthropogenic or atmospheric CO2 for the -- to develop those resources. In addition, we do know that we can technically use CO2 in the shale reservoirs. So, we can increase the 10% recovery that we have today to something much higher than that. So, it's -- there is a use for CO2 in enhanced oil recovery.\n\nIt's not as well recognized yet. But when the world realizes how much the transition will cost, I do believe that this will become the preferred option to ensure that we can continue the production of low-carbon fuel for those that need it.\n\nOperator\n\nThank you. And our next question today comes from Leo Mariani with MKM Partners. Please go ahead.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nHi. I wanted to follow up a little bit on the thought around production here. You guys talked about not really trying to grow the oil and gas production next year. Certainly appreciate that.\n\nBut just wanted to kind of clarify on that point. You obviously have, you know, pretty significant growth on oil and gas production during the course of the year in '22. So, as you think about potential growth in '23, are you more talking kind of exit to exit? So, sort of fourth quarter '22 to fourth quarter '23 where there won't be much growth because, obviously, if you were flat year over year, I guess that would imply your volumes start dropping here in '23.\n\nVicki Hollub -- President and Chief Executive Officer\n\nNo, we were thinking that, probably, it would be year over year. And I'm not saying that there wouldn't be some growth. We don't intend to grow it. If growth is an outcome, then it would probably somewhere -- be somewhere in the neighborhood of 1% or less.\n\nSo, it's not our intention to grow it. But if we have more wells like Richard just talked about, then there will be growth from our assets, but it's not our desire to grow it in the 3% to 5%. It's not -- growth is not the target. It's to develop the best wells in the best possible ways.\n\nAnd if that delivers growth, then that's good.\n\nOperator\n\nThank you. And ladies and gentlemen, in the interest of time, this concludes our question-and-answer session. I would like to turn the conference back over to Vicki Hollub for any closing remarks.\n\nVicki Hollub -- President and Chief Executive Officer\n\nI would just like to thank you all for your participation today. And thanks again to Jeff as he makes this his final call. Thank you.\n\nOperator\n\nThank you, ma'am. [Operator signoff]\n\nDuration: 0 minutes\n\nJeff Alvarez -- Vice President, Investor Relations\n\nVicki Hollub -- President and Chief Executive Officer\n\nRob Peterson -- Senior Vice President and Chief Financial Officer\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nRichard Jackson -- President, Operations, U.S. Onshore Resources and Carbon Management\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nPaul Cheng -- Scotiabank -- Analyst\n\nRaphael DuBois -- Societe Generale -- Analyst\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nLeo Mariani -- MKM Partners -- Analyst\n\nMore OXY analysis\n\nAll earnings call transcripts"
}