{
  "companyName": "Amwell",
  "companyTicker": "AMWL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/amwell-amwl-q3-2022-earnings-call-transcript/",
  "content": "Amwell (AMWL -2.41%)\nQ3 2022 Earnings Call\nNov 07, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Lisa, and I will be your conference operator today. At this time, I would like to welcome everyone to the Amwell Q3 2022 earnings call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speakers' remarks, there will be a question-and-answer session. [Operator instructions] In the interest of time, we ask that you please limit yourself to one question. Thank you. I would now like to hand the call over to Sue Dooley, head of Investor relations with Amwell.\n\nYou may begin.\n\nSue Dooley -- Head of Investor Relations\n\nHello, everyone. Welcome to Amwell's conference call to discuss our third fiscal quarter of 2022. This is Sue Dooley of Amwell investor relations. Joining me today are Amwell's chairman and CEO, Dr.\n\nIdo Schoenberg; and Bob Shepardson, our CFO. Earlier today, we distributed a press release detailing our announcement. The release is posted on our website at investors.amwell.com and is also available from normal news sources. This conference call is being webcast live on the Investor Relations page of our website, where a replay will be archived.\n\nBefore we begin our prepared remarks, I'd like to take this opportunity to remind you that during the course of this call, we will make forward-looking statements regarding projected operating results and anticipated market opportunities. This forward-looking information is subject to the risks and uncertainties described in our filings with the SEC, and actual results or events may differ materially. Except as required by law, we undertake no obligation to update or revise these forward-looking statements. On this call, we'll refer to both GAAP and non-GAAP financial measures.\n\nA reconciliation of GAAP to non-GAAP financial measures is provided in our posted earnings release. With that, I would like to turn the call over to Ido.\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nThank you, Sue. Q3 was another important quarter for our company. We continue to execute well through our time of transition. The market is responding well to Converge, our platform that is designed to enable and empower the innovative healthcare organizations who are leading the way to a hybrid care future.\n\nI'll start by reviewing some highlights of the quarter. Then I'll take a moment to discuss the market for our solution. Bob will then review some key metrics, our financial results in our 2022 guidance. After that, we'll open the discussion with your questions.\n\nTo begin, here are a few highlights from Q3. We are progressing well, and migrations continue at a healthy pace. Specifically, visits on Converge accelerated from 9% of total to 16% of total visits for the quarter. Feedback from Converge customers is excellent.\n\nThe data coming from customers on Converge is reaching a critical mass and is very positive. I'll cover this in more detail in a moment. We announced new leaders to further propel our growth. Vaughn Paunovich is now on board as our executive vice president of enterprise platforms.\n\nMatthew McAllister is our chief product officer, and Tim Conway is our chief information officer. As we complete some of the most strategic aspects of the buildout of Converge, we are excited to have them join our executive team. All bring unparalleled experience leading digital transformation initiatives for some of the world's leading health and technology companies. And we announced the addition of a new member to our board of directors, Rob Webb.\n\nRob is a senior industry veteran with strong health technology leadership track record. We collaborated with Rob during his long career at Optum Health and UnitedHealth Group. We are confident Rob will bring new perspective and intense focus on the health tech needs of our payer clients and add much value to our board. Finally, we published our ESG framework in September.\n\nI encourage you to find this release on our website and see how our company resonates under an ESG lens. Now, I'll take the time to provide a brief update on Converge development and our progress with customer migrations. I will also share some positive feedback we now have on our solution. We are close to the finish line in the development of Converge.\n\nOur R&D teams continue to work at the rapid pace in close partnership with our customers. They have made extraordinary investments to ensure we are enabling our customers to deliver reliable, coordinated, and scalable healthcare when and where it is needed most. We made great progress also on migrations in Q3. This success further validates Converge capabilities.\n\nVisits on Converge grew impressively to 16% of total visits for the quarter. Momentum continues in Q4, and in fact, we are approaching our millionth visit on Converge. Converge is proving it can scale powerfully, even for our largest customers. A notable Q3 migration was at M Health Fairview, a high-volume health system in Minnesota.\n\nWe are supporting their entire enterprise, and our solution is broadly used across their hospital departments, including primary care, endocrinology, and other specialties. And customer feedback reflects that our platform is delivering on the promise of being a best-in-class engine driving great user experience. Our early migrations are now operating at full throttle and have been for some time. Those customers are consistently praising Converge for its ease of use, speed, and reliability.\n\nWe are growing the list of references for both our platform and also for our role as a trusted partner. In October, we attended important customer-facing events. First, we held a virtual customer forum for payers and employers. The event featured three large strategic customers who spoke to their choice of Amwell as their partner.\n\nIn addition, at the Oracle Cerner Health Conference, MU Health Care spoke about ease of use when digitally unifying more than 50 clinics with our platform as the backdrop. With a single text link from the EHR, MU Health Care team members connect with a patient without any passwords or downloads. They easily screen-shared documents and other instructive materials and even can include family members or interpreters in other screens. As a result, they are experiencing improved efficiencies and significantly upgraded provider, patient, and scheduler experience.\n\nLMH Health is using our solution to simplify the digital care experience of their patients, providers, and associates. In a case study, the CIO of LMH Health called unifying workflow and user experience on Converge platform life-altering for their teams. Regarding our automated programs, Nemours Children Health continues to roll these out in support of their world-class care protocols and mission to redefine children's health. On a recent webinar, they shared preliminary results from our tonsillectomy and appendectomy procedure programs.\n\nIt shows very high satisfaction and engagement rates. They highlighted how these programs risk-analyze valuable patient-generated data to automate next steps and alert providers to intervene when necessary. I'm pleased to convey this positive feedback flowing from our customers on Converge. In doing so, it is incredibly clear to me that we made the right decision to replatform our solution.\n\nNext, I would like to take a moment to speak about how we view the current market for our solution. We believe Converge is the infrastructure to support emerging models. Purpose-built and future-ready, Converge is founded on years of investing in understanding the needs of our customers, and we believe the market is moving to us. In our day-to-day lives, it is incredibly apparent that digital is no longer just a side road to surrogate urgent care.\n\nIt is rapidly becoming the main highway for all types of care offered by all types of providers and services. Providers are prioritizing digital care that allows them to offer an experience that improves staff retention, streamlines workflows, improves outcomes, and offers a business model to grow revenue and be more competitive. And payers and employers are scrambling to leverage digital capabilities to enable effective utilization while meeting consumer healthcare experience expectations. As we deliver on Converge in the market response, we are solidifying our role as a digital transformation partner, supporting our clients in defining and accelerating their strategies and aspirations.\n\nFor example, with Converge, payers, employers, providers, and innovators can, for the first time, run on the same platform. In doing so, payers can enable members to see providers they know and trust. They can share gaps in care with providers and enable value-based care much more easily. Now, I would like to speak to the broader environment for a moment.\n\nAs we see it, economic uncertainty creates both headwinds and tailwinds for us. We know hospital budgets are constrained, and yet the challenges facing providers and payers drive an urgent need to leverage technology to achieve their operational goals. At Amwell, we strive in every conversation to compel prospects and customers that our solutions are the must-have engine to resolve their pain points today and well into the future. Workflows, priorities, and timelines will vary, so customers require a platform that seamlessly enables a digital-first approach now, is scalable, and is also future-ready.\n\nThis is the heart of our value proposition. To conclude these opening remarks, and before I turn the call over to Bob to discuss our financials, I want to thank our teams for their great work in Q3 and their commitment and contributions to delivering on Converge and ensuring our unique role in the digital care delivery ecosystem. With that, I want to turn the call over to Bob. Bob?\n\nBob Shepardson -- Chief Financial Officer\n\nHello, everyone, and thank you for joining us. I'm looking forward to sharing our financial results with you. I'll begin with some key operating metrics. We are pleased to see continued growth in our active providers as the number of active providers on our platform is one measure we use to demonstrate the value we deliver to our provider and payer customers.\n\nWe ended the third quarter with over 98,500 total active providers, representing 23% growth compared to a year ago. As a subset, providers employed by customers active on our network grew 25% versus last year. We anticipate this number will continue to rise as we deploy Converge for our largest customers. Beginning this quarter, we changed our methodology of calculating active providers due to complexities in identifying unique providers who conduct visits on multiple platforms.\n\nWe believe this change gives us a better way to accurately reflect our unique active providers as we unify our platform. We described the specifics of this in our press release. To summarize, using this new methodology resulted in a slightly lower number of active providers in Q1 and Q2 of this year. And based on this new method, we still saw healthy growth in the number of active providers of 19% in Q1 and 35% in Q2.\n\nMoving on to visits. Total visits were 1.4 million in the third quarter, approximately the same as last year. Scheduled visits represented 70% of visit volume, consistent with the 70% to 75% range we have seen since the beginning of 2021 and up from approximately 30% pre COVID. We are making steady progress on Converge development, and the migration of our customers to our new platform is proceeding according to our plan.\n\nIn Q3, total visits on Converge grew nicely and comprised approximately 16% of total visits, an increase which reflects what we said previously that visits driven by migrations are not linear and will expand as we migrate our highest-volume customers. And now, onto our financial results. Total revenue was $69.2 million, reflecting growth of 11% versus the third quarter of '21. The components of revenue are as follows.\n\nSubscription revenue grew 19% over a year ago and with $31.9 million, which is up 8% compared to the second quarter. This is in line with our expectations and is reflective of this year as a transition year. Our long-term path to profitability is grounded in our plan to drive high-margin subscription revenue growth at a rate that is faster than that of our overall business over the long run. AMG visit revenues declined 4% year over year to $28.8 million.\n\nRevenue per visit was $78, similar to both last quarter and the year-ago period. Our AMG business is an important differentiator in the market and critical to many of our clients, and we view the offering as an important supporting element of our Converge strategy. Our services and Carepoints revenue was $8.5 million versus $5.4 million a year ago and $5.2 million last quarter, driven largely by our services business. The outperformance this quarter was attributable to the acceleration of an international marketing services contract which we had expected to be spread across the back half of the year and was concentrated in the third quarter.\n\nLooking toward Q4, services and Carepoints typically have their strongest revenues in the fourth quarter as customers seek to drive engagement and use dedicated funds going into ERF. Additionally, we anticipate a healthy mix of professional services contribution to revenue in Q4 as strategic customers continue to deploy customized versions of our platform. Turning to profitability, gross profit margin was 40%, approximately 350 basis points lower than last quarter and a year ago largely due to the temporary mix shift toward lower-margin services and share points revenue I just discussed. Our gross margin can vary quarter to quarter based on mix dynamics.\n\nWe believe as we ramp up Converge deployments, the efficiencies associated with our multi-tenant, test-based platform will lift our gross margins. Next, regarding our operating expenses, R&D spending was similar to last quarter at $36.3 million. Converge development is on track, and we continue to plan for R&D spend to increase into Q4, peaking this year, and tapering off significantly next year, as described in our profitability framework. Our adjusted EBITDA improved to negative $41.9 million from negative $42.8 million last quarter, thanks to careful expense management around headcount and ongoing synergies from our recent acquisitions.\n\nI'll speak to this further when I cover our guidance. Transitioning to the balance sheet, we are fortunate to have a substantial cash position, ending the quarter with $582 million of cash and short-term investments. And now, I would like to review our outlook for 2022. As Ido mentioned, our teams are executing well.\n\nWe are on track for the year, and customer feedback on Converge is very positive. We're encouraged by this. We are confident our strategy is the right one, and our market position continues to be strong. We are taking the opportunity today to refine our guidance.\n\nWe believe our revenues will be within our original guidance range set at the first of the year. With only one quarter left in the year, we have clear visibility to achieving revenue in the lower end of our previously provided range of $275 million to $285 million. Next, I'd like to discuss our EBITDA guidance. We are pleased to be raising our adjusted EBITDA guidance for the year.\n\nR&D spending related to Converge is in line with our original plan, and thanks to expense discipline around headcount and synergies from Silver Cloud and Conversa, we believe we will deliver adjusted EBITDA of approximately $10 million better than our prior guidance. Our new adjusted EBITDA guidance range for 2022 is negative $180 million to negative $190 million. We enter the fourth quarter laser-focused on our strategic priorities. We will complete the buildout of Converge, deliver on our strategic migrations and deployments, and work to ensure the success of our customers to further demonstrate the benefits of our solution.\n\nAs usual, we will provide full-year guidance for 2023 on our Q4 call in February. To summarize, our third quarter was an important and encouraging quarter for us, and we believe we are on a path to achieving the broader strategic and financial goals we have outlined. By putting our technology at the heart of our future, we believe we are on solid ground to execute through this transition year and proceed on the path toward long-term high-margin subscription revenue growth and expanding profitability. With that, I'll turn it back to Ido for some closing comments before taking your questions.\n\nIdo?\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nThank you, Bob. With Q3 behind us, we aim to execute well and close out a strong year. It's early days in the evolution to digital care delivery. Our differentiated solution, our unique role, and large opportunity inspire us every day to be the partner to enable and empower our customers as they seek to evolve their organizations to a digital-first future.\n\nWith that, we are ready to conclude our prepared remarks. Thank you for listening today. Operator, we are ready to open the line for questions.\n\nOperator\n\n[Operator instructions] In the interest of time, we ask that you please limit your question to one. We'll pause for just a moment to compile the Q&A roster. Our first question comes from the line of Charles Rhyee with Cowen.\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nYeah. Thanks. Thanks for taking the questions. You know, Ido, you talked about providers, payers, and, you know, employers all embracing virtual.\n\nAnd, you know, obviously, what we're seeing today in utilization compared to several years ago is much greater. But they were down from the peaks during the COVID period. You know, how -- you know, how do we think about -- where does, you know, utilization go? And not just speaking just, let's say, visit itself, but sort of just the broader adoption of virtual as a core part of care delivery. What do you think keeps it over the line where providers more broadly embrace it? And, you know, clearly, you brought up the idea of just being constrained in the macro environment.\n\nHow much of that you think is more of a headwind versus the tailwind that you described being -- you know, it's also an answer to help solve for that as well.\n\nBob Shepardson -- Chief Financial Officer\n\nIdo, you're on mute.\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nSo sorry. Good evening, Charles, and thank you for your very good question. We are using the methods of the past to try to measure the future in some way. Telehealth was synonymously connected to counting the number of visits as a token of their progress, and we do that as well.\n\nBut it's very important to understand that the adoption of digital delivery enablement is much broader than that. A lot of the utilization we see does not necessarily result in visit. Having said that, by creating this exceptional member experience or consumer experience where my interaction with the healthcare system is digital-first and allows me to really interact and secure physical visits, virtual visits, into a great degree, automated visits is a trend that is definitely here to stay. And the other participants, namely payers, employers, and certainly providers, are also participating in this transformation.\n\nSo, I can't imagine a future where this platform is not really necessary or a must-have for the future and certainly going to use methods that more relate to the improvement of clinical and financial outcomes that it delivers rather than to the very relatively narrow metric of visits. Let me give you just one example maybe to illustrate that. So, on September 29th, UCSF, one of our clients, issued a very interesting case study where the use our technology is part of a new prelisting a program to manage their kidney transplant patients. They are one of the renowned centers in the U.S., maybe in the world, and their list is extremely popular with -- this grew to more than 4,300 patients.\n\nAnd that is something that requires an enormous amount of interaction, not only with the people on the list but growingly with the people that could be potentially candidates on the list. And that was a toll on the organization. With our technology in the backdrop, they have created this prelisting program that really allowed for navigators and a digital envelope really powered by AI reading your visits there in the platform to really engage with this very large population with great emphasis not on the people on the list alone but, really, on the people that would be potential candidates to join the list. With less than a year in play, they were able to report 67% of the patients enrolled routinely and engaged on the program, which is fairly high.\n\nAnd more importantly, the waitlist had been reduced by 30%. They were able to show some significant savings of more than $0.5 million annually by reducing their fees and reducing the listing and testing costs. Most importantly, they said that they got some really great feedback from both their own staff, and staff retention is very important today, and most importantly, their patients. So, this is just one example to show that digital care delivery would be measured in a much broader way going forward.\n\nAnd we certainly see very healthy appetite in the market for different use cases and broad adoption of offering.\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nAppreciate that. And if I could just sneak another one in. As -- you know, Bob, you talked about visibility into the fourth quarter, so the full year coming in toward the lower end. Can you talk about what kind of things maybe didn't happen that might have gotten you to the top end of the range? Maybe just a sense for sort of the puts and takes that kind of occurred in the back half of this year.\n\nThanks.\n\nBob Shepardson -- Chief Financial Officer\n\nSure, Charles. Thank you. And look, we're really happy to be coming in here in the range that we articulated at the beginning of the year on revenue and talking about a beat on the EBITDA side for the year. As you know, we gave a range for reason.\n\nObviously, we're in the middle of a strategic transition replatforming our business. And when we gave the guidance, we talked about what our primary focus items for the year were going to be, and those are building out Converge and finishing the development of the platform, implementing our strategic customers, migrating customers, and ensuring that our customers have an excellent experience through that process. And we feel like we are -- have checked or in the middle of checking all of those boxes. So, you know, the environment that we set the range in was a different environment that we're sitting here in today.\n\nThat being said, you know, we are very pleased with where we're coming out, and we're confident that our approach to the market here is the right one to drive performance through the long-term model. So, that's I think what I would tell you. You know, the puts and takes, really, some are in our control, some are not. And I feel like we did -- we're doing a very good job, especially with the ones that are in our control.\n\nOperator\n\nYour next question comes from the line of Craig Hettenbach with Morgan Stanley.\n\nBob Shepardson -- Chief Financial Officer\n\nCraig, we can't hear you.\n\nOperator\n\nYour line is open, Mr. Hettenbach.\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nSorry. Can you hear me now?\n\nBob Shepardson -- Chief Financial Officer\n\nYes.\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nPerfect. Apologies. So, just a question on the overall spending environment and particularly the dichotomy between health systems and some of the pressures they're under versus health plans. And then maybe also, you can tie into the point of future-proofing the technology and what that means and the type of backdrop we're in today.\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\n Sure. Thank you, Craig. So, there is no question that everybody is feeling the macro trends right now. And there is also no question health systems seem to be even more tight than health plans as we speak.\n\nThat type of environment really requires us to very much focus with our customers on value and ROI. So, when we talk about that, as we stand, as we expand, as we migrate, we really try to understand the business priorities of our customers and find a way that our platform conserve their short-term need. In the case of health system, obviously, the key leaders are staff retention, improving efficiency, and diversifying the revenue and allow them to better compete and increase the top line with payers and other similar trends that relate to the member experience, improving financial and clinical outcomes and creating a much more sticky, meaningful relationship with our customers, whether it's members or, in some cases, the government. The second point I think you alluded to relates to the modularity of our platform.\n\nIn this type of environment, it's even more important than ever. You may remember in the past, we had really one giant offering, and you either bought it or you didn't. Today, you can really buy the component that you need today, but it really benefits from the fact that we are ready to expand the use case and utilization of the platform. It can really scale not only where or frequency of use but also in real scope of the services and value.\n\nThis was not lost, first and foremost, on our strategic customers. And really, we are so proud to have some of the largest organizations across the United States select Amwell as their partner for the next few years. Initially, in the market, we saw less appreciation for the future readiness. In the mid-part and the lower end of the market, it was very much price-based.\n\nThat is changing. I cannot overstate the importance of that, but it's very difficult to measure exactly how it's going to play out. But growingly, the sophistication is going down in market size, and even smaller clients realize that there is much more that they can do. And the pain of switching the platform after a year or two is significant.\n\nSo, we see that as an argument for a bank.\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nAppreciate the color.\n\nOperator\n\nYour next question comes from the line of Stan Berenshteyn with Wells Fargo Securities.\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nThanks for taking my questions. I want to go back to maybe a couple of comments that were made in the prepared remarks. I think, Ido, you referred to certain macro environment pressure on health systems. And then, Bob, I think you mentioned that migration is on track.\n\nI'm just trying to understand, are you seeing any actual buying [Inaudible] as health systems are maybe contemplating certain types of module, operators think about next year. Maybe without giving us actual guidance for next year, are you seeing any types of pressures?\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nWell, there are many reasons why people buy Amwell, stay with Amwell, or expand. That's the nature of a fairly comprehensive platform. But as I mentioned earlier, there is a clear common thread. The number one, I think, for health systems today is staff retention.\n\nSo, improving the provider experience is key. The fact that we are fully integrated in the growing number of EMR, that the interface is very fast, very modern, is highly personalized, and context-sensitive, the ability to work not only with your patients and -- but also with other providers and really expand your reach in a number of ways seem to be very important in helping retain staff. And we also see that other features of our platform, really, in the area of automation more than anything else using AI, natural language processing, and other technologies is very, very helpful because many of those providers really are very tired. There's enormous pressure on them today.\n\nAnd if we can help them in data collection, managing the relationship with patients, with reminding -- providing reminders, providing some kind of longitudinal envelope, so they can manage them better, that seems to be fairly appreciated by our customers. So overall, we are -- these are the common levers. Of course, there is a very large list of examples. As it relates to the management of your emergency room, all the way to avoidance of readmission, the integration of behavioral health when it comes that creates giant bottlenecks, very open, very irregularly, the management of stroke are just some examples to a very specific use cases that we see.\n\nThere are literally hundreds of those today, and clients are rediscovering them as we go.\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nThanks. Maybe a quick one here. I'm going to go to market strategy. I think this year indicated that, you know, it's kind of all hands on deck to drive the Converge upgrade cycle.\n\nIs that changing next year? Just would be great to get a sense of how your sales strategy may evolve in 2023. Thank you.\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nSure. So, this year was really all about the deals more than anything else. That was the No. 1 effort for the company.\n\nAnd as Bob and I mentioned earlier, we are in good shape. We'll have the lion's share of our planned development behind us very soon, by the end of the year. Next year is obviously about refining that and further improving. We really never stopped doing that going forward as part of our offering to our customers.\n\nIt's all about completing this migration. So, the migration plan was public. We talked about it very clearly. The first line of defense was to protect our lower-end customers, which we did quite successfully early on with our network.\n\nThen we move to our providers that were hurting, and we did that and continue to do that very well. And now, we are turning into the last segment of our offering, which are payers. CVS announced they're going live, and they have a payer component, obviously, to their offering in January 1st. The other examples -- so we definitely plan to see a lot of migrations also next year.\n\nSo, if the focus of this year was development and the initial migration in strategic market segments, next year, the focus is really on migration. That would generate opportunities for same-store growth. It will create opportunities for strengthening our relationships with our customers and retention. And very importantly, this is a very close market.\n\nNewcomers are really looking at existing customers and their success. And we believe that when we have a network effect of more and more clients demonstrating that in various ways, that will be a strong tailwind also for other customers. I'd like to caution people that this growth is a very heavy trend. It takes time to move.\n\nWe recognize revenue not only when we sign the deal, and then when we implement it, and then we go live, and we count it as -- through the length of the agreement. But the trend is very much there, and it's very encouraging.\n\nOperator\n\nYour next question comes from the line of David Larsen with BTIG.\n\nDavid Larsen -- BTIG -- Analyst\n\nHi. Congratulations on a good quarter. Without getting too specific, you did previously provide sort of long-term objectives in terms of revenue growth and EBITDA margin. What are going to be some of the positive drivers for 2023? How is the CVS deployment progressing relative to expectations? Is revenue for CVS being recognized now? Or does that start to roll on January 1st? And can you give any color around like the pace of newly signed deals in calendar 4Q of '22? Given sort of the somewhat challenging economic environment that we're in, are they trending relative to expectations at a high level? Thanks very much.\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nSo, Dave, maybe I'll just take the first part of your question as it relates to appetite in the market. The appetite is healthy. There's no question about it. People are paying attention, and I'm fairly confident that if the trend will continue, we will see a nice mix of same-store growth.\n\nWe have a very large market share. So, that's incredibly important. But also, newcomers. We shared some of them.\n\nThe others, we didn't share yet. But overall, I think what we see is encouraging. I'll let Bob really complete the answer.\n\nBob Shepardson -- Chief Financial Officer\n\nSo, the -- I would say -- I think the heart of your question is what's -- where is the goodness going to come from next year? And so, we've been, I think, fighting with one hand tied behind our back here for the last 18 months with the replatforming of our business. Our sales force has been -- I don't want to say handicapped, but they haven't been able to present to customers a platform that is in operation with the same or better functionality, and they've done a fantastic job holding on to customers while we've been doing this. But signing new logos, obviously, is difficult in that kind of setup and as is signing customer upgrades. We have done both, and full credit to those folks for making that happen and selling the vision in the future.\n\nBut, you know, obviously, we feel really good about how we're positioned going into next year to see bookings ramp relative to the rate that we've seen over the -- you know, the prior several quarters and being in a position, once people are comfortable with the migration and active on the network for a while, our existing customers buying up more services. So, those -- you know, and I guess I would add, too, that we're seeing, and I referenced it in our prepared remarks, our strategic customers are wanting more and more of Converge functionality.  That is -- that's a terrific thing. And, you know, that will drive, hopefully, as we go forward here, you know, some incremental professional services revenue as we deploy more customized solutions to the folks that demand those. So, you know, I would look for -- and, you know, you're going to see some of this in the first half of the year, but this is really going to be a build over the coming quarters of bookings momentum driving implementations, which are going to drive go-lives, which are going to drive revenue.\n\nAnd similarly, as you see the percentage of visits on Converge reflecting our migration progress, as those migrated customers take the throttle off and realize the power of the platform and are very comfortable -- get comfortable with it, buying more, whether it's Silver cloud or Conversa or other modules, you know, buying up from there, we've certainly seen demand for that. But that will also drive a good bit of the growth that we'll see next year. I hope that's helpful. I don't want to get specific on numbers or quantum, but we'll certainly do some of that beginning of next year.\n\nDavid Larsen -- BTIG -- Analyst\n\nGreat. Thanks very much. I'll hop back in the queue.\n\nOperator\n\nQuestion comes from the line of Jailendra Singh with Truist Securities.\n\nEduardo Ron -- Truist Securities -- Analyst\n\nHi. This is actually Eduardo Ron on for Jailendra. We're just curious to hear your thoughts about, you know, client feedback, particularly those that -- obviously, you mentioned the ones that up to Converge, but those that either delay making a decision to uptake the offering or don't. And what drives that decision? Are they looking for something else within the module that you're offering?\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nSo, again, a great question. I'm sure that we don't have 100% penetrant in the market, and some clients obviously go with the competition, which is fine. As far as what we see, we have a very good success rate in getting people excited about our offering. That should not be confused with the readiness to make a decision or implement the decision.\n\nThose two factors are really influenced by the macro in some ways, and it's influenced by the priorities of the organization. So, people really understand the value of the offering. We feel that, obviously, many of them are ready to jump in and commit, but then when it comes to implementation and staff availability, things of that nature, there is always a queue in factors beyond our control. We don't see material impact of that, to be fair.\n\nSome organizations, especially the larger ones, they have a clear sense of urgency, and they want to go much faster than we can even deliver. Others have more challenges, especially related to health systems, but these challenges eventually may push the original timeline by a quarter, by a month or two. It's not something that we feel is going to have a dramatic impact on our plan and on our future. And that is very much thanks to the realization that you actually need a platform like ours.\n\nThat it's truly a market.\n\nOperator\n\nNext question comes from the line of Jack Wallace with Guggenheim Securities.\n\nUnknown speaker\n\nHi. This is John on for Jack. I wanted to ask to see if -- in terms of guidance or visit volumes, are you seeing any impact from the flu season? And are those negative impacts embedded within the 4Q guidance? Thank you.\n\nBob Shepardson -- Chief Financial Officer\n\nNegative -- the negative impact -- I guess it's negative for the folks that are getting the flu, but it's positive for our business. It's just -- that's the business we're in. You know, certainly, we are seeing a heightened level of activity associated with that. And anecdotally, you know, I'm seeing it on the ground in New York City.\n\nSo, the flu has certainly come early to the Northern Hemisphere, and volumes are -- you know, I think -- I don't want to get specific about volumes, but we are clearly seeing an impact from the flu and other respiratory viruses.\n\nOperator\n\nYour next question comes from the line of Eric Percher with Nephron Research.\n\nUnknown speaker\n\nThis is Dolf on for Eric. I just want to go back to the gross margin to make sure I understand. Are we supposed to understand that as a pull-forward of low-margin business that then reverses and more so rebounds in 4Q? Or is this something of a margin-dilutive step-up that came earlier than expected? I just wanted to clarify that point. Thank you.\n\nBob Shepardson -- Chief Financial Officer\n\nThe former, Dolf. You know, we expected -- you know, we typically see an acceleration in the fourth quarter of marketing programs. This one is rather large, and it executed in the third quarter. So, a pull-forward of some revenues that we would have expected to see in the fourth quarter.\n\nIt's not a big number, but it had a dilutive impact. And I wouldn't expect -- you know, as a result, I would expect that the margin performance is better in the fourth quarter than we would have otherwise anticipated.\n\nUnknown speaker\n\nOK. Great. And if I could just ask one follow-up. Was there -- are you seeing anything in labor costs within the AMG visits that might temporarily or be kind of weighing on margins at this point? Thank you.\n\nBob Shepardson -- Chief Financial Officer\n\nNo, I don't think so. I don't -- you know, I don't know whether -- you know, I wouldn't say that is going to hold for next year. We're kind of going through that process now. But as far as what we're seeing right now and what we saw in the third quarter, it was kind of business as usual from a $10.99 cost.\n\nOperator\n\nYour next question comes from the line of Jessica Tassan with Piper Sandler.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nHI. Thanks for taking my questions. So, I may have missed this, but --\n\nBob Shepardson -- Chief Financial Officer\n\nHi, Jess.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nHi. Are you guys able to give us a sense of just what percent of provider customers have either completed or accepted a Converge upgrade at this point? And then I know payer is sort of more nascent, but if you're able to provide the same stat for payer, that would be helpful, too.\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nJess, good to hear your voice, and thank you for being the first, I think, right following our release. We really try to focus on a number of metrics and not expand them as much as possible. I would suggest that we see very nice and healthy migration in the health systems segment, and we see some -- the beginning of a healthy migration also in the payer segment, but we really don't report beyond what we are reporting.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nOK. And do you think -- maybe you could just give us some examples of some of the supplemental capabilities or add-on capabilities that customers are asking you to roll out within Converge. Thanks.\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nSure. When you realize the digital-first experience really touches every single element of payer and provider organizations, it really requires enormous amount of integration, integration of scheduling, the payment systems, workflow, rules and regulations, the services, dynamic clinical load balancing, and many, many others. So, it's really making sure that the core capabilities of the infrastructure that we have created is really embedded in everything these customers are doing when they're big and they're complex. It requires enormous amount of work, both from our end and the client end, but it's extremely effective as well.\n\nSo, the ROI of doing that is very, very significant. So, they are really not shy or gun-shy in making those investments.\n\nOperator\n\nNext question comes from the line of Cindy Motz with Goldman Sachs.\n\nCynthia Motz -- Goldman Sachs -- Analyst\n\nHi. Thanks for taking my question. I just want to go back to some of the numbers to make sure I understand them. So, just to get to sort of the lower end of your guidance on revenues, we need to assume probably like a ramp of around 6.5%, 7% next quarter, which is off of a good -- very strong fourth quarter '21.\n\nAnd when I just look, it sounds like the Carepoints, the other revenues had some sort of pull-through this quarter because it's definitely higher than we were expecting. So, we might see some bump next quarter with that. And then the visit revenue, I just want to check, too, because you said it was $78, I think, revenue per visit, which is -- I have sequentially down like from like $81, and then maybe even last year, a little more. So, just wondering if there was something going on there.\n\nAnd then I guess the expectation would be that the subscription revenue is really going to carry us in fourth quarter as you see it. And then I have a follow-up. Thanks.\n\nBob Shepardson -- Chief Financial Officer\n\nThanks, Cindy. I would say -- so on the revenue per visit, it's been run -- your sequential number is right. It is -- it's down about $1, I think. And I think it's down about $1 from the year-ago period, too.\n\nIf you think about -- you know, we had changed the methodology that we used on our Amwell site business. So, if you think about that pro forma number, it's all within $1 or $2. So I think it's -- my point in the prepared remarks was it's been rather consistent within $1 or $2, and it tends to go down during periods where we have a high percentage of urgent care because that carries with it the lower revenue per visit when -- relative to the specialty. So, I hope that's helpful on that.\n\nAnd then the other point I made in the prepared remarks, Cindy, was around professional services and strategic implementations driving some incremental revenue there in the fourth quarter. So, I think we'll see strength across the line items for revenue in the fourth quarter to get you to the range that we talked about.\n\nCynthia Motz -- Goldman Sachs -- Analyst\n\nOK. And then just as a follow-up, you had mentioned that this year, the salespeople kind of had their arms tied behind their back because it is hard to go with new clients and things like that when you're still working on the system but -- the platform and stuff. But I'm just curious because the sales and marketing, the costs are, you know, pretty good. Like they definitely were lower than we were expecting.\n\nIs that because they're basically not going full steam ahead? And then next year, I would think that we would have to see that ramp. You know, you're just waiting for maybe the R&D to work out. And then, you know, again, just following up on one of the other questions, I know you're not giving guidance, but do you still feel comfortable with your sort of articulated path to profitability in the broad sense with EBITDA, like getting down that loss? Thanks.\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nSo, Cindy, in a high level, we are not only changing our platform. We are really changing our company in many ways, from a service-based company with technology to a SaaS enterprise focus. And that touches every single part of the company, including sales and marketing. What you need -- the anatomy of the sales, the DNA of the sale is changing.\n\nIt's much more advisory. It's much more technical and deep. And we have made and continue to make those changes during this year. So, while our engineers were really working very hard on this new differentiated solution, our growth organization was getting ready to catch the ball.\n\nAnd we did that with a great, I would say, caution to operate in a responsible way in this time but not scheming on what we would need to really emerge and grow. You don't need an army to sell enterprise solutions. It's very, very different DNA. Typically, these deals are bigger and longer.\n\nThey cater to the most sophisticated larger clients. So, you can do more with less. We don't see that changing very much going forward. So, the framework that both provided to the pathway of profitability and cash flow positive is something we completely stand behind also today following this year.\n\nBob Shepardson -- Chief Financial Officer\n\nYes, Cindy, I agree on the -- just the long-term path to profitability framework that we laid out, we feel very good about that -- the way that was laid out. Our subscription revenue growing faster than the overall business, that's going to drive our gross profit margins up meaningfully, you know, from the low 40s to the mid-50s over the next few years and seeing operating leverage across the other line items and R&D being down year over year, driving incremental profitability in the near term. And so, you know, we still feel -- we see the same market opportunity we saw at the beginning of the year. We feel like we've really derisked a lot of the concerns around Converge being delivered on time and working well because we are on time, and we're getting very strong feedback from strategic and existing customers, the quality that it's delivering.\n\nSo, our ability to drive market share gains over that period of time, we feel very good about, and delivering on the operating leverage for -- to get us to EBITDA breakeven. We will be a lot, obviously, more specific on our guidance, you know, our near-term guidance in February, and that's going to reflect kind of what we're seeing very near term in the markets today and our estimates, you know, for revenue and profitability.\n\nOperator\n\nOur final question comes from the line of Allen Lutz with Bank of America.\n\nAllen Lutz -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking the questions. Bob, I guess one for you. You mentioned you're not seeing wage pressure in the AMG business, which is good. I guess kind of taking that from a different angle, obviously, inflation is occurring all over the place.\n\nAnd if you kind of think about urgent care and behavioral, there's been some volatility, I think, in the average price per visit, but it looks like prices that you're charging have been relatively flattish. Can you talk about the opportunity to maybe raise prices for AMG?\n\nBob Shepardson -- Chief Financial Officer\n\nYou know, it's competitive market, Allen, and we approach this AMG on a kind of region-by-region, state-by-state basis. And I think we are -- you know, we really do set our prices to accomplish a couple of things. One is to meet SLAs for provider availability for our strategic customers. That's very important.\n\nSo, we want to make sure we have the right level of availability for wait times. But we also, obviously, are looking to generate a reasonable return on that as well. So, I -- you know, overall, we would love to be able to take some price here on the provider side, but -- and we will do that to the degree we can, but we are in a competitive market. And I do think that once we are further penetrated with some of our strategic customers, you know, that volume may drive some opportunity for us.\n\nBut we'll just have to see. I wouldn't be building in -- I'm not building in a lot of increase in urgent care pricing over the next few -- the next several quarters or the same on any of the specialty categories as well.\n\nAllen Lutz -- Bank of America Merrill Lynch -- Analyst\n\nGot it.\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nI would add just one more thing, Allen. Unlike other traditional models, we are looking at a reality where Converge is putting both payers and providers on the same platform. There would be an opportunity to our very large market share of hospitals and specialty providers to participate in providing services if they have the capacity to do so. And therefore, the cost of recruiting and managing those providers counter to the current $10.99 is much lower.\n\nIt also offers an opportunity for patients to see doctors a known trust from brand that they recognize, which is really a net positive for everyone.So, we are seeing, long term, our role is matchmaking and brokering, much more than selling the actual services. And by arranging or orchestrating these services, we can defend a very good margin because we are not actually paying for the supply that we are enabling.\n\nAllen Lutz -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Ido.\n\nOperator\n\nAt this time, there are no further questions. I would like to turn the call back over to Ido for any closing remarks.\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nThank you, operator. And I want to thank everyone for your time and interest and great questions. We really appreciate your support and look forward to continue our dialogue.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSue Dooley -- Head of Investor Relations\n\nIdo Schoenberg -- Chairman and Co-Chief Executive Officer\n\nBob Shepardson -- Chief Financial Officer\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nDavid Larsen -- BTIG -- Analyst\n\nEduardo Ron -- Truist Securities -- Analyst\n\nUnknown speaker\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nCynthia Motz -- Goldman Sachs -- Analyst\n\nAllen Lutz -- Bank of America Merrill Lynch -- Analyst\n\nMore AMWL analysis\n\nAll earnings call transcripts"
}