{
  "companyName": "Applied Materials",
  "companyTicker": "AMAT",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/applied-materials-amat-q4-2022-earnings-call-trans/",
  "content": "Applied Materials (AMAT 0.25%)\nQ4 2022 Earnings Call\nNov 17, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the Applied Materials earnings conference call. During the presentation, all participants will be in [Audio gap] Afterwards, you will be invited to participate in the question-and-answer session. I would now like to turn the conference over to Michael Sullivan, corporate vice president. Please go ahead, sir.\n\nMike Sullivan -- Corporate Vice President\n\nGood afternoon, everyone, and thank you for joining Applied's fourth quarter of fiscal 2022 earnings call. Joining me are Gary Dickerson, our president and CEO; and Brice Hill, our chief financial officer. Before we begin, I'd like to remind you that today's call contains forward-looking statements, which are subject to risks and uncertainties that could cause our actual results to differ. Information concerning the risks and uncertainties is contained in Applied's most recent Form 10-Q and 8-K filings with the SEC.\n\nToday's call also includes non-GAAP financial measures. Reconciliations to GAAP measures are found in today's earnings press release and in our quarterly earnings materials, which are available on the IR page of our website at appliedmaterials.com. Before we begin, I have a calendar announcement. Applied plans to hold an E-Beam Technology and New Product webcast on Wednesday, December 14, at 9:00 a.m.\n\nPacific Time. Please stay tuned for an invitation to join our presenter, Keith Wells, who is group vice president and general manager of our imaging and process control group. And with that introduction, I'd like to turn the call over to Gary Dickerson.\n\nGary Dickerson -- President and Chief Executive Officer\n\nThank you, Mike. Applied Materials delivered a strong finish to our fiscal year with record quarterly performance. Throughout 2022, the company has demonstrated solid execution while navigating COVID-related restrictions, supply chain shortages in a challenging geopolitical and macroeconomic environment. I would like to recognize the hard work and commitment of our global team and our suppliers who are doing everything possible to meet our customers' needs.\n\nAs this is our year-end call, I'll begin my prepared remarks with a quick review of our performance and progress over the past 12 months. I'll then give our latest outlook for 2023 before describing our longer-term growth thesis for the industry and Applied. After that, Brice will provide more color on our financial performance and key areas of operational focus. Like many others in the technology sector, our performance and priorities in 2022 have been shaped by an unprecedented set of challenges.\n\nOur top priority has been mitigating supply chain constraints that prevented us from fully meeting customer demand. In Q4, we made incremental progress, and we expect to continue closing supply gaps over the next few quarters. As well as finding creative short-term solutions, our team has been addressing root causes and building a more resilient, scalable supply chain, and stronger strategic relationships with our suppliers. In addition, we are strengthening our own manufacturing, logistics, and supply chain management.\n\nWhile I'm pleased with the recent improvements in supply chain performance, we are still supply chain limited across a number of key product lines and our backlog grew in Q4. The biggest supply constraints are in our metal deposition business, where customer demand is very strong. This is our largest business unit and where we have highly differentiated solutions for advanced foundry-logic and DRAM. The market for these products, which enable next-generation wiring, is expanding considerably.\n\nIn addition to supply shortages, we're also navigating a difficult geopolitical environment as reflected in the new export control regulations enacted by the U.S. government on October 7. These new rules are complex and cover a broad range of semiconductor technology that includes wafer fabrication equipment and related parts and services. We have taken all the necessary actions to comply with these new rules, including suspending shipments and support where required.\n\nWe estimate that the unmitigated impact to our fiscal 2023 revenues could be up to $2.5 billion. We believe the actual impact can be reduced to $1.5 billion to $2 billion. This will depend in part on how quickly the government provides licenses and approvals, as well as how impacted companies refocus their investments. We are also mindful of the macroeconomic headwinds, including inflation and softening consumer demand.\n\nTo offset the inflationary cost increases we are facing, we are driving multiple initiatives that include reengineering our products and implementing price adjustments. While it's too early to forecast 2023 with any precision, I can describe what we're currently seeing in the market and hearing from our customers. Starting with memory, spending is expected to be down year on year as weakness in consumer electronics and PCs prompts some customers to defer capacity additions. In leading-edge foundry-logic, demand looks strong, with customers racing for leadership and driving major technology inflections that determine their relative competitive positions.\n\nIn ICAPS, chips for the IoT, communications, auto, power, and sensor markets, demand is mixed. Consumer-driven markets are clearly softer, while the automotive, industrial, and power markets remain robust. Those investments are underpinned by large inflections, including the transition to electric vehicles, accelerated adoption of industrial automation, and growing demand for renewable energy solutions, especially in Europe. While all of this adds up to an expected pullback in overall wafer fab equipment spending next year, we believe that Applied's business will be more resilient than the underlying market for three key reasons: First, we have a significant backlog, the highest in our history, measured on both an absolute and percentage of revenue basis; second, demand for some of our most differentiated product lines where we have uniquely enabling technology remains much higher than our capacity to fulfill that demand; and third, our service business is positioned for steady growth with an increasingly large portion of this business being converted to subscriptions.\n\nOver the past 12 months, our installed base of systems grew 8% and the number of tools under comprehensive, long-term service contracts grew 16%. The renewal rate for these agreements is well over 90%, which demonstrates the value customers see in our subscription services. Looking further ahead, our long-term growth thesis for the industry and Applied Materials has not changed. Semiconductors are the foundation of digital transformation that will touch almost every sector of the economy over the coming years.\n\nThis puts the semiconductor industry on a path to a $1 trillion market by the end of the decade. And while every year will not be an up year, the overall trajectory is clear. We also like where Applied Materials plays within the ecosystem. As technology complexity is increasing, we expect equipment intensity to remain at today's levels or rise further.\n\nThis means wafer fab equipment is likely to grow faster than the overall semiconductor market. Within equipment spending, major technology inflections are enabled by materials engineering, shifting more dollars to Applied's available markets over time. We think about the industry's future road map in terms of power, performance, area cost, and time to market. The PPACt playbook has five pillars: new architectures, new 3D structures, new materials, new ways to shrink, and advanced packaging, with each pillar made up of multiple technology inflections.\n\nFor example, new 3D structures like gate-all-around transistors and backside power distribution networks are materials engineering-enabled inflections that grow Applied's total available market. As I referenced earlier, wiring is a key bottleneck for chip performance and power at advanced nodes. And this is driving significant innovation in new materials. Between the seven- and three-nanometer node, contact metallization steps are growing more than 50%, and our total available market is expanding almost 80%.\n\nFor interconnect layers, process steps are being added even faster, and we expect our revenue opportunity to approximately triple through these node transitions. Advanced packaging represents a new era for integrated circuit design that opens major new vectors of innovation for chip designers. Advanced packaging is also enabled by new materials engineering solutions. Although the industry is still in the early stages of adoption, we have already grown our packaging equipment business to nearly $1 billion.\n\nOur process diagnostics and controls business also has broad exposure to these inflections and delivered significant growth in 2022. Our progress and opportunities in e-beam will be the focus of our December technology briefing. Given our positive long-term view of the semiconductor market, the outsized opportunities for Applied Materials within the market, and favorable global government incentives, we are making investments in R&D and infrastructure to support industry growth and position the company for future success. We will provide more details about our specific plans in the coming months.\n\nAt the same time, with the current macroeconomic conditions, we are carefully managing discretionary spending and limiting hiring to only strategic positions. Before I hand the call over to Brice, I'll quickly summarize. Applied Materials ended the year strong with record performance. In the past quarter, we made incremental progress, overcoming the supply challenges that have constrained our performance in fiscal 2022.\n\nHowever, there is still work to do and our backlog continues to grow. We expect 2023 to be a down year for wafer fab equipment spending, but we believe that Applied's business will be more resilient, thanks to our large backlog, growing service business, and strong customer demand for our leadership products that enable key technology inflections. Longer-term secular trends create opportunities for Applied to outgrow the semiconductor market by enabling the PPACt roadmap with our differentiated portfolio of materials engineering solutions. We are making strategic investments for the future while slowing spending growth in the near term.\n\nNow, I'll hand over to Brice.\n\nBrice Hill -- Chief Financial Officer\n\nThank you, Gary. I'd like to start by thanking our team and our supply chain partners for helping to further increase our output for our customers. On today's call, I'll summarize our results for the fiscal year and Q4, as well as provide our guidance for Q1. I'll also discuss the impact of recent U.S.\n\nexport regulations on our revenue and gross margin. Before going into the results, I'd like to make three points. First, despite a weaker customer demand outlook, we generated strong orders in Q4 and ended the year with record backlog, particularly in some of our leadership product areas. Combined with the resiliency of our AGS business, the strong backlog puts us in a good position to offset some of the market weakness expected next year.\n\nSecond, we have not changed our view of a $1 trillion semiconductor market by 2030 with a high single-digit CAGR for semiconductors and similar or faster growth for equipment due to added process complexity. We grew our headcount in R&D spending significantly in 2022 to develop new leadership products and further expand our broad portfolio. While we are slowing our spending growth in the current environment, we remain committed to research and development, enabling critical inflections that support our customers' road maps. And third, we returned nearly $7 billion to shareholders this past year, including buybacks equivalent to 6% of shares outstanding at the beginning of the period.\n\nWith record demand and financial results in 2022, a strong growth opportunity through 2030, and our broad and unique portfolio of systems and services, we're confident in our financial position and our future. Next, I'll summarize our fiscal year results. Although supply chain constraints impacted our output all year, we delivered record annual revenue and EPS. On a year-over-year basis, revenue increased nearly 12% to $25.8 billion.\n\nNon-GAAP gross margin decreased by around 90 basis points to 46.6%. Non-GAAP operating profit grew by over 7% to $7.86 billion. Non-GAAP operating margin decreased by 120 basis points to 30.5%. And non-GAAP EPS increased nearly 13% to $7.70.\n\nWe generated about $5.4 billion in operating cash flow this past year and over $4.6 billion in free cash flow. We returned 151% of free cash flow to shareholders, including $873 million in dividends and $6.1 billion in share repurchases. Our cash returns for the past three years were equivalent to over 100% of free cash flow. In the year, demand for our products and services was very strong with record annual bookings in semi systems and AGS.\n\nOn a year-over-year basis, our total ending backlog increased 62% to $19 billion. Our semi systems backlog increased 90% to nearly $12.7 billion. We expect to reduce our semi systems backlog as supply chain performance improves. Our AGS backlog increased 30% to over $5.6 billion.\n\nThe strong AGS backlog reflects a large increase in long-term service agreements, which gives us confidence in the continued growth of this business. Moving to our Q4 results. We delivered record quarterly net sales of nearly $6.75 billion and record non-GAAP EPS of $2.03. Non-GAAP gross margin declined 20 basis points sequentially to 46%, and non-GAAP opex grew 3.5% sequentially to nearly $1.1 billion, with most of the increase in R&D.\n\nTurning to the segments. Semi systems revenue grew more than 6% sequentially to $5.04 billion. Segment non-GAAP operating margin increased 80 basis points sequentially to 36.9%. AGS revenue was flat quarter over quarter at $1.42 billion.\n\nSegment non-GAAP operating margin declined to 28.3%. AGS key performance indicators continue to be positive with strong year-over-year growth in installed base systems, service intensity, and subscription agreements. As a result, AGS continues to grow faster than the pace needed to achieve our long-term revenue targets. Moving on to display.\n\nRevenue declined as expected to $251 million. Segment non-GAAP operating margin also declined to 13.5%. Turning to our cash flows. We generated $857 million in operating cash flow during the quarter, which was 13% of revenue.\n\nWe returned over $1.72 billion to shareholders, including $223 million in dividends and $1.5 billion in buybacks. We repurchased 17 million shares at an average price of $88.05. Next, I'll discuss the impact of the new U.S. export regulations to Applied Materials.\n\nWe currently expect that the unmitigated revenue impact of the new rules could be up to $2.5 billion in fiscal 2023. We continue to work through the regulatory requirements, including seeking licenses and approvals where appropriate. We hope to reduce the revenue impact by between $500 million and $1 billion to a net impact of $1.5 billion to $2 billion. We also expect the rules to reduce our non-GAAP gross margin by up to 1 percentage point.\n\nWhile this creates a headwind to meeting our gross margin targets for 2024, we remain committed to our goals and believe we can even exceed them over time. In Q4, the new rules reduced our semi systems and AGS revenue by approximately $280 million, which is in the range of our expectation on October 12. Inventory charges in Q4 were lower than our preliminary assessment. In Q1, we expect the new rules to reduce semi systems and AGS revenue by approximately $490 million combined and reduce our gross margin by around 1 percentage point, both on an unmitigated basis.\n\nNow, I'll share our guidance for Q1. We expect revenue to be $6.7 billion, plus or minus $400 million, and we expect non-GAAP EPS of $1.93, plus or minus $0.18. Within this outlook, we expect semi systems revenue to be about $5.15 billion, which is up nearly 13% year over year. We expect AGS revenue to be about $1.33 billion, which is slightly up year over year.\n\nDisplay revenue should be around $170 million. We expect non-GAAP gross margin to be approximately 46.1%, and we expect non-GAAP operating expenses to be $1.16 billion. We are modeling a tax rate of 13%, which is up from 11.8% last year, primarily due to mandatory capitalization of R&D expenses effective in our new fiscal year. Before we begin the Q&A, I'd like to summarize our company's position in the current environment.\n\nWe have record backlog, notably in the highly enabling technologies for next-generation nodes. Our supply chain and manufacturing output are incrementally improving. We expect our services business will continue to grow and generate strong recurring revenue and free cash flow. And the longer-term growth outlook for the semiconductor industry remains strong.\n\nApplied is in a great position to invest in future growth and deliver strong profitability, free cash flow, and shareholder returns. Now, Mike, please begin the Q&A.\n\nMike Sullivan -- Corporate Vice President\n\nThanks, Brice. To help us reach as many people as we can, please ask just one question on today's call. If you have another question, please requeue, and we'll do our best to come back to you later in the session. Operator, let's please begin.\n\nOperator\n\nThank you. [Operator instructions] And our first question comes from the line of C.J. Muse with Evercore ISI.\n\nC. J. Muse -- Evercore ISI -- Analyst\n\nYeah. Good afternoon. Thank you for taking the question. I was hoping to clarify one thing first on China.\n\nAnd really, the question is what changed between October 12 with your press release and then October 30, where it looks like there really wasn't much of an impact at all? And then my, I guess, real question is, as you think about calendar '23 WFE, it sounds like companies are providing kind of a top-down view that things for WFE are -- look weak and declining. However, every company, bottoms up, based on deferred revenues and backlogs, are much more optimistic on the outlook. So, can you kind of talk through the moving parts there? And what kind of range or outcome you see today for year-over-year silicon declines in calendar '23? Thanks so much.\n\nBrice Hill -- Chief Financial Officer\n\nSure. Hi, C.J., it's Brice. I'll start on this one. So relative to the preannouncement that we did, we talked about a $400 million impact, plus or minus $150 million, for the China trade change.\n\nAnd then as we work through it, that impact ended up being less, around $280 million. And it's just estimating the transactional elements at the end of the quarter. It was an initial element estimate, so we did a little bit better from that perspective. The other thing that really happened was execution in the end of the quarter was almost flawless from a logistics perspective.\n\nWe got more supply chain parts in at the end of the quarter. And so, over $200 million of good news from an execution and delivery perspective, finishing product, and completions in the field. So, it was really those two things. It was little bit better than our initial estimate, and execution was excellent in the last couple of weeks of the quarter.\n\nAnd then on '23, the WFE question for '23, we think that it's preliminary. It's too early to give an estimate of '23. So, what we're trying to share is what we're seeing in our order patterns and in our business for Q1 and Q2. We talked about, in the script, how in Q1 -- or in our bookings for Q4, they were really solid.\n\nWe did see pushouts. We did see weakness in the memory business, but our backlog has grown to a record level of backlog. So, when we think about our Q1 and Q2, we're still supply constrained. We still have a number of different equipment lines that we have significant backlog.\n\nWe're trying to catch up to customer orders. And so, the signals to us really are that we have to work on supply chain, work on improving our output, and work on catching up with our customers. So, beyond that, we're just not able to make a call yet on WFE for '23.\n\nGary Dickerson -- President and Chief Executive Officer\n\nYeah. C.J., this is Gary. As Brice said, the -- we can certainly give a perspective on our business. We're not going to guide on overall WFE for '23.\n\nBut we're in a very strong position. If you look at the kind of profile of the business, it's more weighted toward foundry-logic versus memory. And we have some very strong products where we have significant backlog, and we're still working to close the supply demand gaps in those areas. So, from Applied's standpoint, as you know, it's all about the race for power and performance for all of our customers, and we're really well-positioned with leading products and those big inflections.\n\nAnd again, our No. 1 focus is on closing the supply chain gaps.\n\nC. J. Muse -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from the line of Stacy Rasgon with Bernstein.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nHi, guys. Thanks for taking my questions. I wanted to ask you about the mitigated versus unmitigated impact from China. So, you gave the numbers, $2.5 billion, and hoping to bring that down to like $1.5 billion.\n\nBut I gathered a big element of that was getting licenses. Where do you expect those licenses to be gotten? Is that only to the multinational? Do you guys expect licenses to be given to some of the Chinese folks? I mean, how could that happen? What is the mechanism by which you come in at the unmitigated number versus the -- coming to the mitigated number versus the unmitigated number?\n\nBrice Hill -- Chief Financial Officer\n\nHi, Stacy, it's Brice. Yeah, and it's important probably to say that this unmitigated versus mitigated, it has everything to do with the impact to the China shipments and Chinese customers. In other words, it's not referring to whether we can ship a product we are making for those customers to non-China customers. So, the unmitigated, the way we calculated this is we looked at the orders that we have for the affected customers, and that's what you see as the total, $2.5 billion.\n\nIn order to mitigate that --\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nDoes that include multinationals, too? \n\nBrice Hill -- Chief Financial Officer\n\nSay again?\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nI'm sorry. Does that include multinationals, too? Or is that just the local Chinese guys [Inaudible]?\n\nBrice Hill -- Chief Financial Officer\n\nIt does not. It does not.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\n[Inaudible]\n\nBrice Hill -- Chief Financial Officer\n\nYeah. And so, the way we looked at that, there are some customers that we're trying to clarify that we can apply for licenses for or we can get authorizations for once they establish that their technology is within the guidelines. So, we have a process to do that. And on the other side, we expect some customers may decide to change their plan or change their technology, so it does not go above the threshold that's affected by the rules at this point.\n\nSo, it's really those two elements that we'll be able to clarify that some customers were able to ship with or ship to, or some customers changing their plans on the technology side that would allow them to qualify for shipments. \n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nSo, what would that mean though? Would that suck up like supply that would have ordinarily gotten built by somebody else though? Because otherwise, you're just adding like lagging-edge supply into a vacuum, essentially. How do we think about like the second-order effects here?\n\nBrice Hill -- Chief Financial Officer\n\nYeah. We don't think so. We expect all that equipment to be utilized. And so, if that equipment has moved to a different use, then we expect it will be backfilled somewhere else for its original demand purpose if that makes sense.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nGot it. And I guess just one last one. Right now, I guess, you're running at the unmitigated level. When do you think it will be at a mitigated level? Like, how likely do you think it will be that you end up at the mitigated level at some point?\n\nBrice Hill -- Chief Financial Officer\n\nIt's hard to say. It's a process. You can imagine there's a large number of people working on this. In fact, the whole industry is working on this.\n\nSo, it's job two at this point behind increasing output. So, I would say it's still a good estimate today, and we're -- we'll be working throughout the year on improving the number of customers and plants that we can ship to.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nGot it. OK. Thank you, guys.\n\nBrice Hill -- Chief Financial Officer\n\nYup.\n\nOperator\n\nThank you. And our next question comes from the line of Vivek Arya with Bank of America.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my question. I just wanted to clarify. I thought, Brice, you said somewhere that you provided some look for Q2. I don't think I caught that.\n\nAnd then several of your memory customers that said that their spending could be down over 50% next year. Recently, Micron said it could be down even more than that. Have you noticed almost 50% cancellation of orders from them? Because I'm just trying to reconcile your commentary that sounds outside of China, of course, more benign and more supportive versus just the very horrific guidance that your memory customers are providing. I understand you're less exposed to memory versus foundry-logic, but still, it's a reasonable size exposure.\n\nI'm curious, has that 50% cut in capex translated to any reduction in your backlog or any change in your thinking about memory for next year?\n\nBrice Hill -- Chief Financial Officer\n\nOK. Thanks, Vivek. So, we're not giving a guide for Q2. We are highlighting the record backlog and the fact that we're constrained and the fact that in several equipment lines, we're behind on customer orders.\n\nSo, we're going to try to increase output. And I'd say that comment is true for both Q1 and Q2. So that's as much shaping as we're providing for Q2. On the memory side, just to kind of click back and think about the overall demand environment, we positioned last quarter that we had a significant amount more demand than we have the ability to supply for '23.\n\nWhat did happen during the course of this quarter is there is a significant amount of pushouts and reductions in that demand. Now you can see the end result. We still had solid bookings in Q4. We still -- we created a record backlog that's now disclosed.\n\nSo, I would say that some of those pushouts and some of those reductions were definitely in the memory space. And I wouldn't -- I'm not going to characterize what percentage it was, but I would say that that's the most affected area in the business in terms of pushouts and reductions for '23.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nSo, you are seeing a 50% type reduction? I'm just trying to align what we are hearing from those customers versus what you are seeing on the ground in your business.\n\nBrice Hill -- Chief Financial Officer\n\nYeah. Sorry, I can't quantify exactly what it is. I'll just say that that is what -- it's biased, the reductions were biased in that area.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Your next question comes from the line of Krish Sankar with Cowen.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nYeah, hi. Thanks for taking my question. Brice or Gary, I just wanted to find out, you mentioned how lagging edge is still pretty strong, especially auto analog in China. And I wonder like do you ever think that auto analog could be the next thing to drop.\n\nBut in other words, if memory is going to be down next year, but lagging edge holds up, what is the risk that lagging edge rolls over in 2024 and you have two years of lackluster WFE? Thank you.\n\nBrice Hill -- Chief Financial Officer\n\nOK. I'll start, maybe Gary wants to say something. We don't have a specific guide for what we call ICAPS, our mature node businesses. What we would say is there was significant growth in 2022.\n\nAnd when we think about all the end markets, we think the end markets are mixed. We know some of the consumer markets and even industrial have seen some weakening. But on the positive side, automotive and the power market that feeds EV and solar and other areas has been really strong. So, for us, this is a critical market.\n\nWe're continuing to invest and continuing to focus in this area, and we would just highlight to investors that the growth has been very strong.\n\nGary Dickerson -- President and Chief Executive Officer\n\nYeah. Krish, the other thing I would add is that we're -- we've made a change in our organization more than three years ago, forming our ICAPS group. And we have just very, very deep engagements with our customers, both on a technical and a support side of our business. And we have the broadest set of innovative products for ICAPS.\n\nIf I look at where we're at today, those are some of the areas that -- where we have a significant backlog. MDP and implant in FY '23 are very, very strong for us. Those are areas where we have significant demand from customers. And ICAPS is similar in that to the -- all of the rest of our business.\n\nThis is always a race for all of these customers relative to power, performance, and cost. And ICAPS is really materials enabled. We have a really strong team there. We have a great pipeline of products.\n\nI will guarantee you every year will not be up. That's for sure. We're not going to guide '24, but we are in a very good position in ICAPS relative to enabling technology for future inflections.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nThanks a lot, Gary. Thanks, Brice.\n\nBrice Hill -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from the line of Mark Lipacis with Jefferies.\n\nMark Lipacis -- Jefferies -- Analyst\n\nHi. Thanks for taking my question. Gary, maybe for you. It seems like the consensus for WFE this year is somewhere in the $65 billion to $75 billion range.\n\nAnd I'm not asking you to give a guidance or an outlook for next year. But I'm wondering in the scenario where that is proven to be too cautious of an outlook for next year. Based on the conversations that you have with your customers, would you say that that would be because lead times are long and customers just -- they don't want to cancel orders or there's new secular drivers, like bigger chips or advanced packaging or trailing node, like some of the things you've talked about or just competition at the leading edge is driving people to invest more, enabled by subsidies? What are your customers suggesting to you or what -- I mean, your backlog grew even as memory came down, like what do you think are the biggest drivers into next year, regardless of whatever the end number is? And what could surprise on the upside? Thank you. \n\nGary Dickerson -- President and Chief Executive Officer\n\nYeah, Mark, thanks for the question. So, all of our customers in any of these different markets, the technology is moving very, very quickly. So, they're all racing against each other for power, performance, cost, their relative competitive position. So, certainly, as you mentioned in the leading edge, foundry-logic, there's a tremendous amount of focus there, high-performance computing, and a number of those different markets.\n\nAnd again, for Applied, what we've talked about is real strength in enabling new structures that are critical to competitive positions for our customers. Gate-all-around is an incremental $1 billion for Applied for 100,000 wafer starts, more than what we're currently capturing with FinFET. We're on path to gain 5 points of share in the transition from FinFET to gate-all-around. Wiring is probably the No.\n\n1 focus, and I don't know that everyone really understands how important that inflection is for our customers. That's an area where we have tremendous strength. We're enabling a 50% reduction in wiring resistance with integrated platforms that combine many technologies together. So, that's another one where Applied is really well-positioned.\n\nPackaging has grown for Applied to nearly $1 billion, and we have over 50% share in the broad -- in our served market. And we have, by far, the broadest position in advanced packaging, and we're still in the early innings of that inflection. But again, that's all part of this technology race for all of our customers. ICAPS, I mentioned that earlier on the call.\n\nThose are also markets where I think it's surprising to people, including -- you've seen some of our peers talking about ICAPS growth over a longer period of time, there are technology inflections there. And that's, as I mentioned earlier, metal deposition implant. Those are areas where we're very, very -- in very strong enabling positions with our customers. I think -- the other thing for Applied, beyond all of these different areas, high-speed DRAM with logic-like structures, all of those big inflections, our PDC business grew, I think, it was 67% in FY '21.\n\nWe're up around 35% in FY '22. That business is also outperforming and we think that will continue to outperform as we go forward. So. at least -- from an Applied standpoint, it's really all around those big inflections and how we're positioned for those major inflections.\n\nSo, I don't know if -- Brice, if you want to add anything?\n\nBrice Hill -- Chief Financial Officer\n\nNo. I would just comment that the -- we highlighted that we still have to catch up to customer demand in several areas. So, that adds some momentum into '23. And then the other piece is just -- it seems clear that productivity -- to drive productivity in the world, a lot of these things, like in the energy market, data center market, etc., still have resilient demand.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nThank you. Very helpful.\n\nOperator\n\nThank you. And our next question comes from the line of Atif Malik with Citi.\n\nAtif Malik -- Citi -- Analyst\n\nHi. Thank you for taking my question. Gary, I have a question on long-term impact of China restrictions to both domestic and multinational spend. If I look at China spending over the last five years, it has outgrown WFE by three to four times.\n\nWhat replaces this in terms of pending capital intensity and above-average profitability for you?\n\nBrice Hill -- Chief Financial Officer\n\nYeah. Hi, Atif, I'll start. This is Brice. I think on the China side, when we look at that impact, the larger part of the business has been on the trailing nodes for us, and we expect that to still be a very strong business for Applied.\n\nAnd we see that in both the factory projects that we monitor and also in the different end markets where there's investments. And then on the leading edge, if it's a question of do we expect that demand to be taken away from WFE demand globally and permanently? We don't. It will either be satisfied in some way in China, either by multinationals or in some other way, or it will move to another geography. So, we don't believe that that will be an impact.\n\nAnd just circling back around, I would just focus on over time, we expect the China market to be a strong grower, especially in the ICAPS mature node space.\n\nAtif Malik -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from the line of Toshi Hari with Goldman Sachs.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nHi. Thank you so much for taking the question. I wanted to ask about the AGS business going into next fiscal year and calendar year. Obviously, it's been a very steady grower for you guys and for the overall industry.\n\nMany of your leading-edge memory customers and logic and foundry customers, I believe, are in the process of [Inaudible] wafer starts, potentially over the next couple of quarters. So, I guess the question is, when you cite services as one of the reasons why you'll outperform into next year, is the baseline assumption that business continues to grow given the installed base growth and given how you transform the mix of that business? Or could it be down, but it's down less? Thank you.\n\nBrice Hill -- Chief Financial Officer\n\nOK. Thanks, Toshi. Thank you. Yeah.\n\nA couple of drivers here. You'll see in our outlook for Q1 that we have a down quarter for AGS, which is unusual. And the reason is we've got a full quarter impact, approximately $100 million for the reduction of the China customers that we won't be able to serve for the rest of the year. So that's definitely a headwind in Q1.\n\nBut you hit the nail on the head with respect to the dynamics thereafter. Every time we ship a tool, it grows our installed base of equipment. We grew the installed base 8% last year. Beyond -- or after that, our ability to provide services and put those services on subscription agreements, we typically outgrow the installed base than we did last year.\n\nSo that is the driver for the reason the services business is sticky. We have more equipment to serve. The equipment becomes more intensive in terms of service needs. And over time, that grows the business.\n\nNow to your point, a portion of the business is transactional. We do see lower utilization this quarter and next quarter. What we would point to -- what we have pointed to is, even in '19, where there was lower utilization, we still grew the services business. And besides the headwind of China that I pointed out, we expect that to be the dynamic this year and going forward.\n\nGary Dickerson -- President and Chief Executive Officer\n\nToshiya, this is Gary. I'll add a little bit more color. So, we do expect services to be up in '23. The -- as Brice mentioned, transactional will be down based on capacity utilization.\n\nBut our profile, with a significant amount of our service and spares business being agreements, gives us stickiness going forward. And that is continuing to increase, the comprehensive agreements up 16% last year. The tenure of our agreements, the length of the agreements are up to 2.6 years, renewal rates at 93%. So, we're -- and it was an interesting thing through the -- all of the chip shortage period of time.\n\nWe were able to demonstrate value for customers with ramp services to accelerate chip output, managed part services so that people could increase tool availability and output, managed services for yield and optimizing productivity. So, all of that helped us position our service business in a higher value for our customers. And again, that's what gives us the ability to continue to grow into '23. And then the longer-term model we've communicated is double-digit growth, and we still have high confidence we'll achieve that.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nThank you so much. \n\nOperator\n\nThank you. And our next question comes from the line of Harlan Sur with J.P. Morgan.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nHi, and good afternoon. Thanks for taking my question. Yeah. Another follow-up on AGS.\n\nSo, looking back on fiscal '22, your semi systems operating margin declined about 200 basis points on strong revenue growth, obviously due to the inflationary cost pressures. But your AGS business sustained near-record operating margins at 30%. So, I guess how has the team been able to sustain the record or near-record AGS operating profitability in this inflationary environment? And more importantly, in a down year or potential down year next year, you guys talked last call, this call, on sustainability of AGS from a revenue perspective. How should we think about the sustainability of operating margins for AGS?\n\nBrice Hill -- Chief Financial Officer\n\nYeah. Harlan, it's -- thank you. So, one thing I would call out is we did have lower gross margins and operating margins in Q4, and that's largely due to looking at the specific inventory we had for China customers that will have to either reposition or move somewhere else or scrap. But to your point on operating profit, one of the plans the business has there is to improve the amount of repair that we do for products that we bring back to customers.\n\nAnd so that helps us lower the cost and cost of goods sold with customers. And that's one of the ways that we improve our gross margins and the ultimate profit of that business. And the other is just increased efficiency. As we demonstrate more and more capability with the customers, and we provide more services with the same spending profile, then that helps us maintain the profitability.\n\nThose are the two key drivers.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from the line of Joe Quatrochi with Wells Fargo.\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nYeah. Thanks for taking the question. I wanted to ask about the gross margin impact from the China restriction. Can you talk about what's driving that 1 percentage point impact? And then how do we think about what you could potentially recapture in the mitigated scenario that you outlined?\n\nBrice Hill -- Chief Financial Officer\n\nYes. Thank you. So, two things. And it depends on which time period you look at.\n\nBut if we look forward, the gross margin impact is really that they're generally smaller customers. So, the profitability of those customers for Applied is higher. And when we talk about mitigation, as we go forward, it's going to be TBD as to who we sell that product to and what the profitability is. So, at this point, we're expecting the impact that we described.\n\nAnd if you look at the current quarter, we did have specific inventory for customers that's unique. We are working to qualify some of that inventory, and we were successful to a degree, but we did have specific inventory that we had to take a demand reserve on.\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nGot it. Thank you.\n\nBrice Hill -- Chief Financial Officer\n\nYup.\n\nOperator\n\nThank you. And our next question comes from the line of Timothy Arcuri with UBS Securities.\n\nTimothy Arcuri -- UBS -- Analyst\n\nThanks a lot. Gary, I had a question about WFE intensity. So, we're exiting this year at 15.5%, and you were saying that through 2030, you think WFE is going to grow faster than semiconductors. You've certainly been beating that drum now for a while that WFE intensity is going to keep going up.\n\nAnd obviously, there are some underlying upward pressures. But China has obviously been ordering tools and building capacity well ahead of demand now, in part, due to the fear of these bans. So, if China becomes a little more of a lagging-tier region, wouldn't that lower WFE intensity a bit and maybe argue that maybe it has to reset a bit? Thanks, Gary.\n\nBrice Hill -- Chief Financial Officer\n\nYeah, Tim, I'll jump in for a second here just because I have the picture of the graph in my mind that we use. So, we do think intensity is gradually increasing, and it's because of the reasons Gary described. A lot of steps in the process are becoming more complex and require more equipment, and we see that. And then when we think about China and ICAPS specifically, in the past, there's been a lot of reuse of existing fabs and existing process tools.\n\nAnd that allowed for a low intensity. And that's not been what's happening in the past few years and with recent additions. We've talked about the number of factory projects that we see. So, as capacity gets added, even in the ICAPS space, what you see is an intensity level that's more like what we were experiencing on the leading edge just a few years ago.\n\nAnd that's also serving to raise the overall average of intensity. So, we're pretty confident that intensity will continue to rise.\n\nGary Dickerson -- President and Chief Executive Officer\n\nTim, on the -- relative to ICAPS, just reminding people that there was a time period where you had a lot of movement of business to foundries. And during that time period, there were many factories and tools that came on the market, all of that stuff is gone. So, that's what Brice was referring to relative to ICAPS capital intensities. And then if you look at all of the -- I went through a list of key inflections -- technology inflections for customers, and I gave some color around wiring and the number of steps that are increasing.\n\nThat's what we're seeing really in all of the different segments of the business. So, I think that capital intensity is probably the right ZIP code if we look through 2030.\n\nTimothy Arcuri -- UBS -- Analyst\n\nThanks, Gary and Brice.\n\nOperator\n\nThank you. And our next question comes from the line of Joseph Moore with Morgan Stanley.\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. I wonder if you could talk about the environment in China with the multinationals. Obviously, they need to get a license, they did immediately get a license, but it's a 12-month license.\n\nSo, would you say that you generally see the footprint moving away from China with those multinational customers? Do you see any potential for that to become an issue down the road? Can you just talk generally to the fact that the multinationals were included in this?\n\nGary Dickerson -- President and Chief Executive Officer\n\nYeah, Joe, this is Gary. Thanks for the question. The multinationals are not impacted today. Relative to their strategies, we'd really rather have them comment on that.\n\nSo again, just today, they're not impacted. How they position their businesses geographically, that's really up to them.\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Sidney Ho with Deutsche Bank.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nThanks for taking my question. I want to follow up on the earlier question on the longer-term WFE. As you think about the growth of WFE in the next, call it, three to five years, how do you think about the mix between the different type of tools, how that could change? Meaning, deposition and edge versus litho versus process control, as you talk to your customers about the road map and technology inflections. And I also want to ask about -- I assume your served addressable market will continue to expand, but maybe help us understand how much would that grow.\n\nThanks.\n\nGary Dickerson -- President and Chief Executive Officer\n\nYeah. Sidney, thanks for the question. So, if you look at what our customers are talking about relative to their road maps, really, there are five big drivers of the technologies going forward, workload-specific architectures. There are new structures, new materials, new ways to shrink, new advanced packaging inflections for our customers.\n\nAnd so, what we see, if you look at the advanced foundry-logic road map, you see a tremendous focus on new structures and new materials. The transistor innovations around gate-all-around are essential relative to power and performance. Wiring, I talked a lot about wiring. Our largest business is metal deposition and the wires are getting thinner and resistance goes up.\n\nSo, you're seeing more dollars moving in that direction. Advanced packaging is an area where we see -- for sure, that's another big -- one of the big five drivers for the road maps for our customers. And that's still in the early innings around $1 billion business for us today, over 50% served market for the areas we participate. And so, we see that one.\n\nThat's an area that will attract a tremendous amount of investment. And relative to competition between customers is very, very important. In memory, you certainly see material scaling in 3D NAND as customers are moving to more layers or other ways to include logic and memory together through different technology inflections. DRAM is moving to high speed.\n\nAnd so, you have high-K metal gate and logic-like structures there. So, a lot of that investment is moving more toward materials-enabled technologies, and that's where Applied has really a tremendous strength. I don't know, Brice, if you want to add anything there?\n\nBrice Hill -- Chief Financial Officer\n\nNo. Good. Thanks.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nThank you. And our next question comes from the line of Quinn Bolton with Needham and Company.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nThanks for taking my question. Just had a question with the CHIPS Act applications expected to be received or submitted beginning sort of the February time frame. I'm wondering as you look at your '23 WFE outlook, do you expect to see any benefits from CHIPS Act spending in '23? Or do you think it's really more of a '24 and beyond before it hits WFE spending? Thanks.\n\nBrice Hill -- Chief Financial Officer\n\nWe do expect, Quinn, a small -- really small amount in '23. On the equipment side, it will likely really start in '24 as a number of those projects are -- start with construction. There are a few that will start with equipment, but it will really, for us be more the '24 time frame.\n\nGary Dickerson -- President and Chief Executive Officer\n\nQuinn, one thing I'd add is that those investments are time bound. And so, as Brice said, not so much in '23, starting in but there are -- there is timing associated with those incentives.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nGot it. Thank you.\n\nMike Sullivan -- Corporate Vice President\n\nThanks, Quinn. And, operator, we have time for two more questions today.\n\nOperator\n\nCertainly. And our next question comes from the line of Pierre Ferragu with New Street.\n\nPierre Ferragu -- New Street Research -- Analyst\n\nThank you for taking my question. Gary, I'd like to come back to the comments you made about capital intensity and the specifics that the trailing edge part of your portfolio. And so, you described there, I think, like three reasons why capital intensity -- I mean, two reasons why capital intensity is very high there. I mean, higher than the past.\n\nThe first one is that there is no innovation going on. So, like, that drives capital intensity up. And then you mentioned the fact that there used to be like a secondhand market that was feeling the trailing edge that is kind of going away. And my question is there must be also a third element that justifies a very high capital intensity today, which is that we've been growing capacity very, very fast this year and last year.\n\nAnd there is a significant chance that the capacity growth is at some point going to slow down or even to pause. And so, I'd like to hear your thoughts about that and maybe a sense of how much it could impact in the shorter-term capital intensity.\n\nGary Dickerson -- President and Chief Executive Officer\n\nHi, Pierre, this is Gary. Thanks for the question. So, I will say that we're 100% certain that all of these markets will not be up every year. But what we do see, if you think about, pick a number, in terms of edge computing devices by 2030, these technologies are becoming much, much more pervasive.\n\nThey're really -- if you think about industrial automation or gas to smart electric vehicles, a number of different inflections, a lot of these ICAPS technologies are going to grow at a fair compound annual growth rate. I think that's what other people are seeing also. So how that -- what the shape of that looks like every single year, we're not going to forecast that. But we do think that that business is going to see healthy growth.\n\nAnd that's why also, we formed the ICAPS organization three years ago. We saw that, that market was going to be significant from a growth perspective and pulled together all of our different technologies. So, again, if I look across all of those segments within ICAPS, we think over the longer term, there will be significant compound annual growth rates. We have very, very strong positions in enabling some of those technology inflections in ICAP, but we're not going to give a specific profile on a year-by-year basis.\n\nPierre Ferragu -- New Street Research -- Analyst\n\nThanks, Gary.\n\nOperator\n\nThank you. And our final question comes from the line of David O'Connor with Exane BNP.\n\nDavid O'Connor -- Exane BNP Paribas -- Analyst\n\nGreat. Good afternoon. Thanks for taking the question. A follow-up on the backlog to a previous question.\n\nGary or Brice, how should we think about the time frame of getting the backlog back to a kind of more normalized level or -- when do you expect to get caught up on demand for those products that are running pretty hot on the PPACt side? Thank you.\n\nBrice Hill -- Chief Financial Officer\n\nYeah. Thanks, David. We're expecting it's going to take us more than two quarters. So, depending on the line of equipment, I would say between two and four quarters is our internal estimate.\n\nAnd so, that's what we're focused on. We are behind with the customers, and we're working on increasing output every week. Thanks for the question.\n\nDavid O'Connor -- Exane BNP Paribas -- Analyst\n\nThank you.\n\nMike Sullivan -- Corporate Vice President\n\nYeah. Thanks, David, for your question. And Brice, would you like to give us your closing thoughts today?\n\nBrice Hill -- Chief Financial Officer\n\nYeah, absolutely. Clearly, there are questions about the market in the near term. But for our part, we had healthy Q4 orders, and we have record backlog that we described, and it's mostly in our leadership product areas that drive the big technology inflections. Job one for us is increasing our output to meet customer demand.\n\nWe're in a strong financial position to continue to develop our broad portfolio of technology and to drive the critical inflections and to support, eventually, a $1 trillion semiconductor market. I hope we get to see many of you at the upcoming Credit Suisse and Wells Fargo conferences. In the meantime, we hope you enjoy a safe and happy Thanksgiving. Thank you.\n\nMike, let's close it up.\n\nMike Sullivan -- Corporate Vice President\n\nOK. Great, Brice. So, we'd like to thank everybody for joining us today. A replay of the call is going to be available on our website by 5:00 Pacific Time, and we would like to thank you for your continued interest in Applied Materials.\n\nDuration: 0 minutes\n\nMike Sullivan -- Corporate Vice President\n\nGary Dickerson -- President and Chief Executive Officer\n\nBrice Hill -- Chief Financial Officer\n\nC. J. Muse -- Evercore ISI -- Analyst\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nMark Lipacis -- Jefferies -- Analyst\n\nAtif Malik -- Citi -- Analyst\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nTimothy Arcuri -- UBS -- Analyst\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nPierre Ferragu -- New Street Research -- Analyst\n\nDavid O'Connor -- Exane BNP Paribas -- Analyst\n\nMore AMAT analysis\n\nAll earnings call transcripts"
}