{
  "companyName": "KB Home",
  "companyTicker": "KBH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/22/kb-home-kbh-q2-2022-earnings-call-transcript/",
  "content": "KB Home (KBH -0.56%)\nQ2 2022 Earnings Call\nSep 21, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Alex, and I will be your conference operator today. I would like to welcome everyone to the KB Home 2022 third quarter earnings conference call. At this time, all participants are in a listen-only mode.\n\nFollowing the company's opening remarks, we will open the line for questions. Today's conference call is being recorded and will be available for replay at the company's website, kbhome.com, through October 21. Now, I would like to turn the call over to Jill Peters, senior vice president, investor relations. Jill, you may begin.\n\nJill Peters -- Senior Vice President of Investor Relations\n\nThank you, Alex. Good afternoon, everyone, and thank you for joining us today to review our results for the third quarter of fiscal 2022. On the call are Jeff Mezger, chairman, president, and chief executive officer; Rob McGibney, executive vice president and chief operating officer; Jeff Kaminski, executive vice president and chief financial officer; Bill Hollinger, senior vice president and chief accounting officer; and Thad Johnson, senior vice president and treasurer. During this call, items will be discussed that are considered forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nThese statements are not guarantees of future results, and the company does not undertake any obligation to update them. Due to various factors, including those detailed in today's press release and in our filings with the Securities and Exchange Commission, actual results could be materially different from those stated or implied in the forward-looking statements. In addition, a reconciliation of the non-GAAP measures referenced during today's discussion to their most directly comparable GAAP measures can be found in today's press release and/or on the investor relations page of our website at kbhome.com. And with that, here is Jeff Mezger.\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nThank you, Jill, and good afternoon, everyone. We delivered another quarter of strong financial results with meaningful year-over-year growth in most of our key metrics, highlighted by more than 600 basis points of expansion in our homebuilding operating income margin to approximately 18%. These results reflect the strength of our company, our larger scale and the size and composition of our backlog. At the end of our third quarter, our backlog stood at over 10,700 homes valued at more than $5.2 billion, placing us in a good position with respect to deliveries in our 2022 fourth quarter and into the first half of 2023.\n\nApproximately two-thirds of our buyers are either locked on their mortgage rate or paying in cash. And for the most part, these buyers are closing when their homes are completed. Our buyers tend to have an emotional attachment to their purchases that stems from creating their personalized homes on a lot they have selected with features and finishes they have chosen. As to the details of the quarter, we produced total revenues of $1.84 billion, up 26% as compared to the prior-year period, and diluted earnings per share of $2.86, which grew almost 80% year over year.\n\nWhile we achieved the low end of our revenue guidance, we experienced an extension in build times due to ongoing supply chain issues, which affected deliveries in the quarter. Rob will provide more detail on cycle times and the supply chain shortly. Our gross margin of 27% is a particular highlight of the quarter, demonstrating the impact of our internal initiatives, along with our effective management of pace, price, and starts to optimize each asset during the robust demand environment earlier in our fiscal year. In addition, we successfully managed costs, driving our SG&A expense ratio down 100 basis points year over year.\n\nWe remain committed to balancing our overhead with our revenues as we continue to open additional new communities. The factor supporting demand for homeownership remains strong, including favorable demographics, population and job growth in our served markets and rising rental rates, coupled with a limited supply of homes due to the industry's underproduction of new homes and low levels of existing home inventory, particularly at the more affordable price points. Although the long-term outlook remains positive, many prospective buyers have paused and moved to the sidelines amid higher mortgage rates, along with ongoing inflation and a range of macroeconomic and geopolitical concerns. As we manage through these uncertain times, we remain committed to our build-to-order approach.\n\nOur focus is to provide the best value to customers based on their budget and the features that are most important to them and that's to offer the best incentive on a standing inventory home. Homebuyers are making the largest investment of their lifetime, and many desire a personalized home with the ability to select their lot, floor plan, included or upgraded interior finishes, and exterior elevation. This flexibility is also important to our customers if affordability is a constraint as our buyers can select a smaller square footage home at a lower price with the same number of rooms and functionality and also reduce their spend in our studios. We believe our approach is compelling and can make the difference in whether a customer is able to purchase a home.\n\nBy upsizing choice and personalization, as well as the partnership our community teams offer, we provide an important service to our buyers. We think this is a key driver in our consistent achievement of the highest customer satisfaction rating among production homebuilders. Net orders of 2,040 were down relative to a strong 4,085 in the year-ago third quarter. Let me discuss the components of our net orders by first providing some color on our gross orders with a separate discussion of cancellations.\n\nAt the start of the third quarter, given the size of our backlog and with only 69 finished homes available for sale, we made the decision not to chase sales. The quarter unfolded with June's average weekly gross orders coming in softer than May's. July's gross orders held consistent with June's, and we then experienced an acceleration in gross orders in August. We had taken steps in July with respect to pricing in some underperforming communities, while at the same time, mortgage rates had declined slightly since June.\n\nWe were pleased with the activity in August. But following Labor Day, interest rates have again risen, and we've experienced a softening orders trend. We will continue to monitor market dynamics and individual community performance and we'll adjust pricing as necessary to maintain the balance between preserving our backlog and achieving minimum absorption rates to optimize each asset. Over the years and throughout cycles, we have typically generated one of the highest sales rates per community in the industry, and that remains our objective going forward.\n\nWith respect to cancellations, due to the unusually low level of gross orders and large beginning backlog of 12,300 homes, we believe looking at cancellations relative to backlog is a better way to understand the dynamics during the quarter. At 9%, our cancellation rate on beginning backlog did increase sequentially, but it was still well below historical levels. The No. 1 reason for cancellations was buyer's remorse.\n\nIt was not necessarily that the buyers did not qualify, they did not feel comfortable moving ahead with the purchase. We ended the quarter with only 12% of our homes in production unsold, consistent with our second quarter level and with less than one finished and unsold home per community. We expanded our community count in the third quarter due to fewer communities selling out partially offset by some deferred openings. In this market environment, we are not opening communities for sale until models are 100% completed to optimize the selling effort, which contrasts with the past 12 months, during which we opened for presales while models were still being constructed.\n\nWe expect another sequential increase in our ending count in the fourth quarter and year-over-year growth in 2023. This will be an important contributor to our future net orders, given the moderation in absorption rates. The credit profile of buyers that use our mortgage joint venture, KBHS Home Loans, remain strong and consistent sequentially. For loans funded during the third quarter, 67% of these customers qualified for a conventional mortgage and nearly all used fixed-rate products.\n\nThe average loan-to-value ratio was 84%, translating to a cash down payment of over $80,000. The average household income of these buyers was $130,000, and their FICO score was 734. While we target the median household income in our submarkets, we are attracting buyers above that income level with healthy credit that are able to qualify a higher mortgage interest rates. With that, let me pause for a moment and ask Rob to provide an operational update.\n\nRob?\n\nRob McGibney -- Executive Vice President and Chief Operating Officer\n\nThank you, Jeff. We continue to face difficulties in completing and delivering homes in the third quarter. And as a result, we were short about 160 deliveries or 4% relative to the midpoint of the guidance that we provided in June. While we had seen build times improve modestly in May, which we shared with you on our last earnings call, they extended significantly from that point, illustrating the larger industrywide challenge in finding a consistent footing in build times.\n\nDuring the third quarter, build times for our homes under construction expanded by 11 days from the framing stage to completion. This drove the delivery miss in the quarter and is also having an impact on our fourth quarter delivery projection, which we have reduced. There were several factors that contributed to this extension. Building material shortages continued to delay the completion of homes.\n\nWe are seeing improvement in the availability of some products such as appliances, garage doors, insulation, and HVAC flex duct, while other areas are still challenging, including electrical materials, cabinets, HVAC equipment, and flooring products. As to trade labor, the dynamics are mixed with availability on the front end of the construction cycle improving although continuing to be more difficult in the back end. The home building industry has been dealing with power infrastructure issues for quite some time, and this has intensified. We have completed homes that we could not deliver in the third quarter because our utility providers could not get transformers and electric meters.\n\nAnd many of our divisions that build attached product experienced delays in obtaining switchgear and wire. In Houston, there were 77 homes across three communities that were completed and scheduled to close in the third quarter but were postponed due to the lack of transformers. In addition, we continue to experience delays with city inspections in most of our markets due to municipal staffing shortages and elevated production levels in the back end of construction. We are factoring the longer municipal lead times, ongoing supply chain issues and labor shortages we experienced in the third quarter into our future delivery projections.\n\nOur teams are working relentlessly through the challenges and finding ways to progress homes through the construction cycle. We are focused on what we can control, and we are optimistic that will start slowing in most of our markets and our greater scale, we can transition back to our historical build times, although this will take time to achieve. The lower level of starts is also providing us with an opportunity to reduce our cost to build as we renegotiate them where possible. And with that, I will turn the call back over to Jeff.\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nThanks, Rob. Last quarter, we shared with you our expectation of reducing our land investments in light of current market conditions, and then redeploying this cash to our stockholders. In the third quarter, we did just that with a year-over-year reduction in land acquisition and development spend of almost 30%. With near-term visibility limited as to the direction of the economy and its impact on homebuyers, we expect to continue at a lower level of land spend for the foreseeable future.\n\nWe have been renegotiating land contracts to reduce prices and extend closing timelines. In certain cases, where we are no longer comfortable that we can achieve our required returns on the investment, we have terminated the contract. In the third quarter, we canceled contracts to purchase nearly 8,800 lots. Our lot position stands at just under 80,000 lots owned or controlled.\n\nOf these, 51,000 are owned and only about 18,300 are finished lots, with 11,000 of these having a house under construction. We are balancing our development phasing with our start pace so as not to build up a large inventory of finished lots, which supports higher inventory turns. Relative to the vintage of our own lots, we contracted approximately 40% of these lots in 2019 or prior and another 40% were tied up during 2020. As a result, the vast majority of our own lots were underwritten before the run-up in average selling prices, which we believe supports our ability to sustain solid gross margins.\n\nThe balanced approach we take toward capital allocation has resulted in $100 million of stock repurchases in the past two quarters, driving a 5% year-over-year reduction in our diluted share count in the third quarter. With strong profitability and healthy cash flow expected in our fourth quarter and ongoing caution in land investments, we expect to be in a position to redeploy additional capital to our stockholders before the end of this year. In closing, I would like to recognize and thank our entire KB Home team for their hard work and ongoing commitment to serving our home buyers. We believe the differentiation we offer in our build-to-order approach, providing a choice and flexibility that creates an emotional connection between buyers and their personalized homes has contributed to our leading absorption rates in the industry over many years.\n\nWe are focused on preserving our backlog and achieving our minimum net order targets as we navigate current market conditions. All of the homes that we need to complete a strong 2022 fiscal year are already in our backlog, although we acknowledge the longer build times and ongoing supply chain disruptions have impacted the timing of some of our deliveries. With about $7 billion in revenues expected for this year, reflecting over 20% year-over-year growth and a gross margin of 25%, we anticipate that we will generate a return on equity of about 26%, representing meaningful returns-focused growth. With that, I'll now turn the call over to Jeff for the financial review.\n\nJeff?\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nThank you, Jeff, and good afternoon, everyone. I will now review highlights of our financial performance for the 2022 third quarter and discuss our current outlook for the fourth quarter. In the third quarter, we produced measurable year-over-year improvements in most of our key financial metrics, including a 26% increase in our housing revenues, a 610-basis-point expansion of our operating margin, and a 79% rise in our diluted earnings per share. We also completed several significant transactions to improve our capital structure and strengthen our balance sheet, which I will detail shortly.\n\nOur housing revenues grew to $1.84 billion compared to $1.46 billion for the prior-year quarter. This improvement reflected a 6% increase in the number of homes delivered and a 19% rise in their overall average selling price. As Rob discussed, our current quarter deliveries were tempered by extended build times in most of our served markets, driven by building material shortages, trade labor challenges, power infrastructure issues, and delayed city inspections. We have moderated our fourth quarter revenue outlook to reflect an anticipated continuation of these industry challenges.\n\nConsidering our quarter-end backlog of $5.3 billion, the status of homes under construction, and expected construction cycle times, we anticipate our fourth quarter housing revenues will be in a range of $1.95 billion to $2.05 billion. Our overall average selling price of homes delivered in the quarter rose to $509,000 from $427,000, average selling prices were higher in each of our four regions, with year-over-year increases ranging from 12% in our West Coast region to 26% in our Central region. For the fourth quarter, we are projecting an overall average selling price of approximately $503,000, which would represent a year-over-year increase of 12%. Our homebuilding operating income improved to $325.1 million as compared to $169.9 million in the year-earlier quarter.\n\nOperating income margin increased 610 basis points to 17.7% due to meaningful improvements in both our gross profit margin and SG&A expense ratio. Excluding inventory-related charges of $8.5 million in the current quarter and $6.7 million in the year-earlier quarter, our operating income margin was up 600 basis points year over year to 18.1%. The current period inventory-related charges were comprised of $5.9 million of abandonment charges associated with our housing operations and a $2.6 million impairment charge relating to a planned future land sale. We expect our fourth quarter homebuilding operating income margin, excluding the impact of any inventory-related charges, will be approximately 16.7% compared to 12.9% in the year-earlier quarter.\n\nOur housing gross profit margin was 26.7%, up 520 basis points from 21.5% for the prior-year quarter. This margin expansion mainly reflected the favorable selling price environment, supported by healthy housing market dynamics when most buyers contracted to purchase these homes. Excluding the $5.9 million of current quarter abandonment charges and $6.7 million of inventory-related charges in the prior-year quarter, our gross margin was up 500 basis points year over year to 27%. Assuming no inventory-related charges, we believe our fourth quarter housing gross profit margin will be in the range of 25% to 26%, which is lower than our prior expectation due mainly to the anticipated impact of selling price adjustments in response to softening housing market conditions and a loss of leverage on lower expected housing revenues.\n\nAt the midpoint, our fourth quarter gross profit expectation represents a 310-basis-point improvement as compared to the prior-year period. Our selling, general and administrative expense ratio of 8.9% improved by 100 basis points as compared to 9.9% from the 2021 third quarter, primarily due to a 70-basis-point decrease in external sales commissions and increased operating leverage from higher revenues in the current quarter. Considering an anticipated increase in revenues and our continuing actions to contain and reduce costs, we believe our fourth quarter SG&A expense ratio will be approximately 8.8%, a 100-basis-point improvement as compared to the year-earlier quarter. Our effective tax rate was approximately 22%, reflecting $70.9 million of income tax expense, net of $15.3 million of federal energy tax credits we earned from building energy-efficient homes.\n\nWe were able to recognize the tax credits largely due to recently enacted legislation. We expect our effective tax rate for the fourth quarter to be approximately 24%, including an expected favorable impact from additional energy tax credits. Overall, we reported net income of $255.3 million or $2.86 per diluted share compared to $150.1 million or $1.60 per diluted share for the prior-year quarter. Turning now to community count.\n\nOur third quarter average of 221 increased 8% from the year-earlier quarter. We ended with 227 communities open for sales, as compared to 210 communities at the end of the 2021 third quarter. On a sequential basis, we were up 13 communities. We expect another sequential increase in the fourth quarter and believe our 2022 year-end community count will be in the range of 235 to 250.\n\nUsing the midpoint, this would represent a 10% year-over-year rise in our fourth quarter average community count. Our forecasted year income is lower than our prior expectation as we anticipate fewer fourth quarter openings due to many of the same challenges that affected our third quarter deliveries. We invested $556 million in land, land development, and fees during the third quarter with only $135 million of the total representing new land acquisitions as compared to $467 million in the prior-year period. The 71% year-over-year decline in land acquisitions reflects a pivot toward a more selective land investment strategy in response to softening housing market conditions and our ability to develop land positions already under control to drive future new community openings.\n\nIn addition to being more selective on new land acquisitions, we abandoned approximately 8,800 previously controlled lots during the quarter. At quarter end, we had total liquidity of approximately $928 million including approximately $195 million of cash and $733 million available under our unsecured revolving credit facility. During the quarter, we issued $350 million of 7.25% eight-year senior notes and used the net proceeds together with cash on hand to redeem $350 million of 7.5% senior notes prior to the September 15, 2022, maturity, recognizing a $3.6 million loss on this early redemption of debt. In August, we entered into a senior unsecured term loan with $310 million of lender commitments.\n\nWe are pursuing additional lender commitments and can draw up to the total committed amount at any time through November 23, 2022. We intend to use the proceeds of the term loan to redeem our 7 5/8% senior notes due May 15, 2023, which have a par call date six months in advance of their maturity. After retiring the May 2023 notes, our next senior note maturity will be in June 2027. During the quarter, we repurchased approximately 1.6 million shares of common stock at a total cost of $50 million.\n\nYear to date, we have deployed $100 million of cash to repurchase approximately 3.1 million shares, leaving $200 million available for repurchases under our current board of directors' authorization. We ended the quarter with a book value per share of $40.79, a year-over-year increase of 26%. In summary, while current housing market and supply chain conditions have negatively impacted our expectations for the fourth quarter, our outlook for the 2022 full year reflects significant year-over-year improvements across most of our key financial metrics with notable increases in our scale, housing gross margin, operating margin, and returns. We believe we will generate a full year return on equity based on our fourth quarter expectations of around 26% as compared to 19.9% for 2021.\n\nIn addition, during the fourth quarter, we plan to complete the refinancing of our May 2023 senior notes and continued measured common stock repurchases. We intend to carefully manage our business through the current housing market conditions and believe we are well positioned to achieve solid returns and drive book value accretion in the fourth quarter and into 2023. We will now take your questions. Alex, please open the lines.\n\nOperator\n\nThank you. At this time, we will be conducting a question-and-answer session. [Operator instructions] We ask that you please limit to one question and one follow-up. Our first question comes from the line of John Lovallo with UBS.\n\nPlease proceed with your question.\n\nJohn Lovallo -- UBS -- Analyst\n\nHey, guys. Thank you for taking my question. First one is, I guess, maybe could you help us think about maybe quantify the incentive activity on a sequential and year-over-year basis. What type of incentives are you using? Are buyers responding? And then along the same lines on the fourth quarter gross margin being now down sequentially, does that imply that incentives were used in the backlog as well?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nJohn, I can make a few comments on incentives, and I'll kick it to Jeff for the specifics on the slight movement to growth. As I shared in my prepared comments, we really don't focus on incentives. We look at providing the buyer with the best value, which, to us, is the most square footage for the best price, and then let them personalize at the studio. And as a result of that, the buyer builds up their own value versus us building a home and then pushing incentives on the force of value.\n\nAnd therefore, we don't really use a lot of incentives. We may move pricing in a community if it's not selling, and we'll take some stuff to pick up our sales rate. But I think in the quarter, if I'm not mistaken, Jeff, our -- in incentive were less than 1%, like 0.5%, which is what they typically have run over the year. So, for us, the incentives, closing costs, and kind of mortgage financing freebies here in the less than 1%, and that would hold true for our fourth quarter deliveries as well.\n\nYou want to talk about the sequential?\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nSure, John. Yeah, on the sequential gross margin guide. I think, first of all, it's important to point out with our guide at 25% to 26% at the midpoint, it's up 310 basis points year over year, which is a phenomenal level of improvement on a year-over-year basis. So, first of all, we're really pleased with that gross margin progression and what we've seen there.\n\nThere have been a few impacts that have changed that outlook a bit from what we we're expecting at the end of last quarter, a couple of them relate to pricing. One is we took a more cautious approach reflecting current market conditions on pricing expectations relating to any quick move-in homes and those are the homes either sold in the third quarter or in the fourth quarter for fourth quarter delivery. So that had some impact. We did include some potential selective price adjustments that may be required for some of our customers in backlog.\n\nIn certain cases, some of our communities now have pricing a bit below where some of the customers have locked in. And with current market conditions, we wanted to make sure we had some provision in there to cover that and that we need it. We've also lost some leverage on the lower fourth quarter revenue expectation and we explained that a little bit with what we're seeing in the supply chain for the most part. So that had a small impact as well on our fourth quarter gross margin.\n\nAnd then finally, we did see some mixed impacts. We beat the third quarter guide by over 100 basis points at the midpoint of the guide. And as a result, or part of the driver of that was closing higher-margin deliveries in the third quarter that we expect to close in the fourth, so we saw some mix impact also coming into play there.\n\nJohn Lovallo -- UBS -- Analyst\n\nThat was really helpful. Thank you. And then the order cadence you provided with June being worse than expected, July, I think, down, and then August, actually firming up and being positive relative to July. I guess the question is, was this gross orders or net orders? And then with September softening again, are you getting any sense that people are adjusting to a higher interest rate environment? Or is this still in the works?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nBut, John, it's -- I'd call it a start-up process. The rates ran up that actually softened a bit in August. And at that time, the buyer seemed to have digested the higher rate and they were OK and they move ahead. And we were encouraged with the activity that we saw in August.\n\nWhen you look at September, I want to qualify it a little bit, it's 15 days in September, and it includes a Labor Day weekend, which -- so there's always a little noise with that. And there's no question the market is softer than it was last September, and we saw it turn down a bit. And in August, if you go back to that point in time, we had also taken some steps in some communities that weren't hitting their sales rates. And we think that helped.\n\nAnd as we go forward, if things take sluggish, we'll take some steps to further generate sales. But since -- even since I've made my prepared comments since I assumed them over the last week, rates have run up again. And with the Fed comments today, we think they'll move a little more. What's interesting, I can share also, and we didn't include it in our mortgage comments, we have some great and compelling interest rates on adjustable rate mortgages, where it's a 10-year fixed.\n\nAnd if I were a buyer, I would take that in a minute. And those are a couple of hundred basis points lower than the 30-year fixed, and nobody is taking it so far. It's a very limited number of people that have shifted to arms yet. And if you take that dynamic and pair it up with the buyer profile I shared, I don't know that they need the arms yet.\n\nThey're just -- everyone just kind of paused. They're -- as I said, they've moved the sideline and they're waiting to see how things play out, whether it's our interest rates running up more, our inflation concerns, all these things that you're hearing about in the media, that the buyers just put it on pause. They haven't gone away. They're just not buying at the level they were.\n\nOperator\n\nThank you. Our next question comes from the line of Stephen Kim with Evercore ISI. Please proceed with your question.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nThanks very much, guys. And Jeff, yeah thanks for that commentary about the nature of the slowdown in demand. Certainly, sounds like the issues are more mental than that. And so that's encouraging.\n\nI did want to pick up, though, Jeff K., on the comment about the gross margin outlook. And I believe you mentioned that and anticipating that you're going to maybe do some more discounting or something to move your quick move-in homes was a part of that. And so, regarding that, one of the interesting things that we have been hearing recently is that quick move-in homes are actually in greater demand by the buyers because they like to consummate the deal quickly. And so, I was curious, are you generating lower gross margins currently on your quick move-in homes than on your BTOs? And then tied to that, you don't have a lot of standing inventory, so I'm curious, are you -- are you -- it seems like you're maybe selling your QMIs or your quick move-in homes pretty quickly.\n\nSo again, are you generating a lower margin because you're selling them pretty quickly? There seems to be a lot of demand for it, that kind of thing.\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nMy comments really, Steve, were relative to where we were at a quarter ago. So, with our expectation that pricing a quarter ago versus today, obviously, those expectations have come down a little. So, it wasn't meant to imply that we're having to deeply discount quick move-ins or anything else. Most of our quick move-ins are coming from cancellations, as you know.\n\nSo, it's just the dynamic between where it was written at the BTO order and where we end up transacting at on a QMI. But overall, it was really more of a relative comment third quarter versus fourth quarter as far as our expectations.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nOK. That's good. So, it doesn't sound like quick move-in homes are particularly a problem for you at this point.\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nNot at all.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nYeah. And you already -- yeah. And you already talked about the fact that the rate on backlog was only 9%, which isn't very much either. So then sort of a follow-up here, I wanted to talk about investor buyers and basically landlords.\n\nWould you consider selling more QMIs or more quick move-in homes to investor buyers, if higher mortgage rates were to slow retail demand to the point where you do have more standing inventory than you would like? And is it your expectation that sales to landlords would come at a line average margin or better on an operating basis?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nSteve, why don't we make a few comments on that? First off, on your previous question, I wouldn't say that buyers prefer spec over built-to-order. We offer the customer a nine-month lock. So, they get today's rates not going up on them. I share the percentage of our buyers that are locked or cash.\n\nAnd they still value the ability to personalize their home. So, I wouldn't take the position that people prefer spec homes. We really limit or try to get away from any investor sale activity. And one of the things that I'm sensitive to is having a bunch of renter churn, I'll call it, mixed into our community.\n\nSo, we're not a company that would go sell a bucket of inventory and put rental investors in next to our customers on a broad-based approach, maybe a house over here or a householder there that investors purchasing and renting. But where we may consider it, and we've looked at it and haven't penciled yet, but we may do it if we have a larger land holding. And there's a distinct plot of lots that you could identify as single-family rentals, and they have their own streams in and out, and they aren't mingled in with our purchasers, then we may look at something like that. I would think on both bases, even though we're not doing it, I would think that the bulk partners going to expect some type of discount due to buying bulk.\n\nI can't believe they're going to just pay market rate pricing right now.\n\nOperator\n\nThank you. Our next question comes from the line of Matthew Bouley with Barclays. Please proceed with your question.\n\nMatthew Bouley -- Barclays -- Analyst\n\nGood evening, everyone. Thanks for taking the questions. So, on the topic of ASPs, I know you mentioned making some price adjustments in underperforming communities. I think the order ASP overall was maybe down 12% sequentially.\n\nAnd if I'm doing the math right, it looks like on the West Coast, it might have been down more than 20% sequentially. Are you finding that these price adjustments are, I guess, reinvigorating sales pace in those communities? Or should we expect to see perhaps more reductions? And I guess just given the magnitude of that, the owned land impairments start becoming more realistic given that move-in pricing? Thank you.\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nMatt, I'll talk to the price movement then Jeff can give you the impairment thoughts. California is primarily totally mixed. We had several communities that sold extremely well in the second quarter and either sold out or approached sellout where the ASP was $1.5 million, $1.7 million, up to $2 million. And when you get a few of those communities in our coastal business and they sell out and you replace them with townhomes for $600,000 in Anaheim, it can really move your ASP down, and that's what happened in California.\n\nThat's not price cuts. That's a mix shift. So, when we look at it, of the change in ASP, about two-thirds of it was the California mix shift. And then the rest may have been adjustments or further mixed as in the other regions, but don't look at that as a pure price cut because that's not what happened in our business.\n\nJeff, do you want to give your impairment thought?\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nYeah. In relation to the impairment question, Jeff spent a little bit of time during the prepared remarks talking about the vintage of our lots and when those lots were locked in as far as pricing goes. And we're pretty proud of our inventory right now and our lot position in our communities. Exiting the year, as we guided in the mid-20s from a gross margin point of view, puts us in my tenure with the company at about the safest point we've had with the most room between where we're currently selling homes at and would even start to cross the line of an impairment.\n\nSo, it's not high on the list right now of concerns for us at the moment. Obviously, we'll continue to carefully monitor what we're doing in land, in particular with new investments, but it's not a particular concern right now with those type of margins.\n\nMatthew Bouley -- Barclays -- Analyst\n\nGot it. OK. That's really helpful. Thanks for that clarification, particularly, on the mix side there.\n\nI guess second one, you mentioned at the top, I think Rob spoke about the potential to begin renegotiating with certain construction materials. If I heard you correctly, around the decline in housing starts. Just curious if you could, I guess, expand a little bit on that and sort of where you see the opportunities to maybe reduce some of your input costs there. Thank you.\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nRob, do you want to speak to that?\n\nRob McGibney -- Executive Vice President and Chief Operating Officer\n\nSure. Yeah. On the direct, we're starting to see some relief on the front end, and I think that's how we would all expect it to happen because the starts slowed down, the houses that are moving through the front end of the construction cycle, there's just not as much out there, so the trades and the suppliers get hungrier. So that's what we're attacking right now and really working to drive the cost out of the business.\n\nWe haven't seen the same success and I wouldn't expect to until we get probably through this year, on the back end because there's a lot of production volume out there in all of the markets that we operate in on the new home side. So the trade base and the product associated with the homes that are, say, drywall and beyond is still pretty tough, but that's going to flow through. Some of the slowdowns we're seeing in start to first get relief on slab and then framing and it moves on through the system. So that's really the way that our teams are approaching it and attacking it today.\n\nOperator\n\nThank you. Our next question comes from the line of Alan Ratner with Zelman and Associates. Please proceed with your question.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nHey, guys. Good afternoon. Thanks for taking my questions. First one, I would love to get a little bit more color on the roughly 9,000 lots you guys walked away from in the quarter.\n\nI'm curious, was there an attempt to renegotiate those deals and sellers for one reason or another, just didn't want to play ball? Or were those lots that just based on your kind of view of where the market is going, it just didn't make sense to move forward on either at any price or any kind of takedown schedule that you could have potentially renegotiated?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nAlan, I think it would be across the board. You answered some of it. And in some cases, the land sellers are sticky, and they're not willing to reduce price, and they're not extending because they think they've got other people in the wings that will come in and take your position. We said, OK, fine, we're not comfortable and you walk.\n\nThen there's others where, at the price point, we're in that city and what was going on around it, we decided we just don't -- we can't support the return. But as we look at our land activity now, it starts with the underwriting on the price and the pace. And unless that submarket has stabilized, and we have demonstrated pace of a similar or less or similar price point, we can't get comfortable it's not going to get a little tougher out there. So -- but it's a full mix of things.\n\nWe're doing everything and anything to preserve these positions. But if it doesn't make sense, we are prepared to walk\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nGot it. And just in terms of the kind of vintage or duration on these deals, were these primarily lots that would have been community count growth in, call it, '24 and beyond? Or were these deals that you were kind of on the edge of potentially taking down that could have contributed for more near-term community count growth?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nThere might have been one or two where it's a fringe '23 deal, late in '23, but also, but for the most part, it's beyond. And we've had a very successful run. It's filling a very good lot pipeline over the years here. And if you look at the last count that's on, we don't have the urgency to go tie up more right now to have a growth trajectory.\n\nWe have a nice position, softer trajectory than we thought two or three years ago, but still a very favorable growth trajectory. So, we don't have any urgency right now. We can afford to be particular.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nGot it. That makes a lot of sense. And Jeff, you brought up the underwriting. And I remember earlier in the year, you answered a question of mine related to some of those assumptions on your underwriting.\n\nAnd I recall at that time, you said on land underwriting, you were generally assuming monthly absorption rates in the four to six range, and that was when your sales pace was obviously much higher. Today, it's lower and at a point in time, of course. But should we think about your current sales pace at three where four to six is really that desired piece you guys want to be at? And until you get there, price is probably going to be a lever that you're pulling maybe more significantly than you did this quarter. Or have you changed that view at all? Are you more comfortable in this maybe three to four range for the time being?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nI'd say three to five, if I said four to six, it'd be three to five now. And every -- it depends on how many lots and is it replaceable and what's the price point and all those things, we always talk about. But three to five, we can make very good profits and very good returns at the kind of margins we can run.\n\nOperator\n\nThank you. Our next question comes from the line of Michael Rehaut with J.P. Morgan. Please proceed with your question.\n\nMichael Rehaut -- J.P. Morgan -- Analyst\n\nHi, thanks. Good afternoon and thanks for taking my questions. First, I just wanted to circle back and clarify from an earlier question around margins on spec or a quick move-in. It was cited as a driver, reduced pricing expectations on quick moving or spec, I guess, in the fourth quarter.\n\nSo, it would suggest that that margin on spec is a lower margin than your homes in backlog at least, I would presume. I just wanted to get that right. And number two, Jeff K., I think you mentioned four drivers to the reduced gross margin expectations. And I think versus your prior guidance, it's about 250 bps.\n\nYou cited four different drivers, and I'm just trying to get a sense of the degree of magnitude of what each of those drivers represents on the guidance reduction.\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nSure. Yeah, I'll try to address both of those. So, first of all, the QMI again, it was relational. It was related to where we were at a quarter ago versus any type of comparison between QMI homes and build-to-order homes or anything else.\n\nWe've done very, very well with anything that we have needed to sell on a spec basis, particularly over the last couple of years. And there hasn't been much. Our spec homes and delivery has been pretty small. So that's really actually a pretty small impact on the fourth quarter gross margin, but it is one of the factors.\n\nWhen you look at the order of magnitude, we mentioned -- I mentioned four things. The mix and leverage probably being on the lower end of things, the QMI impact probably being on the lower end, probably the largest impact was just provisions that we made in the event that potential selective price adjustments are required on the backlog. So -- and it was judgmental a bit, and we don't know yet where that will land for the fourth quarter, but we wanted to be prudent and a bit conservative on that piece of it in the event that conditions keep deteriorating. So that's how we see it today.\n\nThe mix impact also was somewhat impactful when you look at the overperformance in Q3, and those homes were in backlog. They sold those lower-margin homes, we'll be closing in the fourth quarter and some of the higher-margin homes actually close in the third. So, there's a little bit of a trade-off there as well. But that's how we see it right now.\n\nEvery time, we kind of redo a forecast, we don't go through community by community, home by home, and quantify all of the differences, but those are the main drivers as we see it.\n\nMichael Rehaut -- J.P. Morgan -- Analyst\n\nRight. OK. No, I appreciate that, Jeff. And maybe just to drill down a little further on your answer, I guess.\n\nWhen you say that the bigger portion of the gross margin guidance reduction is from these -- an assumption around selective price adjustments, so if I'm hearing that right, it sounds like you're saying you haven't made those adjustments yet. These are assumptions of what you might need to do through the end of November. And so, to me, that's a little surprising in that you have another 10 weeks to go. Obviously, that's a decent amount of time but you're talking about a large number of closings.\n\nSo I was a little surprised to hear that, that -- I would have thought that those price adjustments would have already been made. Just curious if that assumption is based on some price adjustments that you've already had to do in the last month or two and you're kind of projecting out a run rate on that? Or is it something where these are kind of active and ongoing and maybe you haven't hit the finish line yet, but it's certainly in progress?\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nNo. Price adjustments on home center and backlog, Mike, are generally made very close to the closing date. So that if you decrease prices below some of its contracted price, but later increase the price slightly beyond that, you're not hitting the lowest common denominator. So, it's always pretty close to the close date on those.\n\nYeah, there's definitely a lot of extrapolation that's in the numbers right now because we just don't know what that environment will look like over the next couple of months and how many buyers may need to help or encouragement to get their homes closed.\n\nOperator\n\nThank you. Our next question comes from the line of Susan Maklari with Goldman Sachs. Please proceed with your question.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nThank you. Good afternoon, everyone. My first question is, can you talk a little bit about the studio sales? And how are your buyers thinking about some of the options and the features that they're putting into the homes? And any changes there that you're seeing?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nIt's interesting, Susan. You start with the recognition on the lag between contract and close. So a lot of our Q3 closing actually were sold in December, January, February, and into March. But the spend in the studio actually went up year over year.\n\nAnd I didn't really get into the guts of that. I don't know whether we -- I don't think it's the buyer preference that's changed. I think our studio pricing changed because the costs were going up. But the type of items they were choosing and the spend went up with the type of items were pretty much the same as prior years.\n\nSo, we haven't seen a shift there yet. The other interesting thing to me, our -- the size of our homes has not changed. While interest rates have gone up and pricing has moved and everything, the footage and the deliveries were similar to a year ago and the footage on orders was almost identical. So, buyers are not changing their preference yet.\n\nI think, in part, it's the profile of the buyers we're catering to can afford all this still. And so, it may shift if rates keep going up, moving ahead. But so far, we haven't seen anything change.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nOK. That's helpful color. My second question is, you mentioned that despite the fact that you are offering 10-year loans and some other alternatives that are several basis points lower than a fixed rate mortgage now, you're seeing that people are really just choosing to kind of pause the overall spend buy decision. I guess how are you thinking about the buyer psychology? What are they waiting for in order to decide to make that decision? And how are they weighing the rent versus buy decision today, especially considering that rents are also still moving higher?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nYeah. I just heard a report today driving to work that observed that, on average, single-family rental payments are up 12% year over year. It's a pretty big move. And I think that continues to be a compelling reason to be a homeowner and lock in the value and build up equity over time.\n\nI think the buyer is primarily, to me, just confident in the state of play out there, whether it's inflation and whether it's interest rates when they hear the news coverage on the Fed today or what's going on in the Ukraine war, and all these things are weighing on the consumer today. They're not going away. And I was joking with somebody yesterday on how each month, there's millions more Gen Zs now in their home-buying years, and they're not going away. So, they have to make a decision to own versus rent.\n\nAnd there's arguments for both, but I think people want to be a homeowner. And right now, they're just -- they've taken a pause. And we keep monitoring it. And that's part of why we elected not to start out chasing sales.\n\nOne, we didn't need them because we didn't have the inventory and we already have the backlog for several quarters of deliveries. And two, I think the buyers are inelastic right now. If they just have locked down, so I'm not going to do anything in the short run, you're not going to get them off the fence by throwing more out. So, we thought we'd just pause and see how it all plays out.\n\nBut the buyers are still out there. That has not changed.\n\nOperator\n\nThank you. Our next question comes from the line of Mike Dahl with RBC Capital Markets. Please proceed with your question.\n\nMike Dahl -- RBC Capital Markets -- Analyst\n\nHi. Thanks for taking my questions and for the color so far. I wanted to ask a little bit more about the comments on monthly cadence and obviously, with orders down 50% net, gross down 35%, there can be a lot of moving pieces from month to month. Could you just give us a sense of, on a year-on-year basis, the order trends through the quarter? And then when you talk about the softening in September, maybe what pace or what type of year-on-year decline should we really be thinking about that you're tracking to? Even track it year on year?\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nYear, not for two weeks.\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nMike, I don't know if we can even give you any color on that because it's a two-week period in September. So, I don't -- I couldn't tell you what we did last year in the first two weeks. I just know it's a little softer than August.\n\nMike Dahl -- RBC Capital Markets -- Analyst\n\nOK. Well, I guess can you at least speak to the kind of June, July, August trends more specifically, either sales pace in each month or the year-on-year decline in net orders in each month? And then I guess with respect to September, even if there's something on well at this weekly sales piece, it's down x versus August, anything like that.\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nI don't have the numbers.\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nI mean, Jeff went through a little bit on the quarterly trending during the prepared remarks and talked about August. I'm not sure it's terribly relevant right now rate moves we've seen since August. I mean one of the things that happened in August was we saw a little relief on the rates and a little bit of a -- I don't know, if you call a relief rally or whatever, same with the market, the stock market was -- had some signs of life as well during the month, so that may have had some impact on buyer behavior. But as far as trying to get too detailed on just a short period in September, we typically don't go there and probably won't do it again in this call either.\n\nMike Dahl -- RBC Capital Markets -- Analyst\n\nOK. Fair enough. Maybe I'll ask, I guess, a slightly different way. I think, Jeff, you also mentioned that the kind of new targets, three to five on pace.\n\nI'm not sure if that was kind of underwriting when you're thinking about your land deals or if you're thinking about that as a current selling pace. But given the seasonality in the latter part of the calendar year, things like that, things like what you're seeing with the step-up in, in rates, I mean, should we be thinking that we see seasonality in terms of seasonally lower versus the pace that you saw in 3Q? Or could you potentially be a little more stable to that as you've adjusted prices?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nYeah. Well, if you assume, let's just say, four to five, what I was talking about before on the previous question on the three to five, and the set was is relative to land packages and go-forward underwriting. But if we're going to operate our community, just say four to five or four and a half. So, if you're going to run a four and a half through a year in a typical year, you'll be at five and a half through March, April, May, and June in that period.\n\nAnd then in the fourth quarter, you'll drop down under four. And that would be a pretty typical seasonal trajectory for us. If you're trying to model where our sale is headed, you're going to do less in the fourth quarter than you did in the third quarter than you did in the second quarter due to seasonality. And I do think we're returning to a more normalized seasonal pattern.\n\nOperator\n\nThank you. Our next question comes from the line of Truman Patterson with Wolfe Research. Please proceed with your question.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nHey. Good afternoon, everyone. First, I just wanted to follow up on one of Matt's questions and look for a little bit of clarity. Jeff, I believe you said that two-thirds of the decline in order ASP sequentially of that 12% was purely a function of product mix shift, implying that base pricing is the remaining third or down about 4% quarter over quarter, making sure that I heard that correctly.\n\nAnd if so, that's kind of a direct four-point headwind to gross margin kind of all else equal. And Jeff K., on your fourth quarter gross margin guidance, you ran through some of the items' reasons why it's down quarter over quarter. But are you all seeing any benefit from lower lumber costs that will be hitting the P&L in the fourth quarter sequentially? I believe lumber pricing kind of peaked in February, March time frame.\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nYeah. The lumber -- we expected the lumber to be peaking sort of third, fourth quarter. So, we'll see some relief, I think, going forward on that. I think certainly, we'll see the lumbers come back kind of within range, as they call it, should see some nice benefits as such a large cost factor.\n\nAnd not just on the lumber. I think as the market softens and we're working pretty hard on suppliers and subcontractors and everything else in terms of pricing. There's usually some pricing benefits that help our cost benefits to help offset any pricing issues that we've seen. And then the other question was on.\n\n--\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nYeah. Truman, the two-thirds, I was referring to the California mix shift only. It's hard to say prices are down x because you have ins and outs every month and every quarter, whether it's you open something in Denver and you close something in Tampa and the prices are different. But two-thirds of the price shift was directly tied to all the high-priced goods that we sold through in Coastal California, North and South.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nYeah. I'm just trying to understand because the West ASP falling 21% in the quarter. I realize mix shift can impact that. But I was assuming that there's price concessions included in that as well so --\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nGo back to the order price though from the second quarter was significantly higher than any price we've guided on deliveries. That was -- it was a blip because of the mix.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nGotcha. OK. OK. And similar for, I believe, two of the other regions, the order ASP also kind of declined.\n\nAnyways, I think what everybody is trying to understand is what level of base price cuts, you all have been seeing nationwide, but I'll leave it alone. On the new community, the new communities that you all have coming online, we've heard of builders, maybe not cutting price across all of their existing communities. Is there more adjusting pricing on the new communities coming online but wanting to understand if that's your strategy and maybe any sort of magnitude relative to new communities versus existing communities that you have down the road? And are you seeing consumers respond to these new communities? Are they hitting your absorption targets?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nYeah. But for the most part, the openings are working very well. And what I would reshape the answer, Truman that, as I shared in the prepared comments, a lot of these assets have been tied up at a price from three, four years ago, five years ago even. And therefore, the margins that we would plan on are much higher than our underwriting margins because of the market lift.\n\nSo now if prices come down, we adjust and we have a reservation process that helps us focus in on what the right price points are in the community. So, we may tweak them down to ensure a successful opening, but you're still well above the margins that they were underwritten at. And -- but we want to make sure that the community is a successful opening. You can only open them once.\n\nAnd if they aren't successful, it gets painful. So, we like to set the pricing where the community works out of the gate. And typically, good markets or bad new openings bring a lot of excitement and energy and generate a lot of sales. So, ours are working pretty well.\n\nOperator\n\nThank you. Our final question comes from the line of Deepa Raghavan with Wells Fargo Securities. Please proceed with your question.\n\nDeepa Raghavan -- Wells Fargo Securities -- Analyst\n\nHey, good evening. Thanks for squeezing in, Jeff. Appreciating that your backlog cancellation rate, the 9% versus the overall 35% cancellation rate, can you talk through the risk to the backlog you have? I mean have you scrubbed the backlog fully again for a higher qualification rate, maybe you had conversations with those buyers again? I mean, what can you proactively due to ensure the backlogs are resilient?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nWell, we're constantly scrubbing the backlog deeper. The lesson we would want us to have a name on a home that's under construction that isn't prepared to close when the home is completed. So, all those processes are intact, and we have a quality backlog. What we're seeing, to some degree, we've had buyers that their loan was approved, their loan was locked, the home gets completed.\n\nAnd then they say, I just don't feel good about going forward with this purchase, even though their interest rate that they locked us in the 3s and they have $20,000, $30,000, $40,000 of equity in the home, they still say I'm done. There's too much noise in the world, and I don't feel comfortable with this. And we really can't control that. But if you look within the quarter, at our deliveries, that didn't really impact our deliveries at all.\n\nAnd they didn't impact our percent of width that's unsold. It's the same level and at the end of the third quarter, it was at the end of the second quarter. And as I shared in my comments, for the most part, these buyers are closing when the home is completed. It's still been very predictable.\n\nDeepa Raghavan -- Wells Fargo Securities -- Analyst\n\nOK. That's helpful. A bigger-picture question. If rates stay in the six to six and a half kind of range, is that potential we could see a normalized spring selling season? Or is it too late to expect demand recovery, given just how September has been playing out with these higher interest rates?\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nWell, it depends on what's going on with the economy, jobs, interest rates, inflation, everything else that drives consumer confidence. But I think if rates held where they were and the consumer digests it and they still qualify like our buyers do, I think you could see a more normalized spring. So, I wouldn't suggest that a couple of week trends right now with everything going on is a precursor for what would happen next spring. It's way too early to say that.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJill Peters -- Senior Vice President of Investor Relations\n\nJeff Mezger -- Chairman, President, and Chief Executive Officer\n\nRob McGibney -- Executive Vice President and Chief Operating Officer\n\nJeff Kaminski -- Executive Vice President and Chief Financial Officer\n\nJohn Lovallo -- UBS -- Analyst\n\nStephen Kim -- Evercore ISI -- Analyst\n\nMatthew Bouley -- Barclays -- Analyst\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nMichael Rehaut -- J.P. Morgan -- Analyst\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nMike Dahl -- RBC Capital Markets -- Analyst\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nDeepa Raghavan -- Wells Fargo Securities -- Analyst\n\nMore KBH analysis\n\nAll earnings call transcripts"
}