{
  "companyName": "Concrete Pumping Holdings Inc",
  "companyTicker": "BBCP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/concrete-pumping-holdings-inc-bbcp-q3-2022-earning/",
  "content": "Concrete Pumping Holdings Inc (BBCP -0.51%)\nQ3 2022 Earnings Call\nSep 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, everyone, and thank you for participating in today's conference call to discuss Concrete Pumping Holdings' financial results for the third quarter ended July 31, 2022. Joining us today are Concrete Pumping Holdings CEO, Bruce Young; CFO, Iain Humphries; and the company's external director of investor relations, Cody Slach. Before we begin, I would like to turn the call over to Mr. Slach to read the company's safe harbor statement within the meaning of the Private Securities Litigation Reform Act of 1995 that provides important cautions regarding forward-looking statements.\n\nCody, please go ahead.\n\nCody Slach -- Director, Investor Relations\n\nThanks, Diego. I'd like to remind everyone that in the course of this call, to give you a better understanding of our operations, we will be making certain forward-looking statements regarding our business and outlook. These statements are subject to numerous risks and uncertainties that could cause actual results to differ materially from such statements. For information concerning these risks and uncertainties, see Concrete Pumping Holdings' annual report on Form 10-K, quarterly report on 10-Q, and other publicly available filings with the SEC.\n\nThe company disclaims any intention or obligation to update or revise any forward-looking statements, whether as the result of new information, future events, or otherwise. On today's call, we will also reference certain non-GAAP financial measures, including adjusted EBITDA, net debt, and free cash flow, which we believe provide useful information for investors. We provide further information about these non-GAAP financial measures and reconciliations to the comparable GAAP measures in our press release issued today or the investor presentation posted on the company's website. I'd like to remind everyone this call will be available for replay later this evening.\n\nA webcast replay will also be available via the link provided in today's press release, as well as on the company's website. Additionally, we have posted an updated investor presentation to the company's website. Now I'd like to turn the call over to the CEO of Concrete Pumping Holdings, Bruce Young. Bruce?\n\nBruce Young -- Chief Executive Officer\n\nThank you, Cody, and good afternoon, everyone. Our third quarter marks our fourth consecutive quarter of double-digit consolidated revenue growth, which is a testament to the strength and resilience of our business. We also reported double-digit growth across all of our segments, reflecting continued organic market share gains and contributions from recent accretive acquisitions. By reporting segment, revenue in our U.S.\n\npumping business increased 33% in the third quarter, driven by our recent strategic acquisitions, strong share growth in our commercial end market, rate increases and pent-up industry demand brought about by the pandemic recovery. Of note, all project types within our commercial market experienced demand, which underscores the strength of our team and the end markets recovery. In infrastructure, we continue to benefit from our growing national footprint that allows us to capture increased funding in public project investments. We will continue to work to win projects at the state and local levels, and we are encouraged by the passage of the Infrastructure Investment and Jobs Act.\n\nWhile we do not assume any meaningful benefit from the passage in fiscal 2022, we remain well positioned in 2023 and beyond. At this moment, the magnitude of the bill's benefit to our business today remains tough to quantify. Our residential business was relatively stable in the quarter given the structural supply demand imbalance that continues to unwind. We recognize that there are some negative headlines coming from the residential housing industry, but it is important to note that the majority of our residential work resides in the Mountain states and in Texas.\n\nSo far, these areas have performed relatively well for our business. For example, as a percentage of our total revenue, our residential work volumes traded 100 basis points with growth in our commercial market in the quarter, which carries the added benefit of higher margins compared to other end markets. This shift in revenue by end market underscores the benefits of diversity and durability of our high service value. In our U.K.\n\nsegment, in spite of foreign exchange headwinds, revenue increased 14% compared to the prior-year quarter due to organic growth given the country's continued strong recovery from the impacts of COVID-19. Our team continues to secure energy, road and rail projects in addition to the work we have previously announced with the concrete-intensive high-speed railway project, HS2, which is expected to last beyond 2030. In Eco-Pan, our concrete waste management business, revenue continues significant organic growth with an increase of 26% for the quarter due to an improved sales approach and our team's ability to execute more in-person selling. We continue to expand our Eco-Pan sales team in 2022 to strengthen our position for long-term growth.\n\nGoing forward, we continue to expect to maintain Eco-Pan's double-digit organic revenue growth. We also continue to execute upon our organic M&A growth strategies. In late July, we undertook an expansive strategy along with the U.S. East Coast, starting with an organic greenfield expansion opportunity in Washington, D.C., an area that has experienced rapid growth that we expect to continue.\n\nSubsequent to the quarter end, in August, we strengthened our U.S. East Coast expansion strategy with accretive acquisition of Coastal Carolina Pumping. We're excited to welcome the talented Coastal team to our Concrete Pumping Holdings family, and they bring with them the largest concrete pumping service in the Carolinas with 89 units of operating equipment. We expect our East Coast strategy, which includes acquisition of Coastal, our greenfield in D.C., and our Eco-Pan synergies to generate approximately $25 million of revenue in fiscal year 2023 with similar margins as our existing business segments.\n\nWe acquired Coastal for $31 million, which we funded from existing debt and a strong free cash flow. From a financial perspective, Coastal brings all of the same value creation characteristics of previous acquisitions such as purchasing power, economies of scale, improved utilization, and price optimization. At an average fleet age of five years, Coastal also brings a young fleet that we can use to offset future capex spend. Strategically, the acquisition checks all the boxes well.\n\nCoastal enhances our position of scale, most notably in North Carolina, South Carolina and the Florida regions. The operational capacity enhanced is expected to provide Brundage-Bone and Coastal customers with advantages like increased service offering and expanded fleet availability. Additionally, the acquisition offers a compelling opportunity for Coastal's customer base to access our Eco-Pan Country waste removal services. We also plan to leverage the location of the existing Coastal customers to strengthen our recent D.C.\n\ngreenfield expansion strategy. Shifting to the cost side of the business, as was the case last quarter, rapid inflation, particularly in diesel fuel, continued to impact year-over-year gross margin comparisons. Despite this headwind, our team continued to execute the recalibration of our rates. To put the headwind into perspective, we experienced slightly more than $3 million of year-over-year increase in diesel fuel costs in our third quarter or approximately $7 million in the first three quarters of the 2022 fiscal year.\n\nIn spite of the significant cost headwind, we believe we have largely offset these costs through our rate recalibration and our margin dollars are in line with our expectations if we remove the inflationary headwinds. As a result, we continue to realize the expected equipment return on investment for the same volume of work performed. So, in summary, we had another great quarter that continues to show the strength and resilience of our business. I will let Iain walk through more detail on our financial results before I return to provide some concluding remarks.\n\nIain? \n\nIain Humphries -- Chief Financial Officer\n\nThanks, Bruce, and good afternoon, everyone. We are pleased to report that revenue increased by 29% to $104.5 million compared to $80.8 million in the same year-ago quarter. The double-digit revenue improvement was driven by a combination of volume growth from our recent acquisitions, solid organic growth, and continued improvement in pricing. Revenue in our U.S.\n\nconcrete pumping segment mostly operating under the Brundage-Bone brand increased 33% to $77.4 million compared to $58 million in the same year-ago quarter. Excluding the acquisitions of Hi-Tech and Pioneer, Organic revenue growth for the quarter increased 21% to $70.2 million. This was driven by improvement in many of our U.S. markets due to higher construction volumes and continued pricing improvements.\n\nFor our U.K. operations, operating largely under the Camfaud brand, revenue improved 14% to $14.4 million compared to $12.7 million in the same year-ago quarter. When excluding the foreign exchange translation effects from the weakening British pound, revenue for the U.K. operations increased by 28% in the third quarter.\n\nThe year-over-year revenue improvement was primarily due to organic volume growth from the region's continued recovery from the impact of COVID-19 and continued pricing improvements. Revenue in our U.S. concrete waste management services segment, operating under the Eco-Pan brand, increased 26% to $12.8 million in the third quarter of 2022 compared to $10.1 million in the same year-ago quarter. The revenue increase was driven by organic growth in Pan pickup volume, continued pricing improvements, and the ongoing recovery from the impacts of the pandemic.\n\nReturning to our consolidated results. Gross margin in the third quarter was 41.5% compared to 46.1% in the same year-ago quarter. The decrease in margin is directly related to inflationary pressures particularly related to the continued rapid diesel fuel price escalation that Bruce discussed earlier. To give an order of magnitude of the material impact of these inflationary pressures versus Q3 of last year, we estimate our gross margin in the third quarter was impacted by more than $3 million or approximately 330 basis points due to the higher cost of diesel fuel.\n\nYear to date, we estimate the diesel fuel impact was approximately $7 million or 250 basis points. General and administrative expenses in Q3 were $27.2 million compared to $24.9 million in the same year-ago quarter. Lower amortization cost of intangibles and lower stock-based compensation expense was more than offset by overhead headcount cost increases from recent acquisitions and a $2 million increase due to the foreign exchange fluctuations. As a percentage of revenue, however, G&A costs in the third quarter improved from 30.9% to 26.1% when compared to the same year-ago quarter.\n\nNet income available to common shareholders in the third quarter increased to $14.1 million or $0.24 per diluted share compared to $4.1 million or $0.07 per diluted share in the same year-ago quarter. The improvement was due to the strong contribution from acquisitions and organic revenue, as well as an approximate $7.4 million gain from the change in fair value of outstanding warrants this quarter versus Q3 of last year where we recorded a $260,000 gain. Excluding the impacts of the change in fair value of outstanding warrants in each comparable period, net income increased in the third quarter to $6.6 million from $3.8 million last year, or an improvement of approximately 74% year over year. Consolidated adjusted EBITDA in the third quarter increased 15% to $32.6 million compared to $28.5 million in the same year-ago quarter.\n\nAdjusted EBITDA margin was 31.2% compared to 35.2% in the same year-ago quarter. As discussed previously, the erosion in margin was driven by rapid cost inflation, predominantly in diesel fuel. In our U.S. concrete pumping business, adjusted EBITDA grew 21% to $22.4 million compared to $18.4 million in the same year-ago quarter, driven by our strong revenue growth.\n\nIn our U.K. business, adjusted EBITDA was $3.9 million compared to $4.1 million in the same year-ago quarter as strong revenue growth was offset by significant inflationary pressures, primarily diesel fuel cost. For our U.S. concrete waste management business, adjusted EBITDA improved 6% to $5.7 million compared to $5.3 million in the same year-ago quarter.\n\nTurning to liquidity. At 31 July 2022, we had total debt outstanding of $392 million or net debt of $389 million. We had approximately $134.1 million in liquidity as of July 31, 2022, which includes cash on the balance sheet and availability from our recently upsized ABL facility. As announced in late July, we added JPMorgan Chase to join Wells Fargo in our ABL facility and upsized the ABL to provide up to $160 million of commitments from $125 million previously.\n\nWe remain in a strong liquidity position, which provides further optionality to pursue value-added investment opportunities like accretive M&A or the reduction of our fleet age to support our overall long-term growth strategy. During the third quarter, we entered into a share repurchase program that authorized a buyback of up to $10 million of our outstanding shares of common stock. To date, we have purchased approximately 63,000 shares for $380,000, and the buyback program demonstrates both our commitment to delivering value to shareholders and our confidence in our strategic growth plan. Given our strong revenue performance and recent acquisitions, we are pleased to be raising our revenue outlook.\n\nWe now expect fiscal year 2022 revenue to range between $380 million and $390 million, which is an increase from our previous revenue range of $360 million to $370 million. Given the ongoing impacts of inflation and the timing and size of recent acquisitions, we are keeping the rest of our 2022 guidance unchanged. This calls for adjusted EBITDA to range between $115 million to $120 million and free cash flow, which we define as adjusted EBITDA less net replacement capex, less cash interest, to range between $55 million and $60 million. Operationally and financially, we have a solid foundation and have confidence in executing on our growth strategy.\n\nWith that, I will now turn the call back over to Bruce.\n\nBruce Young -- Chief Executive Officer\n\nThanks, Iain. Overall, we are pleased with our Q3 results. And heading into the final quarter of 2022 fiscal year, we expect our revenue momentum to continue due to the strength in our end markets and our diverse business model. While inflationary cost headwinds have started to ease somewhat, we believe we have proven the steadfast nature of our high-value service, which has well positioned us for 2023 and beyond.\n\nThis inelasticity stems from the necessity of our mission-critical service in today's construction industry. As we think about where our business is positioned for fiscal 2023, we have conviction that commercial and infrastructure will continue to have strong demand due to the factors we are experiencing today. Given interest rates rising and recent indicators of consumer spending weakening, it is only practical for us to assume our residential business volumes may fluctuate and give up some ground to our commercial and infrastructure business in 2023. However, this is an example of the agility and resilience of our business model and fleet management.\n\nWhere construction volumes change in one region or end market, we adjust our fleet management to ensure we optimize equipment utilization. In summary, we are pleased with our third quarter results and are optimistic about our business position heading into 2023. We remain focused on our strategy of driving scale through investing in organic growth and M&A and believe this is the best path to provide superior shareholder value. With that, I would now like to turn the call back over to Diego for Q&A.\n\nDiego? \n\nOperator\n\nThank you. And at this time, we will be conducting a question-and-answer session. [Operator instructions] Our first question comes from Andy Wittmann with Baird. Please go ahead.\n\nAndy Wittmann -- Robert W. Baird and Company -- Analyst\n\nYeah. Great. Thanks for taking my question, guys. Just a quick technical one to start out here maybe for Iain.\n\nThe $2 million that was in the G&A line related to FX, can you just explain the mechanism for that? I just don't understand how that happened and if that could happen again. Is there like some hedge in there, something that's mark-to-market, so that's noncash or what?\n\nIain Humphries -- Chief Financial Officer\n\nYeah, it's noncash. It's all translation FX between -- really translation of the balance sheet and the income statement just on the average rates for the income statement and the closing FX rate on the U.K. It's really just that change, Andy, year over year between the U.S. dollar and the British pound with it weakening.\n\nSo, it's noncash.\n\nAndy Wittmann -- Robert W. Baird and Company -- Analyst\n\nGot it. OK. Then just in terms of the demand for your services, Bruce. I guess drilling on the commercial first.\n\nI guess in the prepared remarks, you said that it sounded like it's fairly broad-based for the quarter. I was just wondering, subsequent to the quarter and what you're seeing in terms of the bidding and quoting activity that you're doing right now, are you seeing any slowdown in any particular types of commercial? Or are things continuing to be kind of steady?\n\nBruce Young -- Chief Executive Officer\n\nIt's been pretty steady. And as you know, we do 1,000 jobs a day. So, of those, on average, about 600 of those jobs will be commercial in various different segments. And all the segments seem to be improving.\n\nEven hospitality has even stepped up some over what we saw last year. So, we're very encouraged that bidding volume has increased in all areas. Our specialty equipment that we use largely in the commercial work is all in use now. And so, we are very encouraged about that market going into next year.\n\nAndy Wittmann -- Robert W. Baird and Company -- Analyst\n\nOK. On infrastructure, I guess, maybe the first question is specific to the U.K. and the HS2. I mean, this is a massive project for that economy to be undertaking.\n\nIs there -- are you hearing anything from your customer or from the government there that would suggest that that's getting slowed down or anything? Or is it just too new with the challenges in the economy there to have an effect? I guess, given its relative importance, I'd just like to hear kind of what you guys are hearing on that job in particular.\n\nBruce Young -- Chief Executive Officer\n\nYeah. It might be too new to see any changes in the pace. Now we've built up to what we think is going to be our volumes for the next several years there. And it's steady at that pace right now.\n\nAnd as what we know right now, that will continue into the future.\n\nAndy Wittmann -- Robert W. Baird and Company -- Analyst\n\nGot it. And then just on the United States side of infrastructure at all there. Are you -- it sounded like the share shift inside the company was from residential to commercial, suggesting that the percentage of the revenue that you have in infrastructure has been steady. Do you expect that infrastructure will, as we move forward into '23, will be taking a larger percentage of your equipment's time next year?\n\nBruce Young -- Chief Executive Officer\n\nYeah. We do expect that we will get more clarity on that as time goes on. It's still very difficult to know where those dollars that have been approved are going to be spent. Infrastructure has been relatively consistent for us as a percentage of revenue over the last several years.\n\nAnd so, as those dollars are flowed down into the states and municipalities, we expect that that will gain some share.\n\nAndy Wittmann -- Robert W. Baird and Company -- Analyst\n\nGot it. I think I'll leave it there. Thanks, guys.\n\nBruce Young -- Chief Executive Officer\n\nThanks, Andy.\n\nOperator\n\nOur next question comes from Steven Fisher with UBS. Please go ahead.\n\nSteven Fisher -- UBS -- Analyst\n\nThanks. Good afternoon. Wondering if you could just give us a sense of the pricing trends year over year versus your volume trends. And I'm curious if the pricing is still accelerating kind of what you see for the balance of the year and kind of what kind of pricing you have carryover into 2023 at this point?\n\nIain Humphries -- Chief Financial Officer\n\nYeah. Good afternoon, Steve, this is Iain. So, if you look at the pricing improvements in Q3, it's quite similar to what we've seen in Q2. So, the momentum on pricing is continuing.\n\nAnd for example, a headline in the third quarter, with all that 29% growth, about 10% came from volume and about 19% from price. So, as you'll remember, that continues to outpace where we thought we would be at the beginning of the year. So, we are seeing some continued encouraging signs on the pricing side.\n\nSteven Fisher -- UBS -- Analyst\n\nOK. And then on the cost side beyond diesel, can you just give us a sense of the other categories you're seeing the most impactful inflation, be it labor or other things? And maybe what kind of magnitude you're seeing there?\n\nIain Humphries -- Chief Financial Officer\n\nYeah. So, really, I mean, we -- as you would expect, we're seeing it in the fuel price as we've talked about. Other areas, as you would expect, are across labor and repair and maintenance, which is mostly on the supply chain of parts. But what I would say is that the pricing improvement that we just talked about is largely covered up the labor and the supply chain, repair, and maintenance part side of things.\n\nAnd the fuel is the last piece that causes the remaining headwinds. So the pricing that we've done so far has done a good job on the cost of supply chain that we're seeing today.\n\nSteven Fisher -- UBS -- Analyst\n\nOK. So, on a sort of a net price versus cost basis, would you say that was sort of a net negative in the quarter still? And then do you see that sort of neutralizing or turning positive at some point in either the -- I guess, what are your expectations for that in the fourth quarter and then maybe as you get into the first part of '23?\n\nIain Humphries -- Chief Financial Officer\n\nYeah. Where we're at right now and is really looking at the margin change that we talked about in our prepared remarks, the erosion in the margin, I mean, the fuel piece that remains is 80% of that margin change. So that's the last remaining piece. But what we have said is that the margin in the dollar impact are slightly different.\n\nSo, when we catch up on passing through the cost of that inflation, that's what's happening today. And the next stage of that catch-up inflation is to improve on the margin side.\n\nBruce Young -- Chief Executive Officer\n\nYeah. Steve, what I think I would add to that is, so our revenue increases have offset our cost of inflation, whether it's fuel, labor, repair, and maintenance parts, but a return is exactly what we expected it to be. So, as you know, we raised our guidance on revenue to offset that, but our return is exactly where we expect it to be on the volume that we're doing.\n\nSteven Fisher -- UBS -- Analyst\n\nOK. Bruce, you mentioned you're seeing some inflation moderated. Is that just referring to diesel prices? \n\nBruce Young -- Chief Executive Officer\n\nNo. We're seeing some in our parts supply, as well as the supply catches up with the demand. Labor, I think, will probably stay where it's at, but I think some of the other supplies will back off some.\n\nSteven Fisher -- UBS -- Analyst\n\nOK. And then maybe just lastly for me. In terms of your visibility to 2023 on the end market demand, and you gave us some good color on sort of housing expectations, but how much visibility do you have on the nonres side at this point? Do you have sort of a backlog? Or do you have kind of a list of indicative inquiries? And then I guess I'm curious if you're just seeing any delays or cancellations on the nonres side.\n\nBruce Young -- Chief Executive Officer\n\nYeah. So, a good question. So, we're not seeing any delays or cancellation on the nonres side. Our backlog for nonres is actually better than what we've seen, and we see that with some of the specialty equipment and some of projects that would be maybe out of the normal and longer in nature than what we've seen in the past.\n\nSo, we're seeing more of that. We are cautious that, that may be offset some by softening in the residential market. But the commercial side, the backlog looks really good.\n\nSteven Fisher -- UBS -- Analyst\n\nOK. Thank you very much.\n\nIain Humphries -- Chief Financial Officer\n\nThanks, Steve.\n\nBruce Young -- Chief Executive Officer\n\nThanks, Steve.\n\nOperator\n\nOur next question comes from Brent Thielman with D.A. Davidson. Please go ahead.\n\nBrent Thielman -- D.A. Davidson -- Analyst\n\nHey. Thanks. Good afternoon, Bruce, Iain. Bruce, just with Coastal, when you announced that you talked about 89 units of operating equipment versus Capital when you acquired it, which came with 144 pieces of equipment, obviously Capital was really accretive.\n\nI guess, just with what looks to be a decent-sized transaction here, can you compare it with Capital? Or maybe there's another deal more comparable? And I guess, just getting to why this wouldn't be more accretive to the bottom-line EBITDA guidance in the near term.\n\nBruce Young -- Chief Executive Officer\n\nYeah. I think -- so comparing it to Capital, I think Capital had better margins than Coastal did when we bought the business, so there's more opportunity for growth there. Capital was in a market that was fairly saturated with equipment, where I think the opportunity for growth in the Carolinas, not only with what they're doing, but with the future work coming in there, it looks like a really good opportunity for a long term. And honestly, we're really excited about it.\n\nBrent Thielman -- D.A. Davidson -- Analyst\n\nGot it. OK. And then Eco-Pan continues to see great momentum. Maybe if you could just give an update on market penetration geographically where you're making some inroads, and if possible, any sort of key performance indicators you can share just to give a feel for the underlying kind of volume growth in that business.\n\nBruce Young -- Chief Executive Officer\n\nYeah. So, with Eco-Pan, and we've talked about this all along, it's really about getting out in front of the customers and saturating the markets where we currently have existing operations with our concrete pumping service. We've done a really good job of integrating the sales team with our concrete pumping service with the Eco-Pan sales team by offering incentives to the concrete pumping group. That's helping.\n\nEco-Pan has added several sales folks into the geographies that we were already existing in. And so, there's -- we do plan on moving into a few new geographies, leveraging our opportunity with Coastal. But largely, it's just creating more density in the markets that we're already in.\n\nBrent Thielman -- D.A. Davidson -- Analyst\n\nGot it. And it looks like the diesel fuel headwind is abating. I guess, I'm just wondering if there's a labor or sort of productivity on the job site component still out there that might weigh on the margins over the near term, even as you sort of pass through these inflationary pieces at the business? And then I guess, Bruce, also just to keep hearing about cement on allocation in certain regions, how that might be kind of impacting the results. Thank you. \n\nBruce Young -- Chief Executive Officer\n\nYeah. So, I'll start with -- so the cement. So, we've had challenges with cement. We've had delays in various geographies since really April.\n\nAnd so that slowed things down in some markets. It's actually helped in the residential market where there was a little softness. It pushed some of that work out to where it kind of levels things off. So, the cement shortages really haven't caused us that much of an issue.\n\nIt's actually maybe helped us in the long run. Labor on the job site seems to be getting slightly better. I don't hear near as much about it out in the field. And honestly, we're not seeing that much within our own business.\n\nIt seems to be lightening up some. And I'm sorry, Brent, I forgot what the third question was.\n\nBrent Thielman -- D.A. Davidson -- Analyst\n\nBruce, I think you hit it. I appreciate it.\n\nBruce Young -- Chief Executive Officer\n\nOK. All right. Thank you.\n\nOperator\n\nOur next question comes from Tim Mulrooney with William Blair. Please state your question.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nBruce, Ian, good afternoon.\n\nBruce Young -- Chief Executive Officer\n\nHey, Tim.\n\nIain Humphries -- Chief Financial Officer\n\nHi, Tim.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nSo, just a couple of questions on the guide. You raised your guidance for the full year. Is that primarily due to the acquisition of Coastal Carolina Pumping? Or are your organic results running ahead of internal expectations so far this year?\n\nIain Humphries -- Chief Financial Officer\n\nYeah, Tim, hi, this is Iain. It's not so much on the Coastal side. I mean, given that we've just announced that there's not a lot of runway until the end of the year. Obviously, it will contribute, but not in a meaningful way.\n\nWe'll see that more in next year's guidance. The up on the revenue guidance is largely because of the pace that we have right now in our business. As you can see, we're outpacing where we would expect it to be, both on the organic growth and the contribution from acquisitions and in volume and price. So with that in mind, that's why we've changed the outlook for the current year.\n\nBut on the acquisition side for Coastal, it's not -- there's not enough time or significance that would change anything for this year.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nOK. That's helpful. I think that's important. And then, you know, your guidance, Iain -- I mean, you guys had really strong revenue growth this quarter.\n\nYour guidance at the midpoint implies a slowdown in that revenue growth rate from the third quarter to the fourth quarter. Is there anything to call out here? Your third quarter results being so strong, was there any pull forward of projects into the third quarter that you originally expected to hit in the fourth quarter? Or is it just comparisons? What do you think accounts for that kind of that slowdown from the strong results you had in the third quarter?\n\nIain Humphries -- Chief Financial Officer\n\nYeah. Tim, if you look at Q3 and Q4, as you know, are usually quite compatible. And if you do the math, if we were to peak Q3 and Q4, it's not actually a slowdown, it would be to the top end of that range. So, we don't have an expectation of a momentum slowdown for the fourth quarter.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nOK. So, if you did 29% revenue growth in the third quarter, and that's inclusive of 30% revenue growth in your U.S. concrete business, are you saying that those are the kind of rates that you'd expect to see in the fourth quarter as well?\n\nIain Humphries -- Chief Financial Officer\n\nYeah. I mean, based on the run rate right now, yes, that would be the expectation. I mean, thought about it maybe a different way, Tim, is if we reperformed Q3 and Q4 at $105 million, it would be at the top end of that range. So that would be based on the same momentum that we have today. \n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nOK. All right. That's very clear. Thanks.\n\nThat's all I've got. Thank you, guys.\n\nIain Humphries -- Chief Financial Officer\n\nThanks, Tim.\n\nBruce Young -- Chief Executive Officer\n\nThanks, Tim. \n\nOperator\n\n[Operator instructions] Our next question comes from Stanley Elliott with Stifel. Please go ahead. \n\nStanley Elliott -- Stifel Financial Corp. -- Analyst\n\nHey, guys. Thanks for taking the question. For stimulus, in terms of the infrastructure stimulus piece, have you all thought about -- I guess, switching gears a little bit on that. In terms of the Inflation Reduction Act, a lot of wind towers out there, a lot of concrete goes into stabilizing those.\n\nWhat sort of impact do you all envision that having on the business? Is that too much of a reach? Just curious kind of what you're thinking about there.\n\nBruce Young -- Chief Executive Officer\n\nWell, we know that most of the projects are structures that come through the Infrastructure Bill, outside of paving are concrete structures. And so whether it goes into wastewater or water treatment, wind, solar, there's foundations in all those types of projects. So as those dollars are let loose into the markets, and since we cover such a wide footprint in the U.S., we expect they'll be in some of the areas we're in, and we'll get some benefit of that. We're still just trying to better understand where those dollars will go.\n\nStanley Elliott -- Stifel Financial Corp. -- Analyst\n\nAnd in terms of some of the larger projects out there, we had comp-based contractors, the builders. Are they concerned about inflation actually taking away the real purchasing power on these jobs that you effectively were looking at smaller-sized projects going forward because of the inflation? Anything along that, that you're hearing?\n\nBruce Young -- Chief Executive Officer\n\nWe're not hearing much on that, but it stands to reason that those dollars won't go as far as what they might have originally gone. And so there would be some concern there.\n\nStanley Elliott -- Stifel Financial Corp. -- Analyst\n\nThen last, how are you guys thinking about capex right now with fleet age where you have it into next year? And then I'm also curious kind of what sort of commitments you have to make from [Technical difficulty] down next year? Now everything still seems pretty good certainly from a minimum standpoint. But just kind of what sort of leverage you would have to pull if the economy were to slow down into next year?\n\nBruce Young -- Chief Executive Officer\n\nYeah. So, we have the ability to turn the faucet on and off. If you'll remember when COVID hit, we did just that. We turned off our capex immediately.\n\nWe put it on hold. It turned out that it wasn't as much of an effect on us as we thought, and we turned it back on. We would have the same flexibility going into 2023. We're going to take a little bit of a cautious approach going into '23 just because of the unknowns.\n\nBut we're still in a really good position to make sure that the fleet age is where it should be, and we're taking care of any replacement that needs to take place.\n\nStanley Elliott -- Stifel Financial Corp. -- Analyst\n\nPerfect. That's all I have. Thanks so much.\n\nBruce Young -- Chief Executive Officer\n\nThanks, Stanley.\n\nOperator\n\nThank you. At this time, this concludes our question-and-answer session. I would now like to turn the call back over to Mr. Young for closing remarks.\n\nBruce Young -- Chief Executive Officer\n\nThank you, Diego. We'd like to thank everyone for listening to today's call, and we look forward to speaking with you when we report our fourth quarter fiscal 2022 results in January. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCody Slach -- Director, Investor Relations\n\nBruce Young -- Chief Executive Officer\n\nIain Humphries -- Chief Financial Officer\n\nAndy Wittmann -- Robert W. Baird and Company -- Analyst\n\nSteven Fisher -- UBS -- Analyst\n\nBrent Thielman -- D.A. Davidson -- Analyst\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nStanley Elliott -- Stifel Financial Corp. -- Analyst\n\nMore BBCP analysis\n\nAll earnings call transcripts"
}