{
  "companyName": "HUYA Inc.",
  "companyTicker": "HUYA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/15/huya-inc-huya-q3-2022-earnings-call-transcript/",
  "content": "HUYA Inc. (HUYA 2.87%)\nQ3 2022 Earnings Call\nNov 15, 2022, 7:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by for the third-quarter 2022 earnings conference call for Huya Inc . At this time, all participants are in a listen-only mode. Today's conference call is being recorded.\n\nI would now like to turn the call over to Ms. Hanyu Liu, company investor relations. Please go ahead.\n\nHanyu Liu -- Investor Relations\n\nHello, everyone, and welcome to Huya 2022 earnings conference call. The company's financial and operational results were issued earlier today and are posted online. You can also view the earnings press release by visiting the IR website at ir.huya.com. Participants -- a replay of the call will be available on our IR website in a few hours.\n\nParticipants on today's call will be Mr. Rongjie Dong, chief executive officer of Huya, and Ms. Ashley Wu, vice president of finance. Management will begin with prepared remarks, and the call will conclude with a Q&A session.\n\nBefore we continue, please know that today's discussion will contain forward-looking statements made under the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties. As such, the company's results may be materially different from the views expressed today.\n\nFurther information regarding these and other risks and uncertainties is included in the company's prospectus and other public filings as filed with the U.S. Securities and Exchange Commission. The company does not assume any obligation to update any forward-looking statements except as required under applicable law. Please also note that Huya's earnings press release and this conference call include discussions of our audited GAAP financial information as well as audited non-GAAP financial measures.\n\nHuya's press release contains a reconciliation of the unaudited non-GAAP measures to the audited most directly comparable GAAP measures. I will now turn the call over to our VP of finance, Ashley Wu, who will read today's prepared remarks on behalf of Mr. Dong. Please go ahead.\n\nAshley Wu -- Vice President, Finance\n\nHello, everyone. Thank you for joining our conference call today. I'm pleased to deliver the following brief remarks on behalf of Mr. Dong.\n\nAlthough macro headwinds continue to impact during the third quarter of 2022, we managed to further grow our active user base year over year and quarter over quarter and improve our top and bottom line on a sequential-quarter basis. Our total net revenues were approximately RMB 2.4 billion, and our non-GAAP net income was RMB 106 million, for the third quarter. In terms of user growth, Huya Live's average mobile MAUs reached 86 million for the third quarter, a low single-digit increase from a relatively high base in the summer of last year due to the heavy app promotion. This growth is encouraging, particularly as we have implemented more stringent marketing channel spending strategies to help contain costs.\n\nAlso, our efforts to enhance user interactive experience and offer attractive gaming and entertainment content not only contributed to the increase in user scale, but also through user engagement across our platform. In the third quarter, users' average daily time [Audio gap] And the app's next month user retention rates stabilized at above 17%. Next, let me share with you some updates about our product and technology advancements. We have been embracing the trend of virtual livestreaming, including developing digital humans and providing avatar live broadcasting tools on our platform.\n\nIn addition, we have recently focused on further integrating virtual streaming technologies with our broadcasting section. Our goal here is to create more immersive viewing experiences and inspire more interesting interaction and high-quality content production for our users. Specifically, we recently introduced a Virtual Live House tool on Huya's mainly open platform. It brings streamers a new livestream in which the image and action of the streamers are automatically recognized.\n\nThe background and the streamer can also be separated and cut out, which lets streamers transform the livestream to a performance stage where they can sing, dance, and play musical instruments on the virtual stage. The audience also has their virtual characters that they can control and use to interact with the streamer. This feature has been well received by our broadcasters. And during the summer, more than 100 virtual events were held on our platform, including live concerts and [Inaudible] which strengthens bond between broadcasters and users.\n\nMoreover, by partnering with the game CrossFire and building on virtual reality technology, Huya launched the industry's first virtual viewing feature for tournaments live broadcasting during the finals of CrossFire Pro League in August. After entering the virtual esports venue [Inaudible] for this game, users were able to choose which games they wanted to support, create an avatar, wear the corresponding team uniform, and get together with fellow viewers. In addition to watching the competition, users could also freely move their avatar around the venue and [Inaudible] the scenes in the game, just as you would in a life event. Additionally, users could express support for their favorite team by sending out virtual firework gift.\n\nAs the competition evolves, so does the background of the venue, bringing the audience an even more immersive competitive atmosphere. This new viewing feature gains solid traction, spurring a 30% increase in viewers' engagement in interactive activities during the finals. In the 2022 season of League of Legends World Championship over 2022, which just ended earlier this month, we also initiated several industry-leading upgrades. First, building on our success in the CrossFire event, we set up an enhanced virtual venue specifically designed for [Inaudible] 2022 to provide an immersive virtual viewing option.\n\nWe also extended the HDR-capable display support for match viewing to improve our mobile app, webpage, and PC clients for both livestreaming and on-demand video, offering users more precise game scenes across different devices. Furthermore, we introduced a tournament assistant feature for the event that greatly simplified users' ability to obtain tournament-related information. It allows users to access the historical match data covering teams and players, their skill, values, and other key data in real time without leaving the live page. Users can just simply touch their mobile screen or moved the mouse over a player's profile image or team name.\n\nDuring the [Inaudible] 2022, many matches were played late night or early morning in China due to the time zone differences. In addition to [Inaudible] the replay videos of those competitions were very popular among users [Inaudible] of last year's event. We still [Inaudible] 13 top spots in our video ranking. Meanwhile, we introduced incentive activities to encourage original video content creation in relation to the [Inaudible] 2022 theme.\n\nThose UGCs are available in this tournament discussion of our Tiger chit-chat community, allowing users to easily participate in event discussions and interaction. With all of our efforts and operational expertise in esports, Huya continues to achieve leading market share for this highly anticipated event. Following the domestic livestreaming regulation introduced in May, our tech support product and operation adjustments impacted our livestreaming revenues. As a result, our domestic livestreaming revenues in Q3 slightly decreased by low single digit compared with the second quarter.\n\nWe have been working to mitigate the impacts by dramatically adjusting our monetization strategies. We will also continue to comply with regulations and improve our corresponding technologies and operating practices to support the healthy and sustainable development of our platform. In summary, we believe our restless effort to improve livestreaming technologies, explore new product features, and enrich our quality content will help us better engage with our users. These measures are designed to place us in a stronger position to capture future opportunities in the game and livestreaming market.\n\nIn light of the persistent challenging market conditions, it is also vital for us to continue to exercise prudence and strengthen our business and financial foundation. We will strive to further optimize our operations throughout the organization and maintain our competitive edge while we continue to navigate the fluctuating market. This concludes Mr. Dong's remarks.\n\nNow, I'll continue with some updates on our content enrichment and diversification. In the fourth quarter of 2022, we broadcasted [Inaudible] third-party professional esports tournaments. The most popular, including the summer season of League of Legends Pro League, LPL; King Pro League, KPL; and CrossFire Pro League, CFPL; as well as ESL Pro League Season 16. Notably, the number of peak concurrent user of the LPL summer improved by 57% compared with the previous addition.\n\nAs we continue our ROI-led strategy for tournament procurement, we have fewer licensed esports tournaments in the third quarter of 2022 compared with the same period last year. However, total viewership of those events reached approximately 660 million, representing a growth of 12% year over year. On the front end of our self-organized esports tournaments and entertainment PGCs of shows, we are broadcasting 23 events during the third quarter, generating total viewership of approximately 100 million. The first series of Honor of Kings and the Peacekeeper Elite all start to mark up.\n\nBoth our major Huya-branded tournaments continue to perform well this summer, demonstrating the appeal of our mobile esport event. It is also worth to mention that our long-standing Huya Kung Fu Carnival, a mixed martial arts competition, now on its sixth season and become a inferential IP for us, linking the live broadcasting industry and the physical sports. This time, the event also features competition in the virtual setting [Inaudible], setting elements of Chinese traditional culture. It was well received by our audience with the number of event viewers on our platform almost doubling compared with the previous season.\n\nLet me provide some updates on our operational optimization efforts. Beginning in April, we strategically adjusted our overseas business to allocate resources to key areas. This initiative has been resulted in a more streamlined and efficient business, narrowing our operating loss in this segment. We are looking forward to further benefit from this adjustment in our overseas business.\n\nAdditionally, in the fourth quarter, our optimization initiative with broadcaster-related costs and bandwidth usage help us to reduce the quarter's total costs, driven by savings from sales and marketing expenses. We are encouraged by the decline in total operating expenses in Q3, saving approximately 37% year on year. Next, moving on to our Q3 financial details. Our total net revenues were RMB 2.38 billion for Q3, a decline from RMB 2.98 billion for the same period last year.\n\nLivestreaming revenues were RMB 2.02 billion for Q3 compared with RMB 2.6 billion for the same [Inaudible] this year. The decrease was primarily due to a decline in the number of paying users and average spending per paying user of Huya Live as the recent macro and regulatory environment adversely affecting paying-user sentiments. Advertising and other revenues were RMB 361 million for Q3 compared with RMB 374 million for the same period last year, primarily due to soft demand for our advertising services resulting from the challenging macro environment. In Q3 2022, content licensing revenues make a relatively large contribution to advertising and other revenues, mainly due to the fact that revenue from licensing of esports tournaments broadcasting rights are recognized according to event schedules and experienced fluctuations between different periods.\n\nCost of revenue decreased by 17.6% year over year to RMB 2.04 billion for Q2, primarily due to [Inaudible] sharing fees and content cost, as well as bandwidth costs. Revenue-sharing fees and content costs decreased by 15.7% year over year to RMB 1.79 billion for Q3, primarily due to the decrease in revenue-sharing fees associated with the decline in livestreaming revenues and lower costs related to content creators. Bandwidth cost decreased by 35.4% year over year to RMB 115 million for Q3, primarily due to improved bandwidth cost management, continued technology enhancement efforts, as well as less overseas bandwidth usage as a result of the strategic [Inaudible] I would like to [Inaudible] 2022 broadcasting revenue [Inaudible] period last year [Inaudible] Gross profit was RMB 342.4 million for Q3, primarily due to lower revenues. Gross margin was 14.4% for Q3.\n\nExcluding share-based compensation expense, [Inaudible] was RMB 351 million, and non-GAAP gross margin was [Inaudible] for Q3. Research and development expense decreased by 16.7% year over year [Inaudible] for Q3, primarily due to decreased personnel-related expenses and share-based compensation expenses. Sales and marketing expenses decreased by 45.8% year over year to RMB 124 million for Q3, primarily due to decreased marketing and promotional fees, as well as personnel-related expenses. General and administrative expenses decreased by 1.8% year over year to RMB 79 million for Q3.\n\nOther income was at RMB 44 million for Q3 compared with RMB 95 million for the same period of 2021, primarily due to lower tax refunds and government subsidies. As a result, operating income was RMB 12 million for Q3 compared with RMB 83 million for the same period of 2021. Interest and short-term investment income were RMB 72 million for Q3 compared with RMB 63 million for the same period of 2021. Income tax expenses were RMB 20 million for Q3 compared with RMB 41 million for the same period of 2021, primarily due to lower taxable income.\n\nShare of income in equity method investments, net of income taxes, were RMB 0.05 million for Q3 compared with RMB 379 million for the same period of 2021, primarily due to the investment income related to a disposal of equity investment in the third quarter of 2021. Net income attributable to Huya Inc. was RMB 60 million for Q3 compared with RMB 524 million for the same period of 2021. Non-GAAP net income attributable to Huya Inc was RMB 106 million for Q3 compared with RMB 180 million for the same period of 2021.\n\nNon-GAAP net margin was 4.5% for Q3. Diluted net income per ADS was RMB 0.25 for Q3. Non-GAAP diluted net income per ADS was RMB 0.44 for Q3. As of September 30, 2022, the company had cash and cash equivalents, short-term deposits, short-term investments, and long-term deposits of approximately RMB 11 billion, compared with RMB 10.7 billion as of June 30, 2022.\n\nWith that, I would now like to open the call to your questions.\n\nOperator\n\nThank you, management. We will now begin the question-and-answer session. [Operator instructions] One moment for the next -- first question. We have -- our first question comes from the line of Yiwen Zhang of China Renaissance.\n\nPlease proceed.\n\nYiwen Zhang -- China Renaissance Securities -- Analyst\n\n[Foreign language] So, thanks for taking my questions. I have a couple of questions. First one is regarding the LOL S12 tournament performance. So, much did it help you on the traffic side? And then, secondly, a related question will be how do you evaluate your tournament cost versus benefit? Thank you.\n\nRongjie Dong -- Chief Executive Officer\n\n[Foreign language] S12 ended early November. During this year's event, we once again maintained our leading market share throughout the entire tournament. Although the event was held in the United States, and the time zone difference between China and the U.S. had a certain impact on the users watching the live broadcast, the overall viewing data of our core users remained stable, especially some key data even improved.\n\nThese achievements came as a result of our continuous optimization of the technical products and operations and our years of experience in cultivating the esports content. [Foreign language] More specifically, Huya has brought several industry-leading live broadcast technology product upgrades to this event, and these differentiated services has further enhanced the users' viewing experience. These include the establishment of S12 exclusive virtual live house, the expansion of HDR-capable display support for a live broadcast, and video-on-demand viewing on app, webpages, and PCs, and the realization of user-selected voice commentary through the online audio real-time analysis technology. Based on the in-depth cooperation with TJ Sports, we have also added to the tournament assistant feature, which greatly simplified viewers' access to historical match data.\n\n[Foreign language] In addition, our cooperation with the League of Legends and the League of Legends manager continues to be welcomed by users. At the same time, the Tiger chit-chat community that we have launched earlier covers video and graphic communications, which is conducive to users' participation in the event-related discussions. And the creation of events-related videos and other content allow a more in-depth participation from the users. [Foreign language] As a top-tier tournament, S12 has a positive effect on the user traffic of the overall queue for our platform.\n\nBut this year, due to the time difference of the event and other reasons, its effect on mobile MAU may not be as obvious as in previous years. And of course, the user level is also subject to other factors such as post-summer seasonality and other activities.\n\nAshley Wu -- Vice President, Finance\n\n[Foreign language] Let me answer the cost and revenue impact of the event. The cost of S12 tournament is indeed relatively high, and the competition took place mostly in Q4. So, it brought about a significant increase in our Q4 content costs. This is similar to the seasonality impact of S11 on the content cost last year.\n\nSo, it might also affect our overall Q4 costs and margins. In terms of revenue, the direct income from live events is still relatively small. Of course, this year, we have made more attempts in business promotion and cooperation and launched some innovative events-specific virtual gifts. In the future, we'll continue to explore the diversified approach for monetization.\n\nAs we mentioned before, for some important content, we not only consider short-term direct costs and income, but also focus on its impact on user value, brand image, platform cooperation, and etc. At the same time, we'll continue to strive for better terms of cooperation to achieve long-term benefits. Hi. That's not -- please take the next question.\n\nOperator\n\nThank you, management. One moment for the next question. I'd like to invite the next questions from Thomas Chong of Jefferies. Please proceed with your question.\n\nThomas?\n\nThomas Chong -- Jefferies -- Analyst\n\n[Foreign language] Thanks for taking my questions. My question is about the different outlook about livestreaming revenue. And on the other hand, given the macro backdrop these days, what are the measures that will be taken to mitigate the impact coming from the reduced user spending? Thank you. \n\nRongjie Dong -- Chief Executive Officer\n\n[Foreign language] Thank you for your question. Recently, the monetization of our domestic live broadcast business has been affected by the overall macro environment and adjustments based on the latest industry regulations. This relative weakness of the game industry and the lack of new major game titles for a long time have also had a certain impact on the game live broadcast businesses. So Q3's live broadcast revenue declined at present due to the continuous impact of the above reasons.\n\nWe will keep an eye on the trend of livestreaming income changes. [Foreign language] Although there are still some uncertainties in the macro environment, we'll pay more attention to the improvement of the company's own capabilities to continue to optimize the content and technological products and serve our users well by providing rich content in games, esports, and other entertainment, bringing users and content creators with better experiences. For example, in the third quarter, we further upgraded the application of virtual live broadcast technology on our platform. Through our Virtual Live House scene, the streamers can intensify their interactions with the users.\n\n[Foreign language] As we launched the industry's first virtual tournament live house in August, which fully upgraded the experience of watching the event, these technologies bring uses a new viewing and interaction experience, making live broadcast content more interesting and are also conducive to the introduction of novel interactive gameplay and monetization scenarios. We are also optimizing the video content ecology of the platform. And through the synergy believe -- between the live broadcasters and the video content, we can prolong the duration and add to the richness of our user content consumption. In addition, we'll also continue to strengthen the compliance capabilities of the platform and invest in corresponding technologies to establish a better foundation for the long-term healthy development of the platform.\n\n[Foreign language] On the whole, with users, streamers, games at the core, we'll continue to improve the user interaction indicators and retention rate through more immersive, more community-based, and more interactive product strategies so as to gradually increase the consumption power of the users on the platform.\n\nAshley Wu -- Vice President, Finance\n\nThank you. Can we have the next question, please?\n\nOperator\n\nCertainly. One moment for the next question. Our next question comes from the line of Lei Zhang from Bank of America Merrill Lynch. Please proceed.\n\nLei Zhang -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] Thanks, management, for taking my question. Two questions here. Firstly, can you share with us your esports content strategy for next year? So, when we have our investor allowed this year? And secondly, how should we look at our revenue-sharing ratio trend? Thank you.\n\nAshley Wu -- Vice President, Finance\n\n[Foreign language] As far as esports content strategy is concerned, overall, we will continue to strive for the copyright of mainstream high-quality esports events in the market in the year 2023. And at the same time, we will remain as selective as we had been this year. The ROI of the project is analyzed and evaluated in detail and dynamically adjust our strategy according to the market situation. At present, the acquisition of the copyright of the main event for the next year has not yet been decided.\n\nThe specific form also depends on the decision of the copyright owner and the negotiation with each broadcasting platform. If there is any, major update, we will also synchronize with the market in time. [Foreign language] The overall competitive landscape of game livestreaming has not changed significantly recently. Huya continues to maintain its leading market share in the field.\n\nSince the beginning of this year, our streamer revenue-sharing ratio remained relatively stable. And through more detailed data analysis, we have achieved some savings in the signing costs. We expect this trend to continue in the short term, and of course, we will keep optimizing the cooperation fee structure with the streamers. At the same time, by providing them with more comprehensive training, support, and services, such as providing operation analysis tools, promoting diversified income channels for streamers, and strengthening the binding partnership between streamers and platforms in order to maintain and strengthen the competitiveness of Huya platform for life broadcasters.\n\nThank you. Let's have the next question, please.\n\nOperator\n\nOne moment for the next questions. Our next question comes from Ritchie Sun of HSBC. Please ask your question.\n\nRitchie Sun -- HSBC -- Analyst\n\n[Foreign language] So, I'll translate it myself. My question is about overseas business. So, we have been tweeting the strategy recently. And can management update us on the progress and specifically on revenue and also the losses? And what is our goal into 2023 for this business? Thank you.\n\nAshley Wu -- Vice President, Finance\n\n[Foreign language] As we mentioned before, based on the changes in the domestic and foreign market environment, we have made strategic adjustment and optimized the Nimo TV business since April. With concentrated resources on the development of key overseas regions, it is hoped that by optimizing costs and expenses to reduce the loss of overseas business and achieve overseas business sustainability. Major adjustments are now largely completed with reduced business operations in some -- certain regions. So far, we have achieved some initial results, although overseas revenue and user scale have been affected to a certain extent.\n\nOverseas business has become more focused, and the amount and proportion of losses have also significantly reduced. [Foreign language] In addition to live game broadcasting, we also provide richer [Inaudible] entertainment content as well. At the same time, with more localization work, we can provide characteristic interactive features and operational activities targeting the local markets. With these results -- efforts, we hope that overseas business can achieve self-sufficiency, businesswise, as soon as possible.\n\nAnd moreover, we'll also dynamically adjust the operation strategy according to the overall market environment. In the future, we hope to Nimo being able to broadcast live games around the world as a key participant in the market.\n\nThank you. Next, please.\n\nOperator\n\nOne moment for the next question. The next question comes from Brian Gong from Citi. Please proceed.\n\nBrian Gong -- Citi -- Analyst\n\n[Foreign language] I will translate myself. Thanks, management, for taking my question. My question is regarding -- about cost and margin trend. Can management elaborate the progress of cost and expense optimization? How should we expect margin trend ahead? And also, can management share -- give some updates on latest -- latest collaboration with Tencent? Thank you.\n\nAshley Wu -- Vice President, Finance\n\n[Foreign language] Since the beginning of this year, we have made continuous efforts to control costs and improve operational efficiency. From overseas, strategic adjustments to more focused strategies for our domestic businesses and, at the same time, increased the effective use of technical resources. We have achieved some initial results. In the third quarter, streamer-related costs, as well as bandwidth costs, were both optimized.\n\nAnd the total operating expenses for the quarter were down approximately by 27% year over year, driven by sales expenses savings. [Foreign language] Therefore, on the premise of maintaining the stability and leading edge of our core businesses, we'll continue to implement cost reduction measures, including ROI optimizations of streamers and event content and livestreaming's operating expenses. This will also help us to better consolidate the company's businesses and financial foundation in a current environment to support the long-term development. As mentioned earlier, due to the large-scale events, the margin level of Q4 this year might expect a loss, but we expect also that the subsequent profit margin level will gradually improve. [Foreign language] In addition to continuing to promote cost reduction, Huya will also actively explore any upgrades to our business ecology products and commercialization in the future.\n\nBased on, but not limited to, live broadcast, we'll keep strengthening our profit level by enhancing the monetization ability.\n\nRongjie Dong -- Chief Executive Officer\n\n[Foreign language] The cooperation between Huya and Tencent continues to be actively carried out. And there is close cooperation in games, events, content, and products, specifically in terms of the combination of games and interactive features. By continuously deepening the interaction of the account data, users can interact and flow between the platforms. [Foreign language] In terms of in-depth cooperation in games and tournaments, Huya and the League of Legends mobile game have collected products -- collaborated in product promotion as well as operation and community, including jointly building in-game livestreaming and interactions, and in the promotion of the League of Legends Esports Manager game in cooperation with LOL with major tournaments, such as LPL.\n\nInteractions in a live broadcast room will lead to Huya's exclusive virtual props provided by the game owner. And all this will help us to improve the user experience and consolidate Huya's leading position in these games.\n\n[Foreign language] Our technology and operation know-how and accumulation in the audio, video, and game content industry is conducive to more and deeper collaboration with Tencent Group, which will also help promote an upgrade of our company's business format and model.\n\nAshley Wu -- Vice President, Finance\n\nYeah, that's all for our answers.\n\nOperator\n\nQuestions -- I found no further questions. Now, I'd like to turn the call back over to the company for closing remarks.\n\nAshley Wu -- Vice President, Finance\n\nYeah. Thank you once again for joining us today. If you have further questions, please feel free to contact Huya investor relations through the contact information provided on our website or TPG investor relations. Thank you.\n\nOperator\n\nThis concludes today's conference call. You may now disconnect your line. Thank you.\n\nDuration: 0 minutes\n\nHanyu Liu -- Investor Relations\n\nAshley Wu -- Vice President, Finance\n\nYiwen Zhang -- China Renaissance Securities -- Analyst\n\nRongjie Dong -- Chief Executive Officer\n\nThomas Chong -- Jefferies -- Analyst\n\nLei Zhang -- Bank of America Merrill Lynch -- Analyst\n\nRitchie Sun -- HSBC -- Analyst\n\nBrian Gong -- Citi -- Analyst\n\nMore HUYA analysis\n\nAll earnings call transcripts"
}