{
  "companyName": "Amplitude, Inc.",
  "companyTicker": "AMPL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/amplitude-inc-ampl-q3-2022-earnings-call-transcrip/",
  "content": "Amplitude, Inc. (AMPL 0.33%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nYaoxian Chew\n\nHello, everyone. Welcome to Amplitude's third quarter 2022 earnings conference call. I'm Yaoxian Chew, vice president of investor relations. Joining me are Spenser Skates, CEO and co-founder of Amplitude; and Hoang Vuong, the company's chief financial officer.\n\nDuring today's call, management will make forward-looking statements, including statements regarding our financial outlook for the fourth quarter and full year 2022, the expected performance of our products, our expected quarterly and long-term growth, investments, and our overall future prospects. These forward-looking statements are based on current information, assumptions, and expectations that are subject to risks and uncertainties, some of which are beyond our control that could cause actual results to differ materially from those described in these statements. Further information on the risks that could cause actual results to differ is included in our filings with the Securities and Exchange Commission. You are cautioned not to place undue reliance on these forward-looking statements, and we assume no obligation to update these statements after today's call except as required by law.\n\nCertain financial measures used on today's call are expressed on a non-GAAP basis. We use these non-GAAP financial measures internally to facilitate analysis of our financial and business trends and for internal planning and forecasting purposes. These non-GAAP financial measures have limitations and should not be used in isolation from, or as a substitute for financial information prepared in accordance with GAAP. A reconciliation between these GAAP and non-GAAP financial measures is included in our earnings press release, which can be found in our investor relations website at investors.Amplitude.com.\n\nWith that, I will hand the call over to Spenser.\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nThank you, Yao. Good afternoon, everyone. Tuning in for our Q3 2022 earnings call. Amplitude delivered a strong third quarter.\n\nWe closed with $61.6 million in revenue, up 35% year over year. This was above the high end of our guidance. We are also delivering strong operating leverage and raising our margin outlook for the year, thanks to our disciplined investment approach. Dollar-based net retention was 123%.\n\nWe now have more than 1,900 customers. For those of you joining us for the first time, Amplitude helps companies build amazing products, drive growth, and win their categories. We are a digital analytics platform that gives self-service visibility into the entire customer journey. With Amplitude, teams can understand what product features are working, where users are getting stuck, and what actions lead to the right outcomes.\n\nNothing is more critical to driving digital revenue growth. Our land performance in Q3 was exceptional. It was our best land bookings quarter in Amplitude's history. New Amplitude customers include Zillow, Fox Broadcasting, Volkswagen, Volaris Airlines, Shell, and Ably.\n\nWe also had several large six-figure wins. Our customers tell us that Amplitude delivers better ROI than their existing solutions. We can provide insights that were not possible with other means, and our self-service approach is more scalable. However, the macroeconomic environment has clearly shifted.\n\nThis quarter was more challenging with regards to expansion and churn, and we expect these dynamics to persist through 2023 as our customers try to navigate the sudden whiplash from the pandemic to 2021 highs, to current macroeconomic weakness. We want to work with them to ensure their success. Hoang will provide more details on how the environment will temper our growth expectations in the near term. Against this, I'm confident that the need for digital analytics will drive long-term durable growth for Amplitude's business.\n\nOur unique approach to analytics at the behavioral level resonates deeply with our customers. We continue to gain share in our early growing market. When it comes to product data, companies are in the first inning. I speak with data leaders all the time, and I consistently hear from them that they're only 5% or 10% of the way toward completing their vision for leveraging customer data at their companies.\n\nThat includes some of the most sophisticated technology companies who are on Amplitude. We are helping shape an early category of software. We're seeing some signs that were even earlier in the category than we initially thought. Many of our new customers are digital natives who are already familiar with product-led growth, yet they still need Amplitude to understand their customer journey and build better product experiences.\n\nCompanies have spent a fortune for teams of data scientists and data engineers. Stopgap in-house tools, and frustrating legacy analytics solutions. The most common result is tedious data breadlines, where the entire organization is blocked on access to data by a few analysts. This means teams do not have an understanding of their customers, lack appropriate context for decisions, and are unable to build winning products.\n\nAmplitude's technology and self-serve approach gives organizations data that's trustworthy and robust enough to run their business on and that everyone can use. This unique combination enables customers to run their business in a data-driven way at scale. Improving your data helps you build an amazing product, drive growth, and win your category. BeReal, the social network app that went from 10,000 daily active users to tens of millions of daily active users in 18 months expanded its work with Amplitude in Q3 in order to keep up with its rapid growth.\n\nData is a central part of BeReal's culture. Almost all of its employees are in Amplitude daily. Alexis, their CEO, told me he spends several hours in Amplitude every day. For fundraising, he shows an Amplitude dashboard instead of a standard pitch deck because it shows how engaging his product is.\n\nBeReal's expanded use of Amplitude will help the team improve the product experience so more of their users create a daily habit. Companies don't just work with Amplitude because of where our product is today. They work with us because of how quickly our product gets better. We outship and out-innovate everyone in the space, and we are fanatical about being responsive to customer needs.\n\nWe released more than 30 new features in Q3. They're all aimed at helping companies make more informed decisions faster. One of the features I'm most excited about is cart analytics. Typically, a user's product behavior and their purchase behavior on different systems.\n\nAmplitude brings this together cohesively. This lets teams analyze performance down to the SKU level and discover opportunities for product combinations and cross-sells. We also launch starter templates to give users a better out-of-the-box dashboard experiences and new integrations with Slack and Miro to bring key metrics to the collaboration tools that our users live in every day. These updates are all about making it easy for anyone to benefit from Amplitude.\n\nData tables, which we talked about last quarter, has already become one of the most top five used features in Amplitude. This is a great example of us leading with first-to-market innovation. We're the only digital analytics vendor with this type of multidimensional analysis. Finally, we're also doubling down on our core and product analytics.\n\nFirst, we're investing in design and user experience to extend Amplitude's ease of use and accessibility. Our goal has always been to make Amplitude's No. 1 ranked product analytic solution, the essential platform for product data, engineering, and growth leaders alike. These new investments will help every potential user, regardless of technical know-how.\n\nWe want everyone to be able to crawl, walk, and then run with our digital analytics platform. Second, we're making significant engineering investments to help customers track data more cost effectively and extend our structural cost advantage over our peers. We hear our customers' concerns in a cost-conscious economic environment and desire to track large volumes of data in a cost-effective manner. We are also investing in greater transparency to help our customers better track usage and drive confidence for scale.\n\nWe believe this approach, combined with continued product innovation, will make Amplitude even more valuable. Amplitude's CDP, which went GA at the end of August, has well-exceeded internal expectations. It's still too early to give you more specifics, but this is an important part of our platform value proposition and approach to innovation. CDP will make it easier to get up and running with Amplitude and remove duplicative spend for our customers.\n\nExperiment now includes support for low latency use cases by local evaluation and real-time monitoring to improve test outcomes. Better performance for customers means more iterations, more tests, and better results. We continue to see strong external validation for Amplitude's leading position in the market. We're mentioned in Gartner's Hype Cycle for Customer Experience Analytics report.\n\nAnd Amplitude ranked No. 1 in nine categories in the G2 Fall 2022 report, including No. 1 in product analytics for the ninth quarter in a row and No. 1 in mobile app analytics for the fourth quarter in a row.\n\nWe also ranked No. 3 in digital analytics for the seventh quarter in a row. Amplitude was also recognized as an insights and analytics category leader in Snowflake's inaugural Modern Marketing Data Stack Report. We have hundreds of joint customers driving significant value using our Snowflake integrations, and we'll be continuing to focus on deepening this partnership.\n\nOur go-to-market evolution continues with new experienced leadership. As part of this evolution, I am thrilled to welcome Tifenn Dano Kwan as our new chief marketing officer. Tifenn was previously CMO at Collibra and Dropbox, and she held numerous marketing leadership roles at SAP, including a CMO of SAP Ariba and a SAP Fieldglass. We knew Tifenn was the right leader for Amplitude because she has an amazing track record for driving product line growth, expanding pipeline, and building strong teams.\n\nI'm excited to have her onboard. As we continue to add leadership, we're focused on improving our execution across go-to-market, including improved approaches to sales operating cadence, pipeline hygiene, accurate quarterly forecasting, better enablement, detailed inspections of top accounts with more engagement and accountability, and value-based selling. These are all muscles that we are building so that our go-to-market strategy and efforts can match a world-class product. I'm pleased with the progress the team is making and the results they delivered this quarter.\n\nWhile we have many of the ingredients in place, our path to greatness here will not be done overnight. We'll continue to invest in and grow our organization to get us there. Numerous deals this quarter were catalyzed by changes in Google Analytics. I think it's important to clarify why Amplitude is superior as more companies move over.\n\nAt its core, Amplitude's focus is always on product and growth workflows. We give the most critical insights into the entire customer journey. This is different from Google Analytics, which only focuses on marketing workflows. Technologically, we built the propriety columnar database that allows us to perform complex distributed joints.\n\nThis means we can deliver behavioral insights on what drives growth in ways that other systems can't. Our customer data infrastructure layer also ensures data easily comes in, unifies, and stays high quality. Our customers can then take action on these insights, making better product decisions through data-driven experimentation and audience activation. Customers who have moved also tell us we had a significant edge in collaboration and usability.\n\nAmplitude works better for casual data users and expert analysts alike. New business trends remain encouraging. While there's greater scrutiny on buying decisions, product analytics continues to be seen as a must-have. Data and analytics continue to rank high in the spectrum of IT prioritization.\n\nThere's growing appreciation of Amplitude's unmatched ROI and a widening opportunity set for competitive replacements. In addition to some of the big wins I mentioned earlier, other Q3 lands include Teladoc, Holiday Inn Club Vacations, and H-E-B Grocery. We also had notable customer expansions in Q3, including NerdWallet, BeReal, Miro, MaxRewards, and AllTrails. I'm going to share a few customer stories from the third quarter that show what drove some of these wins.\n\nOne of the Q3 wins I'm most excited about is Zillow, the most visited real estate website in the United States. After using a page-based analytics solution for years, the Zillow team decided to work with Amplitude to better report and measure the full online and offline customer journey. This sets up Zillow to achieve two big goals. First to expand the data-driven culture that it's been building for years.\n\nWith Amplitude, over 200 product and marketing team members will be able to ask and answer critical questions without having to write a sequel, without having to wait for data scientists to get an answer for them. Second, Zillow wants to connect their app and website to buying a home. They want to know what features a customer used that drove them to make a transaction. Amplitude will help the Zillow team's surface trends connect specific features to those outcomes and continue to innovate.\n\nA part of the Volkswagen group, Elli, is creating a holistic energy and charging experience for electric car drivers and dealers. Until now, the team had little understanding of how customers were using its apps, what features were working, or whether users were getting stuck. In Q3, Elli started working with Amplitude Analytics to establish a more data-driven product management strategy for its three white-label apps. With Amplitude, the Elli team will be able to track user conversion rates, validate user journey hypotheses, and ultimately increase app subscription rates.\n\nBrainly, the most popular education app in the world, with more than 300 million users, started working with Amplitude last year. With a cross-platform view of its customer journey, Brainly discovered that people who use its instant answers feature at least five times are far more likely to buy a subscription. With this insight in mind, the Brainly team adjusted the product experience to make this feature more accessible and as a result, increased free-to-paid conversions. Now, Brainly is expanding its work with us to include Amplitude experiment.\n\nIts team has always had a culture of experimentation, but now, its nontechnical teams will be able to set up product tests and analyze outcomes at a much faster pace. While it will be challenging for the near term, I view this time as an incredible opportunity for Amplitude. Our digital analytics platform is getting better every day. We are even earlier than we thought in our markets.\n\nOur customers love us and want to do more with us over the long term, and we have the flexibility to play offense to set us up for long-term success. We have done a lot in the one year since becoming public. We've won more than 500 new customers and announced our biggest set of product launches in company history. We are investing in our people.\n\nWe are building a world-class team, and we are setting the foundation for sustainable, durable growth. You know, at a recent company All Hands, I asked our team what is the most important determinant of long-term success. What I told them is that persistence trumps everything else. How long do you stick on something day after day, month after month, year after year? While it has been an eventful year in the public lands, it's also been an eventful decade since our founding.\n\nWe've been hard at work here at Amplitude since we started this company 10 years ago, and I expect to be hard at work for decades to come. Thank you for your interest in Amplitude. I now like to turn it over to Hoang to walk us through the financial results.\n\nHoang Vuong -- Chief Financial Officer\n\nThanks, Spenser, and thanks again to everyone for joining us today. Third quarter revenue was $61.6 million, up 35% year over year. Customer count was also up 35% year over year to 1,913. Dollar-based net retention was 123%.\n\nIn the third quarter, we flexed our superior product position and strong execution to deliver our best land booking quarters ever. We signed numerous large deals, thanks to our go-to-market and product teams. They did a tremendous job in highlighting competitive differentiation in showing how Amplitude helps our customer build amazing products, drive growth, and win their categories. It is also worth mentioning that more than a quarter of our land in Q3 had Google Analytics as the incumbent solution.\n\nWe started 2022 with a goal of driving longer-term contracts and attaching new products. We're excited to see more large customers signing multiyear deals. We also crossed a significant milestone of 10 million in ARR from both experiment and audience products in just one year. This is strong validation and execution of our strategy, especially in this macroenvironment.\n\nWe mentioned the potential headwinds in the economy during our last earnings call, and we saw the following specific impact in Q3. Expansion bookings were lighter than expected as some of our customer business load and budget scrutiny remain elevated. We saw higher churn from small businesses who were unable to pay and partial churn increase as customer rightsized due to budget or utilization. If we look past the near-term headwinds, our growth vectors have not changed.\n\nWe will work to continue to acquire new customers around the world, expand across our existing customer base, and extend our product leadership in an early and underpenetrated market. We are confident that we can continue to navigate this environment and come out even stronger. We're seeing results from prior investments and managing the business for long-term sustainable growth. We're in a great position to stay aggressive and win the digital analytics category.\n\nGeographically, revenue from the U.S. increased 26% year over year to 37.4 million in Q3, or 61% of total revenue. International revenue increased 52% to 24.2 million or 39% of total revenue. As a reminder, we invoice primarily in U.S.\n\ndollar. So, the strength of the dollar does not have an FX impact on revenue, but it does have a negative impact on new business. Total RPO increased to $248.1 million, up 63% year over year. Current RPO also increased to $183.9 million, up 46% year over year, or approximately 74% of total RPO.\n\nOur strong growth in RPO benefited from a steady increase in multiyear deal. Next, I'll be discussing non-GAAP results for Q3 going forward. As a reminder, our GAAP financial results, along with a reconciliation between GAP and non-GAAP results, can be found in our earnings press release and supplemental financials on our IR website. Gross margin was 74%, up more than 300 basis points year over year.\n\nWe saw upside to gross margin this quarter with us achieving another credit from our hosting provider. We expect to continue to operate in the range of 71% to 74% in the near term. Turning to operating expenses in a quarter. Sales and marketing expense was 45% of revenue, compared to 43% of revenue in Q3 2021.\n\nR&D expense was 23% of revenue compared to 19% of revenue in Q3 2021. As planned, we continue to hire across all function at the more measured pace that we had planned for. Our strong discipline delivered an operating loss of $4.9 million or negative 8%, beating our guidance of negative 16% to 17%, and compared to a loss of $2.3 million or negative 5% in Q3 2021. Net loss per share was $0.03 based on 112 million shares, compared to a loss of $0.05 with 39.3 million shares a year ago.\n\nCash, cash equivalents, and marketable securities were $306.6 million at the end of Q3. Note, this now includes $59.4 million in U.S. Treasury bonds classified as noncurrent. Free cash flow was negative $3.9 million or negative 6% of revenue, compared to negative $15.8 million or negative 35% of revenue in a year-ago period.\n\nAs a reminder, last year, cash flow included $10.9 million indirect listing expenses paid in the quarter. Now, onto our outlook. As always, our guidance reflects the most recent customer conversations, spend environment, and event volume trends. Here's how we're thinking about some of the financial impact to the model.\n\nHeightened economic stress will cause more full and partial churn. We expect the impact on customer account to be larger than the impact on revenue as we see more churn with smaller customers. As a reminder, more than 70% of our revenue come from companies spending more than $100,000 a year. We are expecting lower event volume base expansion as customer growth slows.\n\nOur base case is that higher churn and lower event volume base expansion will persist through the first half of 2023. If the environment continues to deteriorate, the shape of the curve could be longer. Given the net retention rate is a trailing 12-month number, we expect it to decline. For the fourth quarter, we are expecting revenue between $62.5 million and $64.5 million, representing an annual growth rate of 28% at the midpoint; non-GAAP operating margins of negative 10% to 11%; non-GAAP net loss per share to be between $0.03 and $0.04, assuming shares outstanding of approximately 113.3 million.\n\nFor the full year 2022, we are raising our revenue guidance between $235 million and $237 million with an annual growth rate of 40% to 42%. This is higher than our prior guidance, a range of $232 million to $236 million due to our Q3 wins. We expect non-GAAP operating margins to be between negative 11% to 12%, a marked improvement versus our prior guidance of negative 15% to 16%. And we expect non-GAAP net loss per share to be between $0.21 and $0.22, assuming shares outstanding of approximately 111.6 million.\n\nIn summary, we delivered strong Q3 results amid the challenging environment. We remain incredibly well-positioned to win in digital analytics. We're in a position to invest as others are retreating. And as always, we're focused on long-term sustainable growth.\n\nWith that, we look forward to your questions. Over to you, Yao.\n\nYaoxian Chew\n\nAs a reminder, please limit yourself to one question and one follow-up in the interest of time. [Operator instructions] Our first question comes from Michael Turits of KeyBanc. Michael?\n\nMichael Vidovic -- KeyBanc Capital Markets -- Analyst\n\nHi, this is Michael Vidovic on for Michael Turits. But thanks for taking my question and congrats on the quarter, guys.\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nThanks, Michael.\n\nMichael Vidovic -- KeyBanc Capital Markets -- Analyst\n\nOn the CDP side, you talked about exceeding expectations internally. I know you're not giving specifics, but I'm curious if you could talk about what draws customers to your CDP versus the competitors. And then are those customers generally replacing an existing CDP provider, or they didn't have one to begin with usually?\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nIt's both. So, I think, first, in a macroenvironment like this, you're getting a bunch of spend consolidation where you're trying to eliminate multiple vendor spend and come on to us, something like an Amplitude. And so, being able to have a CDP and experiment offering, as well as a whole bunch of other stuff on products and marketing analytics helps us drive that. I think with H-E-B Grocery was actually example of they came on net new to Amplitude for the first time and they bought -- decided to buy the full stack outright.\n\nThey didn't really have anything in place already. They had a bunch of people who just joined the company that had been previous Amplitude users and another company decided to go all in with us from the start. We are seeing other places where we're already on the analytics and then they're adding in CDP either because they don't have one or to replace an existing vendor. So, that's definitely happening, too.\n\nAnd so, I think from my standpoint, definitely a lot of strong data points in terms of traction from that, as well as experiment.\n\nMichael Vidovic -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thank you.\n\nYaoxian Chew\n\nGreat. Next question comes from Clarke Jeffries at Piper, followed by Elizabeth Porter. Clarke?\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nHello. Thank you for taking the question. You know, first, I wanted to dig into the, you know, the highest quarter for new land bookings in the company's history. You know, could you dig into any industry or driver that really enabled that? And this is the first quarter of sub-100 net add in 2020.\n\nSo, you're able to still net that strong quarter and new land even with a lower amount of customers. And so, you talked about how contract values were trending the new drivers of strength there.\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nYeah. So, let me break that down for you. I think on one of the big trends that we're seeing is that I think historically it was only very sophisticated, more bleeding-edge technology companies that were big adopters of Amplitude. So, this would be, you know, the DoorDashes or the Atlassians or the Intuits or HubSpots of the world.\n\nThat have already embraced this way of building product, and we're kind of ready to go when they first met us. I think what we're seeing is more of the kind of average or majority technology company. I called out Zillow, which was a fantastic land in Q3. We had a record -- another record deal that was actually an eight-figure deal for multiple years with a household tech company name.\n\nAnd so, that was exciting to see. So, I think you see this change from early adopter tech companies to more of the majority tech companies. And that's something that's happening in a big way now. I think, on the -- in terms of total number of customer adds, I think it's definitely a more challenging environment for some of the long-tail and smaller- and earlier-stage start-ups, where the funding is not like it was in 2021.\n\nAnd so, because of that, a lot of them are cutting back on resources and spend decisions and things like that. And so, that's how I net those two things out.\n\nHoang Vuong -- Chief Financial Officer\n\nHey, Clarke. I just want to make a correction there. I think Spenser mentioned there was six-plus figure deal, it was not an eight-figure deal. So, I don't want to [Inaudible] we're overreacting to that.\n\nI do think the only thing I would add to that is what we're seeing in terms of acquisition of new customers, both last quarter and this quarter, you're starting to see some companies -- you naturally think of it being digitally native. So that's why we're saying we're so early in this market. Filing a company that you would think they've already been doing product analytics and digital analytics for a long time, going, \"Hey, wow, maybe this isn't the best way,\" whether it's their in-house solution or they were using some existing marketing solution, going, \"Hey, is there something better,\" as they evaluate and they discover Amplitude and they're moving over to us. And, obviously, those digital companies have a lot more event volume.\n\nThey already have an existing digital business. And so, that's helping our land value. And as you pointed out, our new add did decrease relative to prior quarter, but a big chunk of that also had to do with churn from smaller businesses, as I mentioned, they're unable to pay.\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nGreat. And then just one follow-up, Hoang. Another quarter of 48% CRPO growth, could you walk us through the divergence between revenue growth and CRPO growth? And ultimately, would you expect them to converge over the near term?\n\nHoang Vuong -- Chief Financial Officer\n\nYeah. So, I would ask you to focus on the revenue growth. I mean, obviously, as I mentioned on the CRPO is benefiting from the multiyear and so as you kind of reach some kind of plateau in a multiyear area is that you may actually see a flip between revenue and CRPO. And so, I would focus on the revenue growth.\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nAll right, perfect. Thanks very much.\n\nYaoxian Chew\n\nGreat. Next question from Elizabeth Porter, followed by Arjun Bhatia.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nThank you so much. I wanted to ask on the NRR. So, we could see that bigger decline and just because it is a 12-month rolling number. We don't usually see that much kind of quarter-to-quarter change.\n\nSo, I was hoping to provide -- you called out a couple of headwinds, but just a little bit more color on where you're seeing kind of more of that pressure, the churn versus the upsell? And any sort of qualifiers on what we should think about for the floor? Is there a risk that that number goes kind of below what we saw in the first half of 2021? Thanks.\n\nHoang Vuong -- Chief Financial Officer\n\nYes. Thanks. It's great question. I think Spenser mentioned this in his prepared comments in terms of the whiplash.\n\nI think what you're seeing is in 2021, we had some customers who really drove a massive expansion as their business grew and kind came back from COVID and post-COVID. I think what we're seeing actually in 2022 is the actually a combination of two things. One is expansion kind of being a lot less from those existing customer base and at the same time, you've also seen churn. We obviously mentioned in Q1, we had some high term both with Twitter and also us deciding not to do business with Russia and Ukraine.\n\nSo, I think what you start seeing is you've got really high expansion that drove a lot of growth in 2021 and then you got lower expansion combined with higher churn as caused by the current macroeconomic and some of the things that happened in Q1, that's kind of play into that net retention rate.\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nYeah. The only thing I'd want to add to that is, I think, from my standpoint, we want to do the right long-term thing for all our customers. And so, I think some of them may have overambitious projected out 2021 growth rates for the very long term. And so, a lot of them are asking us to rightsize spend.\n\nI don't think we're getting a lot of churns in that segment. And so what we want to do, all of them have confidence that they're going to increase their spend with Amplitude long term, and we're -- so we're deploying different levers to help them out, whether from helping them track the ROI that spend better by seeing what data is being used, who is using it to, selling -- getting them additional products if they're not getting all the usage that they want out of core analytics, or in some cases, decreasing the volume that they're doing with Amplitude.\n\nHoang Vuong -- Chief Financial Officer\n\nI think Spenser makes a good point there. We did the same thing in early 2020 when first COVID first hit us. And you guys probably saw when we obviously went public, we published out a net retention rate of like 116, I believe, at that time. And I think the right thing is always to do the right thing for the customer because ultimately, you're going to expand into other business unit, other product lines, they're going to go and buy experiment an audience in CDP.\n\nAnd so, we love the future of where it is, and we're going to do the right thing for the customer in today's environment.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGotcha. That makes a lot of sense. And for my second question, I just wanted to ask on the operating margins, really nice expansion that you got in the quarter. Is the pulling back on any of those expenses, is that more of a reaction to the macro or something more structurally and permanent? And also, just a little bit more color on what were some of the biggest areas of improvement that drove that leverage?\n\nHoang Vuong -- Chief Financial Officer\n\nYeah. I'll kind of talk through a few things actually because at the end of the day for us, we've always operated very efficiently. I mean if you look at our operating margin from last year and we're actually spending more -- we're actually increasing our investment in product development. We were at 19%, we're now at 23%.\n\nAnd so, we're actually investing in the increase in expenditures actually for this particular year centers around investment priority development. Some stuff, kind of, obviously call it post-COVID and returning to office, and also doing event like Amplify. And so, we're actually investing and spending. Some of the cutback that you're seeing is actually as a result of us kind of bringing in new leadership and them saying, \"Hey, let's take a pause on things we know are not working, so that I can actually redeploy and use them on new bets and new things that I think we're working even better.\" And we never want for spend, just to spend.\n\nThat just seems silly. And so, I think our ability to turn our operating margins, and, obviously, our gross margin is at a very solid number of 74% compared to where we were before. Somebody wanted us gaining us three points. And then us also being much more prudent around our investment spend to make sure that we put more into things that are working and then taking off of things that are not.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nYaoxian Chew\n\nGreat. Arjun from Blair, you're up, followed by Koji Ikeda from Bank of America. Arjun, please.\n\nArjun Bhatia -- William Blair and Company\n\nAwesome. Thank you. Spenser, and maybe this one for Hoang, actually. Just want to clarify one thing.\n\nOn churn, are you seeing churn in larger customers outside of Twitter? And is it true churn, or is it down-sell? And then just last one on this topic. As customers do churn, whether it's SMB or enterprise, what are they going to? Are they just saying, \"We don't need anything?\" Are they going back to their in-house system, going to GA? What's the replacement for Amplitude that they do decide to shut it down?\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nYeah. Let me take this one high level and then I can let Hoang fill in on some of the details. So, the biggest reasons are either companies or business units getting shutdown or going out of business, or lack of ability to secure implementation resources. We almost never see someone kind of go backward in the maturity journey.\n\nIt's not like folks are going to Google Analytics or just saying, \"Hey, I'm going to go try to build this in-house after having not been successful with Amplitude.\" And so that never happens. And so, I think for us, it's about making sure customers get implemented, customers get set up. That's a huge focus of Thomas and Lambert and team in terms of what we want to try to drive in this environment. The other thing is, from our customers, I think there is an expectation even for the ones rightsizing that they will continue to grow with us long term.\n\nI just talked to current six, seven-figure customer a few weeks ago that was like, \"Hey, I want to be conscious about how we're spending over the next year\" because they're going through spending reevaluation internally in their company. But their expectation is that in out years in 2024 and beyond that they'll continue to grow with us as they have since they've started with us five years ago. And so, for -- on the customer side -- it's not -- from a competitive standpoint, we feel really well set up. We're always kind of the product that's the most innovative bleeding edge in terms of what we're able to do.\n\nHoang Vuong -- Chief Financial Officer\n\nYeah. I mean the only thing I can add for you there, obviously, like you said you do see churn coming from small businesses that are unable to pay, I think the large enterprise customer, the only time they really do churn is that they really have not kind of adopted into our solution. Because if you're leaving -- to answer your question, there's no word -- they're not going to go back to something else. It's really either they're going out of business or they're just not going to get those questions answered.\n\nI do think that for the good customers, what we're seeing because of the macro environment is that they have a much tighter budget. And so, they may actually be looking at the data that they're sending in and trying to figure out ways to optimize that. Now we're actually taking a very different stance on it, which is we're saying, hey, great, we -- let's help you. I think Spenser mentioned this in the prepared remarks, we're trying to work around giving more visibility to the data owner to understand how they're using the data, what data has high value because again, we help them, we believe it would be better off in the long run.\n\nAnd so, it means that in the near term, they like, hey, I got budget constraint. I got to figure out how to save a dollar here, a dollar there. We're actually trying to help them identify which events may not be used and how you can actually do it smarter. And so, that's going to cause some near-term issues.\n\nBut in the long term, I think the health of the relationship is going to be really strong.\n\nArjun Bhatia -- William Blair and Company\n\nYeah, absolutely. That makes a lot of sense. And then just when we -- when you think about the coming quarters and even going into next year, the Google Analytics opportunity, are you expecting that to ramp up, or is the -- is what you're seeing now in terms of the impact on new customers and the migrations that are taking place. Is that kind of a steady state that you expect to contribute over the next few quarters?\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nI'd say -- I don't know, I mean, a third of our new customers coming from Google Analytics is already pretty significant. And so, I think we'll expect to continue to see that over the next few quarters. I mean, Google just announced that they're extending the sun-setting date for Universal Analytics because a lot of their customers are unhappy. And so, I think that will continue.\n\nOur focus there in terms of being the bridge from previous generation tool to Amplitude, we'll continue to bear fruit and be successful. That's a huge part of why we built out a whole bunch of marketing analytics that we talked about on last quarter's earnings call. And so, I expect to see lands. Now, will it grow even more? I certainly hope so, and we're investing in that way in the business in that way?\n\nArjun Bhatia -- William Blair and Company\n\nAwesome. Thank you very much\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nThanks, Arjun.\n\nYaoxian Chew\n\nGreat. Next question from Koji Ikeda, followed by Nick Altmann from Scotia. Koji, please.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking the questions. Great to see you, Spenser and Hoang. I wanted to ask you a question on billings.\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nSame to you, Koji.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Wanted to ask you a question on billings. So, I recall back in the second quarter, there was kind of a $10 million pull forward and that would help back quarter but affect this third quarter. So -- but I guess even after adding back that $10 million, the third quarter billings would still be -- I mean, we calculate roughly 23%.\n\nSo, a pretty big decel from what we've seen in the past. And then when you look at that compared to the billings growth 60%, and Hoang, I do realize that you just had focus on revenue, but billings has been really topical out there and with this big but delta. I just want to make sure we're understanding any sort of volatility or what could be causing volatility in the billings and how it could potentially affect the forward growth trajectory.\n\nHoang Vuong -- Chief Financial Officer\n\nThanks. First of all, as we said last time, our billings in Q2 actually grew 57% quarter to quarter. And so actually, that was a very strong billing quarter. And a big piece of that was obviously that you mentioned, the $10 million that we obviously moved to the renewal base, but we actually had a really large expansion happen in the month of April in Q2.\n\nAnd some of those customers are actually supposed to renew in Q3. And so yes, from a billing standpoint, we grew 4% year over year for Q3, referring to the fact that a big portion of that renewal base moved over Q2, we're actually -- that billion was actually a little bit higher than we were expecting.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nOK. OK. So -- \n\nHoang Vuong -- Chief Financial Officer\n\nAnd the last thing, I would -- one last piece just to remember on our billings, we tend to -- just as a reminder, we billed the following month, right? So, we don't bill in the same month. So, then we actually obviously have bookings that actually happened in the month of let's say, September, they're going to be billed in October, or if your contracts get started in October, you're not going to go down into October. And so that's another factor to catch into where the billing is going to come in. So, our billing will be pretty lumpy when you look at quarter over quarter and something like that.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. OK. Understood. And then I wanted to ask you a question on international just really thinking about 40% of revenue for you guys is coming international, and Hoang, you mentioned you priced in USD.\n\nSo presumably, it's a lot -- it's getting harder for international customers to buy the product. So just taking forward, if FX persists at these kind of levels, how are you thinking about packaging pricing internationally to help alleviate any sort of FX headwinds, international sales cycles?\n\nHoang Vuong -- Chief Financial Officer\n\nThis is actually -- it's not just international that we're looking at this. It's for the entire customer base. One of the big opportunities in 2023 for us is we're going to be focusing more on a product-led growth motion, which includes a self-service and a whole bunch of other things to allow customers to get started at lower price points or more easily with Amplitude as we get into next year. And so that's going to be -- that will allow someone to say, \"Hey, let's start small, prove out some ROI, and then grow with us over time\" is going to be one of the big levers as we look to next year.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks, guys. Thanks for taking the questions.\n\nHoang Vuong -- Chief Financial Officer\n\nYes, sure.\n\nYaoxian Chew\n\nNick Altmann from Scotia, followed by Claire Gerdes from UBS.\n\nNick Altmann -- Scotiabank -- Analyst\n\nYeah Great. Thanks, guys. I'm curious if you've seen sort of any change from customers, either on the net new side of the equation or at renewal, just in terms of their event volume commitments, right? Like just given the macro environment, I'm curious just from a customer perspective, are they taking a little bit more of a conservative approach to their event volume commitments and so perhaps, maybe there's going to be more overages in the future? Or have you guys not really seen more sort of scrutiny on upfront commitments at renewal or even on the net new side?\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nYeah. So, it tends not to happen as much on the net new side. It really is on the renewal side that there are some customers that are putting a bunch of pressure on how much -- what event volume they're doing. That's why I mentioned that we're going to be doing a whole bunch more on the tooling side to give better transparency into the value, as well as helping them find other places that we can help drive that value.\n\nI think for event volume, one of the other big things is customers want to know that as they continue to scale with us, we'll scale with them. And so that's another big area of investment for 2023 is we're going to be doing a whole bunch there so for very, very large volume customers that we're able to track more of the data because the more data we can track the more value that we're able to provide.\n\nNick Altmann -- Scotiabank -- Analyst\n\nGot it. Then can you just talk about how overdues have trended as of late and whether those have been sort of impacted given the macro? And as a follow-up, I guess, is it sort of pertain to your guidance philosophy? Do you typically embed a certain level of overdues in your guidance, or is that typically the driver of upside?\n\nHoang Vuong -- Chief Financial Officer\n\nYes. Nick, I'll take that one. Overdues for us is a relatively very small percentage of our revenue, call it, under 2% or so. Because obviously, what typically happens is if customers are going over, they'll actually end up renewing and expanding under contract.\n\nAnd that's why we saw, for instance, in Q2 such a large expansion happened early in that quarter in the month of April, which is those customers were already over. And so, again, our No. 1 priority is partnering with the customer. And so, we're not trying to get them from overdues.\n\nWe obviously -- it helps us to have the right contracts so that we can do a better job of planning and executing on that side. But we haven't seen kind of a, call it, again, it's such a small percentage. We've always seen a big increase or decrease per se on the overdues. It's been fairly consistent.\n\nIf anything, it may have gone down slightly because some of those large customers already expanded, like I said, in April. So that after those expansions, always tend to go down slightly, and then they begin to build up again. But it's such a small percentage of it.\n\nNick Altmann -- Scotiabank -- Analyst\n\nGot it. Yeah. Thank you.\n\nYaoxian Chew\n\nThank you. Next question from Claire Gerdes from UBS, followed by Tyler Radke from Citi. Claire, please.\n\nClaire Gerdes -- UBS -- Analyst\n\nGreat. Thanks for taking the question. So sorry to go back and harp on billings a little bit. But is the softness in the more a reflection of invoice timing or is it all related to the more flexible payment terms, maybe or changes in duration given the macro? And then, as a second part, as well, if billings on an adjusted basis for the pull forward, it's kind of in the low 20s.\n\nShould we think about it as a leading indicator going forward to potential revenue growth next year or maybe not?\n\nHoang Vuong -- Chief Financial Officer\n\nYeah. So, a couple of things on billing. Again, the timing of the billing in terms for us does matter. And so, therefore, the timing of the bookings also matters.\n\nIn Q2, our linearity of that booking happened to be more front-end loaded in the quarter. In our Q3, more of our bookings were more back-end loaded. And so now, being back-end loaded is actually more normal and typical for us. And so that's why we were talking -- even though we don't guide on billing, if we were -- as I mentioned earlier, I think our billion actually kind of was a little bit higher than we thought.\n\nBut that has a lot to do with our linearity of where they happen. And so, as they happened in the end of the quarter, they'll get billed in the following quarter.\n\nClaire Gerdes -- UBS -- Analyst\n\nOK. Great. Thank you. And maybe you don't want to touch on the low 20s comment, but could that be used as kind of a leading indicator for rev growth, or since it's going to be so variable quarter to quarter, not something to focus on too much?\n\nHoang Vuong -- Chief Financial Officer\n\nYeah. I mean I would point you to what we guided for Q4 in terms of our guidance for that quarter. I think we're guiding to a midpoint like 28%. And as far as the fiscal year 2023, obviously, we'll wait until the early part of next year to provide guidance on that as we kind of continue to monitor the environment.\n\nClaire Gerdes -- UBS -- Analyst\n\nOK. Thank you.\n\nYaoxian Chew\n\nGreat. Next question from Tyler Radke. Tyler?\n\nTyler Radke -- Citi -- Analyst\n\nYeah. Hi, good afternoon. Thanks for taking the question. I wanted to touch just on the go-to-market side.\n\nSo, obviously, there's been some new changes to sales leadership. Just curious if how you're thinking about maybe some of the changes for next year as you're going through the planning cycle, whether it's from an overall messaging or just how you're thinking about organizing or compensating the salesforce? And then secondly, if you could just comment on your overall visibility into next year? I know RPO has been outgrowing current RPO. So, you are seeing multiyear contracts, but -- just give us a sense ofn how your visibility has improved and how we should think about next year. Thank you.\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nYeah. So first, I'm really excited that Thomas is here. I mean, he's already driven a lot of changes within the organization, up-level leadership that we have across the board. So Tifenn, our new CMO, who I mentioned, very excited that he brought her in.\n\nMultiple hires across sales ops leadership, sales leadership, enablement, a few other areas. And we'll continue to evolve the team. I think the way I think about setting it up is we're building out the leadership from -- to take us from here to $1 billion in revenue, and that's a new kind of stage for us as a company. Obviously, we've done a great job in kind of getting us here, but now it's about how do we build the machine that executes for the next few years.\n\nIn terms of the different areas -- I mean, from sales comp, we always love compensating great salespeople [Inaudible] So, if you want to make a lot of money, come join us here at Amplitude. And so that's an area that we're always evaluating how to reward great sellers and great sales performance and we want to make sure to set people up well there. I think there's a lot, just generally on the execution that we're focused on improving. So, I mentioned a whole bunch of areas during the prepared remarks, forecasting pipeline growth, enablement, inspection on top accounts, and things like that.\n\nAnd so, I think while we're -- I'm seeing a lot of great improvement there. Thomas has only been here for a few months, and so there's still quite a ways for that to play out as we go forward over the next few quarters.\n\nHoang Vuong -- Chief Financial Officer\n\nAnd Tyler, to address your question on visibility. I think it's a little bit of a mixed bag. I think, obviously, we're really excited by the fact that we actually have more multiyear and you see it in our RPO. And then we're also starting to see some really great traction on the land side.\n\nBut I think also the macroeconomic kind of pressure on both -- kind of both partial churn and full churn on those customer base, it's kind of -- this is a given in some of those clouds, too. And so, at the moment, it seems like we're always chasing one thing and then something else has changed. I think like if you were to ask me earlier in the quarter, we felt -- I'm sorry, earlier in the year, we felt really good about a lot of things. And then the question around land was actually going to be more like, \"Hey, how is that going to come out? How is that going to play out?\" And as we kind of put a lot of energy and execution on that, you're starting to see the benefit from that.\n\nAnd now, obviously, the macro is causing some of those things that we weren't really expecting. And so -- but we're going to work and manage through those, too.\n\nTyler Radke -- Citi -- Analyst\n\nGreat. And then if I could just ask a follow-up on competition. So obviously, you touched on Google Analytics earlier, but just as we think about the reduced VC funding environment and obviously less capital formation. How are you seeing that change the competitive position with some of the privates out there if there's anything to call out? Thank you.\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nYeah. I mean we're still in a great competitive position. I think we continue to win a lot of the top-growing companies. I mean BeReal's a phenomenal example of that on the consumer side, where they've really taken off in a big way and their big Amplitude customers.\n\nAnd our focus is continuing on trying to win that. I think one of the big things, as I talked about, is like pricing and packaging to make sure that we have more options and opportunities for those people to come on to Amplitude. I think the value in them is not just in the revenue, but that a lot of those companies are the most bleeding edge when it comes to how they think about what data they're looking at and how they're using that to drive product. And so, we want to make sure to be successful with them, which is why we're doing a bunch on the pricing and packaging front as well into making sure to be very specific about targeting the top-grown companies.\n\nA lot of them -- a lot of the larger companies, both in tech and nontech actually look to those start-ups when they say, \"How should I build out the data-driven product first culture?\" And so, it's super important for us to win. And so, we're continuing to do that, and we're -- that's always a top priority on our end.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nYaoxian Chew\n\nGreat. And with that, I'm seeing no further questions in the queue. We will be at the UBS Global TMT Conference in December. Details will be posted to the investor relations page of Amplitude's website at investors.amplitude.com.\n\nThank you very much for attending our Q3 earnings conference call. You may now disconnect.\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nThank you, everyone.\n\nHoang Vuong -- Chief Financial Officer\n\nThanks, guys.\n\nDuration: 0 minutes\n\nYaoxian Chew\n\nSpenser Skates -- Chief Executive Officer and Co-Founder\n\nHoang Vuong -- Chief Financial Officer\n\nMichael Vidovic -- KeyBanc Capital Markets -- Analyst\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nArjun Bhatia -- William Blair and Company\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nNick Altmann -- Scotiabank -- Analyst\n\nClaire Gerdes -- UBS -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nMore AMPL analysis\n\nAll earnings call transcripts"
}