{
  "companyName": "Sonos Inc",
  "companyTicker": "SONO",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/16/sonos-inc-sono-q4-2022-earnings-call-transcript/",
  "content": "Sonos Inc (SONO 1.56%)\nQ4 2022 Earnings Call\nNov 16, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Sonos fourth quarter and fiscal 2022 earnings call. [Operator instructions] I will now turn the floor over to Mr. James Baglanis, senior director of investor relations. Please go ahead, sir.\n\nJames Baglanis -- Senior Director, Investor Relations\n\nGood afternoon, and welcome to Sonos' fourth quarter and fiscal 2022 earnings conference call. I am James Baglanis, and with me today are Sonos' CEO, Patrick Spence; and CFO and chief legal officer, Eddie Lazarus. For those who joined the call early, today's hold music is a sampling from our holiday-inspired Sonos Radio station, Thankful. Before I hand it over to Patrick, I would like to remind everyone that today's discussion will include forward-looking statements regarding future events and our future financial performance.\n\nThese statements reflect our views as of today only and should not be considered as representing our views of any subsequent date. These statements are also subject to material risks and uncertainties that could cause actual results to differ materially from expectations reflected in the forward-looking statements. A discussion of these risk factors is fully detailed under the caption Risk Factors in our filings with the SEC. During this call, we will also refer to certain non-GAAP financial measures.\n\nFor information regarding our non-GAAP financials and a reconciliation of GAAP to non-GAAP measures, please refer to today's press release regarding our fourth quarter and fiscal 2022 results posted to the investor relations portion of our website. As a result -- as a reminder, the press release, supplemental earnings presentation, and conference call transcript will be available on today's investor relations website, investors.sonos.com. I will now turn the call over to Patrick.\n\nPatrick Spence -- Chief Executive Officer\n\nThank you, James, and hello, everyone. Earlier today, we announced that Eddie Lazarus, our interim CFO and chief legal officer, has been appointed as chief financial officer. Eddie has long played an active role in our strategic planning, and he knows the team and the intricacies of our business. His unique background brings a fresh perspective to the table, and he has already made tremendous contributions to our fiscal 2023 plan.\n\nI'm confident that we're in good hands with Eddie in the role. We will commence a search for a general counsel who will assume the day-to-day responsibilities of the legal organization, reporting to Eddie. Now turning to the state of our business. I would like to begin by sharing how proud I am of our team's tremendous efforts to navigate an increasingly challenging macroeconomic backdrop and deliver our 17th consecutive year of revenue growth.\n\nThough fiscal 2022 came in below our initial expectations, we were pleased to see trends stabilize in Q4, ending the year as planned. In challenging macroeconomic times, it is especially important to reemphasize the resilience of our business model and the economic foundation it provides. The unique Sonos flywheel consists of acquiring new customers, which we refer to as households. These households do two things.\n\nFirst, our households add more products to their home over time; and second, the members of these households become advocates who help us acquire additional new customers. Existing customers telling their friends and family to buy Sonos remains the leading driver of new customers. Our flywheel is proven and remarkably consistent over the past 17 years. Even in the midst of last year's many challenges, it continued to drive growth.\n\nWe added 1.4 million households in fiscal 2022, bringing the total installed base of Sonos households to 14 million. And we managed this despite supply challenges crimping our ability to attract new households through both product availability and an inability to run promotions. We are still in the early innings of our growth as our 14 million households represent just 9% of the 158 million affluent households in our core markets. As has been true year in and year out, our customers added new products to their Sonos systems.\n\nAverage products per household increased to 2.98 from 2.95 in fiscal '21, underscoring how the lifetime value of our customers continues to grow. And there's a lot more room for additional growth. 40% of our households are single-product households, whereas our average multiproduct household has 4.3 products. In other words, we are starting to get into the range we talked about at our Investor Day of four to six products for every mature Sonos household.\n\nWe estimate that converting our single-product households to the average multiproduct household install size represents a $5 billion revenue opportunity alone. Of course, this will not happen overnight, but it does highlight the long runway we have to further monetize our installed base. We're investing in the systems and programs to more aggressively go after this opportunity in fiscal 2023 and beyond. Now to recap our financial performance.\n\nIn fiscal 2022, we grew revenues 5% constant currency or 2% reported $1.752 billion. Gross profit was $796.4 million, down 2%, representing a gross margin of 45.4%, down 180 basis points. This was within our annual target range of 45% to 47% but slightly below our fiscal '22 guidance due to lower-than-expected gross margins in Q4. Adjusted EBITDA was $226.5 million, representing a margin of 12.9%.\n\nFrom a product standpoint, 2022 was an exciting year. We launched five products and services and completed three acquisitions. We have seen strong adoption of Sonos voice control since it launched in May. And Sonos Radio has become the No.\n\n1 most listened to service on Sonos and accounted for nearly 30% of all listening. Our products are resonating with consumers. In Q4, we saw both sequential and year-over-year improvements in our home theater market share in the U.S., U.K., Germany, and the Nordics, reaching our highest level of unit and dollar share in almost two years. The fact we are outperforming competitors and picking up share is a validation of our brand strength and category leadership.\n\nLast quarter, we discussed how Ray, our entry-level sound bar, underperformed our internal expectations upon launch. We are pleased to see that it is gaining momentum. And in the U.K. and Germany in Q4, it has become the top product in the entry-level home theater category by dollar share.\n\nOur newest product, the Sub Mini, is strong out of the gate. Since launching in October, it has garnered outstanding media reviews and is already a hit with customers as we are exceeding our initial sales forecasts. We expect this momentum to continue through the fall and into the holiday season as households build out their home theater system to enjoy sports, movies, and music at home. As you know, we've been committed to and executed upon delivering at least two new products every year since 2017.\n\nFiscal 2023 will be no different. We've already launched Sub Mini, and we plan to launch at least two additional products on top of that in the remainder of fiscal 2023. We have built a prudent plan balancing our commitment to profitability with an imperative to invest in the future in light of the exceptional opportunities we set ahead of us in the next few years. On the revenue side, I'd emphasize a few of the building blocks for our approach.\n\nFirst, we've taken a sober view of the macroeconomic conditions using the stabilized run rates we've been seeing over the past four months as a baseline. At the same time, we enjoy the benefit of the steady repurchase behavior we have observed in our customer cohorts. As I have said before, the buying patterns and repurchase rates of our 2020 through 2022 customer cohorts continue to behave like our pre-COVID cohorts. Based on past cohort repurchase behavior, we start each year with a line of sight to achieving 40% to 45% of our annual registrations target.\n\nThis sticky predictable revenue stream from our installed base is something that many other consumer electronic brands do not have. Based on these considerations, the improvement of our stock -- in-stock position, our return to normal levels of promotional activity, and the exciting new products we have planned for this year, in fiscal 2023, we expect to grow revenues between 1% to 7% constant currency at a 45% to 46% gross margin and deliver adjusted EBITDA of $145 million to $180 million, representing a margin of 8.5% at the low end and 10% at the high end. Eddie will give you more details about our assumptions, but I would just remind everyone that a very significant portion of the $79 million foreign exchange revenue headwind we expect in fiscal '23 flows through to detract from both gross profit and adjusted EBITDA. We are making thoughtful and targeted investments to drive our medium- and long-term growth while being mindful of the continued importance of delivering profitability.\n\nWe will grow our team at a significantly slower pace in fiscal '23 than we did in fiscal '22 as we have a lot of people in place to support the new categories we are pursuing. We know this runs against the grain when it comes to recent headlines, but it's important to keep in mind that we've been profitable the last four years and have not chased growth at all costs the way many of the companies you now hear about doing layoffs have. We have been and will continue to be profitable. The investments we are making are laying the foundation for Sonos to meet and exceed our long-term targets of $2.5 billion in revenue and $375 million to $450 million in EBITDA.\n\nWhile we are always cautious when talking about our product roadmap, we are investing in products that will allow us to enter four new categories, one of which we expect to announce in fiscal '23. We have a proven track record of gaining share when entering a new category, which underpins our conviction that we will gain a larger share of the $96 billion global audio market over time. And importantly, entering new categories will further diversify our business. Our investments are focused on driving our flywheel of new household acquisition and existing customer repurchases.\n\nThough our headcount is growing, we are tightening our belts, reducing discretionary spend, and doing some restructuring to make our teams more efficient. If we start following short of our targets in fiscal '23, we won't hesitate to adapt to the environment, prioritize our key initiatives and protect the profitability of our business. I am confident that we will emerge from this period of uncertainty stronger. Our flywheel of new household generation and household repurchase is working.\n\nAnd in the next few years, we will spin it even faster. We expect to accomplish this by focusing on three things: First, we will reset the bar in our existing product categories, further differentiating Sonos as the choice for premium home audio; second, we will enter new naturally adjacent product categories, as you have seen us do with portables; and third, we will expand our geographic reach, building out the beachheads we have already established in markets such as Japan, India, and LatAm. Executing on these strategies will accelerate our annual revenue growth to our previously achieved levels of low double digits with adjusted EBITDA in the 15% to 18% margin range. Now I'll turn the call over to Eddie to provide more details on our results and outlook.\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nThank you, Patrick, and hello, everyone. I'm delighted to assume the role of chief financial officer on a permanent basis. A whole finance organization and my colleagues across the board have done a wonderful job of helping me get up to speed and map out our fiscal year '23 plan. Just to level set, starting out my top three priorities are to ensure that we are making the right strategic investments to build upon our category leadership and drive long-term profitable growth, to drive efficiency in our operations and be a responsible steward of shareholder capital and to give the investing public better tools for understanding our business by adding some additional transparency to our disclosures.\n\nWhile I'll be transitioning out of the chief legal officer role, I will continue to oversee our strategy to defend our intellectual property and specifically, to hold Google accountable for their widespread infringement of our patents. Turning to our fiscal year '22 results. We grew revenue 5% constant currency or 2% reported to a total of $1,752.3 million. Foreign exchange was a $49 million headwind to revenue and a very significant portion of that headwind flowed through to reduce gross profit and adjusted EBITDA.\n\nOn a channel basis, retail and other, which includes IKEA and other business initiatives, declined 2% and was cumulatively 56% of our sales. After two years of exceptionally strong growth, direct-to-consumer revenues declined 5% due to softer demand in EMEA, the strengthening dollar, and limited promotional activity. DTC accounted for a healthy 23% of sales. Installer solutions revenue and this is a new disclosure for us, grew 28%, driven by strong demand for our Amp and Port products despite persistent supply challenges, as well as from geographic expansion.\n\nThe IS channel accounted for 21% of our sales. Heading into the holiday season, our retail channel was in good shape as we are well stocked, and our retail partners are pleased to see a return to our typical promotional activity. As for our other two channels, over the years, we've steadily diversified the distribution of our business to the point where our IS and DTC channels accounted for 44% of the business in FY '22, up 260 basis points from fiscal year '21. Importantly, these channels carry higher gross margins than retail.\n\nWe expect this positive mix shift to continue into fiscal year '23 and to support the higher revenue per product that we have seen in recent years. Let me take a moment to give you some additional color on our newly disclosed installer solutions channel. Households acquired through our installer solutions tend to purchase multiple high ASP products. We have said before that Amp is a critical product to this channel, and we are pleased to be in an improving supply position.\n\nWe continue to see robust performance in our installer solutions channel despite slowing housing activity in the U.S. home improvement activity remains solid, and our dealers have healthy backlogs. Moreover, we have plenty of room to grow this channel worldwide. At the moment, Americas represents more than 80% of our installer solutions revenue.\n\nBut both EMEA and APAC are experiencing meaningful growth as we invest in building our dedicated local teams in these markets. We expect IS revenues to continue to grow into fiscal year '23. Gross profit dollars declined 2% year over year, driven by 180-basis-points decline in gross margin to 45.4%. Gross margin was adversely affected by a number of COVID-related supply chain issues, including increased use of air freight, spot buys due to component shortages, and general component inflation.\n\nThese increased costs were partially offset by lower promotional activity and price increases that we announced in September of 2021. We estimate that airfreight and spot buys were 2.5 -- were a 2.5-point headwind to gross margin. Adjusted EBITDA declined 19% to $226.5 million, representing a margin of 12.9%. The 330-basis-point year-over-year decline in adjusted EBITDA margin was driven by lower gross margin, as well as operating expense growth of 8%.\n\nAs Patrick emphasized, we invested significantly in our future initiatives in FY '22 with an eye to ensuring increased growth and profitability over the long term. One contextual note before getting more into the details. Operating expense growth trailed our headcount growth of 21%, in large part due to paying our employees only a fraction of their annual bonus targets due to our annual results coming in below our targets. The lower bonus payout resulted in approximately $30 million of savings.\n\nNon-GAAP R&D increased 10%, primarily due to increased headcount and product development costs, and professional fees, partially offset by the lower bonus. Our software and consumer experience continues to differentiate our products, and we expanded our investment in this area. Non-GAAP sales and marketing increased 2% in line with revenue due to higher brand and marketing expenses, professional fees, and increased headcount, again, partially offset by the lower bonus. Non-GAAP G&A increased 19% due to increased headcount and continued systems and tools investment, particularly -- partially offset again by the lower bonus.\n\nThis increase includes a major investment to replace our legacy ERP system with the new system, which went live in the third quarter of 2022. Free cash flow was negative $74.5 million in FY '22 and adversely affected by our investments in inventory. In the first half of 2022, we made the deliberate decision to invest in inventory after being severely supply constrained throughout 2020 and 2021. Until the last month of the third quarter of 2022, we were on track to deliver revenue within our guidance range of $1.95 billion to $2 billion, and our supply plan reflected that expectation.\n\nUpon seeing demand soften, we made the necessary adjustments to curtail our purchasing. But given production schedules and long lead times, there is an inevitable lag before the inflow of inventory can be harmonized with run rate sales trends. As a result, our fourth quarter '22 inventory balance is $454 million, up 145% year over year. Within inventories, finished goods were at $407 million, up 163% and primarily driven by unit growth.\n\nWe expect to exit the first quarter in a much better inventory position, which in turn will improve our free cash flow. We ended the year with $274.9 million of cash and no debt. The decline in our cash balance was due to the $277 million increase in inventory that I just outlined, completion of our previous $150 million of share repurchase program, and $126 million of M&A, partially offset by the full year profitability of the business. We are taking actions to improve our cash conversion to enable us to allocate capital toward driving our long-term growth, as well as to return capital to shareholders and offset dilution from stock-based comp.\n\nToday, our board authorized a new $100 million share repurchase program, replacing our prior $150 million program which we completed in the fourth quarter of '22. We repurchased in all 6.6 million shares at an average price of $22.80. Now quickly on our fourth quarter results. We were pleased to see trends stabilize in the quarter and our revenue come in near the high end of our guidance.\n\nRevenue declined 7% constant currency or 12% reported to $316.3 million. Last quarter, we shared how we expected that constant-currency revenue would have grown year over year if we had been in stock on Amp and had not moved the Sub Mini launch into the first quarter of '23. That is exactly how it played out. To provide further transparency, in our earnings deck, we have disclosed quarterly registration trends for FY '22, as well as a monthly basis for the fourth quarter of '22.\n\nIn the fourth quarter of '22, total registrations grew 5%, and we expect that October was in line with this trend. Gross margin of 39.2% came in below our expectation of 40% to 42% due to increased reserves for excess component inventory. As a reminder, as we had foreseen, this quarter's gross margin was adversely affected by the timing of cost recognition for pricey spot market components. As I will outline in a minute, we expect to return to our target annual range of 45% to 47% gross margins in fiscal year '23.\n\nAdjusted EBITDA was negative $25.6 million due to lower revenue flow-through and a decreased gross margin. Non-GAAP operating expenses grew 2%, considerably below our end-of-period headcount growth, 21%, which reflects the lower bonus payout dynamic that I outlined previously. Now let me walk you through our FY '23 guidance. We expect revenue in the range of $1.7 billion to $1.8 billion.\n\nThat's between down 3% to up 3% year over year. As Patrick said, we are assuming demand trends consistent with where we saw stabilization in the past four months. We expect the stronger dollar to create a $79 million foreign exchange headwind with a significantly more pronounced effect in the first half of the fiscal year. For the full year, we expect constant-currency revenue to grow between 1% and 7%.\n\nNow to help you better model our reported revenue, our FX assumptions are as follows: the euro at $0.99 and the pound at $1.13. As a reminder, EMEA was 33% of our revenue in FY '22, and our FX sensitivity is about 4 euros to 1 euro to pound. Now we realized that the rates have moved a bit since we formed this forecast with the dollar weakening some and would note that a weaker-than-model dollar lessens the foreign exchange headwind to our reported revenues and adjusted EBITDA. We expect gross margin to land in the range of 45% to 46%, roughly flat year over year.\n\nWe do not expect to incur any airfreight, and our reliance on spot buy should decrease significantly due to our inventory position, as well as an improving supply environment. We expect that these significant tailwinds will be offset, however, by the combination of FX headwinds and our return to running a normal level of holiday promotions, which we have previously noted, is important to driving new household acquisition. We expect adjusted EBITDA of $145 million to $180 million, representing a margin of between 8.5% and 10%. As previously discussed, FX presents a significant headwind to adjusted EBITDA.\n\nOperating expenses are growing in excess of revenue due to, first, full year expense of hires made in FY '22; second, assumed bonus payout this year of 100% of target versus the fractional payout in FY '22; third, our strategic and targeted hiring plan for FY '23; and fourth, prudent investment in our product road map. As a reminder, the lower bonus payout resulted in $30 million of savings in FY '22. The incremental expense incurred by our FY '22 hiring is another $30 million. At the midpoint of our fiscal year '23 guidance, the $60 million represents approximately 75% of the year-over-year increase in GAAP opex dollars in fiscal year '23.\n\nThe remainder of the increase in opex is targeted hiring and product road map investment, which is a significant reduction in pace compared to FY '22. We're not in the business of growing opex in excess of revenue. And if revenue starts falling short of expectations, Patrick and I are fully prepared to take remedial actions. Overall, I'm committed to driving further efficiency in Sonos' business.\n\nFinally, taking off my new hat for a moment and putting back on my legal hat. I'll briefly recap the recent developments in our Google litigation. In our case against Google in Northern California, Judge Alsup has consolidated the trial on the three patents at issue and scheduled for May of 2023. He further ruled, even in advance of trial, that Google infringes one of the patents at issue.\n\nMeanwhile, we remain undefeated in Google's cases against Sonos, having obtained additional rulings of noninfringement in cases that Google filed in Canada and in the Netherlands, and having now invalidated two more Google U.S. patents before the patent trial and appeal board. We, of course, will defend the new cases Google has filed at the ITC with equal rigor. And with that, I'd like to turn it over to questions.\n\nOperator\n\nYour first question comes from the line of Tom Forte of D.A. Davidson.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat, thanks. First off, Eddie, congrats on being named permanent CFO. One question and one follow-up, and then I might get back in the queue for a couple more. So it looks like you're providing a new disclosure on your dealer channel.\n\nSo first off, thanks for the additional information. Second, how does your dealer channel compare and contrast with your retail and DTC channels?\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nSorry, Tom, what comparison did you ask for? I'm sorry, I didn't hear that one part of the question. It was a little mumbled.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nYeah. So new disclosure on the dealer channel, how does the dealer channel compare and contrast with your retail and DTC channels?\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nWell, as I mentioned, we get very high SP multiple product purchases in the installer channel, which is a great base for us. And we also get very good margins out of that channel. So, on those bases, we love growing that channel. And as I said, we're going to be growing that channel again in '23 and expanding that channel in both EMEA and in APAC.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nAll right. There's a quick follow-up on that one. Can I also assume that there's less marketing dollars devoted to that channel, so your contribution margin is perhaps the highest of the three channels?\n\nPatrick Spence -- Chief Executive Officer\n\nYeah. That's fair.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. Right. Then for my other question, and I'll get back in the queue. All right.\n\nSo, another consumer electronics company recently launched a complementary line of hardware outside its historical focus, which leverages the strong branded distribution, which is something I think Sonos could do. For example, at a high level, how married are you to solely focus on sound? Would you consider video? And then same for connected home hardware, beyond sound-related products?\n\nPatrick Spence -- Chief Executive Officer\n\nThanks for the question, Tom. We have a lot of opportunity remaining in audio. We know that people spend about $96 billion a year there. So, we have a lot of opportunity to keep expanding in audio and take more and more of that share.\n\nAnd you can bet that's what we're focused on. And I do believe that our brand is strong, and we have a lot of opportunity in other categories over time. But I also think that you need to be thoughtful in terms of how you move into those, how you do it for your own brand and build on your own brand strength and capabilities, and all of those things. But certainly, I believe the Sonos brand positions us to take more and more of that $96 billion in audio and even go beyond that in the long term.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nThank you, Patrick. Thank you, Eddie.\n\nPatrick Spence -- Chief Executive Officer\n\nThanks, Tom.\n\nOperator\n\nOne moment, please. Please stand by for your next question. Your next question comes from the line of Matt Sheerin of Stifel.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nHi, thanks. Good afternoon. A couple of questions from me. First, on the gross margin guidance for the year.\n\nCould you sort of walk us through how that looks in the December quarter and plays out through the year? Traditionally, I know seasonally, the gross margin is down because of promotional marketing and that sort of thing. But then, of course, you've got this inventory issue. So how should we think about gross margins playing out through the year?\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nWell, as I said, we expect gross margin to be basically flat year over year and within our target range of 45% to 47%. It's true that, of course, promotions do have an effect, but the inventory situation is not going to have an effect. We will be able to work through the inventory we have without doing any extraordinary measures. And so that's just going to play out over time.\n\nBecause we expected to have greater demand and based on the first half of last year, we developed this backlog when demand subsided a bit. But it's -- we're going to be in a much better position by the end of the first quarter. And as I said, it's not going to have a gross margin effect going on through the rest of the year. The big pluses for us on gross margin are going to be a reduction in these extraordinary supply chain costs that we've had, air freight, spot buys, etc.\n\nBut the headwinds will be the FX and the fact, as you pointed out, that we'll be doing our usual promotions this year, which -- so when you balance all that out, we expect to be basically flat year over year.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nGot it. Thanks for that. And then kind of same question on the opex side. You look like you've got some meaningful step-ups in expenses.\n\nOf course, the commissions being -- or bonuses being part of that. But could you tell us like where those buckets are in terms of the incremental costs? Is it mostly R&D and sales and marketing or across the board?\n\nPatrick Spence -- Chief Executive Officer\n\nYeah. Matt, it's Patrick here. The focus has been making sure that we're investing in our product, which is our engineering and product groups and operations group, to make sure that we can continue to scale and raise the bar in the existing categories and then expand into those four additional categories that I mentioned. And so that's really where we've focused the investment in those people, and we are definitely building for the long term with those investments.\n\nSo, you will see us -- as I mentioned, we're slowing the pace of investment in fiscal '23, and you'll see those pay off those investments that we've made in our people in R&D payoff in the future.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nOK. Just as a follow-up to that. Could you tell me what the headcount of the company is and expectations as you get through the year?\n\nPatrick Spence -- Chief Executive Officer\n\nWe're just over 1,800 now. And so, we'll be growing that slightly over the course of the year.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nOK. Thanks very much.\n\nOperator\n\nYour next question comes from the line of John Babcock of Bank of America.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nGood afternoon. I guess just to start out, broadly, given the macro volatility and also your guidance, I just want to get a little bit more clarity here. I mean it seems like your revenue range is relatively tight, but at the same time, the adjusted EBITDA range is pretty broad. So, I just want to get your thinking around this guidance and the key drivers there.\n\nPatrick Spence -- Chief Executive Officer\n\nWell, I think the -- we've assumed that our -- that we -- the trends remain stable, right, in terms of kind of where things are. So, we're not economists. We're not going to guess on what happens in the macro, of course, and we've been encouraged by the stabilization we have seen across Q4, and obviously, today, reporting that we got that right. And then on top of that, we layer in our expectations based on the resiliency of our customer base and what we've seen across the last 17 years in terms of repurchase rates, and then the new products that we have coming and how they factor in as well.\n\nAnd so, we've put all of those into the mix in terms of thinking about the year ahead and how we're going to perform from a top-line perspective. And then we factored in, as Eddie mentioned, hopefully, the transparency helps in terms of understanding we'll be in that gross margin range, our typical 45% to 47% range for this year but flat year over year based on what we can see right now and the give and take on component costs and some of the things that we won't have to incur that we did this year. Obviously, product mix goes into that as well, and factoring in some things on the new product front into all of that and then hashes out into the way that we're looking at the investments in the team, that bonus payout, FX all coming down ultimately to the bottom line in terms of where we are. So, I don't know, Eddie, if there's anything you want to add.\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nJust in terms of the spread, for what it's worth, we actually started out last year with a narrower spread on revenue of $75 million. This year, we went to $100 million precisely because of the uncertainty. So I actually think that the EBITDA flow-through to the adjusted EBITDA is actually in line with the fact that we're a little bit wider on the top line as well. So not really a deviation there.\n\nJust given the uncertainty, we have a little bit bigger spread on both ends.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nOK. That's helpful. And then given the broader environment, you talked a little bit about inventories, but just was wondering if you were able to provide any more color on where inventories are right now. Obviously, from the data, we can kind of tell where inventory is out of the quarter, but I want to get a sense onto how that has trended so far in the quarter and also if there's any detail by channel, for example, how much you guys are holding versus how much retailers are holding.\n\nAnything you can provide on that would be useful.\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nWhat I would say about that is that for the first time in three years, our retail channel is comfortably stocked for the holidays and for the promotions. We just haven't been able to do that over the last couple of years. And so, we're very pleased to be able to do that this year. It's too early in the quarter to provide really any color on what the ultimate sell-through is going to be on all of that.\n\nBut as I said, we're in a position to burn down a significant amount of the finished goods inventory that we have, by the end of Q1, get into a much more normalized position. So, we think the holiday season will rebalance where we are.\n\nPatrick Spence -- Chief Executive Officer\n\nAnd then, John, just the other thing I'd add on there is we -- you know our product cycle, as well as do most of you on the call. We're not like typical companies that are rushing to refresh or bring in a new season set of stuff. And so, our products are long lived. And so, we have time to sell through these products as well.\n\nSo, it's something that we're watching closely. We never want to put too much cash into that. But obviously, bouncing back from what we saw in the first half of last year and being in a position where we couldn't capture all of the sales that we would have liked, we feel like we're in a much better position for this holiday period.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nOK. Gotcha. And then just last question before I turn it over just on the Sonos Ray. I was wondering if you're seeing any signs of that cannibalizing the sales for the Beam, out of curiosity.\n\nPatrick Spence -- Chief Executive Officer\n\nYeah. Interesting question. No. And the home theater has been super interesting as a category because we've seen a lot of share gain with the introduction of Ray.\n\nBeam remains really strong. And so -- and Arc's right there as well, Sub Mini. So home theater is particularly strong right now, and it's been great to see both the reception to Sub Mini and Ray really taking that top spot across U.K., Germany, and the Nordics in the entry-level round. So, so far, no cannibalization.\n\nAs we think about taking more and more of that $96 billion in audio, I think it shows that having a good, better, best kind of range in these areas make sense and customers are responding to that.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nYour next question comes from the line of Erik Woodring at Morgan Stanley.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nHey, guys. Thank you for taking the questions. Maybe, Patrick, I'll ask my first to you and my second to Eddie. I think the slide that you show on the repeat purchase opportunity of $5 billion is extremely powerful.\n\nI'm just curious, do you guys -- have you been able to measure kind of how long on average it takes your multiproduct households to ultimately get to four products? And then like the second part of that is, if you haven't seen the single product households repeat purchase yet, what are they looking for and/or what do you need to do to get them to buy more products? And then I have a follow-up. Thanks.\n\nPatrick Spence -- Chief Executive Officer\n\nYeah. No, I'm glad you picked up on that, Erik, because we've tried to provide a little more transparency around that as well, and it's something we're very focused in on. As I mentioned, we've been investing in our CDP platform to actually understand this even better and give our DTC team the ability to go after customers in this way. And so, we've really -- in terms of -- I don't know how long it takes as we go through it.\n\nLike a specific answer for you and like we've talked about in the past, it differs depending on where you are. But I will say we've significantly increased the number of people that start with multiple products. Our DTC team has done a tremendous job this year putting together sets. So, if you're watching the sonos.com site, which I know many of you are, you'll see there's many more sets to get started with, and that's become a much bigger proportion of the sales that we're seeing through DTC.\n\nWe've just run as part of our early promo of sets promotion, and we saw really good take-up on that. And we know that people that are starting with more than one or even more apt to come back and purchase and do it more quickly. And so, what we've also learned through all of this is engagement is so critically important. And so, one of the things that we've been focusing on, and it's one of the reasons SVC and Sonos Radio are important investments is that if we can get people using it and using it pretty regularly coming out of the gate, we know that's as well correlated to people making a follow-on purchase and moving from single into multiple.\n\nAnd so, we're really, I think, coming -- we're making progress, and we've come a long way in terms of understanding some of those drivers and starting to put more focus into those and having kind of the systems and the teams in order to actually go after that. And so, I'm excited about the opportunity that's there. That's why we felt it was important to quantify that a little bit because I do think that's something that we're going to get better at in fiscal '23 and beyond.\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nAnd Erik, one of the interesting things about that particular metric is it's just a snapshot in time, right, because we're adding new households, some of whom will be single-product households all the time. And so, as some product -- single product households move up the chain into multiproduct households, others take their place in the queue. And so that's the flywheel dynamic we're trying to drive.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nYeah, totally clear. That's really helpful, guys. And then maybe, Eddie, my second question for you is if we just look -- or if we just assume that revenue in fiscal '23 kind of on a quarterly basis grows in line with normal seasonality, it would get you to that $1.5 billion of revenue. Obviously, you're guiding to something higher than that.\n\nAnd so, any dynamics you can share around seasonality that might look different than past years. And/or does this imply that there's revenue that maybe you weren't able to capture in the last few years because of shortages that was deferred or -- not deferred in an accounting stance, but just deferred to the future that you might be able to capture in fiscal '23? And that's it for me. Thanks, guys.\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nWell, I think it's very, very tough to look back and think through a seasonality curve because we were so supply constrained over the last year, we couldn't promote it all. And so, it's kind of distorted the way we see things. I can just tell you what the building blocks of our plan are, and we think that they're rock solid. As Patrick said, we took a very sober view of what the baseline should be, which is we took the last four months of run rate as the baseline.\n\nAnd that was, of course, a diminished level from the kind of revenues that we were seeing earlier. And then we looked at what our NPIs, our new product introductions were going to be for this year. We don't talk about a road map, but I'll just say that they're very exciting. And then we looked at the fact that we're in stock and we can promote.\n\nAnd then we also do a top-down view where we look at what we expect new household and registration growth to be and do a calculation based on that. And when we did the bottoms up and when we did the tops down, they really coalesce right around the guidance plan that you're seeing from us. So, we're not sure that looking back over last year's seasonal curve is really the right baseline. We think we took the right measurements.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nOK. I appreciate the color, guys. Thanks so much.\n\nPatrick Spence -- Chief Executive Officer\n\nThanks, Erik.\n\nOperator\n\nYour next question comes from the line of Brent Thill of Jefferies.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks. Patrick, most economists are kind of predicting things to get a little worse before they get better. So, when you're assuming kind of the baseline of what we're seeing right now, I guess, why not bake in a little more conservatism based on what's happening across many of the different sectors? Can you give us your thoughts or your perspective on that?\n\nPatrick Spence -- Chief Executive Officer\n\nWe're not economists, Brent. And I've been at these 25 years, and I think at this point, I'm not going to guess at where that economy goes, but I can look at like kind of where things are today and kind of what we've seen. And we took into account that step-down that happened in June, kind of what we've seen stabilize, and then we obviously take inputs from the channel, and we think about the product road map and everything that's happening. But right now, we feel it's most prudent to be able to plan.\n\nIt's why we've got a little bit of a wider range, as Eddie mentioned, in terms of going through it. And we'll adjust if we need to as we go through this. But I certainly feel like it's prudent where we are today. And I think if the pandemic has taught us anything, it's that we need to be nimble as we go through this period, and we will.\n\nSo, we'll be watching it very closely. You know we watch it daily because we got registrations and new household data. We're watching that very closely. And if we need to adjust along the way, we will, but we feel like this is a good plan based on what we've been seeing and then as well, of course, the new products that we have planned and coming in the year.\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nWe certainly have some humility around it. There's no question about that. But we also do see the data, and we did put some additional data into the investor deck this year, and I think I mentioned, which is we did show monthly registration trends for the fourth quarter. And we were very heartened by the fact that in July, we were up low single digits.\n\nIn August, we were up low single digits. And actually, in September, we were up low double digits. So, we just have to go on the information we've got. We didn't take a particular amount of joy in those numbers, but they did give us a little bit of confidence going into this year that things were, as we've been saying over and over again, really stabilized in the business.\n\nPatrick Spence -- Chief Executive Officer\n\nAnd the one other thing, Brent, the one other factor that as we think through this period, and we've seen this from the market share data over the last four months, is we believe that given our brand position, given the products that we have right now in our portfolio and what we have planned in the product road map, we can be taking share over this period as well. And so, we've seen that. We're going to plan to be able to do more of that. It's why we've been focused on building the brand we have, the portfolio we have.\n\nAnd certainly, that's something, I think, that we expect to continue to do.\n\nBrent Thill -- Jefferies -- Analyst\n\nAnd just a quick follow-up on the direct-to-consumer channel. I know you mentioned it was down. You've been making some really good progress and understand some of the factors. But it feels like you've got a lot more runway to take that higher as a Sonos customer, thank you for the Sub and Installed.\n\nIt just seems like there's an incredible opportunity to take that higher. Can you talk through the initiatives and what you're pushing there on the direct-to-consumer side?\n\nPatrick Spence -- Chief Executive Officer\n\nYeah. It's -- we're investing in really the systems and tools to understand our customers better and make sure that we can target on a more individualized basis as well and give each customer the right kind of offer based on the products that they have today and then we know what will make their experience better. And so, I would say that with that, we've been investing to have those systems, to have the team in place, and to be able to make these offers. And I think that will help us drive more growth in that channel, for sure.\n\nAnd as you know, I mean I expect that we should be able to, over time -- obviously, we've got the macroeconomic uncertainty right now, but over time, we should be able to drive growth in all of these channels as we go through it. But I do think that the investments we've been making in our systems and tools and our team in DTC set us up for more success in that channel.\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nYeah. Pretty tough comps. Two years ago, we were up 80-something percent. I think last year, we were up 47%.\n\nIt did dip a little bit, but that's really because retail so much -- opened up so much more around the world. But as Patrick said, we have very high hopes for being able to continue to grow in DTC.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks, gentlemen.\n\nPatrick Spence -- Chief Executive Officer\n\nThanks, Brent.\n\nOperator\n\nFor your next question, we will return to Tom Forte of D.A. Davidson.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. Thanks. So, three more relatively quick ones from me. So first one, how should we think about your ability to price locally to offset the impact of the strong U.S.\n\ndollar?\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nSo, just as a reminder, we did take price in September of 2021. And we always want to be careful about not double dipping too aggressively. But we're going to, of course, look at price, especially given the FX headwinds. And so that's something we'll revisit after the holidays, but we have nothing to announce on that.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. And then you sort of touched on this in your prepared remarks, but I was hoping you can talk about it a little more. So, a competitor is reportedly laying off staff in its hardware unit. From your vantage point, how has the competitive landscape changed over the past year? And is it possible that more companies with diversified business models may scale back their hardware efforts given the current challenging macro environment?\n\nPatrick Spence -- Chief Executive Officer\n\nYeah, Tom, it's Patrick. I do think that there's been rumors, obviously, of the kind of money that -- and we know that there's been some companies that have been in this space and using hardware as a way to get into people's homes for other reasons, right, other strategic purposes and other ideas they've had about potential services to layer on top that haven't panned out. And so, I do think you will see more sanity, quite frankly, return to the hardware space in general. And I think the path that we've been on around sustainable profitable growth is something that you see all companies scrambling now to be able to get to.\n\nSo, I like the fact we already have that discipline in our DNA. It's something we always have to keep working on. But it's why I believe that right now is an important time to continue to invest in R&D, continue to invest in product and actually go after additional categories because we can do it from a place of discipline, and we can come out of this stronger. As others are fearful, we can use it to get stronger and start to enter new categories as well and take more of that opportunity.\n\nAnd so, I do see this period as one of opportunity for Sonos and setting us up for even more growth than '24 and '25.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nExcellent. All right. So last question, I promise. I think this one is important though, because I think some investors misunderstand the relationship between maybe new housing starts and your sales.\n\nSo how should investors think about the sales of your products when consumers move versus when they remodel their homes because they're unable to move?\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nWell, I'd say that you've captured the yin and yang of it, right? The housing starts and movement for housing sales is down just at the moment. But at the same time, remodeling is up. And so, when you talk to our IS channel, which really handles a lot of that sort of thing, you find that they're very encouraged by what they're seeing in the remodel market. They have a healthy backlog of orders.\n\nAnd so, notwithstanding the temporary slowdown in housing starts and in the housing market itself because of the balance in that channel, we think we're in good shape.\n\nPatrick Spence -- Chief Executive Officer\n\nYeah. And certainly, all of those new homeowners from the last couple of years haven't yet outfitted their house with their sound systems and all of those things. And this is the perfect way to, really, in an attainable kind of way, be able to go out and make your home an even better place, right? Especially if there's pressures in other areas and as people maybe reduce travel and those kind of things after the swing back, then investing in Sonos to make your house a little better is a pretty attainable thing given the price points that we have.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. Thanks, Patrick. Thanks, Eddie.\n\nPatrick Spence -- Chief Executive Officer\n\nThanks, Tom.\n\nOperator\n\nAt this time, there are no further questions.\n\nPatrick Spence -- Chief Executive Officer\n\nGreat. Thanks, Paula. Appreciate it. And thanks, everybody, for joining the call today.\n\nWe look forward to talking to you again in February. Take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJames Baglanis -- Senior Director, Investor Relations\n\nPatrick Spence -- Chief Executive Officer\n\nEddie Lazarus -- Chief Legal and Financial Officer\n\nTom Forte -- D.A. Davidson -- Analyst\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nMore SONO analysis\n\nAll earnings call transcripts"
}