{
  "companyName": "BWX Technologies",
  "companyTicker": "BWXT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/bwx-technologies-bwxt-q2-2022-earnings-call-transc/",
  "content": "BWX Technologies (BWXT 0.29%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, welcome to BWX Technologies second quarter 2022 earnings conference call. [Operator instructions] I would like to turn the call over to our host, Mark Kratz, BWXT's vice president of investor relations. Please go ahead.\n\nMark Kratz -- Vice President, Investor Relations\n\nThank you, Amber. Good evening, and welcome to BWXT's second quarter 2022 earnings call. Joining me are Rex Geveden, president and CEO; and Robb LeMasters, senior vice president and CFO. On today's call, we will reference the second quarter earnings presentation that is available on the Investors section of the BWXT website.\n\nWe will also discuss certain matters that constitute forward-looking statements. These statements involve risks and uncertainties, including those described in the safe harbor provision found in the investor materials and the company's SEC filings. We will frequently discuss non-GAAP financial measures, which are reconciled to GAAP measures in a separate presentation that can also be found on the Investors section of the BWXT website. I would now like to turn the call over to Rex.\n\nRex Geveden -- President and Chief Executive Officer\n\nThank you, Mark, and good evening to everyone. Earlier today, we reported robust second quarter 2022 results. Revenue was up 10%. Net income and adjusted EBITDA were up 26% and earnings were up 32% per share.\n\nWe also delivered good operating cash flow, which was up 29%. These results were driven by a combination of strong site and commercial field services performance, along with favorable timing of activities that were originally planned for the third quarter. It is worth noting that we delivered these positive results in spite of some production inefficiencies in the naval component manufacturing business at our sites in Ohio and Indiana. Strong second quarter performance reduces uncertainty for the year and leads us to increase underlying operational guidance and narrow the earnings outlook for 2022.\n\nThe entire team continues to do a commendable job of supporting the ongoing operations while simultaneously building strategically significant new business lines in advanced microreactors and nuclear medicine. Since the last earnings call, we've achieved several important milestones on both fronts, so let me offer you a quick update on those. In the Commercial Operations segment, the BWXT Medical team has completed all operational qualifications and registration batches for the Tc-99 FDA submittal. The data collected from those batches demonstrate our ability to supply a competitive offering that matches industry standards for product quality.\n\nThe team is now finalizing the FDA package. Furthermore, we continue to build an impressive portfolio of other products in the medical business. In June, we announced the signing of a commercial agreement to supply Bayer with high-purity actinium-225, an alpha-emitting radioisotope that has highly desirable characteristics for targeted cancer therapies that improve patient outcomes. In developing that product line, we have already successfully irradiated material for the first batch and expect to begin low-level production later this year to supply Bayer with this product for clinical trials.\n\nOver the last two years, we have positioned BWXT Medical as a global leader in nuclear medicine manufacturing. The base business is growing smartly, and we've invested heavily in the Tc-99 generator line, and we have developed and expanded relationships with global-scale pharmaceutical companies, leading irradiation partners and other important manufacturing value chain participants to stake out a unique competitive position in the market between irradiation services and finished product manufacturing. As the business transitions from a build-out phase to a commercialize-and-ramp phase, we are making corresponding leadership changes, recruiting external resources where necessary and dedicating some of BWXT's best executive talent to accelerate our progress in this exciting market. Dr.\n\nJonathan Cirtain, BWXT's corporate chief technology officer for the past two years, is taking leadership at the BWXT Medical business as its President and CEO. He will oversee the ramp of the commercial Tc-99 production, as well as a pipeline of new products in development. Jonathan is not new to that business unit, having overseen the company's entry to the nuclear medicine market a few years ago and tackling some of BWXT Medical's most daunting technical and operational historical challenges. We have built a world-class leadership team in Medical that is prepared for the next stages of growth.\n\nWe hope you will be able to meet the management team and see all the capabilities we have built in Kanata, Ontario over the past couple of years when we host investors, customers and other stakeholders at BWXT Medical's headquarters in the near future. In the commercial nuclear power business, we are seeing a step-up in demand and volume for 2022, particularly for some of the outage services that are scheduled this year. Last month, we also announced a contract valued at over $100 million for major component replacements for five of Bruce Power's reactors, providing incremental long-term visibility into our clean energy business. Beyond the work we do in the CANDU market, we remain cautiously optimistic that small modular reactors will gain traction in North America and globally.\n\nThe pipeline of interested utility and power generation customers continues to build in the wake of forward-leaning players like Ontario Power Generation and the Tennessee Valley Authority, both of whom have announced plans to build GE Hitachi's BWRX-300 small modular reactor at existing grid-ready sites. In Government Operations, we are excited to build the first advanced microreactor in the United States for the DOD Strategic Capabilities Office, named Project Pele. In June, we announced that BWXT was awarded a competitively bid contract valued at about $300 million for the fabrication of a full-scale microreactor prototype slated for completion in 2024. The team is aggressively ramping up the program, and we are making incremental capital investments for this exciting new line of business.\n\nBeyond terrestrial applications, we continue to pursue space-based microreactor solutions. In June, the DOE in conjunction with NASA awarded three teams a 12-month contract to develop preliminary design for a 40-kilowatt class fission power system for the lunar surface. And we are pleased to be partnering with Lockheed Martin on this strategically significant effort. BWXT is also preparing to submit a proposal to DARPA for the demonstration of a space-based microreactor, which is anticipated to be awarded around the end of the year for a national security space propulsion application.\n\nIt has been our long-held vision that multiple national security and space agencies of the Federal government would see the capabilities of these terrestrial and space demonstrations to fulfill their special mission needs for nuclear power and propulsion. If that demand signal translates into orders, BWXT would be well-positioned to enter a stage of low-rate initial production in the back half of this decade. Such a buildup could put us on a trajectory toward our long-term aspiration of replicating the core nuclear naval franchise and supporting the U.S. government with our specialized and unique nuclear capabilities across sea, land and space domains.\n\nAnd of course, to update you on the strength of our core naval franchise, conditions remain supportive from a Federal budget perspective as we continue to tackle challenging operating conditions at certain sites. As I mentioned earlier, this quarter, we experienced production inefficiencies in some of our Northern U.S. plants, where we make steam generators, missile tubes and other components. These challenges are similar to some of the issues we experienced last year around workforce disruptions connected to COVID.\n\nMore recently, our difficulties have been attributed to manufacturing choke points, labor shortages and the challenge of building out capacity in a production environment. So these factors, coupled with the general macro pressures many industries including our defense peers are facing around wage pressure, supply chain issues and hiring, set up for a tough environment as we face increasing demand. The team has put in place an aggressive set of action plans to address these conditions, including intense recruiting and intercompany movement of experienced personnel, as well as focused investments to alleviate key production bottlenecks. A prime example of that is the recent appointment of Sharon Smoot to lead nuclear operations within BWXT's Government segment.\n\nShe is a proven executive with over 30 years of civilian Navy service in the United States Navy in a variety of impressive positions, including most notably, leadership of naval nuclear shipyards. On the legislative front, we see strong bicameral and bipartisan support for increased shipbuilding for national security investments more broadly. Both the House and Senate have proposed budgets above the President's request for key programs, the nuclear naval shipbuilding, Project Pele and site management and environmental restoration for DOE and NNSA. Those and similar actions validate our long-term Government Operations growth thesis and increase our confidence in a firm outlook for defense spending over the coming years.\n\nIn summary, BWXT remains positioned for growth over both the short- and long-term horizons. The business is highly differentiated with major content on programs that are well-funded across the government space and reaching inflection points in commercial nuclear clean energy and nuclear medicine. That diversity and the work we do across the portfolio serves as a distinctive advantage that positions the company to outperform in this space of challenges and a choppy macro environment. With that, let me turn it over to Robb.\n\nRobb LeMasters -- Senior Vice President and Chief Financial Officer\n\nThanks, Rex, and good evening, everyone. Let's start with total company results on Slide 4 of the earnings presentation. Second quarter revenue grew nicely by 10% to $554 million, driven by growth in both operating segments. Second quarter adjusted EBITDA was robust, up 26% year over year to $115 million, which was driven by higher revenues and strong margins in both segments despite lower recoverable CAS pension income.\n\nEarnings were up 32% per share in the second quarter, given strong operational performance and the benefit of some below-the-line items, including lower interest expense, tax rate and share count, which was partially offset by lower pension income and some foreign exchange losses. Operating cash flow was also up $18 million year over year, driven by an increase in net income and some modest working capital improvements. Free cash flow improved more significantly as we continue to wind down the two major capital campaigns in the Navy and medical businesses. We have detailed a second quarter EPS bridge on Slide 5, and I will now move to segment results on Slide 6.\n\nIn the second quarter, Government Operations revenue was up 8% to $437 million, driven by timing of long-lead material in the naval reactors business and higher volume in uranium processing. These increases were partially offset by lower missile tube revenue due to contract adjustments. Second quarter Government Operations adjusted EBITDA was up 15% year over year to $95.7 million, driven by strong contract performance in uranium processing and technical services, which was partially offset by lower recoverable CAS pension income and fewer positive contract adjustments, particularly at some of the Northern sites that Rex mentioned. In Commercial Operations, revenue was up as we expected due to the seasonality of commercial power service outages.\n\nThe 16% year-over-year growth was also aided by higher fuel handling in the commercial nuclear power business and higher BWXT Medical revenue. Second quarter Commercial Operations adjusted EBITDA was up significantly to $18.2 million, driven by a combination of higher revenue and a more favorable business mix when compared to the second quarter of last year. Turning now to guidance on Slide 7. As we detailed in the press release earlier today, we are increasing revenue and adjusted EBITDA guidance and narrowing non-GAAP EPS guidance.\n\nWe now expect consolidated revenue growth of 6.5% to 8% this year versus our prior range of 3% to 4%. This revision is driven by a combination of factors. In Government Operations, we have increased segment revenue guidance to 6% to 7.5%, primarily as a result of the Project Pele win and the DCL-Cunico acquisition. In Commercial Operations, we anticipate 7.5% to 8.5% revenue growth as we gain service outage scope coupled with increased volume in nuclear component manufacturing and medical isotopes.\n\nConsolidated EBITDA is now expected to grow 5% to 6.5% versus the prior range of 3% to 4%. We see a relatively more modest step-up in EBITDA growth given a higher mix of Commercial Operations, as well as the addition of a lower-margin Project Pele contract. We have also incorporated some of the operational challenges and fewer favorable contract adjustments into the Government Operations EBITDA guidance, which we now expect to be $400 million to $405 million. Commercial Operations EBITDA is now expected to be $48 million to $50 million, given heightened field service demand, increased volume in nuclear component manufacturing, a strong showing by our BWXT Medical business and efficient cost management across that segment.\n\nWe continue to make good progress on managing and rationalizing corporate costs, while also capturing some modest synergies from the resegmentation. This results in lowering the corporate unallocated cost guidance to about $17 million versus a prior estimate of about $20 million. As a result of these changes, we are tightening our non-GAAP EPS range to $0.15. Our revised earnings guidance is now $3.08 to $3.23 per share, and we continue to anticipate the midpoint is still the most likely outcome for the year.\n\nAs I mentioned on the last call, we continue to believe that the next couple of years will show a return to a more normalized level of capital expenditures, with only modest growth capital to turbocharge our strategic initiatives. We continue to see such investments at a scale of tens of millions each that'd be spread across a couple of years. With the strategic win of Project Pele, we will upgrade our facilities for this program in the second half of this year and into next year, causing us to increase capex guidance to a range of $195 million to $210 million for the year or about $12.5 million increase at the midpoint. As I mentioned last time, we had projected that the investment for Pele would add less than $30 million of incremental capital to our initial capex forecast presented at our Investor Day.\n\nAnd so the guidance now incorporates about half of that spend in 2022 as we aggressively stand up that effort for our highly ambitious government customers. Finishing up my remarks on guidance, I wanted to provide some quarterly color. As Rex and I both mentioned, beyond some outperformance, strong second quarter results included certain items that were originally anticipated in the third quarter. Therefore, we see third quarter earnings lining up to be similar to our first quarter in 2022, implying simply a shift -- EPS shift into and out of Q2 and Q3, respectively, driven by a modest change in seasonality.\n\nWe continue to anticipate a strong fourth quarter as field service demand in the commercial power business returns, and we ramp up on government service projects and the new Project Pele contract. We have updated our guidance bridge on Slide 8 that incorporates the various changes to the components of EPS. By and large, we are anticipating slightly better operational results for 2022, with some modest incremental headwinds in the nonoperating components of the income statement. Let me continue that thread of nonoperational items as we start to think a little bit about 2023, namely, I wanted to flag interest rate expectations and noncash pension income given the macro environment and capital markets performance.\n\nI mentioned on the last call, we continue to monitor the impacts we see from higher interest rates -- from the higher interest rate environment. As you recall, we had adjusted our expected interest expense for 2022 upward at that point, and we continue to see the rising interest rate environment affecting our floating rate debt, which is about 40% of our outstanding debt balance. This will surely have an impact on our anticipated interest expense next year as we think about higher rates on a full year basis. With current floating rate debt of about $600 million, every 100 basis point increase in the interest rate is about $5 million after tax or about $0.05 of EPS headwind.\n\nBeyond the interest expense line in our P&L, current market conditions lead us to believe that noncash pension reported in other income may also be negatively impacted by discount rates and asset returns. We provide these sensitivities in our 10-K, and we have included a slide in the appendix of today's earnings presentation for quick reference. We see the potential for negative impacts to non-service FAS pension income in two respects. First, for every 100 basis point increase in the discount rate, which is closely derived from the prevailing interest rate curve, we anticipate approximately $6 million of additional net periodic benefit cost, resulting in a decline in the other line of the P&L -- the other income line in the P&L.\n\nSecond, we are a little different from most defense peers in that we mark the pension to market at the end of each year through the P&L and adjust those negative or positive entries in the non-GAAP results. As a guide, a 100 basis point decrease in pension assets would lower future net periodic benefit income, causing a decline in the other income line of the P&L by about $1 million. Final estimates of pension asset and liability balances will be made as part of our standard year-end process, but we wanted to give you that initial estimate amid these muddled macro markets. So if we snap the chalk line at the end of June, we would estimate just over a $20 million noncash earnings headwind to other income, with about half of that impact coming from higher interest rates and the other half coming from about a 10% decrease in pension assets.\n\nOn the flip side, after years of solid management of our pension assets and conscious contributions and annuitizations done during calculated circumstances, we find ourselves in a constructive funded status using these June estimates. Should these conditions prevail through the end of the year, we estimate that we are fully, if not slightly, overfunded on a GAAP basis, with a projection of no material cash contributions to the pension for the foreseeable future. So while it is still too early in the year to give specific guidance for 2023, we anticipate another year of underlying operational EBITDA growth being masked by the potential for material interest and noncash pension income reductions, should these market conditions sustain themselves through the end of the year. And with that, I'll turn the call back over to Rex for some closing remarks.\n\nRex Geveden -- President and Chief Executive Officer\n\nThank you, Robb. I want to thank our employees for rising up together to take on the new missions that we see ahead. We are a strong company that does not back away from the challenge. Our corporate purpose is to take on some of the world's most important problems using nuclear technologies.\n\nAnd we all continue to be inspired by that vision every day. In 2022, we expect to grow underlying EBITDA in the high single digits, muted somewhat by a FAS/CAS pension headwind, which demonstrates the benefit of participating in our remarkable multifaceted end markets and positions us to drive strong economic performance despite challenging operating and macro conditions. This year, we found ways to offset pension headwinds and interest rate pressures. And next year, we will again seek to outrun interest -- increased interest expense, depreciation headwinds and potential pension income decreases before the growth vectors that we laid out at our Investor Day fully inflect.\n\nWe are primed to deliver on our medium-term financial targets given an attractive exposure to multiple defense and commercial markets. We intend to harness our capabilities, facilities and uniquely qualified and talented workforce to attain the bright future we have laid out for this company and its shareholders. We now look forward to taking your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Bob Labick with CJS Securities. Bob, your line is now open.\n\nBob Labick -- CJS Securities -- Analyst\n\nGreat. Thank you. Good afternoon, and congratulations on a nice quarter. Wanted to start -- also, obviously, congratulations on Project Pele.\n\nSo yes, a fantastic win for you and obviously could be a big opportunity. Can you give us a sense of how the revenue will run through the P&L and kind of timing? And will this be -- will you be running this neutral? Is it accretive? Will it be an investment in the P&L? Will it run at a loss? Or how should we think about that over the next couple of years?\n\nRex Geveden -- President and Chief Executive Officer\n\nYeah, I'll start with it and maybe Robb will have something to add to it, Bob. And good evening to you. Yes, Pele is a $300 million contract that's running over, let's call it, a 30-month period. And so think about it sort of peanut buttering over that.\n\nNow we have to ramp up on the front end of it, so it won't achieve sort of the average run rate for a while. But it -- and it is a cost-plus fixed-fee contract. No, it's a pretty modest fixed fee. And so think of it as dilutive to margins in that segment, generally speaking.\n\nSo it's not going to give us a lot of lift on the margin side. But of course, there's no cost risk here. So that's an attractive proposition for us. And of course, it is laying the foundational pieces for that microreactor business.\n\nSo we quite like the terms of that contract. And that's probably about it. Robb, anything to add to that?\n\nRobb LeMasters -- Senior Vice President and Chief Financial Officer\n\nNo, I think that's right. Rex talked about it good that it will be a little bit lower-margin contract for us. So we really want to get set up in that business, and it will -- as we hire, we're trying to vigorously hire. And so that's really what we're after is to ramp that as quick as we can.\n\nBob Labick -- CJS Securities -- Analyst\n\nOK. Great. Thanks. And then just one quick one on isotopes for me.\n\nMaybe a little more color on the leadership transition. How, if at all, does this impact the submission to the FDA? And do you -- now that [Inaudible] FAS/CAS are done, would you expect by the end of September to be able to submit? And do you still believe it should be nine months plus or minus for approval after you do submit?\n\nRex Geveden -- President and Chief Executive Officer\n\nYeah. Yes, Bob. We expect to submit that FDA package probably by around the end of this month or so, give or take. And the leadership change, yeah, certainly, I view it as positive for the business.\n\nAs I mentioned in the script, Jonathan has been involved with the business for a long time. He ran -- he originally ran Advanced Technologies, the Advanced Technologies business, before it became CTO, and that was a business that hatched the neutron capture technology for the moly and Tc-99 generator project. So -- and he was also sort of on the vanguard of the technology for lutetium-177 and other such developments. And even as CTO has been deeply involved in this registration batch campaign and qualification campaign for all that equipment.\n\nSo he knows the business up and down, back and forward. A very energetic, very bright person who's got very strong commercial instincts also. And Martyn, by the way, is transitioning back into his consulting business and returning to his home in the U.K. But we're retaining Martyn in a commercial role.\n\nHe is particularly strong there in developing channels to market and developing good commercial terms for the business. So he'll be at Jonathan's right-hand side, developing the commercial end of that business. But it's going to be quite a good leadership transition. It's very stable, and it will be good for the business and give it some lift.\n\nBob Labick -- CJS Securities -- Analyst\n\nOK. Super. Thank you very much.\n\nOperator\n\nThank you. Our next question comes from Pete Skibitski with Alembic Global. Pete, your line is now open.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nHey, good evening, guys. Nice quarter. Rex, can you talk maybe a little bit more about Indiana and Ohio in terms of how much more labor needs to be hired there? And are you still adding in kind of new pieces of machinery, maybe [Inaudible] or something, and that's kind of contributing to maybe [Inaudible] issues kind of to -- I think maybe it was last year, you had similar issues.\n\nRex Geveden -- President and Chief Executive Officer\n\nYeah, similar, Pete. So let me paint the total labor picture for you. We're about 7,000 people across this entire enterprise across mainly North America and a little bit in the U.K. now.\n\nAnd our attrition rates have been running kind of mid- to high single digits these days. That's higher than historical and maybe sort of typical for what we and our peers have been facing. And if you think about that on the scale of 7,000 people, then you could by -- through attrition, lose, let's say, 500 people this year, around those kind of numbers. And we need to hire about 500.\n\nThat's the kind of ramp that we're on, given the demands in the Navy program, Pele program and all the other things that we're trying to do. And so we have to hire about 1,000 to net 500 out of all this. And that's the headwind that we're facing. And we are net positive on our hiring for the year, but not at the rate that -- to get us to 500.\n\nAnd I think that's kind of typical of what's going on in the business right now. Now to be more specific about what's happening in Ohio and Indiana. We are -- we continue to have some struggles with the missile tubes program. Nothing to do with weld repairs or anything like that.\n\nWe're well past that. But we did experience some cost creep in that program last year, and we brought in some new leadership, and they've rebaselined the program and estimated some new cost to ramp that program up. That resulted in a negative EAC adjustment. Now we have some claims against that number, and we're having some discussions with our customer about an equitable adjustment on that program more broadly.\n\nSo we've got line of sight to being able to deal with that in the future, but it did create a hole for us in the quarter that we had to overcome. And so that's kind of what we're dealing with. And maybe another log to throw in the fire here is we are having some efficiency challenges, and that's a multifaceted problem, but some of it has to do with trying to build these plants out while we're producing products. Some of it is just the labor churn, causes yet to -- it causes challenges because you have to train out people for so long for them to become proficient.\n\nAnd some of this is frankly how we bid the work. Sometimes, we've underestimated the complexity of some of these components, particularly in the first-of-a-kind things. But we're getting on top of it. We have a very capable leadership team in place, and they're attacking this problem head-on.\n\nAnd so I feel very good about the course corrections that we're making. But that's -- those are what the problems are, in summary.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nOK. I appreciate the color. And just to tie it up on the missile tubes, is that work going to continue into 2023? I thought you guys were about done at this point?\n\nRex Geveden -- President and Chief Executive Officer\n\nYeah, we're in the wrapping-up phases of it. But we have -- I think, it's eight more missile tubes to deliver, and we have these box parts that go with hundreds of those. And those are the components that go on to the missile tubes and they box it up and ship with the tubes. That will bleed into '23.\n\nThe bulk of the work is done by the end of this year, but some of it will continue.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nOK. Last one for me. Just on this Dynamic Controls. Can you talk about how integration on there and the outlook for that business?\n\nRex Geveden -- President and Chief Executive Officer\n\nYeah, I will. I'll make a couple of comments about it, then I'll ask Robb LeMasters to comment. Robb kind of led that acquisition activity. It's a neat business, Pete.\n\nIt's making naval components, supporting the U.S. Navy fleet and also the U.K. fleet, has some exposure to Australia historically. And like our core business, it's specialized high-consequence components.\n\nIn this particular case, valves and seawater components, cold-formed seawater components for the most part. I would think of that business as having the same kind of growth potential that the nuclear Navy business has in the sense that governments that have those capabilities are recapitalizing their fleets. In the case of Australia, of course, it's embarking on a nuclear naval fleet, and so we see potential upside there. And so we quite like it.\n\nAnd that doesn't speak to the synergies that are available from the combination of BWXT with that business. So it's shaping up nicely. I think the business, frankly, a little bit better growth trajectory than anticipated when we bought it and then opportunities to maybe take some cost synergies along the way, too. So Robb, do you want --\n\nRobb LeMasters -- Senior Vice President and Chief Financial Officer\n\nYeah, that's right. I would add that, yeah, it's being integrated quite nicely. As you know, there's an operation in Long Beach in California and then an operation in the U.K. And it's proving to be a nice bite-sized acquisition.\n\nWe're really swarming it with several people from our core business, taking different turns to try to bring that company really into the fold in digestible steps, so bringing it to look very similar to our core business. And they've got great people. The brand has, frankly, in both markets, really surprised us. People really seem to have a great relationship with the company, and they've turned out good product over the years.\n\nSo if they start really being integrated with our operations, we see those three core drivers that we outlined on our last call around trying to drive the business around critical components for the U.S. Navy being a growth channel. We find the same in the U.K. We think that we can expand our mix of products there.\n\nAnd then, thirdly, as international partnerships just become more and more relevant to us and to the U.K. and supporting all that, it just helps to have another entree into an international market. So those three are all growth avenues here. And so we're really excited about that acquisition.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nThanks. I appreciate it, guys.\n\nOperator\n\nThank you. Our next question comes from Peter Arment with Baird. Peter, your line is now open.\n\nPeter Arment -- Robert W. Baird -- Analyst\n\nGood evening, Rex and Robb. Hey, Rex, I wanted to circle back just on the FDA submission process. Anything that you view as any more like long poles in the tent? It sounds like you had some challenges initially getting the reference batches that you needed, but it sounds like you're there now. Just your confidence level on the submission of this time line that you currently laid out?\n\nRex Geveden -- President and Chief Executive Officer\n\nYeah. I -- it's a little bit hard to say, Peter. I would -- our view is that we would request a priority. Historically, we've said we would request a priority review with the FDA, which we will do.\n\nIf that is granted, then you get a filing date shortly after you submit the FDA package. And that filing date starts the clock on this six-month approval process. The variable here is that if your data package is seen as incomplete in some ways or there are some problems and the FDA needs more information, then they stop the clock appropriately. They stop the clock and then await the data submittal.\n\nSo there can be some quite back and forth in that process. And that's the reason we've always fuzzed it up a little bit.\n\nPeter Arment -- Robert W. Baird -- Analyst\n\nAnd then just once you do ultimately get approval, how quickly can you turn it on to producing revenues? I think a lot of us are expecting you to ramp up pretty materially in '24, but just thinking about back half of '23?\n\nRex Geveden -- President and Chief Executive Officer\n\nYeah. I think it depends on -- I mean, I think from an operational perspective, all this has been a dress rehearsal for the commercial production of the product. And so I feel good about our ability to turn it into a commercial operation as soon as we have contracts in place and are ready to go with the radiopharmacy networks. The variable there is when our product is going to be available and the specifics of the supply agreements, which, of course, we're in discussions on.\n\nBut -- so it depends on the nature of those supply agreements, when they become effective and the time line on the approval.\n\nPeter Arment -- Robert W. Baird -- Analyst\n\nOK. And then just, Robb, just a clarification. You mentioned the combined headwind for the higher interest cost potentially in '23 in the pension side was $20 million? Is that -- what was the combined number? I just wanted to clarify.\n\nRobb LeMasters -- Senior Vice President and Chief Financial Officer\n\nYeah. So it's really two below-the-line impacts, if you really think about it. There's the interest expense, which is just true interest rates just on our debt, that we tried to talk to people about. Given where rates have gone, we're seeing about a $10 million increase there if you just think about taking that debt balance and running it out over the course of next year and using higher interest rates, assuming we don't pay down any debt.\n\nSo that's one item. And then the second item is a $20 million item in the other income, which really has two components to it: an interest rate component and an asset component, if you will. And those each are $10 million. So in total, if you want to think about those three items being -- or two items, really, its interest expense and then other income.\n\nPeter Arment -- Robert W. Baird -- Analyst\n\nAppreciate it. Thanks, Robb.\n\nOperator\n\nThank you. Our next question comes from David Strauss with Barclays. David, your line is now open.\n\nDavid Strauss -- Barclays -- Analyst\n\nThanks. Good evening. So what were your EAC adjustments in the quarter, net EACs?\n\nRobb LeMasters -- Senior Vice President and Chief Financial Officer\n\nSo it's about -- we actually had about flat, and that was composed of missile tubes being down, as we talked about it, which will be in the Q of about $11 million number and then other offsets to make it up.\n\nDavid Strauss -- Barclays -- Analyst\n\nOK. Got it. Thanks. And Robb, I mean, how are you thinking about leverage and the potential paying down debt given -- or terming out this 40% that you've got that's floating at this point to try and take away that volatility?\n\nRobb LeMasters -- Senior Vice President and Chief Financial Officer\n\nYeah. We have flexibility. Those markets are still completely open if we ever needed to refinance that or even enlarge that facility. As we look out over the next year or two, as we talked about, the free cash flow really starts to get pretty robust here shortly.\n\nSo we're sort of looking to grit our teeth and pay down debt. We don't see a lot of need to do large-scale M&A of any sort, so we'll do just kind of look at tuck-ins and very strategic deals there. And so as we look out and you think about the sort of operating cash flow at a kind of $300 million-ish number over the next couple of years, and then we're hoping to bring that capex down to more of the maintenance level, you're going to be generating a couple of hundred million dollars. So we'll be able to pay down debt and move our leverage back below the three times.\n\nSo we're not in any rush to go deal with that. We certainly aren't looking to do anything on -- in the sort of bond market. So we always have the flexibility if we wanted to do something on the bank side. So we'll review that and see whether we need any additional capacity.\n\nDavid Strauss -- Barclays -- Analyst\n\nOK. And then the last one for me. In terms of the medical business, at the Investor Day, you had put up this slide that showed during the '22 to '24 time frame, $60 million in sales going to $125 million; EBITDA, $10 million loss going to $25 million positive. Are we still in those kind of ranges in terms of where things are running today and kind of how you're projecting things over the next two years?\n\nRobb LeMasters -- Senior Vice President and Chief Financial Officer\n\nYeah, I think that's right. I think we've clearly lost a couple of months here this year. But those are endpoints that we still see as very reasonable to get to, right? So we're going to be ramping our actual -- our therapeutics efforts. That was the total BWXT Medical story, as you know, which included sort of the Nordion business, the ramping of the Tc-99 and, ultimately, the therapeutics.\n\nAnd so along those different -- there might be slight puts and takes. But ultimately, that picture still lines up quite nicely with what we're seeing.\n\nDavid Strauss -- Barclays -- Analyst\n\nAll right. Thanks very much.\n\nOperator\n\nThank you. Our next question comes from Michael Ciarmoli with Truist. Michael, your line is now open.\n\nMike Ciarmoli -- Truist Securities -- Analyst\n\nHey, good evening, guys. Thanks for taking the questions. Rex, on the naval -- the core naval business, you mentioned some production-related inefficiencies tied to the steam generators. And I wonder if you could just talk about maybe any other manufacturing choke points you're seeing.\n\nWe keep hearing about forgings and castings. Anything else in the supply chain that you're seeing or that might create or lead to further inefficiencies as we kind of progress here?\n\nRex Geveden -- President and Chief Executive Officer\n\nHey, Michael. No, we haven't seen much of that. Our forgings business has been fine. And the other long-lead material that we, of course, concern ourselves with are the alloys, special alloys that we need for that business, and those supply chains are stable.\n\nSo we haven't seen much of that show up in the supply chain. It's really been around labor, for the most part, and not the other elements.\n\nMike Ciarmoli -- Truist Securities -- Analyst\n\nOK. OK. And what about just dealing with the contract structure? And you're looking for all the hires you just mentioned. I'm assuming there's a fair amount of wage inflation happening.\n\nDo you think you'll be able to kind of contain that cost growth in your current contracting structure? Or should we expect maybe some pressure on margins as you bring on these new employees?\n\nRex Geveden -- President and Chief Executive Officer\n\nWell, it's -- we've talked about the two-edged sword of negotiating pricing agreements on two- or three-year boundaries with us in a sole-source configuration like this, Michael. So it cuts both ways. And the way that it benefits us as we get into a new pricing discussion, hopefully, you can capture all the escalation that you're seeing in raw materials and labor and any other things and bring those into the cost baseline, which form the basis for how you lay in the profit on top of it. The downside is that also applies to your backlog, and so you get a negative contract adjustment from the application of higher materials and labor to that.\n\nSo we're walking that tight rope right now. We think we've got it under reasonable control and we -- and it hasn't changed our view about the long-term margins in this business. We still believe we can deliver margins into the high teens, and we've got paths to get there.\n\nMike Ciarmoli -- Truist Securities -- Analyst\n\nGot it. Just last one. Any latest update or additional thoughts on the AUKUS submarine?\n\nRex Geveden -- President and Chief Executive Officer\n\nNot much. We're on the outside looking in on that one. We're not in the room on those negotiations. But we're seven or eight months probably from an announcement here, and we remain excited about it.\n\nI would say that from BWXT's perspective, we certainly would like to support that effort, and we'll see what the decision makers do with it.\n\nMike Ciarmoli -- Truist Securities -- Analyst\n\nGot it. Thanks a lot, guys.\n\nOperator\n\nThank you. Our next question comes from Tate Sullivan with Maxim Group. Tate, your line is now open.\n\nTate Sullivan -- Maxim Group -- Analyst\n\nHi. Thank you, and good evening. I'm just starting -- just a follow-up on Government Operations. The margin increased quarter over quarter to 19% from 17%.\n\nWhat was -- a meaningful portion of that's Savannah River. And was Savannah River -- was at a full run rate in 2Q '22, please?\n\nRex Geveden -- President and Chief Executive Officer\n\nYeah, Tate. Savannah River is in there, although I would say that was probably a modest component of all that. Generally speaking, site performance in our technical services business has been good, and that did contribute to the improved margins in that business. We also had long-lead materials that we pulled that we're able to deliver in the second quarter originally forecasted for the third quarter.\n\nThat was a contributing factor there. And those would be the primary elements, I believe.\n\nRobb LeMasters -- Senior Vice President and Chief Financial Officer\n\nYeah. We're also seeing strength in the core Navy business. You have a couple of other businesses in there as well. We've talked about the fuel business and the new metals business, the purification business.\n\nThose are good margin businesses, and so we do see a ramp-up there. And so we're doing quite well on that contract. And so that's building up nicely for us. So that's helping.\n\nTate Sullivan -- Maxim Group -- Analyst\n\nOK. Thank you. And a follow-up on Project Pele, and thanks for the detail before that. And with delivery of the prototype in 2024 per your previous press release, a testing period that could last up to three years, can you book revenue during the period? I imagine from supplying TRISO fuel for the testing period? Or is that in the $300 million contract amount?\n\nRex Geveden -- President and Chief Executive Officer\n\nSo the TRISO fuel is a separate contract for that. We announced a few years ago the base phase of that contract, which I believe was $29 million. There's another option piece. It's a bit bigger than that that hasn't been exercised yet to manufacture the fuel itself for that reactor.\n\nAnd so think of that as tens of millions on top of the Pele reactor. In fact, the TRISO fuel contract was competitively awarded also. It was a little bit of a smaller news item for us. But those two together push you into the mid-300s or above.\n\nAnd I thought the point you were headed to, which is also true, is there would be sustaining engineering for BWXT modest revenues. But sustaining engineering have to deliver that reactor while it's being tested and demonstrated at Idaho National Laboratory.\n\nTate Sullivan -- Maxim Group -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. There are no further questions in queue. [Operator instructions] As there are no further questions in queue, I will pass the conference back over to Mark Kratz for any additional or closing remarks.\n\nMark Kratz -- Vice President, Investor Relations\n\nThank you, everyone, for joining us today. If you have further questions, you can reach us by phone at (980) 365-4300 or by email through investors@bwxt.com.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Kratz -- Vice President, Investor Relations\n\nRex Geveden -- President and Chief Executive Officer\n\nRobb LeMasters -- Senior Vice President and Chief Financial Officer\n\nBob Labick -- CJS Securities -- Analyst\n\nPete Skibitski -- Alembic Global -- Analyst\n\nPeter Arment -- Robert W. Baird -- Analyst\n\nDavid Strauss -- Barclays -- Analyst\n\nMike Ciarmoli -- Truist Securities -- Analyst\n\nTate Sullivan -- Maxim Group -- Analyst\n\nMore BWXT analysis\n\nAll earnings call transcripts"
}