{
  "companyName": "Vuzix",
  "companyTicker": "VUZI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/vuzix-vuzi-q2-2022-earnings-call-transcript/",
  "content": "Vuzix (VUZI 1.11%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Vuzix second quarter ending June 30th, 2022 financial results and business update conference call. At this time, all participants are on a listen-only mode. A brief question-and-answer session will follow the formal presentation [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the call over to Ed McGregor, director of investor relations at Vuzix.\n\nMr. McGregor, you may begin.\n\nEd McGregor -- Director of Investor Relations\n\nGood afternoon, everyone, and welcome to the Vuzix second quarter 2022 ending June 30th financial results and business update conference call. With us today are Vuzix CEO, Paul Travers; and CFO, Grant Russell. Before I turn the call over to Paul, I would like to remind you that on this call, management's prepared remarks may contain forward-looking statements which are subject to risks and uncertainties, and management may make additional forward-looking statements during the question-and-answer session. Therefore, the company claims the protection of the Safe Harbor for forward-looking statements that are contained in the Private Securities Litigation Reform Act of 1995.\n\nActual results could differ materially from those contemplated by any forward-looking statements as a result of certain factors, including, but not limited to, general economic and business conditions, competitive factors, changes in business strategy or the development plans, the ability to attract and retain qualified personnel, as well as changes in legal and regulatory requirements. In addition, any projections as to the company's future performance represent management's estimates as of today, August 9th, 2022. Vuzix assumes no obligation to update these projections in the future as market conditions change. Today's call may include certain non-GAAP financial measures.\n\nWhen required, reconciliation to the most direct comparable financial measure calculated and presented in accordance with GAAP can be found in the company's Form 10-Q filing at SEC.gov, which is also available at www.vuzix.com. I'll now turn the call over to Vuzix CEO, Paul Travers, who will give an overview of the company's operating results and business outlook. Paul will then turn the call over to Grant Russell, Vuzix CFO, who will provide an overview of the company's second-quarter financial results. Paul will return to provide some closing remarks, after which we will move on to the Q&A session.\n\nPaul?\n\nPaul Travers -- Chief Executive Officer\n\nThank you, Ed. Hello, everyone, and welcome to the Vuzix Q2 2022 conference call. On this call, we're going to review our results and recent developments and then give you some perspective on where we see things headed. The overall business environment in the second quarter of 2022 remained challenging for most companies due to macroeconomic headwinds causing delayed decision-making and a resurgence of COVID, particularly in parts of Asia.\n\nDespite these issues, our Q2 revenue of $3 million, which exceeded the consensus expectation, represented a 20% increase versus Q1 2022 and a 3% gain year over year. From a customer engagement perspective, the second quarter was very encouraging across our core Smart Glasses business. Most notably, we expanded our international sales channel with the addition of Westbase.io to support our business in Northern Europe, a firm with a 30-year pedigree and one of the most experienced connected worker device distributors in Europe with solutions from cellular to XR technology and connecting tens of thousands of frontline workers and businesses. We're bolstering our local sales and support team in Europe with additional boots on the ground that came online in early Q3 to support our key accounts and drive additional sales growth in the EMEA region.\n\nAlso in Europe, we'll be opening a Vuzix sales office in Germany later this quarter, which will provide a new central operational and support hub for our European business. As always, we continue to work closely with our key independent software vendors to support the needs of our collective customers as they roll out their solutions and work through any further optimizations ahead of expected enterprisewide rollouts. On the OEM side of the business, upon which I will expand shortly, there is a growing momentum with both existing and new customers, and we expect our OEM business activities and revenue to accelerate in the back half of 2022. We continue to invest in our core technologies, including waveguides and display engines, along with our significant investment and commitments in Q2 regarding our micro-LED and backplane announcement with Atomistic.\n\nAdditionally, we are also investing in the expansion of our high-volume, cost-effective waveguide manufacturing capacity. Our Smart Glasses core customer base continues to expand and our customers' commitments to scaling up is also increasing. One market vertical that has continued to expand over the last 12 months is warehousing and logistics. After a period of starts, pauses, and stops primarily due to COVID and other headwinds we discussed earlier, we're now starting to see volume multiyear rollouts for Smart Glasses being actively planned by some of the largest companies in the world.\n\nOne Fortune 100 customer that we referenced in the July press release has already placed multiple orders for initial rollouts and is well into scheduling a multiyear rollout of our Smart Glasses. The Smart Glasses project at this retailer, as currently slated, will represent one of the largest deployments of Smart Glasses in the world to date. And it's great to see that Vuzix Smart Glasses was selected to support this customer. The benefits afforded by this Smart Glasses and software solution will help deliver critical efficiencies and powerful ROIs to the logistics arm of this customer without any material implementation disruptions to their operations.\n\nThey are just one of four Fortune 100 retailers that are preparing to actively deploy much larger numbers of our products. Feedback from our other large customers regarding warehouse and logistics, including Amazon, remains very positive. As per their own social media, Vuzix Smart Glasses have been deployed across various Amazon warehouses, and we expect this project's rollout should continue to expand over the second half of 2022 and beyond. Amazon even has their own custom M400 Smart Glasses SKU from Vuzix.\n\nAt other large customers in this space, our Smart Glasses are being deployed within their distribution centers and the integrated software solution in some instances is still being fine-tuned in preparation for wider rollouts which we anticipate should begin during the second half of 2022. In healthcare, our major ISVs continue to expand the availability of their Vuzix-powered surgical solutions. Medacta continues to expand its NextAR surgical platform solution, which now has hundreds of units and performed over 1,000 surgeries to date. They had a full market release of their shoulder surgery solution in May and in June received their solutions' approval in Japan for knee, shoulder, and spine surgeries.\n\nIn late July, Pixee Medical received FDA 510k clearance for its FX SPS, a total shoulder arthroplasty online 3D planning software, which will create even more sales opportunity in North America for their Smart Glasses-based surgical solutions for both knee and now shoulder replacements. Rod and Cones business also continued to expand, and they're now active in more than 600 hospitals and have supported well over 25,000 surgeries in 75 countries worldwide. That's a current run rate of as many as 60 surgeries a day. Around the world, we are seeing more and more healthcare-related whitepapers being written and POCs taking place, as well as a steady stream of incoming inquiries from doctors and medical facilities.\n\nOverall, our core Smart Glasses outlook and expected sales pipeline for the remainder of 2022 remains healthy. However, one of our biggest challenges in our forecasting continues to be managing and understanding customers' needs and expectations around the timing of deployments from these key accounts, which can have a material impact on our quarterly sales. Regardless, we expect our core Smart Glasses revenue over the second half of 2022 to grow compared to the second half of 2021. As announced in mid-May, Vuzix signed a series of agreements with Atomistic, a France-based technologies firm with a novel material science approach related to the development of next-generation microlight-emitting diodes or micro-LEDs.\n\nThe combination of Atomistic's displays and Vuzix see-through waveguides will deliver full color, high-resolution, HD solutions, a level of form, and functionality that represents what we believe to be the Holy Grail for the broader AR wearable markets. Market's expected to ultimately become as large as the current smartphone market itself. We're making great progress, and if you would like to learn more about Vuzix's micro-LED efforts and this transaction, please review the conference call that Vuzix hosted on May 18th of this year. You can find it on our website.\n\nElsewhere on the M&A front, Vuzix continues to engage in due diligence and hold discussions with multiple vertical market solution companies that could broaden our SaaS-based service offerings across key market segments. We look forward to bringing you news about these developments if and when they are successfully completed. As promising as the Smart Glasses market opportunity looks to us going forward, we are equally excited about what we are seeing on the OEM side of our business. Our standardized OEM platform that was announced during the second quarter is now being proactively offered to third parties.\n\nThis new platform will offer customers one-stop shopping for their advanced and customized waveguide and display engine solution needs, from design to high-volume, cost-effective production capabilities, a mix that is currently almost impossible to find with the competition. Since this announcement of our expanded OEM initiatives, we have been fielding many RFI, requests for inputs, and formal RFQs, request for quotes, for our waveguide-based solutions, and in most cases display engines to go with them. Our IP portfolio continues to strengthen and now consists of 247 patents and patents pending. Our ability to deliver the world's best-performing waveguides and display engines in volume with a very cost-competitive solution is just one of several critical technologies needed for the AR products of the future.\n\nWe are well on our way to expanding our waveguide production facilities to support high-volume, low-cost offerings. We have also made significant waveguide technology strides that include 80% reduced eye glow, a tripling of waveguide efficiency for higher brightness and more efficient battery usage, and the use of higher index substrates and polymers supporting single-layer color designs and much larger fields of view to name a few of our advances. To deliver against expected OEM needs and Vuzix own future demand, we are preparing for an expansion of our waveguide fabrication equipment to address the millions of units of waveguides associated with the potential business we see coming long term. And our goal is to do the same for full-color, high-resolution micro-LEDs in due course via the Atomistic investment.\n\nWe feel the OEM revenue opportunities for Vuzix are very significant as the waveguides and engines will be an integral part of the computing platform of the future from defense all the way to literally replacing the smartphone. On the defense side, where a noncompete agreement expired in June, allowing us to directly engage with any U.S. and allied defense organizations around the world, we are well positioned as the only U.S.-based manufacturer of waveguides. We are actively addressing the defense market with plans to attend key defense-related tradeshow events and outreach to direct government programs.\n\nWe are also in the process of evaluating new talent and business development that could assist our efforts with bringing on additional defense business. Our goal is qualification and selection of our OEM components into volume programs where production runs can span five years or more and result in four-, five-, and even six-figure unit volumes. On the consumer side, we are well-positioned to be a flexible, high-volume, cost-competitive provider of waveguides and related solutions, most notably many leading consumer products companies have publicized their intention to offer Smart AR Glasses for the masses but are discovering just how challenging it is to build a pair of highly functional, cost-effective, and fashionable consumer AR Smart Glasses in volume. The optics and display engines for AR glasses represent integral pieces of any solution and have to be designed from the ground up to work together for their application.\n\nSo, many are now turning to Vuzix as a partner for our waveguides and display engines for this exact reason. On the enterprise side, customers and varied industry verticals are driving a variety of use cases that represent greenfield applications and/or upgrades to older solutions that are already being deployed. I would like to give you some specific customer color on what's going on for us in the OEM space. And as you can see on Slide 8, it's a lot.\n\nWe are actively engaged with many leaders in their respective spaces, and we are in discussions with many more. Starting with defense, we are currently engaged with seven firms with multiple projects underway with some of them. Most notably, we recently announced an agreement with L3Harris Technologies, a leading defense contractor, to develop a new customized waveguide-based head-mounted display engine for use within existing L3Harris programs and new ones in the works. It's exciting that our technology can be used on multiple projects that they may pursue and the multiyear unit potential for us could be quite large given the size of L3Harris's existing product lines and the use cases they target.\n\nProjects with other defense firms remain in various stages of development. For instance, the long-term supply agreement we have discussed in the past with another defense partner is still in process, with preproduction modules continuing to be delivered. We expect to offer more specifics about some of these over the balance of this year, as well as see some move closer to production. On the consumer side, we announced an equally significant development last month when we received the purchase order for custom-designed waveguides from a Fortune 50 software and hardware technology company.\n\nThe work for this customer, which is consistent with the consumer-related remarks I made previously, is well underway and the waveguides are being built by Vuzix to specifically match this customer's needs and specifications. We are also engaged with other firms of equal caliber and anticipate that additional programs will be announced as we continue to receive growing customer interest for cost-effective and fashion-forward see-through waveguide designs to support the broader markets. Overall, we expect our OEM-related revenue growth to accelerate in the second half of this year as more development projects reach the contract stage. In most cases, these will be engineering service sales and as such represent just the very beginning in terms of future revenue potential.\n\nVuzix remains on track to release three new AR Smart Glasses products over the next several months. Our development and production teams should get high marks for successfully managing our delivery and project schedules with the challenging supply chain issues during shutdowns in China due to COVID. We are nearing completion of a new waveguide-based successor to our Blade Smart Glasses that will feature our latest advanced waveguide optics, a new microprocessor, and Android 11 out-of-the-box. We believe this new product will answer the call from many of our enterprise customers that love the Blade's form factor but required an upgraded Android OS and broader Wi-Fi capabilities to support their application's architecture, among other things.\n\nWe expect to formally announce and commence volume production of this follow-on product within weeks. The Vuzix M400-C, our second-generation USB-C-based Windows PC and phone-compatible Smart Glasses takes full advantage of the robust design and camera afforded by the Vuzix M400, including IP67. We have shipped a limited number of initial production units of the M400-C, and we expect to introduce the M400-C to our standard channels during the third quarter. Finally, the Vuzix Shield, our next-generation Smart Glasses, is far advanced compared to the competition, and its form and functionality have garnered significant early interest from enterprise customers that require a more traditional eyeglass form factor and the capabilities afforded to them by the Shield to solve operational challenge.\n\nThe Shield is on track for introduction well before the end of the second half of this year. I'd like to now pass the call over to Grant for his financial review. Grant?\n\nGrant Russell -- Chief Financial Officer\n\nThank you, Paul. As Ed mentioned, the 10-Q we filed this afternoon with the SEC offers a detailed explanation of our quarterly financials. So, I'm just going to provide you with a bit of color on some of the numbers now. Our second-quarter total revenues for the three months ended June 30th, 2022, was $3 million as compared to $2.9 million for the prior 2021 period.\n\nAnd while we did see a year-over-year double-digit gain in Smart Glass unit sales in the second quarter of 2022, this was offset by negative foreign exchange impacts and a large volume discount given on a customer order in the quarter. Revenues from engineering services were relatively unchanged in the 2022 quarter versus the 2021 quarter, and I would like to point out that we currently have near $0.7 million in remaining engineering services obligations, which should be completed and recognized in the second half of 2022. There was an overall growth profit of $0.4 million, or 14%, for the three months ended June 30th, 2022, as compared to a gross profit of $0.6 million, or 20%, for the same period in 2021. The decrease in gross profitability in the quarter was largely attributable to a rise in product direct costs to 62% of sales versus 47% in the same period of 2021, primarily driven by a higher level of sales discounts on large volume unit order and the negative impact of foreign exchange in the 2022 period on non-U.S.\n\ndollar denominated sales and higher allocations of applied manufacturing overhead costs included directly in product cost of sales. R&D expense was $3 million for the three months ended June 30th, 2022, compared to $2.7 million for the comparable 2021 period, an increase of approximately 10%. The higher R&D expense was primarily due to increases in external development expenses related to our Shield Smart Glasses and increased salary and benefits expense due to headcount increases. Selling and marketing expenses for the three months ended June 30th, 2022, was $1.9 million as compared to $1.3 million in the 2021 period, a 37% increase largely due to a $0.3 million increase in headcount and salary and benefits-related expenses and to a lesser extent increases in travel, sales commissions, and tradeshow expenses.\n\nGeneral and admin expenses for the three months ended June 30th, 2022, was $5 million, a decrease of 3% versus $5.2 million in the prior year's period. The decline was largely due to a decrease in shareholder and IR-related expenses and, to a lesser degree, a drop in recruitment and hiring expenses. The net loss for the three months ended June 30th, 2022, was $10 million, or $0.16 per share, versus a net loss of $9.2 million, or $0.15 per share for the same period in 2021. Now, for some balance sheet highlights.\n\nOur balance sheet remains strong with cash and cash equivalent positions of $100.6 million as of June 30th, 2022, and a net working capital position of $109.1 million. Cash used in operations, after adding back noncash operating expenses, which are mainly stock compensation, but excluding changes in our working capital, totaled $5.5 million for the second quarter of 2022 as compared to $4.6 million in the 2021 comparable period. Cash used for investing activities for the second quarter of 2022 was $8.2 million as compared to $0.6 million in the prior year's period. The increase reflects $4.5 million in payments made toward our $15 million technology license fee commitment related to our Atomistic agreements and $3.5 million for investments in manufacturing equipment, product mold tooling, and backplane design and tooling fees.\n\nAs of June 30th, 2022, the company continues to have no current or long-term debt obligations outstanding, other than our Atomistic outstanding license fee commitment. Looking forward to the balance of 2022, we are confident we have the resources to execute on our business plan and further invest in our future. With that, I would like to turn the call back over to Paul.\n\nPaul Travers -- Chief Executive Officer\n\nThank you, Grant. To close, I would like to reiterate a few important points. The world's adoption of AR and Smart Glasses is gaining momentum and by most accounts will be unstoppable. We are seeing no loss of enthusiasm to deploy this new technology throughout enterprise with medical markets leading the charge and supply chain right behind it.\n\nVuzix has been preparing for this for years, and we have developed the IP and manufacturing capabilities to supply to it. And to deliver to this growing opportunity, Vuzix has the balance sheet to get it done. With that, I'd like to turn the call back over to the operator for Q&A.\n\nOperator\n\nThank you. The floor is now open for questions. [Operator instructions] The first question today is coming from Matt VanVliet of BTIG. Please go ahead.\n\nMatt VanVliet -- BTIG -- Analyst\n\nHey, guys. Good afternoon. Thanks for taking the question. I guess first on -- you outlined a number of OEM opportunities here across a number of different market verticals.\n\nCurious how a number of those discussions have been progressing just the last several weeks or month or two as inflation goes up and there's concerns around whether it's consumer world or just the broader macro limiting potential total business activity and maybe even enter a technical recession here. Just curious if you've had any of those discussions slow down or what you consider the pace of those. And then a secondary question on that. If a number of those come through, where would you be from a total capacity and production capability and how quickly can you continue to invest and expand those capabilities as demand comes in? Thanks.\n\nPaul Travers -- Chief Executive Officer\n\nMatt, really good questions. First of all, the pace, it's quite fast, quite frankly. We opened up, we went to the SID show maybe three, four, five months ago, something like that, and we announced this new portion of our business. We've always offered that if anybody picked up the phone and called us, that we would be willing to do this sort of stuff for select customers.\n\nThis was officially announced and is part of a program now at Vuzix. And since we've done that, the amount of business that's coming over the transom just keeps growing. And it has not slowed down a bit, actually as it relates to the economic window, at least from what we can tell. It seems it's less expensive to get good outside help than it is to try to hire a whole bunch of people to do this inside and come up to speed because what we do is quite unique, which just opens up doors.\n\nWe should be seeing this business, it will be very consistent and growing easily every single quarter here through the next foreseeable quarters, frankly. Right now, it's their engineering programs that are part of building into production programs, and in one case, we're actually preproduction in 2023, instead of just having these earlier programs -- real production programs start to roll out, which is even more exciting, quite frankly. And as far as capacity goes, this is part of the reason why we are -- we said we were preparing to upgrade our facilities. The facts are we're probably short on where we're really at.\n\nWe are well into upgrading our facilities for higher volume capacities. We can already manufacture a reasonable quantity of waveguides. And for the defense customers and the like, we're fine with where we sat, but some of these customers are wanting really significant numbers. And for those folks, we need to have more expanded facilities.\n\nThey take time. There's no doubt, to bring up a new line takes some time, but we're well into doing that.\n\nMatt VanVliet -- BTIG -- Analyst\n\nAll right. Great. Thanks on that. And then as you look at the logistics and warehousing deals you have coming through and ultimately what the pipeline is there, how would you characterize the volume of these initial orders relative to the overall total opportunity there? Have you captured 5%, 10% of the opportunity, or are you maybe 25%, 30%? Just want to get a big picture ballpark of how much more expansion is here as you talk about already receiving follow-on orders.\n\nThanks.\n\nPaul Travers -- Chief Executive Officer\n\nYeah. Everybody is looking to Vuzix to finally open up that tap with our customer base and see real expanded volume programs. These really are -- they're just getting started, Matt. Smart Glasses are going to change the way work gets done.\n\nAnd at $3 million a quarter, it's pretty modest revenues, frankly, compared to where this business is going to be. So, this is the tip of an iceberg. I would characterize it as way less than 1% even. This is just getting started.\n\nMatt VanVliet -- BTIG -- Analyst\n\nAll right. Great. Thank you.\n\nOperator\n\nThank you. The next question is coming from Christian Schwab of Craig-Hallum. Please go ahead.\n\nUnknown speaker -- Craig-Hallum Capital Group -- Analyst\n\nHey, guys, this is Tyler on behalf of Christian. So, I guess first question maybe just a follow-up on the OEM front and it's great to hear that those things are tracking very well still. I was wondering, to the degree you can, Paul, maybe help rank-order some of these OEM opportunities. The slide was great with a number of them, but maybe level set where we're at on maybe what ones are furthest along if you're able to or what ones are potentially could be some of the largest opportunities? Any color there would be great.\n\nPaul Travers -- Chief Executive Officer\n\nYeah. I'll try to characterize it for you, Tyler. The defense programs are -- they're smaller volume, OK, but the unit cost for a defense Smart Glass engine, which would be a display and an optic and maybe a pair of them, those things are in the $4,500 to $7,500 per unit kinds of costs or sale price, but the volumes are smaller. I will say, if you get into some of the programs that are part of the bigger side of the U.S.\n\ndefense markets, they can be 10,000- to 100,000-piece quantities with those kinds of numbers. So, the margins are easier to maintain at a much higher level, but the volume is smaller, but it's still significant business when you add it up. The unit volume and the much bigger business is in the broader markets. And you start talking about potentially replacing a smartphone, and if your technology is in those smartphones and they ship billions a year, it's just significant business, Tyler.\n\nAnd so, we have people that are in the spectrum that go from that smaller but higher-margin opportunity right on through to we're going to need a boatload of these. And on the boatload side of the business, I would suggest it's a end '23 going into '24-ish kind of thing for volume programs. Some guys are trying to be even more aggressive than that in their discussions with us. On the defense side of the business, like I said, there's one particular that we've already got preproduction programs we're shipping to.\n\nSo, 2023, you'll definitely see early production -- real production programs on that side of the business.\n\nUnknown speaker -- Craig-Hallum Capital Group -- Analyst\n\nGreat. That's great color. Thank you. And then second, pivoting maybe to the strategic partnership you announced in the quarter I think it was very interesting and positive.\n\nI was wondering you said you continue to engage with multiple other opportunities like this. So, I was wondering on the strategic or M&A opportunity front, should we expect similar technology tuck-in deals? I know you've mentioned software opportunities in the past, maybe something larger, more transformational. Any color or thoughts would be great.\n\nPaul Travers -- Chief Executive Officer\n\nYeah. So, technology is always an important part of what Vuzix does and you could potentially see more stuff happening on that front. On the software front, though, we said this before getting a SaaS model functional at Vuzix we think is important. And you'll see, I think, knock on wood, should they come together, some stuff that's on that side of the house that has the potential I think to be significant for Vuzix.\n\nBut knock on wood, it may not be all that expensive to get into game with it. So, I'm sorry, I can't offer more than that, Tyler. So, there's two legs to it, as you know, the technology side, like I mentioned, and the SaaS-based side of it.\n\nUnknown speaker -- Craig-Hallum Capital Group -- Analyst\n\nAll right. That sounds good. That's all for us. Thanks, guys.\n\nOperator\n\nThank you. The next question is coming from Jim McIlree of Dawson James. Please go ahead.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nThank you, and good afternoon. Paul, I was hoping you could characterize the pace of the rollouts that you're expecting in the logistics business, and not necessarily numbers -- well, numbers would be great, but I'm trying to imagine if a customer has, I'll make up a number, 100 warehouses, how you think that might be rolled out? That is 20% in Year 1, 25% in Year 2, something like that, or is it more front-end loaded or back-end loaded? I was just hoping you could characterize what you think a rollout schedule might look like.\n\nPaul Travers -- Chief Executive Officer\n\nIt really does depend upon the customer and where it is in their system. And the other thing that happens, Jim, is once these guys start to roll, they often -- from what we've seen in the past and how these companies operate is with success comes, let's have faster success. So, the current thinking is, it starts just a little bit slower, but then as it rolls, it gets faster and faster. So, that's not a really hard answer for you there.\n\nI apologize for that. But the kinds of volumes that we're talking, though, you've got a reasonable number of products in the distribution center, and there's 100, 200 distribution centers that all adds up fairly quickly.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nOK. And the second question, again, regarding that customer set. Are you the sole source Smart Glass supplier, or are these customers dual sourcing this particular technology?\n\nPaul Travers -- Chief Executive Officer\n\nFrom what we're seeing, once the decision is made, it's the product of choice. And so, many of these retailers, if you look in the healthcare sector, all of the business that's really happening around Smart Glasses and healthcare and in the operating rooms, you don't see much competition there. And once it's decided on, the systems are built around it, and the software is released. It's almost like you're cemented in the program.\n\nIt doesn't mean we don't have competition with these guys, because often there's this front-end where they're trying to make decisions and they got to comp this one against that one, and then, of course, there's always the negotiation that, maybe we'll use them instead of you kind of thing that happens. But once you're there, Jim, we're not up against a multiunit of this and this and this company's deployments. It's just too difficult for these companies, I think, to even manage that.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nAll right. And then my last question is, as we start -- as you start rolling out, or as your customers start rolling out the products through their system, what level of resources will you have to commit either in terms of aftermarket support or maintenance or warranty, or what is it that you'll have to do in order to support these deployments that you don't have right now?\n\nPaul Travers -- Chief Executive Officer\n\nThat we don't have or that we don't have enough of maybe would probably be a better way to think about that. Look, in many of these cases, we recommend that they buy extra units on site. So, if they need -- for instance, one to 400 per site, which in some cases we have partners that -- deployments that would have those kinds of numbers. In other cases, there's like 10 to 50 per site kind of a thing.\n\nIn those cases, we always recommend if it's a smaller number, a few spares; if it's a bigger number, more spares. And we have programs in place with these guys to allow them to return product fast if they need to. I will say, our return rates on M400s, which is probably the lead dog in all of this, is pretty low. We do not get a lot of warranty repair back.\n\nThey're quite low numbers. It's more work upfront, which is part of the reason why it's taking longer to deploy than we'd like to see it. But once you get over that front-end, there's less handholding that's required. I would also say that, in almost every case, this is done with an ISV a partner with Vuzix.\n\nAnd those folks are also supporting these programs with these companies. So, there's a level of support that comes from two companies to help make this happen, in almost most cases.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nGreat. Thank you. That's it for me.\n\nOperator\n\nThank you. At this time, I'd like to turn the floor back over to Mr. Travers for closing comments.\n\nPaul Travers -- Chief Executive Officer\n\nEverybody, I'd like to thank you for participating in the call today. I hope everybody is getting a good feel for the excitement that's going on at Vuzix these days. It's a really fun time to be at Vuzix, I have to say. It's great to see the level of interest across the board and what our product mixes are doing to the world.\n\nAnd we look forward to sharing a lot more with everybody as the next year and actually couple years unfold. Exciting times to be Vuzix. And thank you very much for all being shareholders. Have a good evening, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEd McGregor -- Director of Investor Relations\n\nPaul Travers -- Chief Executive Officer\n\nGrant Russell -- Chief Financial Officer\n\nMatt VanVliet -- BTIG -- Analyst\n\nUnknown speaker -- Craig-Hallum Capital Group -- Analyst\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nMore VUZI analysis\n\nAll earnings call transcripts"
}