{
  "companyName": "ON24, Inc.",
  "companyTicker": "ONTF",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/on24-inc-ontf-q2-2022-earnings-call-transcript/",
  "content": "ON24, Inc. (ONTF 2.25%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and thank you for standing by. And welcome to the ON24, Inc. second quarter 2022 financial results conference call. Please be advised today's conference is being recorded and a replay will be available on ON24's Investor Relations website.\n\nI would now like to hand the conference over to Lori Barker, investor relations. Please go ahead.\n\nLori Barker -- Investor Relations\n\nThank you. Hello, and good afternoon, everyone. Welcome to ON24's second quarter 2022 earnings conference call. On the call with me today are Sharat Sharan, co-founder and CEO of ON24; and Steve Vattuone, chief financial officer of ON24.\n\nBefore we begin, I would like to remind everyone that some information provided during this call will include forward-looking statements regarding future events and financial performance, including guidance for the third quarter and full fiscal year of 2022. These forward statements are subject to known and unknown risks and uncertainties. ON24 cautions that these statements are not guarantees of future performance. All forward-looking statements made today reflect our current expectations only, and we undertake no obligation to update any statements to reflect the events that occur after this call.\n\nPlease refer to the company's periodic SEC filings and today's financial press release for factors that could cause our actual results to differ materially from any forward-looking statements. We'd also like to point out that on today's call, we will report both GAAP and non-GAAP results. We use these non-GAAP financial measures to evaluate our ongoing operations and for internal planning and forecasting purposes. Non-GAAP financial measures are presented in addition to and not as a substitute for financial measures calculated in accordance with GAAP.\n\nTo see the reconciliation of these non-GAAP financial measures, please refer to today's financial press release. I will now turn the call over to Sharat.\n\nSharat Sharan -- Founder and Chief Executive Officer\n\nThank you, and welcome, everyone, to ON24's second quarter 2022 financial results conference call. We appreciate you joining us. On today's call, I will review our Q2 results, provide a progress update on our fiscal 2022 priorities and share how we believe we are positioned to return to growth in 2023. First, for those of you who are new to ON24, I would like to spend a few minutes to reiterate who we are and how our platform is a must-have for B2B businesses to drive revenue growth.\n\nON24 is a digital engagement platform, purpose-built for B2B sales and marketing. We enable thousands of businesses to convert millions of their prospects into customers and count some of the world's largest and most recognized businesses as our customers, including three of the five largest global technology companies, three of the six largest US banks, three of the five largest global healthcare companies and three of five largest global industrial and manufacturing companies. We have a very large TAM that we currently estimate to be over $44 billion worldwide and expect this market opportunity to grow as the move to digital continues to accelerate it. According to Gartner, 80% of B2B sales interactions will happen through digital channels by 2025, which has the potential to provide significant tailwinds to ON24.\n\nWe enable companies to digitally transform their sales and marketing by providing a single digital engagement platform for several go-to-market functions across the enterprise demand generation to customer marketing to partner enablement. Our platform powers a suite of seven different experience products. Our customers use these products to engage with millions of prospects at scale. We take the audience engagement from these products and convert that into first-party data and insights, which are made actionable through our deep integrations with our customer, sales and marketing ecosystems to drive revenue growth.\n\nTurning to Q2 results. Total revenue was $48.2 million, exceeding the high end of our guidance. Subscription and other platform revenue was $43.1 million, and professional services revenue was $5.2 million. We posted a non-GAAP operating loss of $6.2 million, also ahead of our guidance.\n\nWe continue to remain well-capitalized with approximately $345 million in cash and marketable securities. Ending ARR was $167.8 million representing an increase of 2% year over year and in line with our expectation of very modest ARR growth. As we all know, the global macroeconomic environment continues to remain volatile. Like others, we also experienced longer sales cycles and greater deal scrutiny, particularly with new business at and over the $100,000 threshold.\n\nWe also saw some customers rationalize their spend upon renewal as they face budgetary pressure. While our total customer count declined sequentially, the number of customers contributing greater than $50,000 in ARR was roughly flat sequentially and represents the vast majority of our ARR, which is consistent with prior quarters. With a more uncertain economic market, we pivoted to focus on our existing customers, and we had a strong quarter on the expansion front, which included closing the largest deal in our history. A number of our top customers are making increased investments with on 24 as we deliver cost-effective SaaS ROI and continue to be a critical component of their go-to-market tech stack.\n\nNew products in our portfolio are resonating. Our customer base is adding multiple products and making multiyear commitments to ON24. Let me share some color on these expansion wins. A longtime top ON24 customer, which is one of the world's largest technology companies, expanded with a seven-figure deal, growing their total spend with 24 by over 100%.\n\nFor the past several years, we've helped power this customer's global demand generation engine. During Q2, a significant division of this organization consolidated their global partner enablement program on the ON24 platform. They will now deliver training, enablement and certification to thousands of worldwide partners and system integrators using ON24. In Q2, we signed the largest deal in our history, which consists of a multiyear commitment, including our newest products.\n\nThis existing customer is a leading learning platform company who helps upscale the workforce of thousands of enterprises. After seeing the power of our two newest live experience products ON24 Forums and Go Live, they decided to expand their use of our platform and enhance their digital engagement strategy. As a result, we increased this customer's total spend by 30% and solidified our long-term strategic partnership. Finally, one of the world's largest software companies increased their investment in our platform and commitment to our partnership, because of our successful track record of delivering cost-effective ROI with a multi-year seven-figure deal.\n\nOur first-party engagement data plays a central role in their go-to-market execution strategy, achieving meaningful results, such as significantly increasing marketing pipeline and increasing their average deal size. Now taking a step back. More than 20 years ago, I co-founded ON24 and has navigated the company through several challenging economic cycles. Historically, ON24 has done well during uncertain times.\n\nOur solutions help companies drive top-line results with a cost-effective sales and marketing, digital engagement solutions. We believe many customers are prioritizing fast ROI solutions like ON24 and are looking to consolidate their point solutions onto a single platform for better economies of scale. While we remain optimistic on our long-term market opportunity, we have taken a hard look across our business operations and made the decision to better align our cost structure with the realities of the current environment and customer demand to secure long-term growth with an improved business model. The cost reduction plan includes reducing headcount by approximately 5% from mid-Q2 levels and is expected to be substantially completed by the end of Q3.\n\nThis was a difficult decision, and I want to express my sincere gratitude to those that will believe in us. Shifting gears, let me provide a progress update on our four strategic priorities for 2022. First, we have made substantial headway on our aggressive product road map. Last year, our customer conversations highlighted a consistent need for point solution consolidation.\n\nThey wanted to expand the first-party engagement data they get from ON24 to more of their experiences beyond traditional demand gen webinars and virtual events, to turn in their partner training, roundtables, executive briefing centers and so on into a data-driven strategy. Once our customers start using our platform and have ON24's first-party data integrated with their systems, it is easier to adopt more of our experienced products and keep their first-party engagement data unified and generated from one platform. So as we look at the future of our platform, our innovation agenda will be focused on enhancing the engagement, first-party engagement data and deep integrations we can provide to our customers. After launching this past April, ON24 Forums has been well received by our prospects and existing customer base.\n\nOne of our new logos in Q2 was a leading American auto parts distributor that purchased Forums. After struggling to scale their program with a collaboration tool, they purchase Forums to educate and certify the reseller partners and technicians in the field. Most important to this customer was our first-party data and flexible API, which makes it possible for them to automatically track and certify course completion. As an aside, while you likely have seen ON24 power many earnings webcast, this is a minor part of our legacy business that we will be winding down.\n\nMoving to our other priorities. Within our enterprise go-to-market, we have seen steady growth in the number of multiproduct deals and building C-level relationships for large complex transactions. In Q2, the percent of customers with two or more products reached another record high. One of the new Q2 multiproduct deals, I'll highlight was with a multinational insurance firm from EMEA.\n\nThey came to us with multiple use cases to address across the go-to-market execution, including demand generation, customer market, partner enablement and internal employee engagement. The key to our win was the ability to provide seamless integrations with their tech stack and provide a 360-degree view of all their first-party engagement data across every ON24 experience, something collaboration tools were not able to do. Now they are using us to create a full ecosystem of experiences powered by ON24 Elite, Breakouts, Target and Engagement Hub. We are seeing similar success selling multiproduct deals with our existing customer base.\n\nAnother one of our long-term customers is one of the largest multinational banks. Their corporate banking group needed a way to engage the employees of their enterprise clients and provide financial wellness education as an HR benefit, while tracking the performance of the program and reporting value back to their HR clients. Through the combination of ON24 Elite, Target and Engagement Hub regain a powerful digital channel to connect with corporate employees, drive them to take an action and provide a robust set of analytics back to their employers, intelligence that we believe they would not get with any other solution. Next, on the customer success front, we have seen positive signals from the investments we have made with gross dollar retention improving quarter over quarter.\n\nWe have also heard great feedback from customers on our revamped onboarding program. Lastly, we continue to see steady revenue contribution from our partner ecosystem. The percentage of partner-influenced deals in Q2 crossed double-digits, and the number of partner-influenced opportunities added to our pipeline has more than doubled year over year. An example of our Q2 partner strategy execution is a win with a leading global biopharmaceutical company.\n\nThey wanted to consolidate their external digital engagement onto one platform to make it easier for healthcare providers and patients to engage with a consistent, connected experience and streamline their own team's ability to execute. Our deep data integration with Viva and partnership with a regional system integrator gave us a competitive edge. In conclusion, while the economic backdrop may continue to be turbulent, I'm confident in our strategy and long-term market opportunity. We have managed through these cycles before and a number of our top customers are increasing their investments with ON24.\n\nEven more importantly, our traction on new products is grown and our product enhancements excite me for the future. With the organizations under mounting pressure to deliver more with less, we are well positioned to help them consolidate point solutions onto a single platform for digital engagement. Given these factors, I'm optimistic that we will return to growth in 2023 with an improved business model. With that, I'll hand it over to our CFO, Steve Vattuone, to walk you through Q2 results in more detail and provide our outlook.\n\nSteve Vattuone -- Chief Financial Officer\n\nThank you, Sharat, and good afternoon, everyone. I'm going to start with our second quarter 2022 results and we'll then discuss our outlook for the third quarter and full year 2022. Total revenue for the second quarter was $48.2 million, representing a decrease of 7% year over year. Subscription and other platform revenue was $43.1 million, a decrease of 3% year over year.\n\nThis includes overages, which were under 2% of revenue in Q2 of this year compared to 3% of revenue in Q2 of the prior year. Professional services revenue was $5.2 million, a decrease of 33% year over year and representing approximately 11% of total revenue compared to 15% in the year-ago period. This decrease is in line with our expectations we provided last quarter. Moving on to ARR.\n\nARR represents the annualized value of all subscription contracts at the end of the period and excludes professional services and overages. Ending ARR was $167.8 million, an increase of 2% year over year, which is in line with expectations. The macro environment remains challenging, we experienced longer sales cycles with more approvals needed for business at and over the $100,000 threshold. Despite these challenges, we had a strong quarter for expansion and closed the largest deal in our history.\n\nCustomers are continuing to increase their multiyear commitments with us with a percentage of our ARR and multiyear agreements increasing from the prior quarter to the highest ever. Also, I am pleased to see the percentage of customers with two or more products in each record levels, and our new customer, ASP was over 30% higher than any of the prior four quarters. Turning to customer metrics, total customer accounts increased by 1% from Q2 last year to 2,101 customers. We experienced a sequential decrease in total customer count, which was driven by lower commercial logo acquisition and SMB logo churn.\n\nA number of customers contributing ARR at $50,000 and above was roughly flat from the prior quarter represents the vast majority of our ARR, which is consistent with prior quarters. We ended the quarter with 349 customers, contributing ARR of $100,000 or more, representing an increase of 1% year over year. Although the number of 100,000-plus customers decreased sequentially, ARR contribution from the $100,000 plus customer cohort was consistent with the previous quarter and represents approximately two-thirds of our total ARR. Before turning to expense items and profitability, I would like to point out that I will be discussing non-GAAP results going forward.\n\nOur non-GAAP results include stock-based compensation as well as other certain items. Our GAAP financial results, along with a reconciliation between GAAP and non-GAAP results can be found within our earnings release. Gross profit in the quarter was $35.9 million, representing a gross margin of 74%, which is a four-point decrease in the gross margin percentage year over year. We are investing in our public cloud infrastructure capabilities and have grown our customer success teams over the past year to drive improved retention.\n\nNow, turning to operating expenses. Sales and marketing expense in Q2 was $25.2 million compared to $23.9 million in Q2 last year. This represents 52% of total revenue compared to 46% in the same period last year. While we have made targeted investments in our go-to-market functions over this past year, we are tightening our sales and marketing spend, given the current macroeconomic environment.\n\nR&D expense in Q2 was $8.9 million, compared to $7.3 million in Q2 last year. This represents 18% of total revenue, compared to 14% in the same period last year. We increased our R&D spend this past year, as we have brought new products to the market and expanded our platform. And for the remainder of this year, we expect any R&D spending increases to be relatively moderate.\n\nG&A expense in Q2 was $8.1 million, compared to $7 million in Q2 last year. This represents 17% of total revenue, compared to 13% in the same period last year. Our G&A expenses have increased this past year due to the costs associated with being a publicly traded company. G&A expense increases have moderated sequentially this year -- and as our G&A function matures, we expect G&A expense to scale and decrease as a percentage of revenue over time.\n\nOperating loss for Q2 was $6.2 million or a negative 13% operating margin, compared to operating income of $2.5 million and an operating margin of 5% in the same period last year. Net loss in Q2 was $6.4 million or $0.14 per share based on approximately 47.2 million basic and diluted shares outstanding. This compares to net income of $2.5 million or $0.04 per diluted share in Q2 last year using approximately 55 million diluted shares outstanding. Turning to the balance sheet and cash flow, we ended the quarter with $344.9 million in cash, cash equivalents and marketable securities.\n\nOur capital position is advantageous in a challenging macroeconomic environment of uncertain duration. We also believe it will allow us to be nimble in our decision-making with regard to organic and inorganic investments, and we will be disciplined in our approach with a focus on maximizing every dollar of our shareholders' capital. Turning to our use of cash in the quarter, cash used in operations in Q2 was $2.7 million compared to cash flow from operations of $6.9 million in Q2 last year. Free cash flow was negative $3.4 million in Q2 compared to positive $5.7 million in Q2 last year.\n\nFree cash flow margin was negative 7% and in Q2, compared to positive 11% in Q2 last year. In Q2, we repurchased 566,000 shares at a weighted average price of $13.27 per share utilizing $7.5 million. As of the end of Q2, we have utilized $29 million under the share repurchase program was $21 million remaining out of the $50 million authorized under the share repurchase program. Before providing our outlook, I'd like to make an observation.\n\nIn 2020, we experienced explosive growth, growing our ARR 100% year over year, and we continue to experience high growth in the first half of with our Q2 2021 platform revenue growing 64% year over year. Coming off such rapid growth, we believe we will get back to growth in 2023. Now turning to guidance, we are reiterating our 2022 annual revenue guidance. At the same time, as Sharat mentioned, we are reducing our cost structure and improving non-GAAP operating loss guidance for 2022.\n\nFor the full year, we expect revenue in the range of $191 million to $195 million. Professional services revenue is expected to be low double digits as a percentage of total revenue, representing a year-over-year percentage decline of low to mid-20s. I would like to provide some additional context on our revenue guidance. In 2021, professional services revenue was 14% of our total revenue, and this year, our current guidance is for that to decrease to low double digits as a percentage of our revenue, which is largely driven by more of our customers electing to be self-service.\n\nIn addition, as we discussed on our call in March, overages are trending lower this year as more customers have added capacity into their contracts at the time of renewal and thus ensure fewer overages. While neither of these items are part of our ARR. Both of these items acted an approximately 4% headwind for our full-year revenue growth rate in 2022. Global macroeconomic environment remains volatile; and we believe that we may continue to see longer sales cycles and greater deal scrutiny for larger deals.\n\nGiven this backdrop, we believe it's prudent to assume that net ARR additions will be roughly flat for the second half of the year. We are improving our previous 2022 annual bottom line guidance and expect a non-GAAP operating loss in the range of $27.5 million to $24.5 million and a non-GAAP net loss per share of $0.57 to $0.51 per share, using 48.1 million basic and diluted shares outstanding. These estimates include the impact of our cost reduction activity, partially offset by the impact of inflation on compensation and other variable costs. Our cost reduction activity included 5% reduction in our headcount this quarter compared to where we stood in mid-Q2 of this year.\n\nThe headcount reduction will be substantially implemented by the end of Q3. For Q3, we expect total revenue in the range of $47 million to $48 million. Professional services is expected to represent approximately 10% to 11% of total revenue, representing a year-over-year percentage decline in the low to mid-teens. We expect a non-GAAP operating loss in the range of $8 million to $7 million and a non-GAAP net loss per share of $0.17 to $0.15 per share based on 47.4 million basic and diluted shares outstanding.\n\nWe expect a restructuring charge of $1 million to $3 million related to our cost reduction plan. This restructuring charge is excluded from the non-GAAP amounts provided above. In conclusion, we are confident in our ability to navigate through this volatile macro period, and we believe we are well-positioned to return to top line growth in 2023 with an improved cash flow profile. We will also lap the difficult comparables from services and overages started early next year.\n\nWith that, Sharat and I will open the call up for questions. Operator?\n\nOperator\n\n[Operator instructions] We'll take our first question from Arjun Bhatia with William Blair. Please go ahead.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nThanks, guys. Thanks for taking the question. Just on the macro front, can you talk a little bit about where in terms of from an industry perspective, where you're seeing more weakness versus where there is strength and where you're still seeing expansion opportunities? And then for Steve, is flat ARR growth, do you think that's achievable in light of the macro uncertainty plus some of the SMB churn and rationalization that you're still seeing in this environment?\n\nSharat Sharan -- Founder and Chief Executive Officer\n\nArjun, let me take that, and Steven can jump in. I think your first question was macro. And so let me take that first. As we've talked about, we are seeing some macro uncertainty.\n\nNow we've managed through this, Arjun, as you know, before. And so one of the things in Q2, when we started seeing this, we pivoted to our customer base more and a number of our top customers are increasing their investments with ON24. We talked about, we closed the largest deal in our history, a high seven-figure deals with a multiyear deal with a learning technology platform. We also -- another large customer, we doubled their ARR spend.\n\nWhere we saw challenges was in the new business side, where we saw sales cycles lengthen for large deals greater than $100,000. At the same time, our ASP in -- was the highest by 30% in the last four quarters. We saw some challenges in the commercial logo space because acquiring commercial logo was a little challenging. We saw headwinds in EMEA, they continued.\n\nFrom a vertical point of view, life sciences and financial services were OK, but we saw challenges in technology and manufacturing. I mean what we also saw overall that our customers are eager to consolidate their sales and marketing engagement platform to kind of one vendor. And especially ON24, where we provide cost-effective ROI solutions and allow them to consolidate demand generation partner, field and others. And we saw that as an example in EMEA.\n\nI talked about that in the prepared remarks, a six-figure multiyear deal where that insurance company, bringing together demand generation partner, customer marketing, etc. Now on ARR, your second question, let me start that, and Steve can kind of jump in. We are being prudent about the second half. Q3 is generally more challenging.\n\nSo that's -- because it's seasonally softer, I think Q4, we have a little reduced visibility. But based on some of the work that we are seeing in our installed base from an expansion point of view and also some of the progress that we are making on churn, we believe that we should be able to deliver that. Again, Q3 is seasonally softer.\n\nSteve Vattuone -- Chief Financial Officer\n\nYes. If I could just jump in and add on to what Sharat was saying. First of all, we were pleased to be able to reiterate our annual guidance in the current environment. And in terms of Q3, we do have better near-term visibility for Q3 than Q4, as Sharat mentioned.\n\nAnd while we are seeing a little bit of weakness in the lower end of the market, we are seeing some good results with our installed base. Sharat gave out some of the impressive wins that we had this quarter. And the percentage of our revenue in multiyear deals is the highest ever, and the percentage of our customers with two or more products is -- is the highest ever. So that gives us confidence in our ability, even in this challenging environment to at least deliver relatively flat ARR in the second half of the year.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nOK. Got it. That's very helpful. And then -- I know you're taking some steps here to improve profitability.\n\nWe have the cost reduction plan, a little bit of the restructuring. It sounds like you're being more prudent with sales and marketing spend. But how should we think about the time line to which you get to sustained profitability? Is that a 2022 story? Is that still further out and more of a long-term dynamic?\n\nSharat Sharan -- Founder and Chief Executive Officer\n\nYes. Let me go ahead and take that one. So we are adjusting our cost structure to lower our costs going into 2023. And we're happy to provide improved bottom-line guidance.\n\nAs we mentioned, we did reduce our headcount by 5% for mid-Q2. We're expecting to see improved bottom line performance in 2023 as we drive growth with an improved business model. We're always balancing profitability and growth and our goal is to return to growth in 2023 with an improved cost structure that shows an improving bottom line. We really won't see the full impact of our cost reductions until in Q4.\n\nBut going into 2023, we do look to have an improved cost profile. And we're always going to monitor our spending and we'll make adjustments in the future as we need be as we look to continue to improve the bottom line here.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nAll right. got it. Thanks for taking the question.\n\nOperator\n\nWe'll take our next question from Scott Berg with Needham.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, Sharat. Thanks for taking the question. I guess just a couple here. Yeah.\n\nThanks. I guess a couple here. Sharat, you talked about some rationalizations in the quarter. Should we think about those as being separate or in addition to the ones that you've spoken about the last couple of quarters?\n\nSharat Sharan -- Founder and Chief Executive Officer\n\nI think, Scott, what we discussed in Q1, where we saw from a handful of customers, pretty significant rationalization which really impacted the down-sell from those particular customers. I think the rationalizations that we are -- what we are really talking about is that -- in the new business, we saw sales cycles mentor large deals over $100,000. So that's just kind of a lengthening of the sales cycle. I think overall from our installed base, we really saw -- we didn't saw issues with the rationalization or down-sell this quarter.\n\nI think we have that under control. What we really saw that a lot of -- a number of our large customers really doubled down, increased the investment ON24, those are the examples I gave you. I think we saw some strong performance on the expansion side. Also on the churn of prospect side, we made progress from Q2 levels.\n\nI expect that our churn is going to continue to increase into 2023. And we feel we've got line of sight to getting back to pre-COVID levels also.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. That's helpful. And then I wanted to just talk about the growth opportunity for next year. You both commented that you expect to return to revenue growth next year.\n\nBut if we think about ARR being flat here in the second half versus where you ended up in the second quarter, I guess my math would tell me that subscription revenues are probably flattish or so in Q1 and Q2 next year. I guess, how should we think about your confidence or visibility about your opportunity to return to growth? Because that assumes some positive ARR bookings probably entering next year, which is a little bit different than what your guidance is? Thank you.\n\nSharat Sharan -- Founder and Chief Executive Officer\n\nYes. So first of all, Scott, one of the things that we are doing right now is because our visibility in Q4 is limited, that's why we are guiding toward flattish growth, ARR growth for the second half of the year. But let me provide you context on how we are looking at 2023 growth. So first of all, we expect to return to growth in 2023 and to pre-corporate levels over time.\n\nAnd let me break it down into three core components to build that. Like most companies, we break it down between gross retention, net retention and new business. So on the gross retention side, we are making progress. Q2 is better, and we expect it better next year.\n\nAnd I talked about, we believe we've got line of sight to get back to pre-pandemic levels of retention in due course of time. Net retention, which is our expansion, this thing we had a strong result and our customers are buying more products, we have more products. The percentage of our customers buying two or more products was the highest ever in Q2. So we believe we are going to continue to make progress on net retention.\n\nNew business is where the macro will be the macro, but we provide an efficient and effective way for companies to drive revenue through an engagement platform, first-party data and insights. So I think as I look at it, yes, with a flattish ARR, maybe Q1 will have some impact. But we believe that we will start making progress in ARR starting early next year, and that will have an impact in the quarters after that.\n\nSteve Vattuone -- Chief Financial Officer\n\nAnd in addition to what Sharat was saying, one other thing I'd like to point out, in 2021, our service revenue was 14% of our total revenue. And this year, for that to be in the low double digits. So that is a bit of a headwind this year and that headwind will be gone largely entering 2023. And in addition, we had a bit of a headwind this year from -- I'm sorry, from overages, as those normalized year-over-year and that headwind will be gone next year as well.\n\nScott Berg -- Needham and Company -- Analyst\n\nGreat. Very helpful. Thanks for taking my questions, everyone.\n\nOperator\n\nWe'll now take our next question from Noah Herman with J.P. Morgan.\n\nNoah Herman -- JPMorgan Chase and Company -- Analyst\n\nHi, guys. Thanks for taking my questions. So just going forward, how should we think about, how much you will lean more into the direct sales motion, maybe versus the partner network or the channel? And then given the guidance provided, are you assuming any kind of deteriorating environment from the macro standpoint from here? Thanks.\n\nSharat Sharan -- Founder and Chief Executive Officer\n\nYes. No. I think your first question was direct sales versus partner. So let me tell you a little about -- and then I'll come to the macro environment a little more.\n\nSo -- the partner channel is one of our top priorities. We are still mainly our direct force focus on enterprise and commercial segments. But it is the part that we're building our partner channel is clearly one of our top priorities. In Q2, our partner-influenced business that we closed for new business came close to double-digit levels and the highest ever and for many -- many of you who've been on the call for the last four quarters, we've literally been able to bring that from low single digits to close to double digits.\n\nSo we are doing well there. The partner influence pipeline has also doubled in one year, so that has been good. And our goal is to get it over 20% over time. And we focus on three kind of partners, agencies, strategic technology partners and regional system integrators.\n\nSo I still believe that we are going to, for the most part, focus on our direct motion, but we are little significant traction on the partner network side. Now talking about macro environment and deteriorating macro environment potentially. So I think one of the things that I want to mention though, I mean, we have managed through economic cycles before and we know how to manage through them. I mean right now, we -- our visibility is what it is.\n\nThat's why you try to come up front and talk about the second half. But just to provide your perspective, in the last recession, which was prior to our IPO, and that was some time ago and we were a smaller company. But ON24 performed well. We generally have done well in uncertain times because in such times, companies are looking for a cost-effective solutions to engage with their prospects and convert them to customers and we see that across the verticals, technology, pharmaceutical, financial services.\n\nIn a way, the way we see it, we believe we have the perfect product for the times, especially as people want to do more with less.\n\nNoah Herman -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you so much.\n\nOperator\n\nWe'll now move on to our next question from Mauro Molina with Piper Sandler.\n\nMauro Molina -- Piper Sandler -- Analyst\n\nHi. This is Mauro. Just jumping on for Brett here. Thanks for taking our questions.\n\nJust two from us really. So I just kind of wanted to double click on EMEA, if we can. Obviously, we've seen a lot of companies reporting seeing some challenges there here in Q2. So anything in particular you can speak to regarding challenges there, maybe specifically with regards to certain verticals or customer sizes that we should be thinking about? I think you mentioned manufacturing in the past.\n\nAnd then as a follow-on to that, any impact from FX on the full-year guide that we should be thinking about?\n\nSteve Vattuone -- Chief Financial Officer\n\nYeah. Let me -- this is Steve. Let me go ahead and I'll talk about where we landed on EMEA relative to our expectations. And then I'll take the FX question and then I'll let Sharat talk a little bit about the general market environment in EMEA.\n\nSo EMEA came in about where we thought it was this quarter. In the last call, we set expectations that we expected to see some macro headwinds in EMEA given the state of things in the world in EMEA, in particular. In 2021, EMEA was 18% of our revenue. In Q1, last quarter, it was 17%.\n\nWe suggested we expected to drop a couple of points as a percentage of our revenue this year and then Q2 it was 16% of our revenue, which was year over year the decline of our revenue from EMEA was about 15%, which is about what we had expected in line with the guidance -- in accordance with how we guided. Now in terms of FX, the vast majority of our revenue was billed in US dollars. So the impact of FX on our top line was limited in the first six months of 2020 to 13% of our revenue was in foreign currencies. So we are seeing some impact, but it is a little bit limited.\n\nAnd any FX impact, which was some has been incorporated in our guidance.\n\nSharat Sharan -- Founder and Chief Executive Officer\n\nLet me just add what Steve said on and give you a little more qualitative thing sorry, Mauro, on the EMEA. From a vertical point of view, of course, manufacturing, which is a core vertical there is still challenged. But I also look at it from the point of view of threshold of deals. We continued elongated sales cycles and deals that are $100,000 and above.\n\nWe continue to see that, even though we did have some good wins there. I think the commercial business also because a lot of these companies are private tends to be a little more challenged. We did see good performance continue in categories like life sciences and pharmaceuticals. But we saw that across the board, but also in EMEA.\n\nSo hopefully, that helps.\n\nMauro Molina -- Piper Sandler -- Analyst\n\nYes. Absolutely. Thank you for that. And then just one more from us.\n\nI think you've talked in the past about a certain customer profile that really isn't sort of the ideal customer that you're targeting, maybe a little bit on that smaller SMB side? And how close are you to kind of getting the size of that SMB cohort to where you would want it? And kind of as a follow on to that, what is the ideal mix of the SMB business in your overall customer base?\n\nSharat Sharan -- Founder and Chief Executive Officer\n\nSo when you look at the -- we've got three core segments. We've got the enterprise business that has 2,000 employees and above. We've got the commercial business under 2,000 employees. And I think the SMB kind of tightens up to be about somewhere around 50 to 100, something around there.\n\nThat's the SMB cohort. But if you look overall, the SMB cohort is about 10% of our revenue. So -- but from a logo point of view, the logos may be about maybe even more about a third or others. So we generally see more challenges in logo churn in the SMB.\n\nBut from an ARR point of view, I think we have it pretty well sized. But from a logo churn, it does show some challenges, especially in these environments. But let me also go back to your question about ideal customer profile. Even in the SMB, we really love data-driven marketers, people who have a data-driven agenda, because over two-thirds of our ARR is integrated in company sales and marketing ecosystem.\n\nSo all the first-party data and insights that our engagement platform provides is in the -- is at the fingertips for the sales and marketing people through deep integrations. So if you're an SMB company, and you are integrating in your platform, we see much, much lower churn there. So that continues to be a good area of focus for us. That's a key part of the qualifier, if you're really trying to drive pipeline or some of our core use cases and you integrate that in your sales and marketing ecosystem.\n\nSo hopefully that helps.\n\nMauro Molina -- Piper Sandler -- Analyst\n\nAbsolutely. Thank you very much.\n\nOperator\n\nAnd with no additional questions in the queue, I would now like to turn the conference over to Mr. Sharan for any additional or closing remarks.\n\nSharat Sharan -- Founder and Chief Executive Officer\n\nThank you. As you heard today, a number of our top customers are increasing their investments with ON24. In today's economic environment, the ON24 platform is well positioned with our portfolio of experienced products, first-party data and insights to drive revenue growth for our customers efficiently and effectively. We have a proven track record of navigating through challenging cycles, and I'm confident we will emerge stronger from this current cycle.\n\nAnd the progress we have made on our priorities and our adjustments to our cost structure sets the stage for us to return to top-line growth in 2023 with an improved business model. Thank you, everyone, for being on the call today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLori Barker -- Investor Relations\n\nSharat Sharan -- Founder and Chief Executive Officer\n\nSteve Vattuone -- Chief Financial Officer\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nNoah Herman -- JPMorgan Chase and Company -- Analyst\n\nMauro Molina -- Piper Sandler -- Analyst\n\nMore ONTF analysis\n\nAll earnings call transcripts"
}