{
  "companyName": "Enstar Group",
  "companyTicker": "ESGR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/enstar-group-esgr-q3-2022-earnings-call-transcript/",
  "content": "Enstar Third Quarter 2022 Audio Update with Domonic Silvester, Orla Gregory, and Matt Kirk-TRANSCRIPT\n\nEnstar Group (ESGR -0.26%)\nQ3 2022 Earnings Call\nNov 3, 2022 \n\nMATT KIRK, GROUP TREASURER AND HEAD OF INVESTOR RELATIONS\n\n\nHello everyone, I am Matthew Kirk, Group Treasurer and Head of Investor Relations. Thank you for listening to Enstar's Third Quarter 2022 Earnings Audio Review with CEO Dominic Silvester and CFO Orla Gregory.\n\n\nBefore we begin, I'd like to remind everyone that this presentation contains forward-looking statements and non-GAAP financial measures. Forward-looking statements in this presentation include but are not limited to statements about Enstar's expectations for pending and future transactions, run-off liability earnings, the performance of its investment portfolio and the impact of rising interest rates on Enstar's business. These statements are inherently subject to risks, uncertainties and assumptions that may cause actual results to differ materially from the statements being made as of the date of this Update or in the future. Additional important information regarding these statements and measures is outlined in the text that appears below the link to this recording. With that, I will turn it over to Dominic.\n\n\nDOMINIC SILVESTER, CEO\n\n\nThank you, Matt and thank you to all of those listening today.\n\n\nEnstar had an active third quarter from an operational standpoint, and we continued to deliver on our core strategy of providing attractive capital release solutions to our partners.\n\n\nWhile our investment portfolio continued to be impacted by unrealized losses driven by inflation and rising rates, as was the norm throughout the insurance industry, we remain confident that our investment strategy will continue to generate strong returns over the long term. Further, Orla will discuss later how Enstar expects to benefit from the rising interest rate environment.\n\n\nDuring the quarter:\n- We announced our Loss Portfolio Transfer agreement with Argo, with reserves of approximately $750 million dollars. This continues our trend of executing on larger-scale transactions, where we have competitive advantages to deliver value to our partners and shareholders.\n\n\n- We announced our split RITC transaction with Probitas which aligns our continued commitment to servicing Lloyd's and further demonstrates our ability to provide tailored solutions to the full market.\n\n\n- From a strategic perspective, we completed the commutation of Enhanzed's Catastrophe book, and as a result, expect to record approximately $60 million dollars in favorable development in the fourth quarter. We later entered into a novation agreement to sell Enhanzed's portfolio of deferred annuities and whole life policies. This transaction has received regulatory approval and we expect closing next week. While the decision to wind-down Enhanzed was taken mainly due to a lack of scale for that platform, we remain open to other assumed life opportunities should they provide an attractive diversified earnings profile.\n\n\nWe continue to make steady progress with respect to active claims, leaving us optimistic about our potential for strong fourth-quarter run-off liability earnings, or RLE. Our new business pipeline remains robust and active, with numerous $1 billion dollar plus liability opportunities. Further, our significant capacity, scale, expertise and global presence in the market provides us a great opportunity to compete and outperform. However, we maintain our disciplined pricing approach to ensure we deliver solid future returns, particularly given the ongoing challenging macro environment.\n\n\nOverall, as Orla will discuss later, our economic balance sheet has become stronger and Enstar is well-positioned to prosper across varying insurance cycles. We remain committed to delivering attractive ROE over the long term.\n\n\nWith that, I'll now turn it over to Orla.\n\n\nORLA GREGORY, CFO\n\n\nThanks, Dominic.\n\n\nThe third quarter was similar to the first half of the year, with negative investment performance driven by rapidly rising rates and an increasingly challenging economic environment.\n\n\nWe recognized $546 million of net unrealized investment losses, of which $151 million relates to our non-core equity investments, and $395 million relates to our core trading fixed income portfolio. These results drove our third-quarter net loss of $444 million and a return on equity of negative 10.6%. While we generally hold our fixed income portfolio to maturity, we will also undertake tactical repositioning as opportunities arise with a view toward achieving a better result than passively waiting as the portfolio naturally pulls to par.\n\n\nMoving to our underwriting performance, we recorded positive RLE of $109 million for the quarter, and adjusted RLE of $14 million, with the fair value adjustment of $82 million being the largest contributor to the difference.\n\n\nWe completed approximately 20% of the value of our annual reserve reviews in the third quarter and the following themes arose:\n• Favourable experience in the workers' compensation elements of our portfolios, where our claims settlement experience continues to drive positive outcomes.\n• This was partially offset by adverse experience in General Casualty, where we have observed additional claims settlements on our larger claims, and our Motor book of business, where we continue to experience higher-than-expected development.\n• In addition, we did see increased claim cost severity on certain construction and construction defect portfolios, mainly attributable to inflationary pressures on labour and materials. That said, the Construction Defect lines of business represent only 1% of our reserves and therefore had minimal impact on our experience.\n\n\nGiven our reserve composition and excellence in speedy claims settlement, Enstar remains well-positioned and adequately reserved within the industry. Further, we expect that our fourth quarter annual actuarial reviews will deliver RLE and Adjusted RLE consistent with previous years' results.\n\n\nIn the likely event of further rate increases by the Federal Reserve, we would anticipate additional unrealized investment losses in the near term. However, our economic balance sheet remains well insulated because of the offsetting discount in loss reserves that we recognise. We remain confident that Enstar will benefit over the long-term from an extended higher interest rate environment, given that:\n• Firstly, $2.7 billion of our investments are floating rate, most of which are tied to Libor. Libor has increased by 355 basis points since the beginning of the year which in turn is resulting in more net investment income.\n• Secondly, as we acquire new portfolios and put new money to work, we will benefit from higher yields. Whereas new money yields were below 2.0 percent in 2021, we now have the ability to achieve new money yields in excess of 5.5 percent.\n\n\nImportantly, our team has substantial experience managing through interest rate volatility and multiple economic cycles, and we are confident that we have created a flexible business model where our ability to acquire business is not impacted by a changing rate environment.\n\n\nAs Dominic mentioned earlier, our solvency or economic balance sheet has become stronger in the current rising interest rate environment. Let me explain this further.\n\n\nAs a reminder, on a GAAP basis, our $11.5 billion of gross loss reserves are carried at nominal value and are NOT impacted by changes in interest rates. This creates a GAAP mismatch as all of our investments are marked-to-market quarterly to reflect current market conditions.\n\n\nOn a solvency basis, our loss reserves are discounted, which better matches assets with the corresponding liabilities. As our insurance assets are shorter in duration than our insurance liabilities, during this period of rising rates, we have experienced an increase in our solvency.\n\n\nGiven this, we currently maintain significant amounts of excess capital for future M&A and the potential to return capital to our shareholders.\n\n\nOur GAAP leverage ratio at the end of the quarter was 31.9%, which is modestly higher than our target range of 25% to 30%. This was driven by the unrealized losses on our investments. We continue to have prudent levels of margin within our bank covenant constraints. Maintaining a strong balance sheet throughout this challenging time is of paramount importance to Enstar.\n\n\nWe remain confident in our long-term strategy and using our 30 years of experience to navigate through the current environment, particularly as:\n- Our Balance sheet continues to be in excellent shape\n- Our M&A pipeline remains robust, and we are uniquely positioned with our scale and capacity to execute on transactions of significant size and complexity\n- We believe we will benefit from the higher rate environment over the long term given our asset leverage\n- And lastly, our best-in-class M&A and Claims functions should continue to drive value.\n\n\nThank you for your time and for your continued interest in Enstar.\n\nAll earnings call transcripts"
}