{
  "companyName": "Dynatrace, Inc.",
  "companyTicker": "DT",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/dynatrace-inc-dt-q2-2023-earnings-call-transcript/",
  "content": "Dynatrace, Inc. (DT -0.44%)\nQ2 2023 Earnings Call\nNov 02, 2022, 8:00 a.m. ET\n\nOperator\n\nGreetings. Welcome to Dynatrace fiscal second quarter 2023 earnings call. [Operator instructions] Please note, this conference is being recorded. At this time, I'll now turn the conference over to Noelle Faris, vice president of investor relations.\n\nMs. Faris, you may now begin.\n\nNoelle Faris -- Vice President, Investor Relations\n\nThanks, operator. Good morning, everyone, and thank you for joining Dynatrace's second quarter fiscal 2023 earnings conference call. Joining me on today's call are Rick McConnell, chief executive officer, and Kevin Burns, chief financial officer. Before we get started, please note that today's comments include forward-looking statements such as statements regarding revenue and earnings guidance.\n\nThese forward-looking statements are subject to risks and uncertainties depending on a number of factors that could cause actual results to differ materially from those expressed or implied by such statements. Additional information concerning these uncertainties and risk factors is contained in Dynatrace's filing with the SEC, including our annual report on Form 10-K and quarterly reports on Form 10-Q. The forward-looking statements included in this call represent the company's view on November 2, 2022. Dynatrace disclaims any obligation to update these statements to reflect future events or circumstances.\n\nAs a reminder, we will be referring to some non-GAAP financial measures during today's call. A detailed reconciliation of GAAP and non-GAAP measures can be found on the investor relations section of our website. Unless otherwise noted, the growth rates we discuss today are non-GAAP, reflecting constant currency growth. To see the reconciliation between these non-GAAP and GAAP measures, please refer to today's earnings press release and financial presentation under the Events section of our website.\n\nAnd with that, let me turn the call over to our chief executive officer, Rick McConnell. Rick?\n\nRick McConnell -- Chief Executive Officer\n\nThanks, Noelle, and good morning, everyone. Thank you for joining us on today's call. Dynatrace's Q2 results solidly beat expectations on the top and bottom line. In particular, adjusted ARR in the second quarter was 33% year over year.\n\nSubscription revenue came in at $261 million, an increase of 29% year over year in constant currency. Non-GAAP operating income was $73 million or 26% of revenue. And on a trailing 12-month basis, free cash flow margin was 29%. These results once again highlight our ability to run a balanced business that delivers compelling top line growth coupled with strong bottom line performance.\n\nAnd they are a testament to the strength of our market, the significant value of our platform and the ongoing durability of our business model. In addition, I am excited to highlight the launch and release last month of what we believe will prove to be a market-changing product innovation with the launch and release of Grail. Kevin will share more details about our Q2 performance and guidance in a moment. In the meantime, I'd like to share my view of the current market environment and long-term demand trends; our platform leadership, including further comments on Grail; and our intended operational approach for the remainder of the fiscal year.\n\nBeginning with market opportunity. Digital transformation remains one of the most durable areas of investment for enterprises. This has driven a sustained need for more sophisticated observability and application security solutions to successfully navigate the resulting complexity and enormous scale of data. Our customers tell us that such solutions are mission-critical and view them as increasingly mandatory to drive greater operational efficiency, improve customer satisfaction and facilitate commerce.\n\nThis market evolution has been a key catalyst to our growth in recent years, and we continue to see very healthy demand and resultant pipeline generation across our business. This is a great indicator of the value our customers place on our solutions and of the substantial market opportunity still to come. We added 164 new logos in Q2, and our net expansion rate was greater than 120% for the 18th straight quarter. We have, however, begun to see additional macro impact, particularly in Europe.\n\nClearly, enterprises are working to navigate the rapidly changing economic environment that is leading to increased caution in spending and a result lengthening of our average close cycle. Consequently, we are bringing down our ARR guidance to reflect increased pressure on new logos and net expansion rates. As I mentioned, demand generation remains very healthy and our competitive positioning plus win rates remain consistent and strong. Given our pipeline growth, market strength and portfolio evolution, we are highly confident in our ability to reaccelerate ARR growth as economic conditions normalize.\n\nMoreover, our strong enterprise customer base coupled with our recurring subscription revenue model provide us with excellent P&L resiliency even in an uncertain economic environment. As I said last quarter, we are focused on executing well during this period to exit with greater competitive differentiation once the economy improves. Let me now turn to platform differentiation. Our approach to observability and application security is radically different.\n\nDynatrace does not provide a single product or address a single data type. Rather, we deliver a comprehensive software intelligence platform that combines the industry's deepest and broadest multi and hybrid cloud end-to-end observability solution with continuous runtime application security. It is rapidly becoming impossible for even an army of people in network operation centers to oversee and triage an organization's entire software ecosystem. By leveraging our AIOps and automation expertise, our solution enables customers to successfully navigate its uncontainable increase in complexity.\n\nThis is the power of Dynatrace. Whereas other approaches deliver dashboards, we deliver precise answers and intelligent automation from data. It enables our customers to deliver flawless and secure digital interactions by providing broad-based situational awareness of their cloud ecosystems at all times, and it enables them to take action immediately to ensure maximum uptime and performance. Industry analysts corroborate our leadership position.\n\nLast quarter, we announced our position as a leader in the Gartner Magic Quadrant for application performance monitoring and observability for the 12th consecutive time. In October, ISG released their 2022 provider lens for cloud native solutions, which named Dynatrace, a leader with the top overall position in cloud-native observability and a leader in cloud native security. This recognition reflects both our leading position in observability as well as our strength in its convergence with application security. Our customers agree, of the 164 new logo customers that we landed in Q2, well over half of them are leveraging three-plus modules.\n\nIn addition, we saw an increase in the size of our new logos with our trailing 12-month average land growing to $120,000. The reason customers typically choose Dynatrace is because of our platform strength and I'd like to share just a few examples of Q2 wins. First, one of the world's largest multinational energy companies made a significant new investment in Dynatrace. With over 4,000 applications across multiple cloud providers, this customer recognized that the scale and complexity of their clouds created a need for a unified observability platform.\n\nThey selected Dynatrace across the organization and deployed five of our modules. This is also a great example of the power of our partner channel, having leveraged the AWS marketplace with support from our strategic technology partner, DXC. Second, once customers experience the scale and efficiency of automation and AI, they are eager to expand their relationship with Dynatrace. One such customer is a large financial organization seeking to enhance customer experience, improve operational efficiency, and reduce cost by consolidating multiple disparate tools.\n\nAs a result, the customer made an eight-figure commitment to standardize on Dynatrace. They also identified Dynatrace as a crucial player in their strategic initiative to accelerate cloud migration. A third example highlights the continued traction of our application security offering with one of the largest global cruise lines. They struggled with prioritizing the hundreds of vulnerabilities they see on any given day.\n\nDynatrace AppSec gave this customer the ability to sift through the noise and help them focus on the vulnerabilities that really matter, saving them time and resources by speeding up their development processes. These are just a few examples of the trends that are widespread throughout our customer base. We continue to maintain our aggressive focus on innovation as a core differentiator of Dynatrace. We delivered 24 major releases per year.\n\nOur innovation engine is constantly humming, adding functionality to accelerate product leadership. In fact, the vast majority of our R&D team is working on growth and strategic initiatives. AppSec and Grail are great examples of this investment in innovation. I'd like to take a moment to thank our Founder and CTO, Bernd Greifeneder, along with our product and R&D teams for their immense work over the past few years to bring these groundbreaking technologies to market.\n\nWith respect to Grail, you should think of it not as a new module but as an additional core technology in the Dynatrace platform, joining one agent, PurePath Smartscape and Davis. It becomes a key element of our comprehensive end-to-end observability solution and will enable us to capture our $50 billion TAM faster. Grail is a purpose-built massively parallel processing data lake house that changes the game for data ingest, management, and real-time analytics. We see it as a quantum leap forward for Dynatrace's competitive differentiation, and we are extremely excited about the plethora of opportunities it enables.\n\nWhile there are many salient Grail attributes, here are three areas that differentiate it in the market. First, Grail enables organizations to cost effectively ingest and retain all of their data while preserving its context across a myriad of data types, including traces, metrics, logs, really user data, etc. Second, Grail leverages the new Dynatrace query language, or DQL, to easily build queries for even the most complex use cases that can be run in near real time. And third, Grail takes advantage of massive hyperscaler compute resources that can scale to thousands of processors operating in parallel on a single query.\n\nOur first use case for Grail is log management and analytics, which we continue to see as a market that is ripe for disruption. While we don't expect Grail to have a meaningful impact to ARR in FY '23, we are delighted to see strong early demand with nearly 100 customers lined up for POCs in less than a month of its availability. One early adopter of Grail is Toyota Financial Services. Before Grail, the team had to decide which log data to keep and store.\n\nWith Grail, they can get cost-effective storage for logs while retaining context, enabling them to deliver more value and better user experience. This brings me to my final topic, covering our operating approach over the second half of the fiscal year. I'd like to begin by providing a brief update on partners as a key investment area within our go-to-market strategy, most notably with global system integrators. In addition to our formal alliance agreement that we announced with Deloitte, last week, we announced a significant expansion of our relationship with DXC, a leading technology services company.\n\nDXC has been a longtime partner of ours, and they now plan to embed the Dynatrace platform, as the preferred observability solution within its DXC Platform X solution helping their customers optimize and automate their cloud and digital services. In addition, Dynatrace and DXC have agreed to launch a joint global strategic go-to-market program to bring the solution to customers worldwide. In addition to our commitment to thoughtful and strategic investment in innovation and partnership, we are equally committed to protecting margins. We have adjusted our planned headcount increases and opex through the balance of the year to yield an expected increase in our FY '23 operating margin relative to prior guidance and in alignment with our revised top line model.\n\nOverall, we have proven our discipline in delivering growth in challenging environments while managing top to bottom line in a balanced way, and we plan to continue to execute in this way, as we look ahead. Before I turn the call over to Kevin, I'd like to take a moment to share my thoughts on the CFO transition. I am thrilled to have Jim Benson joined Dynatrace as our CFO. Jim is a tremendous financial leader with a proven track record of leading and scaling global finance organizations.\n\nHaving worked with Jim previously at Akamai, I'm confident that he will be a strong partner to me and to the global leadership team. In addition, I'd like to thank Kevin for his excellent leadership over the past six years and for his dedication to Dynatrace. Having announced his intention back in May to leave Dynatrace by the end of this calendar year, I very much appreciate his commitment to the company through this rigorous search process and to ensuring a seamless transition to Jim. I want to thank the finance organization and the rest of the Dynatrace team for their engagement in supporting this transition.\n\nI continue to be extremely impressed with the strength of this team and I look forward to its next phase of growth. In closing, Dynatrace is a business that delivers high growth with strong profitability and free cash flow. We delivered a strong second quarter even amid macro uncertainty and we remain highly confident in the strength of our market opportunity as well as our platform leadership. Moreover, we will continue to drive innovation to meet our customers' evolving needs and further differentiate ourselves in the market.\n\nWe expect to manage prudently from a financial perspective, and we intend to invest thoughtfully in our strategic priorities near term to emerge from this period in a position of expanded strength. With that, let me turn the call over to Kevin.\n\nKevin Burns -- Chief Financial Officer\n\nThank you for the kind words, Rick, and good morning, everyone. Before I jump into the business, I want to share that it has been a true pleasure to be part of the team that has helped build Dynatrace over the last six years. I'd like to thank our board, John, and Rick for providing me the opportunity to be part of this talented team. It has been a truly rewarding experience and a highlight of my career.\n\nEqually important, I'd like to thank all the Dynatracers that have so much passion and commitment. It is so rewarding to see such a vibrant community. Together, we have all built Dynatrace into one of the most successful software businesses. The market opportunity is immense.\n\nYou are in great hands with Rick and Jim, and I remain confident that Dynatrace will continue to be highly successful. And now on to our second quarter performance. As Rick mentioned, we delivered a strong second quarter in a fluid environment. We overachieved our internal forecast and guidance across all of our key operating metrics, even as we saw many of the macro trends from last quarter continued to weaken in Q2.\n\nOverall, the resiliency of our subscription model, the strength of our enterprise customer base and solid execution are reflected in our performance. We have a strong business and expect to continue to deliver a balanced performance of growth, profitability, and cash flow. As with previous quarters, I will focus on adjusted ARR growth as it normalizes for currency fluctuations and the wind down of perpetual ARR. Please note that all growth rates will be year over year and in constant currency, unless otherwise stated.\n\nDynatrace delivered 33% adjusted ARR growth in the second quarter. ARR for the second quarter was $1.065 billion. Please note that our reported ARR would have been $12 million higher or $1.077 billion when you consider the incremental FX headwinds in the quarter. Moving on to the building blocks of growth for the business.\n\nWe added 164 new logos in the second quarter, in line with our expectations but certainly an area of our business that continues to be impacted by economic headwinds. As Rick mentioned, the average ARR for new logo lands was $120,000 on a trailing 12-month basis compared to $114,000 last quarter. In the second quarter, and once again, while over half of our new logos landed with three or more modules representing the movement to the observability platform. The value of the Dynatrace platform continues to resonate with prospects, as they look to deliver rapid operational efficiencies in a tight budget environment.\n\nDynatrace's ability to rapidly drive greater automation and efficiency that deliver strong ROI and places us near the top of the strategic IT investment list. Our net expansion rate for the second quarter was once again above 120%. Gross retention rates have been consistently trending up for the last two years. From an existing customer standpoint, we continue to see strength in multi-module adoptions with 55% of our customers now using three-plus modules at an average ARR of nearly $500,000 per customer.\n\nOverall, we are pleased with the resiliency of our enterprise customers that delivered a strong second quarter performance even in a challenging environment. Our existing customers view us as an essential part of their ecosystem, given the proven value, operating efficiencies, and insights that we deliver. Moving on to revenue. Total revenue for the second quarter was $279 million, up 30% year over year, and subscription revenue for the second quarter was $261 million, up 29%.\n\nWith respect to margins, non-GAAP gross margin for the second quarter was 83%, down two percentage points from Q2 of last year. This reduction was primarily driven by investments in our partner strategy that showed up as services cost of goods and customer success initiatives as we expand broader coverage. As we have said before, we have a very healthy margin profile, reflecting the value and efficiency of the Dynatrace platform, and I do anticipate gross margins stepping up in the back half of '23. Investments in innovation and select go-to-market initiatives remain top priorities for us.\n\nFor the second quarter, we invested $41 million in R&D or 15% of revenue. We continue to drive successful product innovation. And as Rick noted, our recent launch of Grail is a great example of our steadfast commitment to ongoing market leadership. On the go-to-market side, we invested $90 million in sales and marketing this quarter or 32% of revenue, prioritizing investments in direct sales and our expanding partner strategy.\n\nWe grew our sales rep headcount by about 25% year over year, which will be down from our original goal of 30% growth as we pull back slightly as we have sufficient capacity given today's environment. Our non-GAAP operating income for the second quarter was $73 million, resulting in a non-GAAP operating margin of 26%, exceeding the top end of the guidance range by 250 basis points due to the revenue upside, combined with a disciplined investment strategy. On the bottom line, non-GAAP net income was $64 million or $0.22 per share, $0.03 above the high end of our guidance range. Looking at the balance sheet.\n\nAs of September 30, we had $563 million of cash, an increase of $193 million compared to the same period last year and inclusive of $120 million of debt repayments on a trailing 12-month basis. Our free cash flow was $25 million compared to $14 million in the same period last year. Due to seasonality in billings, we believe it is best to view free cash flow over a 12-month period. On a trailing 12-month basis, our free cash flow was $300 million or 29% of revenue.\n\nWe are extremely pleased with our continued healthy cash generation, and we have not yet needed to modify customer payment terms due to macro issues. The last financial measure that I would like to discuss this morning is our remaining performance obligation. RPO was approximately $1.53 billion at the end of the quarter, an increase of 29% over Q2 of last year. The current portion of RPO, which we expect to recognize as revenue over the next four quarters was $878 million, an increase of 29% year over year.\n\nWe are very pleased with the RPO growth, and it's important to remember that seasonality, associated with bookings and contract modifications will cause variability in the RPO growth rates. When combined, these strong Q2 results demonstrate the durability of our business model that supports a strong balance of growth and profitability. Now let me turn to guidance. Our pipeline and demand generation remains very healthy, and our competitive positioning and win rates remain strong.\n\nHowever, the macro conditions continue to generally weaken and we think this is even more prevalent in Europe. As a result, we now expect close rates in the back half to be lower than what we experienced in the first half of fiscal '23. Therefore, we will be reducing ARR constant currency guidance by $30 million, and we believe this will primarily impact ARR toward the end of the fiscal year. In light of this increased pressure on ARR, we are moderating some investments in order to increase operating margin and to continue to drive a balanced business.\n\nSo let me walk you through some of the key assumptions and insights into what is included in our updated guidance. First, as I mentioned, new logos continues to be an area of the business that is most impacted by the weakening of the economy. Given that, we now expect new logo additions in fiscal '23 to be down roughly 5% over last year, reflecting tighter budget scrutiny and elongated sales cycles. From a headcount standpoint, we had a strong first half for hiring and have a talented team in place to execute against our strategic goals.\n\nThis provides us flexibility to moderate the pace of hiring in the back half of the year while still maintaining healthy growth in headcount on a year-over-year basis. Third, with more than 40% of our business denominated in foreign currency, the continued strength of the USD creates a sizable headwind. We now expect full year constant currency impact to be approximately $60 million on ARR and revenue. This represents an incremental headwind of approximately $20 million to ARR and $12 million to revenue for the full year compared to our prior guidance.\n\nAnd finally, consistent with prior guidance, the perpetual license wind down for fiscal '23 is expected to be approximately $8 million or 80 basis points. The headwind in Q3 will be approximately one percentage point. With that in mind, let's start with our guidance for the full year, again, with growth rates in constant currency. We expect ARR to be between $1.164 billion and $1.172 billion, representing an adjusted ARR growth of 24%.\n\nFrom a constant currency standpoint, this represents a $30 million or 300 basis point decline from prior guidance, driven by the factors I outlined above. In terms of ARR seasonality, we expect that net new ARR is going to be $120 million in the back half of '23, split roughly evenly between Q3 and Q4 to reflect further conservatism in guidance. Given some strength in Q2 revenue and the fact that we think the ARR reduction is back-end loaded, we are raising the midpoint of our prior revenue guidance by 50 basis points. We expect total revenue to be between $1.190 billion and $1.126 billion, and subscription revenue to be between $1.047 billion to $1.052 billion, both of which result in 27% year-over-year growth.\n\nFrom a profit standpoint, we remain committed to offsetting incremental headwinds with operational efficiencies and appropriate investment management. With that in mind, we are raising our non-GAAP operating margin guidance to 24.5%, representing a 175 basis point increase from the midpoint of our prior guidance. We believe this will still enable us to support additional investments in R&D and sales and marketing. We are raising non-GAAP EPS by $0.07 to $0.81 to $0.83 per share based on 292 million to 293 million diluted shares and a non-GAAP effective cash tax rate of 11%.\n\nAnd finally, we are maintaining our free cash flow margin guidance of 27.5% to 28.5% of revenue. In terms of dollars, we expect free cash flow to be between $308 million and $321 million. Looking at Q3, we expect total revenue to be between $283 million and $286 million or 24% to 25% growth. Subscription revenue is expected to be between $266.5 million and $268.5 million, up 24% to 25% year over year.\n\nFrom a profit standpoint, non-GAAP operating income is expected to be between $71.5 million and $73.5 million, 25.5% of revenue and non-GAAP EPS of $0.21 to $0.22 per share. In summary, our second quarter fiscal '23 results demonstrated strong performance amid increasing macro headwinds. It's a challenging environment and the durability of our business model is purpose built to navigate these transitory market conditions. We are being mindful of our investments and we'll continue to prioritize strategically in innovation and go-to-market.\n\nOur strong financials, subscription business model and healthy enterprise customer base, combined with a world-class people organization, continue to position us for resilient and predictable growth and profitability as we move forward. And with that, we will open the line for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Thank you. And our first one question is from the line of Matt Hedberg with RBC Capital Markets. Please proceed with your question.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for taking my questions. I guess either for Rick or Kevin, Q2 was a really nice quarter and a really tough tape. And kind of looking at, Kevin, your new ARR assumptions, I think for my math, it looks like it's down about 27% in the second half, that's versus up about 13%, the first half.\n\nAnd I guess the question that we're getting from a lot of folks are sort of your level of confidence that this will be the last cut. And so maybe I know you gave some of the underlying assumptions, but maybe ARR assumptions or anything else that can kind of get us helpful with what looks like a significant level of conservatism.\n\nKevin Burns -- Chief Financial Officer\n\nSure. Thanks, Matt. Good to connect. As you mentioned, we were certainly pleased with the performance in the quarter and it came in ahead of expectations internally and obviously externally as well.\n\nSo we're pleased with that performance. When we thought about the back half though, as I'm sure you can imagine, we went back and looked at the pipeline and coverage and how the geographies were performing and also the economic conditions in the regions. And we just continue to see additional pressure, and we are expecting additional pressure coming out of the European area. So generally, the reduction is primarily focused in the European part of the world.\n\nThat will be a little bit of new logos. As we talked to you, new logos will be down 5% year over year against generally, most of that will be coming out of Europe. And there will be some pressure, obviously, on the net expansion rate. We did reduce bookings ARR by $30 million.\n\nAnd obviously, that will have some pressure on the net expansion rate. We do believe, though, Matt, as we said in the call, we put this as a back-end loaded adjustment, and I think that's indicative of what we thought guide from a revenue standpoint where we actually slightly increased our revenue guidance. So back-end loaded, trying to be cautious. We reset once.\n\nWe had to do it again, unfortunately. We want to be very conservative. It's going into Q3 and Q4. We're very bullish on the business.\n\nWe're optimistic, but we need to balance it with setting expectations that we will deliver on Q3 and Q4.\n\nRick McConnell -- Chief Executive Officer\n\nYes. Let me just add quickly, Matt, and thanks for the question. First of all, we are very confident overall in this business. Pipeline is growing.\n\nThat is a great sign. The challenge is some purchasing decisions are getting deferred, as Kevin said, particularly in Europe, and that's elongating some sales cycles. So we wanted to derisk the model as we look to the second half, and that's what we sought to do. Overall health of the business, very strong, great about the overall product leadership and evolution, which I talked about.\n\nAnd that's how we're going to manage the business in the second half.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThat's super helpful, guys. And then, Rick, maybe just one for you on Grail. Obviously, a lot of exciting things to think about there for the future, 100 customers on POC. Eventually, when that starts to hit your ARR, how do you expect that to sort of benefit? Is it just even more -- maybe just the monetization of, I guess, is the question, eventually when it comes in, I know it's still early here.\n\nBut how should we think about that eventually maybe as a fiscal '24 driver?\n\nRick McConnell -- Chief Executive Officer\n\nWell, as I said, Matt, we believe that the log management and analytics market is very ripe for disruption. We believe we have a very, very unique opportunity to take advantage of that given the technological framework that we've constructed. And we are thrilled with the early demand and interest from customers. We saw this in our customer innovate sections, which we executed globally in Singapore, Sao Paulo, and London over the prior month to six weeks, getting first-hand feedback from customers here.\n\nSo we feel very good about it. We still believe what we said a quarter ago, which is that as with infrastructure, we think that log management and analytics can add $100 million or so of ARR over an eight-quarter span or thereabouts. So that's what we're still expecting following launch.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Sterling Auty with MoffettNathanson. Please proceed with your question.\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nYeah. Thanks. So first, Kevin, congratulations. Thank you for all the hard work and good luck with all the future endeavors.\n\nAnd then in terms of question, I wanted to drill in on the existing customers. We saw a notable slowdown out of the hyperscalers. How did you factor that into your ARR? And what gives you the confidence that, that's the right level in terms of the full year guide? Thank you.\n\nKevin Burns -- Chief Financial Officer\n\nThank you, Sterling. It's been great working with you. So I always appreciate the great covering and great questions and insights you have in the business as well. So I appreciate that.\n\nThank you. With respect to our ARR guidance how we thought about the hyperscalers, it was absolutely part of the equation. I will say that our hyperscaler component of our business continues to grow nicely. So we didn't see a dramatic of a slowdown as they did some of them printed publicly.\n\nSo we're pleased about that. And I'd say the other thing that we're super excited about, again, more over the next couple of quarters as opposed to the near term, but is the GSI partnerships that we're developing, right? The one that we have with Deloitte, the one that we just announced DXC, other ones in process that we will hopefully talk about in the near future as well. So we definitely took some adjustments from hyperscaler slowdown. We're pleased with the performance internally.\n\nWe do also think there's another tailwind on the GSI. So I'm not trying to walk up our guidance and get too excited about it, but definitely some tailwinds there that we adjusted down, but we think there's some tailwinds.\n\nRick McConnell -- Chief Executive Officer\n\nThe only thing I would add, Sterling, is that we obviously have a huge market opportunity with the installed base of hyperscalers already. It is obviously well, well over $100 billion in revenue. And we believe that as observability becomes more commonplace, becomes more standard in cloud deployments, especially for enterprise customers that there is a lot of opportunity to penetrate that installed base. And obviously, the growth rate continues to be strong, even though down over the prior quarter for the hyperscalers.\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nUnderstood. Thank you, guys.\n\nOperator\n\nOur next question is from the line of Kamil Mielczarek with William Blair. Please proceed with your question.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nHey. Thanks for taking my question. I just want to better understand the linearity of demand. As the quarter progressed, when did you see the largest deterioration in sales? And how did that change in the first few weeks of the December quarter?\n\nKevin Burns -- Chief Financial Officer\n\nSo in Q2, Kamil, our business performed as expected, if not slightly as we mentioned, it performed slightly better. So we definitely reached our expectations a little bit in terms of linearity, and linearity came in line, performance came in line with expectations for the quarter. So pleased about that. When we look into Q3, when we look into Q4, our approach is just to be more cautious, right? The economy seems to be getting tougher, deal cycles, we believe, will continue to elongate.\n\nAs Rick said, we have great pipeline coverage. Our win rates are great. But the close rates, we just expect them to slow down in Q3 and Q4, and that's really what's driving. So those are the -- it's really a close rate assumption, is sort of how we're thinking about adjusting our guidance.\n\nTop funnel, all those metrics, win rates, are doing great, but we just wanted to be a little bit more cautious, as we fill into the back half of the fiscal year.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThat's helpful. And if I could just follow up, Kevin, and Kevin called out a slight slowdown in the pace of sales rep hiring. Can you update us on your hiring targets for fiscal '23 for the business as a whole? And what has hiring looks like to date?\n\nKevin Burns -- Chief Financial Officer\n\nSo ballpark, we're at 25% for total company midpoint through the year, which is great. I'd say we're definitely slightly a little bit higher on the innovation sort of R&D and sales and marketing side. And our sales headcount growth, as I mentioned, we did about 25% growth there. So we did a great job in the first half of getting great talent on the board.\n\nOur retention is very high as well, which is great. I think that can also help our sales capacity. As we go, we'll have better and more mature revenue. So that's where we are at midpoint of the year.\n\nWe'll continue to grow R&D and sales 20-plus percent in that range. We'll see how the quarters play out here over the next six months. And then we'll slow some other things down generally. So the punch line is, I think, fiscal year ending headcount will probably be around 20% growth with it a little bit higher in the innovation and go-to-market.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nAppreciate the color. Thanks again.\n\nOperator\n\nOur next question is from the line of Raimo Lenschow with Barclays. Please proceed with your question.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nHey. Thank you. Kevin, if you look at how other companies or how we kind of think about the scenario, like close rate is usually the one that the CFO is driving in terms of the -- like everything is kind of -- seems to be working, but like close rate as kind of where kind of put the final stop one. If you look about your pipeline, and you said the pipeline coverage is totally fine.\n\nIf you think about like deal sizes in the pipeline and also how they track through the pipeline, have you seen a change there? Or is that also like what you've seen before, but like the final step of the close rate is where you kind of want to be more conservative? And then I have one follow-up for Rick.\n\nKevin Burns -- Chief Financial Officer\n\nRaimo, it really is -- it's close rate. That's what we've looked at. And of course, there's some moving parts here and there. But the fundamental change in the business is elongating cycles, which means our close rates just aren't what they were historically.\n\nSo that's what we see. And again, as we mentioned, it's more pronounced over in the European region.\n\nRick McConnell -- Chief Executive Officer\n\nRaimo, the only thing I would add to that is that while that's true on close rates, it is important to understand that we expect close rates to renormalize. There's nothing that we have seen to suggest that as the macro environment improves -- although we're not predicting exactly when that is, but as the macro environment improves, we expect those close rates to renormalize. And the good news is with ongoing growth in pipeline and no change in win rates, we think that, that's a very productive long-range scenario.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Yes, makes sense. And then one question on Grail like if you think about -- you mentioned earlier that it's not just a number tool. It's slightly more fundamental.\n\nHow do we have to think about your positioning of Grail and your other products in the market, is Grail becoming the platform that everything builds out? Is it the underlying analytics platform? How do you think about why think about Dynatrace and how they're positioning -- how you guys positioning your product in a year or two? How does it all fit together? Could you just speak to that a little bit?\n\nRick McConnell -- Chief Executive Officer\n\nSure. Grail, as I mentioned, Raimo, is a core technology, just like one agent, PurePath Smartscape, etc., for us. It is, as I said, massively parallel processing data lake house that gives us incredible performance at exceptional scale and also an ability to do that in a very cost-effective way. So that's how we sort of look at Grail.\n\nThe first instantiation of it is log management and analytics, and that's how we'll initially deploy Grail. So that's sort of our overall perspective on how we take advantage of this market opportunity and leverage Grail going forward. It is a solution that doesn't do reindexing, doesn't do rehydration and uses graphing technology to provide very complex analytics on logs in near real time. And that is a very, very unique position in the market.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThe next question is from the line of Mike Cikos with Needham & Company. Please proceed with your question.\n\nMike Cikos -- Needham and Company -- Analyst\n\nHey, guys. Thanks for taking the questions here. The first question I wanted to ask about was around the adjusted ARR guide. I know that we have this -- you're calling out from Europe and you have cited I guess pressures we're expecting in the second half of the year on both new logos and the expansions.\n\nSo first, happy to have the color regarding that 5% year-to-year decline we expect in the new logos for fiscal '23. Regarding the net expansions, we should be thinking about that playing out over the remainder of the year? Is there a potential for that to actually dip below that 120% plus you guys have been posting on a consistent basis?\n\nKevin Burns -- Chief Financial Officer\n\nMike, it's Kevin. So yes, unfortunately, based on our guidance, mathematically, the net expansion rate in the fourth quarter would fall below 120%. Again, that's based on what we have currently guided. We also highlighted in the prepared remarks that our net expansion rate remains very healthy.\n\nCertainly in the second quarter, it was very healthy. Our third quarter is always a very big quarter from us going back to our customer base and expansion in our customer base. So we're optimistic about that. And it's still early on Q4.\n\nSo again, we wanted to derisk the number in Q4. Mathematically, net expansion rate could drop below Q4 for a period of time. As Rick said, though, we think these are just transitory items in the business and long term, net expansion rate will certainly rebound north of 120%, assuming we come in around where the guidance is. But I don't want to walk numbers up again, but we're very bullish about the ability to continue to sell on our customer base.\n\nAverage ARR is still around $300,000, significant opportunity. With Grail coming on board, that will be another boost in FY '24 as well. So again, we definitely believe there's a lot of tailwinds to that number and if it does drop below 120%, we think that will be short lived.\n\nMike Cikos -- Needham and Company -- Analyst\n\nThat's very helpful with the color there. And if I could just tack on one more follow-up. It's really around the sales cycle elongation that we're calling out today. And I just wanted to make sure I was clear.\n\nCan you give a rough order of magnitude for the delta that we're seeing? Like are these push outs weeks? Are we more in the neighborhood of months? And then the follow-up question, just given how you guys are describing Europe, I think it's probably fair to characterize your pressure as being more pervasive in nature. The first is volume of pressure in Europe, a fair characterization? And then second, is any of that weakness spilling over to other geographic regions that you guys participate in?\n\nRick McConnell -- Chief Executive Officer\n\nWell, Mike, the weakness in macro environment is clearly global, but more pronounced in Europe, which is what we're calling out. So that's point number one. And with regard to the overall sales cycles, we look at it mostly in terms of quarters, but the vast, vast majority of any deals that pushed out due to lengthening close cycle last quarter, we expect to close this quarter. And as I said, no change in win loss ratio.\n\nSo we feel good about the prospects, as we look into the quarter associated with those close rates.\n\nMike Cikos -- Needham and Company -- Analyst\n\nThank you very much, guys.\n\nOperator\n\nOur next question comes from the line of Andrew Nowinski with Wells Fargo. Please proceed with your question.\n\nAndrew Nowinski -- Wells Fargo Securities -- Analyst\n\nOK. Thank you. I want to start with a question on the close rates and the operating margin expansion. So I appreciate your focus on profitability and expanding that margin.\n\nBut do you think maybe the slowdown in hiring, do you think that could possibly extend this period of lower close rates? Or are those close rates really independent of the sales capacity that you have?\n\nKevin Burns -- Chief Financial Officer\n\nNo, I think that's right. I think they're independent, Andrew. And I think they're independent for two reasons. One is, as I mentioned, we grew the sales organization 25%.\n\nThe other thing that's happening in that organization is the tenures increase, right? And I think you've talked about this clearly before. As you have more mature reps, their productivity is much higher as well. So we do believe 25% headcount growth in the sales organization with increasing maturity, low attrition rates sets us up to reaccelerate when macroeconomic conditions rebound. And then the other piece that can be additive over time, which I think Rick and the organization have done a great job, is the partner channel, right? I think we're doing well with the hyperscalers.\n\nI think the opportunity is perhaps even larger with the GSIs and we talked about that in the prepared remarks in terms of what we've done, including the recent DXC announcements, the Deloitte partnership and more to come there as well. So overall, I think that gives us a lot of capacity to reaccelerate the business as we move forward when conditions rebound.\n\nAndrew Nowinski -- Wells Fargo Securities -- Analyst\n\nOK. That's great. Thank you. And then I wanted to ask a follow-up question on Grail.\n\nYou noted that it's more than just a new module. So I'm wondering, is Grail targeted at new customers to replace their legacy data warehouse solutions in their data lakes? Or will this be more of an add-on sale initially targeted at existing customers? Just wondering where do you think you'll see that initial traction with Grail?\n\nRick McConnell -- Chief Executive Officer\n\nWell, the lowest hanging fruit is in clearly our installed base where our customers trust Dynatrace, already. They have strong and healthy net expansion. They are used to adding modules. We have more than 50% of our customers now on three-plus modules.\n\nAnd in fact, new logos are closing with more than three-plus modules at greater than 50% as well. So it is a cross-platform sell, a cross-platform play and Grail fits nicely into that. But having said that, we also have experienced and seen interesting and significant demand even out the chute from new customers that are interested in candidly moving away from their existing log management and analytics solution.\n\nAndrew Nowinski -- Wells Fargo Securities -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question comes from the line of Koji Ikeda with Bank of America. Please proceed with your question.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking the question. I had a question on sales capacity. You had comments on investing for the future, potential ARR growth reacceleration, lots of commentary on the pipeline and how it continues to build, but really balanced against the current environment affects the close rate.\n\nSo the question here is really what are you looking for the end market? Can maybe signal a pickup again in sales hiring, so the capacity is ramping ahead of a demand curve versus potentially trying to catch up to demand?\n\nKevin Burns -- Chief Financial Officer\n\nI think the leading indicator is that we'll continue to monitor. We'll be top of funnel, right? And then we're going to be looking at close rates and win rates and conversion rates as well. So once we start to see those move in, that's when I think we would probably step into a little bit more sales capacity investments. But again, please keep in mind based on what I just said, we think we have a lot of capacity in the organization.\n\nObviously, it's a productivity flow given the environment. So we think this organization that we have and where they're going to be in six months, 12 months, will give a lot of capacity to reaccelerate the business. So we generally think Koji, that we're in a good spot with the sales organization and the partner organization at this point. And we will add a headcount as we see the demand come in.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And then maybe just a quick follow-up for Kevin. In your prepared remarks, you did mention that you aren't seeing any payment term changes right now. But thinking about the guide, are there any assumptions for more flexible payment terms incorporated within the guidance? Thanks, guys.\n\nKevin Burns -- Chief Financial Officer\n\nThere are not. I added that in. We added that in just to give folks comfort that the enterprise customer base that we are working with. When they decide to move forward on projects, generally, they're not negotiating payment terms.\n\nIt's obviously -- they seem to tend to focus on the discount. So we're good there. We have pretty good visibility into the cash flow over the next six months as well. So we didn't take anything in.\n\nWe don't see it meaningful. Even during COVID, the impact was de minimis. So I don't expect that would move the needle on the fiscal year guidance.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks so much, guys.\n\nOperator\n\nOur next question is from the line of Adam Tindle with Raymond James. Please proceed with your question.\n\nAdam Tindle -- Raymond James -- Analyst\n\nOK. Thanks. Good morning, Rick, I just wanted to start with kind of the story for the stock. You previously considered this fiscal year, fiscal '23 to be more of an investment year where margins would be in the low 20% range and then they would reaccrete to the mid-20% range in fiscal '24, alongside new product releases.\n\nSo we thought growth would potentially accelerate and a lot to think about for fiscal '24. Today, obviously, the environment has changed. You're increasing your profitability outlook and now in the mid-20% range here today. I'm wondering how we can think about this story from here.\n\nI'm wondering if this means fiscal '24 becomes more of an investment year. Some these investments are now spread over multiple years, as some of those initiatives are understandably pushed out and how you would kind of reset telling the growth and margin story from here, if that makes sense?\n\nRick McConnell -- Chief Executive Officer\n\nSo if you think, few quarters ago we did want to make some incremental investments in certain areas. We've made those investments in Grail, in partners, in SDRs, for example and those have enabled us to expand the business through this period of time and set ourselves up for the long term. We have traditionally operated in the mid-20s operating margin, and that's what we expect to do going forward. So that's where we're resetting the boundary to an operating margin at this stage.\n\nSo we've taken it up by 175 basis points at the midpoint, and that's where we expect to be able to operate as we look ahead.\n\nAdam Tindle -- Raymond James -- Analyst\n\nOK. Got it. And then maybe just as a follow-up on the question, why is this last cut as I think about potential risk factors from here, and please add any like you're thinking about, but EMEA is the region that you're seeing a lot of the challenges. I'm wondering how currency impacts demand in that region? I think you do have some U.S.\n\ndollar pricing. And I'm wondering, as I think about potential pressure from here, the need to reduce pricing in that region to match the purchasing power of the customer, particularly relevant as I'm sure you have a bunch of renewals coming up this coming quarter. Just wondering how you're thinking about pricing and currency as it relates to that and any potential deflation that to happen in the model?\n\nKevin Burns -- Chief Financial Officer\n\nTo clarify, that was a question for your -- on Europe, I'm sorry, I missed the region.\n\nAdam Tindle -- Raymond James -- Analyst\n\nRight. FX impact and whether you will potentially need to reduce pricing, which would potentially be a headwind to growth.\n\nKevin Burns -- Chief Financial Officer\n\nSo we operate in Europe. I would say, 95% of our business is done in local currency over in Europe, if not closer to 99%. So our guidance is assuming that the euro remains where it is for the balance of the year. So we don't expect to see any additional constant currency adjusted ARR guide, assuming terms to stay flat.\n\nWith respect to pricing and what's happening there from an end user standpoint, when we do renewals with our customers, we are actually looking to drive higher price increases, right? I appreciate the economy is tough right now, but the cost of everything is going up, and we are trying to pass some of that on to our end users as well. So historically, we've done sort of low single-digit price increases. We're trying to realize a higher percent price increase as we move the business forward. We're certainly seeing that from our vendors that we work with, and we think that's the right thing to do through the business.\n\nSo no specific additional price pressures over in Europe, and we are certainly trying to make sure that we increase prices appropriately to maintain margin over there.\n\nAdam Tindle -- Raymond James -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from the line of Fatima Boolani with Citi. Please proceed with your question.\n\nFatima Boolani -- Citi -- Analyst\n\nGood morning. Thank you for taking my questions. Rick, one for you and one for Kevin. Rick, I'll start with you.\n\nJust the commentary on budgetary caution. I can appreciate that's contributing to the sales cycle conversation being protracted. But I'm wondering if you can share some nuances as to what these customers are doing in lieu of launching onto the Dynatrace platform? Is it more of sticking to DIY lower-cost, open source environment? Or are they sticking with incumbents? What are some of the granularities in the discussion in terms of the reasons customers are pushing out the conversation?\n\nRick McConnell -- Chief Executive Officer\n\nIt is absolutely just sticking with what you currently have, typically DIY. We always say that DIY is our biggest competitor. And it is companies that just think I can get by for another quarter or another two quarters, doing what they have been doing with DIY deployments and trying to manage through that without taking advantage of sophisticated AIOps and performing capabilities such as those that Dynatrace delivers. So that's what's happening currently.\n\nFatima Boolani -- Citi -- Analyst\n\nGot it. And Kevin, just for you, with the cost moderation measures that are now clearly in place, and we can see it in your comments around the moderating hiring, when should we see some of that dovetail into free cash flow conversion? Just curious because you didn't change the ranges on your free cash flow margin. So how should we think about a delayed impact or seasonal factors that maybe aren't obvious to us on the free cash flow margin side versus the operating margin upside?\n\nKevin Burns -- Chief Financial Officer\n\nSure, Fatima. So generally, as we mentioned, we took ARR down by about $30 million, which you would think would generally flow through to free cash flow depending on when you build that. However, that was offset by our slower investments, right? So operating income, operating margins went up to offset generally the decline in ARR, which is why we were able to maintain the free cash flow conversion rate of margin of 28%. So nothing is going to happen in FY '24, that is going to change the trajectory.\n\nWe're not pulling things in to drive higher cash flow here in '23. That's just a normalized run rate based on operating at a 24.5% operating margin.\n\nOperator\n\nOur final question is coming from the line of Will Power with Baird.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nThanks for taking the question. Thanks for taking the question. Maybe just to start with the follow-up. I know as it pertains to the full year outlook, you're now expecting weaker customer expansion as well on top of some of the new logo pressures.\n\nI wonder, just to be clear, is that something you're already seeing I guess, as you kind of look through the month of October? And if it is something you're seeing and expect, are there particular workload or use cases where you're expecting some of that customer expansion pressure relative to perhaps prior expectations?\n\nKevin Burns -- Chief Financial Officer\n\nIt's not something we're seeing now, but what we've seen, as we've mentioned during the call here, is that it's a closed rate item at this point, right? And obviously, close rate means that whether it's an expansion deal or new logo deals, all those things are getting pushed out, which implies that. Obviously, your new logo number is going to come down and net expansion rate is going to come down. We have seen over the last two quarters, a slight change, just given that adjusted ARR came down by a percentage point. Feel like a very slight change in net expansion rate in Q2.\n\nAgain, we're optimistic. I don't want to walk up numbers. We're optimistic that the business continues to perform and remain resilient. But trying to be cautious and conservative, we wanted to bring down that back-end number.\n\nSo there's no trends we're seeing. The only trend we see right now is just close rates are extended in Europe, in particular, and be implied as new logos and net expansion will come down as a result of that. But as we've tried to communicate, this is hopefully short term, temporary. And we do believe every customer need to accelerate move forward.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nOK. And then maybe to sneak one in for Kevin. Nice to see the higher margin assumptions for the year. I know you referenced moderating hiring, I know that's probably a big piece of that.\n\nAnything else on the higher operating margins to call out that we should be aware of?\n\nKevin Burns -- Chief Financial Officer\n\nNo. As Rick mentioned, we did make some of the strategic targeted investments in the first half, right? So those will be reduced in Q3 and Q4. So that drives higher op margins. And then I think generally, as you can see from our P&L, we've been operating at a 25% op income margin.\n\nSo it really is generally at this point, headcount, and those targeted investments we've made in Q1 and Q2 are coming to conclusion here as well. So those are sort of the two things that we needed to adjust generally.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nAt this time, we've reached the end of our question-and-answer session. And I'll turn the call over to Rick McConnell for closing remarks.\n\nRick McConnell -- Chief Executive Officer\n\nWell, thank you all for joining this morning's call. We really do appreciate it. Dynatrace has a very strong business. Q2 was very solid, delivering high growth, profitability, free cash flow.\n\nI am extremely bullish on Dynatrace's market opportunity and our growing product differentiation with solutions such as Grail, as we discussed, and absolutely believe in very strong view to the future. We are participating in several conferences this quarter and look forward to speaking with you in the coming weeks, and we thank you again for your continued support.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNoelle Faris -- Vice President, Investor Relations\n\nRick McConnell -- Chief Executive Officer\n\nKevin Burns -- Chief Financial Officer\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nMike Cikos -- Needham and Company -- Analyst\n\nAndrew Nowinski -- Wells Fargo Securities -- Analyst\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nAdam Tindle -- Raymond James -- Analyst\n\nFatima Boolani -- Citi -- Analyst\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nMore DT analysis\n\nAll earnings call transcripts"
}