{
  "companyName": "Yeti Holdings INC",
  "companyTicker": "YETI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/yeti-holdings-inc-yeti-q3-2022-earnings-call-trans/",
  "content": "Yeti Holdings INC (YETI -0.17%)\nQ3 2022 Earnings Call\nNov 10, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the YETI holdings third quarter 2022 earnings conference call. All participants will be in a listen-only mode today. [Operator instructions] Please note that this event is being recorded. I would now like to turn the conference over to Tom Shaw, vice president, investor relations.\n\nPlease go ahead, sir.\n\nTom Shaw -- Vice President, Investor Relations\n\nGood morning, and thanks for joining us to discuss YETI Holdings' third quarter 2022 results. Before we begin, we'd like to remind you that some of the statements that we make today on this call may be considered forward-looking, and such forward-looking statements are subject to various risks and uncertainties that could cause our actual results to differ materially from these statements. For more information, please refer to the risk factors detailed in our most recently filed Form 10-Q and the Form 8-K filed with the SEC today. We undertake no obligation to revise or update any forward-looking statements made today as a result of new information, future events or otherwise, except as required by law.\n\nDuring our call today, we'll be discussing certain non-GAAP measures pertaining to completed fiscal periods. Reconciliations of these non-GAAP measures to their most directly comparable GAAP measures are included in this morning's press release, as well as in the supplemental reconciliation, both of which are available in the Investor Relations section of our website at yeti.com. We use non-GAAP measures as the lead in some of our financial discussions as we believe they more accurately represent the true operational performance and underlying results of our business. Today's call will be led by Matt Reintjes, president and CEO; and Mike McMullen, interim CFO.\n\nFollowing our prepared remarks, we'll open the call for your questions. And now, I'd like to turn the call over to Matt.\n\nMatt Reintjes -- President and Chief Executive Officer\n\nThanks, Tom, and good morning. To start the call today, I would like to focus on the excellent execution during the quarter and outline how we are positioned to grow over the important Q4 holiday period. I'll then give some color on each of our four strategic growth priorities, that remain central to our continued success in 2022 and beyond. Looking at the third quarter, YETI posted a 20% sales increase underscoring the ongoing strength of the brand, as well as the unique power and importance of our omnichannel approach.\n\nWe saw very balanced sell-in and sell-through at wholesale inclusive of some earlier-than-planned shipments to support inventory at retail ahead of the holidays. Our direct-to-consumer business was highlighted by strong customer retention and acquisition across our DTC channel. And we saw excellent international contribution from what is still a relatively young part of our business. As we look forward, our current view of the second half and full year revenue remains consistent and intact from our prior outlook.\n\nAs seen throughout the year, gross and operating margins remained strong even with significant headwinds, partially offset by ongoing expense discipline. Importantly, we are increasingly optimistic on gross margin tailwinds building in 2023. We expect this will help support margin expansion and investment in future growth. As Mike will cover, we made good progress on the inventory management front, as we balance order flow against lowering transit times to drive working capital efficiency going into next year.\n\nAs we head into the final stretch of the year and plan for the holiday season, we recognize a heightened level of uncertainty persists across the market. As consumers make purchase decisions in this environment, we will continue doing what we do best, stoking the brand and delivering product innovation. Our goal remains focused on winning this season's gifting occasions. We have a great lineup of product and brand activities we're deploying toward these efforts.\n\nThe innovation foundation for the quarter has already been laid, capping one of our most expansive innovation years for YETI, included are the completion of our full channel rollout of our two flagship soft coolers, extensions of the successful Camino tote, our two newest wheeled coolers, the recent debut our new Straw Lid Rambler drinkware and this week's introduction of YETI's first lightweight bottle, Yonder. We will show these products through our unique and diverse marketing channels to engage both new and existing customers throughout the quarter and into 2023. This includes expanding the reach of our brand through our fall YETI Dispatch magalog dropping in homes next week, special finds in our seasonal gear garage during Black Friday week, and activating our holiday brand campaign, use your gifts. Our overarching holiday message underscores the value, versatility, and desirability of products.\n\nNow to our strategic growth priorities. Continuing to expand our brand and audiences while also connecting with our customers remains central to our growth agenda. We are focused on cultivating deep engagement opportunities across our existing customer base as we see untapped opportunity for the discovery of our product assortment and our customization capabilities. These efforts are magnified when we target newer consumer communities as we establish awareness and consideration.\n\nThis has been the essence of our breadth and depth strategy, which we brought to life in distinctly YETI ways during the third quarter. Starting with our social media, we expanded our popular packed social series of how-to videos that inform and educate customers on the functionality of our products. The campaign spotlights the broad range of our offering, including our Camino totes, Roadie hard coolers, and our Crossroads Duffels, and provides tangible examples of the versatility for a variety of activities and adventures. The brand also showed up big in college football at the matchup between the Alabama Crimson Tide and the Texas Longhorns, showing another great example of how YETI can seamlessly integrate brand and product in a real way.\n\nThis effort was anchored by our new Roadie wheeled coolers, positioned as a perfect Tailgate companion. We invited one of our ambassadors, Matt Pittman, the founder of Meat Church, to smoke a mix of Texas and Alabama barbecue to share with fans in the college game day crew. Finally, we spotlighted our collegiate customization business to drive engagement across our digital channels. Perhaps most importantly, and in a return to normal, this campaign showed the ongoing power of YETI products as we continue gathering with our friends and family at events that were disrupted throughout the pandemic.\n\nI want to highlight what an incredible quarter it was for some of our newer YETI ambassadors. Australian surfer, Stephanie Gilmore, won her eighth WSL world title in Southern California. She stands alone as the most decorated female athlete in professional surfing. Another Aussie, Tia-Clair Toomey, won her sixth consecutive world's fittest woman title at the CrossFit Games in Wisconsin, becoming the first person to claim that many titles.\n\nFinally, we're thrilled to add Nora Vasconcellos as the YETI's first female skate ambassador. I want to recognize our Major League soccer partner, Austin FC, who, in their second season, made the MLS Western Conference Finals. As the official jersey sponsor of Austin FC, YETI received exposure on national broadcast on ESPN and ABC over three consecutive weekends, culminating in the Western Conference Finals on October 30. As we continue to broaden our 13 passion-based active communities, we will foster deep and broad relationships, which is the unique power behind how we build and expand this brand.\n\nOn the product side, our third quarter results are highlighted by innovation, strong inventory flow, and demand dynamics across our cooler business, driving the overall C&E category up 25% for the period. Our in-stocks continue to improve across our core Tundra hard coolers, which were particularly depleted in the wholesale channel last year. Our latest soft coolers, the M30 Tote and the M20 backpack, continue to resonate with customers and have just recently become fully assorted in the wholesale channel. The new Roadie 48- and 60-wheeled hard coolers have captured strong early reviews for both the trade and consumer.\n\nFull distribution is still ramping. All in all, we are in the best product position since before the pandemic with a deep assortment of both existing and new innovation. We believe this well positions the brand to not only capture holiday demand but to also drive growth and expansion into 2023. Our limited expansion of YETI bags and wholesale continued in the quarter as we've debuted our product across nearly 100 doors since the summer.\n\nEarly results are positive, and we will continue to look at strategically increasing doors for the balance of the year with additional opportunities building into 2023. Our drinkware business grew 17% during the quarter with strong trends continuing across our bottles business and our travel mugs. Our new innovation builds upon this momentum starting with the new Rambler 25-ounce and 35-ounce straw lid mugs that were launched in DTC in late October. And just this week, YETI added a new noninsulated product to our drinkware business with the debut of our first lighter-weight Yonder bottle.\n\nOver the years, we have received feedback from our ambassadors and customers that weight can matter more than thermal performance when exploring deep in the wild. We have worked hard to develop a line of drinkware that would be both lighter than our core offerings while retaining YETI's superior durability and performance qualities to truly disrupt the marketplace. Ultimately, the team delivered a highly durable product punctuated with a great carry and drinking experience. Launched in two sizes and four colors, Yonder creates an additional way for YETI to be part of daily life.\n\nAnd as we move into 2023, customers will be able to customize their bottles with full color printing options available on yeti.com. Our channel strategy is designed to effectively match the customer with a great experience when and where they choose to find our brand. That's the objective of a true omnichannel approach, and we're seeing this dynamic play out now more than ever. As expected, as we rebalanced inventory across our channels, wholesale growth outpaced DTC growth for the second straight quarter and drove our first $200 million quarter for the channel.\n\nWe saw excellent sell-through trends during the period, supported by much healthier in-stock positions relative to last year. As we have seen historically, our brand performs best in this channel when we are in stock, and our product is merchandised well. We continue to work closely with our key wholesale partners to optimize delivery and the customer experience. During our Q2 call, we indicated that growth in our DTC channel would be driven by a strong recovery in our Amazon business.\n\nAmazon faced a similarly limited inventory position as wholesale last year. We also saw strong ongoing momentum within corporate sales and YETI-owned stores. As we think about measuring the reach of DTC, we're increasingly looking at total acquisition and retention trends across the direct consumer channel. A holistic look across our e-commerce, Amazon and YETI-owned stores showed healthy acquisition growth compared to last year.\n\nThis dynamic is consistent with the rebalancing of demand we are seeing across our omnichannel, leading to 20% overall top-line growth. We remain pleased with the level of retention we are seeing across DTC, particularly yeti.com, as well as the underlying quality of those transactions. As we head into 2023 with a more normalized inventory position, we are taking a fresh look at the roles and scope of each part of our omnichannel to ensure that we are amplifying and differentiating to drive accelerated growth for the long term. Looking at a few of the details across DTC.\n\nAmazon's recovery was demand-driven and anticipated given the inventory normalization following last year's YETI inventory allocation decisions. We will continue to balance the strength fulfilled by Amazon position and supplement what fulfilled by merchants to help drive improved year-over-year execution throughout the holidays. Strong demand in corporate sales continues as the brand resonates across a wide range of accounts, including B2B, collegiate, and hospitality. Increased customization capacity should help service demand over the holidays and into 2023.\n\nYETI-owned stores continue to drive a pinnacle to get experience with a heightened focus on localization, merchandising, and service. We opened our 12th location in Southlake, Texas, earlier this quarter and we'll add one additional destination later this month, located just south of Los Angeles and El Segundo. We continue to expect an accelerated pace of YETI store openings starting in 2023 as these become increasingly valued for brand exposure, product consideration, and purchase. Taking the YETI story globally remains one of our biggest opportunities, and we continue to make excellent progress in the third quarter despite unabated tensions in the global, political and economic environment.\n\nOur international sales grew 60%, representing our highest quarterly growth in the past year, and realized a YETI high 13% sales mix. Growth was once again well balanced across our three primary regions. Performance in Canada echoed many of the channel trends experienced in the U.S. with strong wholesale performance, coupled with robust DTC growth despite relatively softer e-commerce trends.\n\nWe continue to make progress with several key wholesale accounts while also investing in merchandising initiatives as in-stocks improve. On the DTC side, growth was supported by the launch of fulfilled by merchant on Amazon to drive greater depth and breadth of assortment to local customers. Australia's performance remains outstanding, continuing to exceed expectations with balanced strength across channels. Our Local Father's Day campaign was particularly successful building up to the early September holiday, including our largest online day to date for the country.\n\nIn addition, we launched updated versions of our e-commerce sites in both Australia and New Zealand. As we look at Europe, I was fortunate to spend some time in several markets in the U.K. and Europe during the quarter, seeing and hearing firsthand how the brand is making a strong impression with customers across their active lifestyle pursuits. While we are being mindful of the clear pressures across the region, we are delivering on our near-term financial expectations with the actions needed to build a lasting brand foundation.\n\nThis effort included very successful consumer-focused participation and brand building in our most extensive series of local events to date across the U.K. Additionally, we continue to add select wholesale doors across the U.K. and European region, surpassing 800 total locations during the period with nearly half of this year's openings in our focus markets of the U.K. and Germany.\n\nWe have a tremendous opportunity to build a sizable business across Europe, and we'll continue to utilize and localize our playbook to drive the brand in future global locations. Finally, I want to express my thanks to our recently departed CFO, Paul Carbone. Paul is an incredible partner of mine, helping bring this company public and navigate many dynamic environments for the past four years. I'm excited for him as he returns to Boston and is able to spend more time with his family.\n\nAs we continue our active search for our next CFO, we are incredibly fortunate to have a seasoned, capable, and strong leader in Mike McMullen as interim CFO. Mike has been a key partner to me leading our finance team for nearly seven years, and I'm excited to have him step into the role. In closing, it's important to take a step back and press upon where we stand today. Growing top line 20% in Q3 and 19% year to date in this environment is a testament to both the hard work and execution of our team and the unwavering passion for the brand from our customers.\n\nConsumers are still discovering the breadth and depth of our product lineup. They're giving us permission to bring more high-quality offerings to market to meet their needs, and they're waiting for our brand to reach them across global channels. Profitability remains strong but has been challenged this year by market-driven headwinds, but we do see many of these turning to tailwinds as we move toward 2023. As we work through the near-term noise, our focus is on driving strong top line and strong margins while investing in growth to build upon our momentum.\n\nAnd finally, we are resolute in maintaining a healthy balance sheet, which we see as an asset that creates flexibility and one that strengthens as we work down the inventory pressures driven by supply chain costs. As we think through the working capital opportunity in the near term, we believe the business is set up once again for strong cash flow in 2023. And with that, I will now pass the call over to Mike.\n\nMike McMullen -- Interim Chief Financial Officer\n\nThanks, Matt. I'll begin with a detailed review of the third quarter, followed by our outlook for the year. We will then open the call for your questions. Third quarter sales increased 20% to $433.6 million compared to $362.6 million in the prior-year period.\n\nThis growth came in above our expectations for the period and was modestly ahead of the 18% growth achieved during the first half of the year. Approximately 2 points of sales upside came from increased orders in the wholesale channel given the strong sell-through and our partners' efforts to reach more optimal inventory levels earlier ahead of the holiday season. From a channel perspective, wholesale sales increased 25% to $206.2 million compared to $165.5 million last year. Our wholesale performance was driven by strong results in coolers and equipment, primarily given improved inventory positioning in the channel, as well as ongoing demand for both soft and hard coolers.\n\nBags also contributed to growth as a larger portfolio of products continues to be introduced to consumers through the channel. Direct-to-consumer sales grew 15% to $227.4 million compared to $197.1 million in the same period last year. Direct-to-consumer performance included a healthy return to growth in our Amazon business and was supported by strength in the drinkware category. Our corporate sales business also continued to perform well posting solid growth on top of strong performance in the year-ago period.\n\nBy category, coolers and equipment sales increased 25% to $185.7 million compared to $149 million during the same period last year. Soft coolers remained the standout, including robust omnichannel demand for our new Hopper M20 backpack and M30 tote offerings, as well as solid performance across our Flip and DayTrip product lines. Inventory of core hard coolers continue to get healthier across our distribution network, supporting the strong sell-through that we are seeing. This category is also benefiting from the recent launches of our two Roadie wheeled coolers, which continue to expand across wholesale in the current quarter.\n\nGrowth in our bags business was supported by the new Panga colorway and ongoing traction across our Crossroads line. Drinkware sales increased 17% to $239 million compared to $205 million last year. As Matt highlighted, our momentum was sustained in bottles, travel mugs, and the straw cup. We also saw growth contributions from our Lowball where we are retiring our current offering to make way for future product updates, and jugs where we have expanded our color and customization options this year.\n\nAs we have consistently seen, the customer's ability to customize their YETI products remains an important driver and differentiator for the brand. Internationally, sales grew 60% to $56.5 million compared to $35.2 million in the prior-year quarter, representing approximately 13% of total sales and a new high for YETI. For the period, we experienced strong balanced growth across Canada, Australia, and Europe. Gross profit increased 7% to $222.4 million or 51.3% of sales compared to $207 million or 57.1% of sales in the same period last year.\n\nAs we have seen in recent quarters, the year-over-year contraction was primarily driven by a 490-basis-point impact from higher inbound freight. Additional headwinds included 150 basis points from higher product costs, 70 basis points from unfavorable foreign currency exchange rates, 20 basis points from unfavorable channel and product mix, and 20 basis points from all other impacts. These headwinds were partially offset by 170 basis points from pricing actions. Adjusted SG&A expenses for the quarter increased 12% to $149.1 million or 34.4% of sales compared to $132.8 million or 36.6% of sales in the same period last year.\n\nNonvariable expenses decreased 360 basis points as a percent of sales primarily driven by strong top-line growth and disciplined spending. Variable expenses increased 140 basis points as a percent of sales primarily reflecting higher distribution and logistics costs, as well as higher Amazon marketplace fees. Adjusted operating income decreased 1% to $73.3 million or 16.9% of sales compared to $74.2 million or 20.5% of sales during the same period last year. Our effective tax rate was 23.7% during the quarter compared to 20.5% in last year's third quarter with a higher rate reflecting a discrete income tax benefit in the prior-year period adjusted net income decreased 6% to $54.7 million or $0.63 per diluted share compared to $58 million or $0.65 per diluted share in the prior-year period.\n\nTurning to our balance sheet. We ended the third quarter with $77.8 million in cash compared to $259.3 million in the year-ago period. Similar to prior quarters, the lower cash position primarily reflects the completion of the share repurchase during the first quarter, as well as ongoing investments in working capital. Inventory increased 65% to $439.4 million compared to $266 million during the same quarter last year and down approximately $50 million sequentially.\n\nExcluding the impact of capitalized freight, inventory grew approximately 45% year over year to $330 million. Inclusive of the mix of our inventory shifting to coolers and equipment units from drinkware, total inventory units grew 17% across these two main product categories. Total debt, excluding unamortized deferred financing fees and finance leases, was $95.6 million compared to $118.1 million at the end of last year's third quarter. During the quarter, we made principal payments of $5.6 million.\n\nNow turning to our fiscal 2022 outlook. We now expect full year sales to increase approximately 16% compared to fiscal 2021. This level is at the midpoint of our prior outlook and normalizes some of the timing dynamics between the third and fourth quarters. For the full year, we continue to expect coolers and equipment growth to outpace drinkware, while channel growth to be balanced between DTC and wholesale.\n\nWith gross margins, we now expect the full year rate to be approximately 52.5%, also at the midpoint of the prior outlook range of 52% to 53%. Looking at margin components, higher inbound freight is expected to impact gross margin by approximately 500 basis points, driving the majority of the overall year-over-year decline. On a positive note, ocean rates across our primary shipping lanes continued to decline sharply from peak levels, which is expected to be a source of margin recovery moving to 2023. The extent and timing of this recovery will be dependent on working through the current higher cost inventory on the balance sheet and the levels of anticipated lower-cost inventory receipts.\n\nOur expectations have improved somewhat for combined input costs and GSP duties this year where we now see approximately 130 basis points of headwind. Other margin impacts inclusive of foreign currency exchange rates are now expected to be about an 80-basis-point drag, largely reflecting the adverse impact of the strengthening U.S. dollar on international sales. Partially offsetting these headwinds, we see our pricing action this year, adding approximately 180 basis points, a level consistent with what we have seen the prior two quarters.\n\nWith these gross margin pressures, we have remained disciplined with our adjusted SG&A spending throughout the year, though still expect to end the year with low double-digit growth. Led by the continuation of higher distribution and logistics costs and the impact of Amazon marketplace fees, we expect fourth quarter variable SG&A expenses to grow faster than sales. Our larger nonvariable expense bucket is planned to grow below the rate of sales in the fourth quarter as we continue to thoughtfully prioritize expenses. Overall, we expect to achieve an adjusted operating margin of approximately 17% for the year.\n\nThis compares to our prior range of between 17% and 17.5% and incorporates our updated views of ongoing supply chain pressures, greater FX headwinds, and channel mix shift. Below the operating line, we continue to expect full year interest expense of approximately $4.6 million and an effective tax rate of approximately 24.6%. Based on full year diluted shares outstanding of approximately 87.3 million, we now expect adjusted earnings per diluted share of approximately $2.36 compared to $2.60 in fiscal 2021. For capital expenditures, we now expect approximately $50 million of spending for the year, which is below our prior outlook of $60 million as we have shifted the timing of certain capacity investments.\n\nI also want to provide an update on inventory. As we indicated last quarter, we continue to actively monitor and manage our purchase orders to better match demand. In addition, transit times have begun to decline with in-transit inventory ticking down sequentially to approximately 28% of our total inventory. Thus, we now expect year-end inventories to be below our prior outlook and modestly below third quarter levels.\n\nTo reiterate, the overall composition and quality of our inventory remains in great shape, supported by a higher mix of newer or recently constrained products, which, like the vast majority of our portfolio carry multiyear shelf lives and are anticipated to have strong sales vitality. In summary, we executed well in the third quarter, keeping us on track to deliver within the ranges of our previous full year outlook. In this operating environment, we believe our outlook provides a balanced look at our positioning and strategy heading into the peak holiday season. Moreover, our confidence looking ahead to 2023 is supported by our ongoing ability to drive sustained demand for the brand, the increasing signs of release from recent cost pressures and an anticipated return to strong cash flow generation.\n\nI would now like to turn the call back over to the operator to take your questions. \n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] We ask that you please limit yourself to one question and one follow-up. At this time, we will pause just momentarily. And our first question here will come from Robby Ohmes with Bank of America.\n\nPlease go ahead.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning, and thanks for taking my question. Matt, I think -- just the first question is, can you talk about what you're seeing, if anything, changed from sort of your commentary last quarter about the casual customer? And how are you -- what are you seeing from the customer heading into holiday here? And then I have a follow-up. \n\nMatt Reintjes -- President and Chief Executive Officer\n\nThanks for the question. I think as we progressed through the second quarter in the third quarter, what we saw was really good strength from our customer. And as we said on the call, I mean, with 20% top-line growth, good growth across our channels, really strong performance in wholesale and I think our consumer continues to show up and continues to recognize our innovation continues to desire the brand. And so, as we look forward into Q4, that's kind of the objective, is to keep getting products in our channels, fully distributed, both DTC and wholesale, get in front of the customer, tell great brand stories and it's been a recipe for success for us for many years and many Q4s, and that's what we're aiming toward.\n\nSo, I wouldn't call out any dynamic we've seen change among our customer. And I think Q3 is a testament to that.\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nGotcha. That's helpful. And then just two follow-ups or clarifications. So, the -- how did drinkware do in wholesale in the third quarter? It sounded like coolers and equipment was really strong within wholesale.\n\nLike was drinkware positive in the third quarter, wholesale?\n\nMatt Reintjes -- President and Chief Executive Officer\n\nYeah. I think the -- when you saw the coolers, equipment, we called out, that was the piece of our business that had the most inventory challenge in 2021. And so, as we rebuild that inventory and then focused on getting merchandise and getting sold through, we like how the entire assortment is performing from a consumer perspective. The rebuild of inventory getting the shelfs merchandise, as we had said at the beginning of the year was going to be disproportionately focused on the coolers and equipment side of the business. \n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nAnd then just last one, the fulfilled by merchant on Amazon launch, can you just walk us through the timing of that and how significant of a benefit that's been to sales?\n\nMatt Reintjes -- President and Chief Executive Officer\n\nYes. And Robby, we had FBA and FBM active in the U.S. And last year, when there were some challenges getting inventory into the Amazon marketplace, we pivoted to more fulfilled by merchants. So that's been part of the run rate of what we've had in the U.S.\n\nwhere we added it was in Canada. And I wouldn't call it out, but for, we think it's another channel for us to access leveraging our inventory and the inventory in our control to address consumer demand. So, it's just an evolution of our Canadian Amazon marketplace strategy.\n\nOperator\n\nOur next question will come from Peter Benedict with Baird. Please go ahead.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nSorry about that, was on mute. First question, just on the expected flow of these easing supply chain pressures over the next several quarters. I know, as you mentioned, is going to depend on sell-through and some other factors. But I don't know how you would frame it, but how might it look if next year is a revenue growth year that maybe is within your algorithm? Or how does it look if, let's say, revenues are flat next year? Just trying to better understand the timing and the flow of that under some different scenarios.\n\nMike McMullen -- Interim Chief Financial Officer\n\nHey, Peter, good morning, and thanks for the question. So, when we get to the end of the year and we give an outlook -- our traditional outlook, we'll be able to give more color. I would say though that we do expect as -- like we mentioned, the container rates are -- have come down significantly. And we do expect that to be a tailwind as we head into FY '23.\n\nIn terms of the timing of how much and when and which quarter, I'm not going to get into that too specifically now than to say we're -- we do like what we see in terms of the opportunity there as we head into '23.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nOK. Understood. Curious if you could talk a little bit more about maybe what you're seeing on yeti.com, what the trends are there? I know some of the other DTC channels were called out as being strong. Just curious what's going on at yeti.com.\n\nAnd also, just around the promotional environment. And you guys have kind of stayed above that, but just what's going on from a promotional perspective in and around your category?\n\nMatt Reintjes -- President and Chief Executive Officer\n\nThanks, Peter. I'll hit both those. On the DTC business, we feel great about where our DTC business is. And then you step back up and you talk about 20% growth in the commentary we made, and we said from the very beginning, we believe in a strong omnichannel business.\n\nAnd if you walk from 20% down to the strength we had at wholesale, the strength we had at DTC. Within the components, as we said at the beginning of the year, some pieces of our business we expected to perform stronger versus others because of operational decisions and inventory availability decisions we made in 2021. I think wholesale is benefited from that this year. We called out in Q2, we expected Amazon to benefit from that in Q3.\n\nOur B2B business, corporate sales business continues to perform very well, and our stores performed well. I think the thing that was the biggest beneficiary of those operational inventory placement decisions we made in '21 was yeti.com. So the thing that we're seeing on yeti.com that we really like is that our retention continues to be very strong after two very big acquisition years in that channel in 2020 and 2021 and the reactivation we're seeing of older cohorts of customers. So yeti.com, while it is the channel that is performing very strong from a retention perspective, it's probably the channel that most has the risk of the inventory being redistributed among our envelope.\n\nSo, we feel great about how the omnichannel is performing. We feel great about the role yeti.com plays. We think we've rebalanced our inventory and redistributed our demand to where our consumers are. And as we go into 2023, we would expect DTC to continue to be a strong performer.\n\nWe expect a strong contribution from wholesale, and we expect yeti.com to be our flagship.\n\nOperator\n\nAnd our next question will come from Randy Konik with Jefferies. Please go ahead. \n\nRandy Konik -- Jefferies -- Analyst\n\nHey, Matt, maybe you could give us a little bit of a history lesson on innovation and how that innovation has traditionally been a catalyst for new customer growth and existing customers, like myself to reactivate, as you just said, because I just bought the new straw Rambler. Maybe give us maybe on a qualified basis and quantify it on how that innovation historically around new products, product categories, and colors has been that catalyst? And how you think about that as a catalyst for growth into 2023 and beyond. Maybe give us a little bit of perspective.\n\nMatt Reintjes -- President and Chief Executive Officer\n\nThanks, Randy. I think innovation's critically important to us, and it's been at the heart of the evolution of the business. But as you know, having been part of the story for a while, one of the things we do is, that I think we've done well, is we launch innovation, and then it performs in the market for quite some time. Some of our best-performing products today, we launched their original in the Tundra 45 in 2018 and the Rambler 20 in 2014 -- excuse me, 2008 and 2014.\n\nSo, we'd like to put great innovation out there. We like to stoke it with great brand and then we like to build around it. So, if you watch the evolution in our drinkware portfolio over the last eight years, we've gone from two SKUs to an assortment of different products from a couple of early tumblers to a full assortment of bottles -- tumblers and I think you'll continue to see that. And what it allows us to do is both reactivate existing customers, but also reach new customers.\n\nAnd then you layer on top of that a strategy around how we use color. And we use color both as a way to reactivate and reengage our most ardent fans and go out tell stories to new customers is an acquisition point. I think you've seen it this year as we've evolved our soft coolers, brought in our second-generation backpack cooler. That's been a wonderful product for going and addressing customers who may not have had the distinct need for the traditional YETI Tundra, but a backpack cooler is a wonderful complement for getting out and about.\n\nAs you think about our drinkware expansion, as recently as this week with our first Yonder bottle, light-weight bottle, it expands the use cases, it expands the audience that we can address, it creates another use case environment for a customer, and gives us more reasons to be in a consumer life. And I think that philosophy of how we built out is it's methodical and thoughtful with enough innovation where we're also stoking our existing portfolio plus the new innovation.\n\nRandy Konik -- Jefferies -- Analyst\n\nSuper helpful. I guess my last question, maybe for Mike. You gave us a lot -- you ticked off a number of gross margin headwinds and you ticked off the pricing that was beneficial to gross margin. Can you maybe just dig a little deeper.\n\nAnd again, we don't have to quantify it, but just really talk to it. As we kind of think about 2023 and beyond just maybe give us some perspective on how we should be thinking a little bit more on that freight cost side of things -- side of it, where we know the costs are coming down, when those start to come through. Product costs, are we done with those as being a headwind going forward? FX, we can skip. Channel seems like it might be a beneficial, or could be in 2023.\n\nAnd then maybe give us some perspective maybe Matt, on pricing for next year. Just give us that perspective would be helpful just as we think through a high level of how the gross margin can kind of -- it looks like it's going to get better next year, but just give us some perspective on those different buckets so we can think through them, if not quantity, but qualify them into next year and thinking through them for the buy side and the sell side. Thanks, guys. \n\nMike McMullen -- Interim Chief Financial Officer\n\nYes, Randy, thank you for the question. So, I mean, you listed them. I'd say, obviously, inbound has been the major driver of the decline we've seen this year. But with the significant rate -- drop-in rates that we've seen, we do -- like we said, we do expect that to be a tailwind as we go into next year.\n\nHow much and when, I think we'll be able to give a lot more color when we get to our Q4 earnings call. Product COGS, also an impact this year. As you could see from the color we gave from last quarter to this quarter, those have gotten a little bit better, so things have sort of stabilized there. Where they go from here, I think, is we'll need to sort through and again, we'll give a little more color at year-end.\n\nFX has been the one that has -- seems to have got a little bit worse quarter-over-quarter. But to your point, where that goes, I think, is obviously to be determined. Channel mix, not -- didn't see much of an impact this year for the full year, just given that wholesale and DTC are growing pretty consistently. But as we've seen in prior years and as we've messaged about the future, our long-term growth -- goal is to grow DTC faster than wholesale, and we would expect to see a margin benefit as that continues to happen.\n\nAnd for the pricing benefit, I'll turn it over to Matt.\n\nMatt Reintjes -- President and Chief Executive Officer\n\nYeah, Randy. On the pricing, we don't use, as you know, pricing as a lever. We very sparingly use that. We like where our products are priced.\n\nWe like the consistency of our pricing. We think that's a good consumer experience. And I think as you -- just some of the questions earlier around the promotional environment, we -- it's a highly promotional environment right now. YETI has retained being above that, as someone mentioned earlier and consistent with ways we've priced, and we promoted before.\n\nWhat we're using this environment right now to do is to drive some transition of some products to bring in new innovation and have the double benefit of -- some of the inventory we carry today is at a higher level because of the supply chain costs than some of the innovation that we have coming. And so, we're using this sort of unique point in time to leverage our traditional approach to product transition, maybe accelerate a couple of things and get some stuff into the market as we go into 2023.\n\nOperator\n\nOur next question here will come from Sharon Zackfia with William Blair. Please go ahead.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nHi, good morning. Sorry for my voice. I'm battling a little bit of something here. I guess, I'm curious, there's definitely a thesis on the Wall Street that YETI's benefited from pull forward in demand.\n\nYou've clearly been doing well all year on the top line. But Matt, as you look into kind of '23, what are your indicators on whether you can kind of hold that long-term held goal for 10% to 15% revenue growth? And I guess secondarily, and my follow-up would be on the brand awareness. I was a little bit surprised to see that plateau in the deck in '22 versus '21. Just any commentary on how you think the effectiveness of marketing is progressing and what you think led to kind of that plateauing?\n\nMatt Reintjes -- President and Chief Executive Officer\n\nGood morning. Sharon, when it comes to the thesis that you mentioned, I would say it's a little bit of a head scratcher to us because we've been a consistent grower year after year for a number of years within -- well within the ranges that you're talking about and above. And we've talked through the pandemic moment in time where we grew through that disruption. We were growing at similar rates pre-pandemic on the other side of it.\n\nWe've had a great year through the first three quarters this year. So, as we look forward and you look at the drivers of our growth, the continued expansion of our product portfolios, both in drinkware and coolers and equipment, the continued growth that we're seeing in our U.S. business, which is our most established business, the outsized growth we're seeing globally even amid some markets around the globe that are significantly disrupted right now and the relatively untapped opportunity there. So, when we look across our growth algorithm and our growth vectors, it's -- we believe, is intact as it was back in 2018 when we first talked about -- talked publicly about where we're going to take this business.\n\nAnd over the last four years, I think we've shown that formula works, expand the product portfolio, expand the reach, the brand, expand the global in nature, and drive a strong digital business. And that really has evolved to a strong omnichannel business. So, we feel good about where this business is, where it's going and what the opportunity is in front of it. And frankly, we've gone through a number of different market backdrops and environments, and we found ways to be successful in each one of those challenges.\n\nI think that when you think about the brand awareness, unaided brand awareness that you're referring to, we put that one data point out there. We obviously look at a lot of different data points, including slices of unaided awareness, slices of aided awareness, we look at the absolute performance of the business. We look at owner studies and brand studies. That one data point for us is interesting.\n\nThe only thing that we can sort of pin that moderation in unaided awareness because it's sort of nonsense goal that the business has grown geographically that we've had the strength we've had that we've reached new consumers that, that would step down is that during that '20 and 2021 period, when the world is a little more disruptive and people were in front of screens at a higher frequency and rate is that maybe there was a top-of-mind awareness change. So, we look at it as interesting. We look across the rest of our data points and continue to see the really positive signals for where the business and brand are going. And it ties back to the growth algorithm and the growth thesis.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nAnd our next question will come from Joe Altobello with Raymond James. Please go ahead. \n\nJoe Altobello -- Raymond James -- Analyst\n\nThanks. Hey, guys. Good morning. I guess first question for Matt.\n\nYou've talked about throughout this call, improved customer acquisition trends in the quarter. You talked about the improvement in Amazon Marketplace. And maybe I missed it, so I apologize. But was there anything specific that you think drove those improvements in the quarter?\n\nMatt Reintjes -- President and Chief Executive Officer\n\nHi, Joe. Nothing that we would point to specifically. I would say it's been a few things that we've done throughout history is as we tell great brand stories and bring brand campaigns, as we launch new products, as awareness of new product and innovation continues, as kind of people become aware of where they can actually access that product or learn about it, we tend to see some changes in acquisition. I would say the Amazon, we called out that it was demand-driven growth.\n\nThat's a channel where we own the inventory. We don't recognize the sale until it sells through. So, it's pure demand-driven growth. I think the ability to have products out in front of consumers where consumers want to shop is as important as ever.\n\nAnd I think that's one of the powers of this brand is the balance of our omnichannel, the strength and importance of our wholesale partnerships, the strength, and importance of the reach of the Amazon Marketplace, the power of yeti.com, the power of having our own YETI stores and then complemented with the corporate sales and B2B business. So, I think that is -- I think that's one of the strengths of YETI and what drives the acquisition and I think ultimately drives retention.\n\nJoe Altobello -- Raymond James -- Analyst\n\nGot it. Maybe a follow-up on market share. Have you seen any indication that consumers are trading down in other coolers or drinkware?\n\nMatt Reintjes -- President and Chief Executive Officer\n\nNo, nothing that would indicate trading down. I think you look at our numbers and you look at the strength and you look at the commentary we had around sell-through that supports that strength. I think consumer's discerning. I think when you have a brand that has a desire behind it, price points become achievable when you think about a cup at $30 or $35 and a cooler at $250 or $300.\n\nThey're premium in their category, but the product backs it up. And they're achievable price points. And that's why as we go into these holiday seasons, why we like the giftable nature of YETI and why we back that up with our brand and marketing.\n\nOperator\n\nAnd our next question will come from Brian Harbour with Morgan Stanley. Please go ahead.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nYes, thanks. Good morning, guys. Matt, you had made a comment about something to the effect of taking a fresh look at some of the channels, I think, in 2023. What was that kind of referring to? Is that about where you put inventory? Is it about how you promote certain channels? Or what were you kind of thinking there?\n\nMatt Reintjes -- President and Chief Executive Officer\n\nHi, Brian, great question. I would say this -- last year and this year were a little interesting from an omnichannel perspective for us because in 2021 in an inventory constrained environment with high demand, we had to make decisions on how distributed we were going to be with our inventory versus how concentrated to support the consumer demand. As we came into this year in a better inventory position and we believe we are -- and we'll exit this year at a more balanced distributed and available inventory across our omnichannel, what it allows us to do as we go into 2023 is think about the importance and role of each channel and each one has a role to play. We're continuing to evolve the acquisition and retention around yeti.com.\n\nWe're continuing to look at making sure that we have the right assortment available on the Amazon marketplace. In wholesale, we continue to focus with our incredible wholesale partners on merchandising and assortment planning and making sure that YETI shows up in the way they would want and the way we would want. So, I wouldn't call it out as radical changes in our philosophy. It's more we're now back into a position where we have full strength and we can then apply our marketing, our merchandising, our brand building on top of it.\n\nI think the one callout we said was the continued rollout of YETI-owned stores. That's been a wonderful run to date. We have -- we'll have 13 stores by the end of this year. They're great brand beacons.\n\nThey change the assortment that a consumer considers. So, they work the entire funnel from consideration all the way through to purchase and we think it also benefits our omnichannel.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nOK. Thanks. And maybe to that point, just a question on capex. Is some of this just timing where these capacity investments will shift from this year to next year? And then are you going to put more capex toward stores if you're going to accelerate that as we think about next year and beyond?\n\nMike McMullen -- Interim Chief Financial Officer\n\nYeah. Hey, Brian, so in terms of your first question, yes, it's purely timing. I mean as we looked at what our needs were and we refined what we needed to spend this year to meet demand versus next year, we just shifted the timing to next year. So, yes.\n\nAnd then the second question on stores, it is a piece of our capex today. It's not the biggest piece. The biggest piece is around product and capacity and technology. But obviously, as the number increases next year, that will go up.\n\nBut I think we'll still manage within a relatively consistent envelope of capex, and you may see stores go up a little bit, but others go down as we feel like we've -- we're at capacity levels or we have the technology projects that we need. So -- but don't really see a huge spike in the overall dollar going forward.\n\nOperator\n\nAnd our next question will come from John Kernan with Cowen. Please go ahead.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nGood morning, Matt and Mike. Thanks for taking my question. So Mike, can you talk to the working capital opportunity, how can -- how this can be balanced with growth and also margin expansion next year. Do you think you're going to hold structurally higher levels of inventory going forward that turns can improve here back to pre-COVID levels? Thanks. \n\nMike McMullen -- Interim Chief Financial Officer\n\nYes. Hey, John, thanks for the question. So, here's what I'd say. So first, we were happy with our ability to manage inventory in Q3 versus Q2 with it stepping down about $50 million.\n\nWe do think that will continue to come down in Q4. And as we look into 2023, we think inventory can be a meaningful source of cash for us. And I think the big opportunity is transit times come down, I think you'll see that portion of our inventory come down in a material way. So -- and I think that will help drive some free cash flow.\n\nI think the second thing I'd call out on working capital, and that's really been the impact this year is our payables balance. So as we looked at our purchases and what we needed to place this year, and we just -- we refined that assumption around payables, and that's really what's kind of led to the lower free cash flow number that we've seen this year. But we also think that, that could be a meaningful source of cash next year as we start to buy into more inventory, not only is there going to be a P&L benefit for us, but also a free cash flow benefit.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nGot it. And then -- and Matt, you talked to accelerated store openings. Can you talk to how this part of the DTC efforts rank in growth opportunities? And if this is changing in your mind, what the right footprint is for the total YETI store base?\n\nMatt Reintjes -- President and Chief Executive Officer\n\nYeah. Thanks. Thanks, John. A couple of things.\n\nIt's still 13 stores, and it's still a relatively small piece of our DTC and a small piece of our overall. But as we've talked about in the past, our stores are productive and they're accretive to the business, and that's the focus, is we want productive and accretive stores, which is what drives the pacing of how many, how fast. As we think about what we talked about pre-2019, we talked about four to six stores a year. This year, we'll round out our 13 stores, getting back -- we're building out the capabilities and the team and the pace and the support to be able to get back on that pace and maybe look at some acceleration on that.\n\nBut at the end of the day, the focus in our DTC business is really the buildup and strength of our e-commerce and our dot-coms. And that's really that investment we're making and continue to make in our advanced analytics to understand consumer behaviors, to understand buying behaviors and that's where, I would say, the disproportionate focus among our DTC. We make sure we optimize our Amazon Marketplace. We've got a heavy focus on our corporate sales.\n\nB2B opportunities, we continue to see that domestically and globally as a great way to introduce the brand. But the key focus is on our dot-coms and then really ramping the store contribution, the store connectivity to the overall digital DTC piece.\n\nOperator\n\nAnd our next question will come from Brooke Roach with Goldman Sachs. Please go ahead.\n\nUnknown speaker\n\nHi, this is Evan on for Brooke. I was just wondering if you could dive a little deeper into the wholesale trends you're seeing sell-in versus sell-through? And then if you've had any conversations with partners, maybe you could touch on the spring order book outlet today?\n\nMatt Reintjes -- President and Chief Executive Officer\n\nThanks, Evan. We -- I think we reiterate what we said on the call in the release, which is we saw strong sell-in, coupled with strong sell-through, which was great demand in our wholesale partners, and it's a testament to how our product shows up, it's a testament to our partnerships, it's a testament to the brand and the desirability of it. And that's really what we're focusing on as we go into Q4 and get into this important holiday season. So that continues to be an important channel for us, and it continues to be a channel that those partnerships get deeper and more rich and more productive.\n\nAs we think about order books, it's not really something we talk kind of forward order book. YETI is an always-on brand and always on the floor. So, we have constant conversations with our partners about what the next month, what the next quarter, what the next year looks like. I think we'll have a more refined view as we wrap through this important holiday season and as Mike said, get our outlook to 2023 and talk more fully about that.\n\nBut I will say we're deep into the planning process as we present our innovation road map, as we present our supply availability road map to our wholesale partners, and start to think forward to 2023.\n\nOperator\n\nAnd our next question will come from Kaumil Gajrawala with Credit Suisse. Please go ahead. \n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nHi, guys. Good morning. Can you talk a little bit about marketing and how the marketing strategy might be changing or evolving given that inventory now is in a bit of a better place but at the same time, some of what you said earlier about the value of a $30 product as a gift? We've seen some other companies with similarly superior products, kind of focusing a little bit more on that value message as opposed to a more premium message. I'm just curious if you're making any similar sorts of changes given the environment we might be going into.\n\nMatt Reintjes -- President and Chief Executive Officer\n\nThanks for the question. It's a great point and a great call out. I would say one of the things that we've always focused on is the balance between brand marketing, product marketing, consideration, and then all the way down the funnel to conversion or purchase. Our head of marketing, our chief commercial officer, spent a lot of time balancing those dollars between brand and performance.\n\nAnd there's a really -- I think you'll see that play out in the fourth quarter, a really nice intersection between that. If you look at our holiday campaign to the point on value, our holiday campaigns are all based around use your gifts and the versatility of our products, and that we really want people to get out and put the products to the test and put them in the test in active outdoor pursuits. And so that -- you'll see that theme play through all the way down to ultimately the more direct performance marketing, more direct conversion. But building into that, the value is really wrapped up in the versatility, the quality, the performance of the product, and versus value being a price-driven value tool.\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nThank you. \n\nOperator\n\nAnd this concludes our question-and-answer session. I'd like to turn the call back over to Matt Reintjes for any closing remarks.\n\nMatt Reintjes -- President and Chief Executive Officer\n\nThanks, everyone, for the time this morning. We look forward to speaking with you as we wrap up the fourth quarter and look toward 2023.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTom Shaw -- Vice President, Investor Relations\n\nMatt Reintjes -- President and Chief Executive Officer\n\nMike McMullen -- Interim Chief Financial Officer\n\nRobby Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nRandy Konik -- Jefferies -- Analyst\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nJoe Altobello -- Raymond James -- Analyst\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nUnknown speaker\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nMore YETI analysis\n\nAll earnings call transcripts"
}