{
  "companyName": "Starbucks",
  "companyTicker": "SBUX",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/starbucks-sbux-q4-2022-earnings-call-transcript/",
  "content": "Starbucks (SBUX -0.57%)\nQ4 2022 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Diego, and I will be your conference operator today. I would like to welcome everyone to Starbucks' fourth quarter and fiscal year-end 2022 conference call. [Operator instructions] I would now turn the call over to Tiffany Willis, vice president of investor relations.\n\nMs. Willis, you may now begin your conference.\n\nTiffany Willis -- Vice President, Investor Relations\n\nThank you, Diego, and good afternoon, everyone. And thank you for joining us today to discuss Starbucks' fourth quarter and fiscal year 2022 results. Today's discussion will be led by Howard Schultz, interim chief executive officer; Frank Britt, executive vice president, chief strategy and transformation officer; Sara Trilling, executive vice president and president of Starbucks North America; and Rachel Ruggeri, executive vice president and CFO. And for Q&A, we will be joined by Laxman Narasimhan, incoming chief executive officer; Michael Conway, group president of international and channel development; and Belinda Wong, chairwoman of Starbucks China.\n\nThis conference call will include forward-looking statements, which are subject to various risks and uncertainties that could cause our actual results to differ materially from these statements. Any such statements should be considered in conjunction with cautionary statements in our earnings release and risk factors discussed in our filings with the SEC, including our latest annual report on Form 10-K and quarterly report on Form 10-Q. Starbucks assumes no obligation to update any of these forward-looking statements or information. GAAP results in fourth quarter fiscal year 2022 include several items related to strategic actions, including restructuring and impairment charges, transaction and integration costs and other items.\n\nThese items are excluded from our non-GAAP results. All numbers referenced on today's call are on a non-GAAP basis, unless otherwise noted, or there is no non-GAAP adjustment related to the metrics. Further, year-on-year comparative metrics on today's call are based on a 13-week or 52-week basis, to exclude the impact of an extra fiscal week in fiscal 2021. For non-GAAP financial measures and year-on-year metrics mentioned in today's call, please refer to the earnings release and our website at investor.starbucks.com to find reconciliations of those non-GAAP measures to their corresponding GAAP measures and 53-week and 52-week metrics.\n\nThis conference call is being webcast, and an archive of the webcast will be available on our website through Friday, December 2, 2022. And for your calendar planning purposes, please note that our first quarter fiscal year 2023 earnings conference call has been tentatively scheduled for Thursday, February 2, 2023. And with that, allow me to turn the call over to Howard.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nThank you, Tiffany. Well, hello from Milan. Today has been a very special day for me and a powerful emotional reminder of the intersection of my life and years with Starbucks. It was 40 years ago, walking the beautiful streets of Milan, that the inspiration for the possibilities of what Starbucks could one day be and mean around the world first struck me.\n\nAnd here I am, back in Milan, celebrating the early days of our beautiful, thriving business in Italy, a country in which no one expected Starbucks to succeed, on the very day of our global launch of holiday, an event that has become a phenomenon all over the world. So much of Starbucks' inspiration has come from Italy. And in Italy, our partner's dedication to the art of coffee, to the elegance and passion of coffee craft and to the delivery of a premium coffee experience to our customers, is being executed at the highest level. Italians have embraced Starbucks.\n\nOur top-selling beverage is actually a solo espresso, validating the quality of our coffee and the relevance of Starbucks customer experience that has defined us since Starbucks' founding in 1971. We recently opened our 20th store in Verona to record crowds, with Rome and Naples fast following in 2023. Milan and Italy are reflections of the premium coffee experience Starbucks is delivering to customers in cities and countries everywhere as demonstrated by the very strong Q4 and fiscal 2022 financial and operating performance Starbucks reported this afternoon. In Q4, Starbucks grew global revenues 11% over prior year to a quarterly record of $8.4 billion driven by 7% comp growth globally and 11% comp growth in North America.\n\nFor the fiscal year, we grew global revenues 13% over prior year to a record $32.3 billion driven by 8% comp growth globally and 12% comp growth in North America. We also grew our global store base 6% in fiscal '22 and ended the year with roughly 36,000 stores in 83 countries. Today, Starbucks serves over 100 million customer occasions from our retail stores around the world and across all channels, delivers over 400 million customer coffee occasions globally every week. We continue to manage the business through today's challenging operating environment, more mindful than ever of the unprecedented global economic uncertainties and challenges confronting our customers.\n\nOur strong performance in the quarter and year is particularly gratifying, in that it underscores the relevance of the Starbucks brand and the strength of our relationships with our customers around the world in the face of these unprecedented challenges. We saw strong demand for Starbucks coffee in Q4 and throughout the year in every market and channel in which we operate. We are encouraged by the early signs of recovery we saw in China in Q4, where innovation, increased customer physical and digital engagement with the Starbucks brand and the relaxing of COVID restrictions, drove solid positive sales momentum and sequential quarterly improvement. The speed with which our business in China accelerated in Q4 and the strong positive correlation between Starbucks revenue growth and the relaxing of COVID mobility restriction reinforces our confidence in Starbucks' long-term growth opportunity in China.\n\nHowever, as you know, over the past few weeks, there has been a significant resurgence of COVID in China. With the resurgence has come renewed lockdowns and mobility restrictions pursuant to China's strict zero-COVID policy, including in many cities in which we operate, meaningfully reducing traffic in our stores. We anticipate the current COVID-related uncertainty to continue and repeat the view we shared on our Q3 call and our Investor Day, that while our long-term aspirations for China remain undiminished, we expect the recovery of our business in the country to be nonlinear. I'll spend more time on China in a few minutes.\n\nIn fiscal 2022, we drove meaningful growth in our global customer base. In the U.S. alone, we grew our unique customers 9% year over year, and our U.S. customers are engaging more deeply with the Starbucks brand as evidenced by a 16% increase in U.S.\n\nStarbucks Rewards membership year over year to nearly 29 million members, up 5% over Q3. Today, Starbucks is connecting to more customers more deeply, both in the U.S. and around the world, than ever before, ideally positioning us to drive further acceleration in revenues and comps in the quarters and years ahead. Our performance supports our confidence in the ambitious growth agenda we announced in September, in which we will be adding roughly eight new stores per day, delivering best-in-class returns around the world every day for the next three years, bringing us to nearly 45,000 stores globally by the end of fiscal 2025.\n\nOur Q4 results also demonstrate evidence of early but highly encouraging benefits from reinvention plan investments we detailed at Investor Day in September. And as you will hear from Frank Britt, our chief strategy and transformation officer, we have clear line of sight to a full array of benefits reinvention will deliver in the quarters and years ahead. Following Frank, Sara Trilling, a 20-year Starbucks partner, who recently took over leadership of our North American business after having successfully led Asia Pacific for the last four years, she will provide insights into our business in North America today and what to expect in the quarters ahead. Then Rachel will highlight our financial and operating performance in Q4 and for the year and provide guidance for the year ahead.\n\nAnd finally, we will end the call with Q&A. When fully rolled out, Starbucks' reinvention, co-created in partnership with our partners across the country, will touch and elevate every aspect of our Starbucks partner, customer and store experiences. Last week, 2,000 Starbucks leaders from across U.S. and Canada converged in Seattle to coalesce around reinvention and take it back to their local markets.\n\nI don't think I've ever seen greater engagement in over 40 years of a more positive response to any Starbucks gathering in our history. Reinvention investments will make it easier for our partners to do their jobs, better enable partners to satisfy growing demand in our stores and provide greater opportunity for our partners to engage with our customers. Reinvention investments are already having a measurable positive impact on our business and operations, most notably in terms of improved partner retention, increased speed of service and an elevated customer experience. And I'm particularly pleased that reinvention investments are bringing coffee excellence, coffee craft and joy and a little bit of love back into being a Starbucks Barista.\n\nKey to Starbucks' success and the foundation of our long-term growth strategy is Starbucks' continued global leadership around all things coffee and espresso, hot and cold, Starbucks' core. In Q4, we continued to grow from our core, innovate, introduce new levels of customization and premiumization and extend our global coffee leadership in both the hot and cold beverage categories, with an emphasis on cold coffee, a category we single-handedly created and are growing around the world. Customer demand for customized, handcrafted Starbucks cold beverages is so strong that, today, cold coffee beverages account for 76% of total beverage sales in our U.S. company-operated stores.\n\nAnd customers are increasingly further customizing their cold coffee beverages by adding high-margin beverage flavor modifiers to create unique beverages tailored to their own particular taste preferences. We also continue to introduce innovative new core hot coffee and espresso beverages and innovate around iconic platforms, like pumpkin spice, up 17% over last year driven by increased customization, including cold foams. As part of reinvention, we are rolling out a new, completely proprietary, handheld cold foamer that enhances beverage quality and increases speed of service while reducing complexity for our partners. The response from our partners has been overwhelming.\n\nOur growing base of new U.S. customers and Starbucks Rewards members, combined with very strong customer response to our innovative hot and cold beverage lineup to deliver the highest net sales week in our history in September. Let me just repeat that. In our history, we had the biggest sales week in September.\n\nThe strength of our business as we exited September, coupled with a fantastic holiday lineup kicking off today, with our stores turning red, holiday favorites on the menu and the return of our iconic red cups, gives us tremendous confidence heading into holiday in 2023. In North America overall, the combination of customer shifts toward premium hot and cold beverages, increased customization, strategic decisions around beverage, food and modifier pricing and an 18% increase in food sales drove net revenues up 15% year over year to a record $6.1 billion. Once again, our convenience channels, drive-through, Mobile Order & Pay and delivery drove 72% of our total sales volume. Starbucks Rewards members drove a record 55% of tender in our U.S.\n\ncompany-operated stores in Q4. Starbucks Rewards continues to deliver value to our customers, enable customer connection and drive our business. And despite its global scale and growth, we have significant untapped opportunities to grow our Rewards program in a very unique way. We recently launched our Reward Together program, enabling a select group of leading brands to partner with us by linking their loyalty program to Starbucks Rewards.\n\nThrough Reward Together, we will engage and reward members of both brands with new benefits and experiences that will make our Rewards program even more valuable, drive membership and increase customer lifetime value. Our first U.S. partnership with Delta Airlines launched last month to an extraordinary customer response. Both Delta and Starbucks were overwhelmed with what took place.\n\nAnd in September, we announced Starbucks Odyssey, our next-generation loyalty model that integrates NFTs with Rewards. Starbucks Odyssey will enable us to connect even more deeply with customers and give our customers the opportunity to earn and purchase digital collectible assets that will unlock access to new benefits, a digital community and immersive coffee experiences that they cannot get in any other place. Customer response to Starbucks Odyssey has been overwhelming. You will hear more about the Starbucks Odyssey in a few weeks when our first wave of customers have an opportunity to explore this new exciting way to experience and connect with Starbucks.\n\nThe numbers that we will release in terms of the response will surprise many of you. Our fast-growing 6,600 North American-licensed store business posted very strong results in Q4, with revenues up 25% in Q4 and 29% for the year. We are proceeding with the rollout of Starbucks Connect across the U.S. licensed store portfolio.\n\nStarbucks Connect enables licensed stores for the first time to offer the full array of Starbucks' Mobile Order & Pay and Rewards benefits. And as you will hear from Sara, the 1,600 licensed stores that have adopted Starbucks Connect are seeing a significant lift in business since adoption. Starbucks Connect enables us to capture demand across our broader portfolio and will be highly accretive to our business. The momentum we saw in our International segment coming out of Q3 continued in Q4, with revenues for the quarter up 12% to $1.8 billion on a constant currency basis.\n\nFor the year, revenues grew 9% year over year to $6.9 billion, also on a constant currency basis. We added 518 stores during the year and now operate nearly 18,500 stores around the world. We are sensitive to the challenges that the rapid increase in the value of our dollar is posing to our International licensees and remain in close contact as we work together to navigate the dynamic environment that we are all operating in. Turning to our Channels business.\n\nStarbucks is the No. 1 share in U.S. at-home coffee. Starbucks is the No.\n\n1 share in global ready-to-drink coffee, and continued growth in our Global Coffee Alliance with Nestle combined to deliver strong performance in Q4, with revenues increasing 18% on a constant currency basis to $484 million. For the year, revenues also increased 18% to $1.8 billion on a constant currency basis. Now let me begin the discussion around China by saying that Starbucks has been in China for 20 years and that our aspirations for our business in China has never been greater. We have over 6,000 stores in China today.\n\nAnd as Belinda shared at Investor Day, we have close to 9,000 stores -- we will have close to 9,000 stores by 2025. We will be opening our Starbucks China Coffee Innovation Park, including our largest coffee roasting and packaging plant outside the U.S. in summer 2023. Starbucks employs over 60,000 passionate, dedicated partners in China.\n\nOur partners are deeply engaged with their customers and demonstrated by today's record high customer connection scores. We continue to be an employer of choice and lead the way in partner investments, recently introducing a 14th month bonus for all full-time partners. And we continue to invest in China to create career and opportunity paths for our partners and to support the communities we serve. We also continue to expand our customer base in China and deepen our digital connection to customers.\n\nActive Starbucks Rewards membership grew 29% sequentially in Q4 over Q3 to over 17 million members, just below historic levels, coinciding with the lifting of restrictions and reflecting the relevance and underlying strength of the Starbucks brand in China. Mobile ordering sales mix, nonexistent prior to 2019, drove 44% of mix in Q4. Delivery, up 35% year over year, now representing over 24% of sales. We expect mobile, digital, loyalty and delivery to continue to grow and drive our business.\n\nHowever, we are ultrasensitive to the evolving macro challenges that have surfaced regarding China, particularly in connection with the impact of the zero-COVID policy. But our strong belief in China is based on our success in the country and our commitment to playing the long game. We are confident that when COVID disruptions affecting the country abate, Starbucks will emerge not only as the undisputed leader in our category, but likely the No. 1 Western consumer brand in the country for having continued to meaningfully invest in our partners and in our business throughout the pandemic and despite the disruptions.\n\nLaxman's immersion is going spectacularly well. He's visited and worked in stores in the U.S. and U.K., quickly connecting and winning the hearts of Starbucks partners wherever he goes, just this week earning his Barista certification in record time and store Green Apron. Laxman's commitment to becoming intimate with store operations and our partner and customer experiences reflects our mutual understanding of what is most important in these early days of his joining Starbucks.\n\nHe and I engage daily as he absorbs more and more about the company and our business. And the board leadership team and I are all deeply invested in his success. I cannot be more confident that Laxman is the right CEO at the right time for Starbucks. Today, Laxman has a front-row seat as we launch our all-important holiday season.\n\nSoon, along with our leadership team, he will be leading the company, bringing reinvention to life and guiding Starbucks to the next chapters of our storied history. In closing, Starbucks has never been financially stronger, better positioned or more confident in our future as we enter Q1 and holiday and embark on the exciting new era of growth ahead. With that, I'll turn the call over to Frank. Frank?\n\nFrank Britt -- Executive Vice President, Chief Strategy and Transformation Officer\n\nThank you, Howard, and good afternoon, everyone. It was just 50 days ago that we laid out our reinvention agenda that involve five major strategic shifts. First, creating a truly unified global company; second, radically improving our in-store partner experience; thirdly, reimagining our store operating model; fourth, reinvention around what customer connection means; and perhaps, most importantly, redesign the construct of what it means to be a partner at Starbucks. While still early days, we are seeing progress with several key proxy measures.\n\nFor example, retention has increased with turnover scores at the hourly Barista level, lower by one point versus prior year and four points versus prior quarter. Additionally, customer connection scores show a five-points improvement to pre-pandemic levels. All of these are early but encouraging signs. We fully embrace that our partners are the most critical component to our longer-term performance, and we need to be even better at addressing their needs.\n\nPartners who proudly wear the Green Apron have bravely shared their stories and their ideas in our co-creation sessions, and we have concentrated our efforts to jointly create solutions with our partners and for our partners. In the fourth quarter, we continue to improve our already industry-leading benefits to a deeper position of strength with several new programs for partners. Representative examples of improvements include: a new incentivized savings program in partnership with Fidelity, designed to help partners in case of unplanned financial challenges; a new student loan debt program to empower partners looking to find the best ways to address their college debt management obligations; an increase in sick time accrual ratios for our partners; an updated family expansion reimbursement program, aimed to assist partners with the cost of growing their families through adoption and the like. We have remained committed to the critical development opportunities of our people.\n\nAnd as a complement to doubling our partner training hours, as Howard noted, we've reintroduced our iconic Black Apron credentialing program, and nearly 5,000 partners have already earned their apron and continue in the program. We've also launched the pilot of a new partner app designed to create one digital community for our 270,000 U.S. and Canada company-owned operated store partners. And over time, this new digital platform will allow partners to stay connected on what matters to them most, including their schedules, their benefits and continuing to use their voice to drive the co-creation of Starbucks.\n\nMore than 1,000 partners have participated in our testing and are providing feedback for our launch planned for Q2. Obtaining the right mix and number of hours is essential to a thriving partner experience at Starbucks, and we aim to provide desired hours with flexibility and predictability. We are highly focused on honing our staffing models and operating processes to ensure we can allocate the right amount of talent to each store in every daypart and advancing our capabilities to fine-tune our hours of operations by store to reflect unique demand patterns. As part of the reinvention agenda, all of these efforts share in common a primary focus to grow the lifetime value per partner and are connected to the ongoing reinvention initiatives, including in-store waste reduction and further acceleration of equipment rollout to enable an improved partner experience and higher productivity.\n\nWe will also continue to focus on accelerating our trade area transformation, modernizing the way technology elevates the store experience and continuing supply chain innovation. Longer-term, powered by our partners' insights, we have a very robust agenda and improvement plan powered by a new architecture and vision of the partner experience. And over time, this will translate into an even more partner-centric system in the stores, affirm our reputation as a frontline talent career launchpad and improve retention rates. Finally, as part of this new phase of reinvention, we continue to lean into our centralized project management office to drive better integration among our initiatives and more fully capture the synergies across our store and customer innovations.\n\nTogether, these initiatives are designed to strengthen our business through top line growth and margin expansion and improve the partner experience. I look forward to sharing more of the progress in the quarters ahead. Let me now turn it over to my partner, Sara.\n\nSara Trilling -- Executive Vice President and President of Starbucks North America\n\nThank you, Frank, and good afternoon, everyone. I'm Sara Trilling. I'm pleased to join you today for my first earnings call in my new role, leading the North America business. While I'm relatively new to this particular role, I'm a 20-year partner and most recently served as Senior Vice President of Asia Pacific.\n\nOver my Starbucks career, I've touched nearly every aspect of the business and have served many leadership positions across a variety of functions, including store development, retail operations, product and marketing. And I'm looking forward to applying the relevant breadth and depth of my experiences to this next phase of growth in North America. To build on some of the comments from Frank and Howard, we continue to see very healthy growth in our North America business. As we highlighted at Investor Day, we saw the highest net sales week of all time with the launch of our fall promo.\n\nAnd I'm pleased to share this subsequently led to an incredibly strong September, with the three high sales weeks in our history. Our strong quarter, comparable sales of 11% and revenue growth of 15% were largely driven by a record-breaking fall launch, coupled with continued strategic pricing actions and increased food attach, as well as the shift to more premium beverages and a growing demand for personalization in both company-operated, as well as licensed businesses. Elevated from pre-pandemic levels, we maintained ticket comp strength in our U.S. company-operated business at 10%, representing our fifth consecutive quarter of increased ticket comp.\n\nThese results reflect the continued strength in demand for Starbucks as our customers fell into their new normal routine and behaviors. We fully expect the momentum from our record fall launch to continue as our highly anticipated holiday at Starbucks launched just today and include some great seasonal offerings. What gives us further confidence in the holiday season is the strength of the Starbucks brand with younger, more diverse customer groups. More than half our U.S.\n\ncustomer base is Gen Z and Millennials, reflecting relevancy and brand love across generational cohorts, trends we see with diverse customer cohorts as well. We are incredibly pleased with our momentum in the business and the reinforcement of our strategy in the following key areas. First, we've established sustained relevancy of the Starbucks brand in customer loyalty. In fact, Starbucks is consistently, quarter over quarter, the leader in market share, first choice and past 30-day visitation when it comes to an away-from-home coffee occasion as measured by our brand equity tracker.\n\nWe're also pleased to share that customer connection scores have increased five points versus pre-pandemic levels. The strength of the brand is further illustrated by the success of our iconic pumpkin spice platform, which grew 17% year over year and continues to resonate with customers who love the classic Pumpkin Spice Latte, as well as newer additions, such as the Pumpkin Cream Cold Foam modifier. Second, our cold customized beverage strategy is working. We're seeing growth in both hot and cold and increasing customization.\n\nIn Q4, more than 60% of beverage units sold in the U.S. company-operated business were customized, contributing to the $1 billion and growing annual net sales for modifiers, representing growth of 2x since the first fiscal 2019. Finally, we reinforced our unique position in providing experiential convenience as evidenced by all-time highs in Starbucks Rewards engagement amid Mobile Order & Pay orders. The Starbucks Rewards program in the U.S.\n\ngrew 90-day active members, ending FY '22 with nearly 29 million members. This represents growth of 16% year over year and 55% of our U.S. company-operated revenue in the quarter, up nearly 4% from prior year, representing the highest-ever percent of tender. Mobile Order & Pay surpassed 26% in Q4 for the first time in a quarter, finishing fiscal year '22 at 25% of total transactions.\n\nWe're incredibly optimistic about our continued momentum in digital, following the unprecedented interest in Starbucks Odyssey, the integration of NFTs with our industry-leading loyalty program to create an accessible Web3 community that brings unique aspects of our brand to life in a new way. We also experienced a wildly successful launch of Reward Together with Delta. With this partnership, our Rewards members are able to earn miles faster through their everyday purchase at Starbucks and earn even more Stars on days when they travel with Delta. The initial response from customers has been extraordinary and beyond our expectation, and this is just the start.\n\nImportantly, we finished the year with nearly 25% of our U.S. license portfolio live with Starbucks Connect, allowing us to create a seamless digital experience across our stores, giving customers more ways to connect with our brands, furthering the value of the rewards experience. As part of our reinvention and as we shared at our September Investor Day, we're investing in equipment to innovate for an improved partner and customer experience. We have completed the deployment of Starbucks Cold Brewer and have rolled out the Mastrena 2 espresso machine and new warming ovens to nearly 95% and 72%, respectively, of our stores across the U.S.\n\nThis equipment collectively supports improvement in our throughput during both peak and full day, while providing the foundation to support elevated partner and customer experiences as we further reinvention plan investments and productivity. The rollouts for these three items will be completed by fiscal year '23 for our company-operated stores. Additionally, we rolled out nearly 60% of our handheld point-of-sale investments to nearly 75% of our cold beverage labelers. Handheld POS is already helping us capture new and latent demand in support of our ambitious revenue expectations.\n\nAnd we expect to see further benefit as we extend the rollout for handheld POS into fiscal year '24. While still in the early days of development, partner and customer reception of the new Siren System innovation we shared at Investor Day is overwhelmingly positive, including the Clover Vertica brewer and the new proprietary on-demand cold-pressed Cold Brew technology. We expect to begin rolling out Clover Vertica brewer later in this fiscal year, with our broader Siren System innovations fast following in fiscal year 2024. Through our investments, we're giving our partners more time to focus on coffee craft and connect with customers, enabling them to continue delivering experiential convenience in a way that only Starbucks can.\n\nThe powerful unlock is our reinvention positions us for sustainable, profitable growth over the long term. In fact, just this last week, we welcomed nearly 2,000 retail leaders from U.S. and Canada to Seattle for our District Manager Leadership Experience. This powerful three-day event is designed with great intention to provide a renewed understanding of the critical role each leader plays in our business and with our people and equip them fully to lead their stores and store partners through our reinvention and into our future as we all breathe life into this reinvention plan.\n\nTo close, what I would leave you with -- is with this. This is an incredibly exciting time to lead our North America business. While the macro environment may have uncertainty, our performance is once again demonstrating the strength and resilience of our brand and our business. We are well-positioned in this environment, which will only further strengthen as our reinvention comes to life.\n\nI'll now turn it over to Rachel.\n\nRachel Ruggeri -- Executive Vice President and Chief Financial Officer\n\nThank you, Sara, and welcome to your first Starbucks earnings call. And good afternoon, everyone. As you heard throughout this call, starting with Howard, we had record-breaking performance this quarter, and I'm incredibly proud of what we achieved together. We finished fiscal year 2022 with consistently strong demand in the U.S.\n\nand in nearly all major markets across the globe, with that demand sustaining as we exited the year. Our Q4 consolidated revenue reached another historical high, $8.4 billion, up 11% from the prior year or 14% when excluding a 3% impact of foreign currency translation. The revenue growth was primarily driven by 7% comparable store sales growth and 6% net-new store growth over the past 12 months, further strengthened by the remarkable momentum in our global licensed store businesses. In addition, this outstanding performance reflects double-digit revenue growth in all three of our reporting segments in constant currencies, showcasing the resiliency of our brand, power of customer loyalty and depth of our diverse portfolio.\n\nQ4 consolidated operating margin contracted 380 basis points from the prior year to 15.1%, primarily driven by investments in growth in labor, including enhanced store partner wages and new partner training, part of which were investments under our reinvention plan. In addition, operating margin was impacted by inflationary headwinds and deleverage related to COVID restrictions in China. The overall contraction was partially offset by pricing in North America and sales leverage across markets outside of China. Q4 EPS was $0.81, declining 9% from the prior year, but better than expectations, including $0.05 of nonrecurring benefits primarily related to discrete tax benefits.\n\nFor full year fiscal 2022, our consolidated revenue reached a record $32.3 billion, up 13% from the prior year or 15% when excluding a 2% impact of foreign currency translation driven by 8% comparable store growth, 6% net-new store growth and strength in our global licensed store businesses. Full year consolidated operating margin and EPS were 15.1% and $2.96, respectively. I will now provide segment highlights for Q4. North America delivered revenue of $6.1 billion in Q4, up 15% from the prior year and another all-time record, primarily driven by an 11% increase in comparable store sales, inclusive of a 10% increase in average ticket, as well as net-new store growth of 3% over the past 12 months.\n\nImpressive momentum in our U.S. licensed store business also contributed to the segment's record revenue performance. My colleagues spoke in detail about our incredible U.S. performance in Q4, posting 11% comparable store sales growth.\n\nAverage ticket once again broke a record, primarily driven by pricing and food attach. Despite elevated pricing actions taken throughout the year, daily store traffic in the U.S. reached approximately 95% pre-pandemic levels in September, fueled by the wildly successful fall promotion. Importantly, the volume of beverage and food items sold per store has well-exceeded pre-pandemic levels, and the number of unique customers, again, reached an all-time high in Q4, up 9% over the prior year and up more than 1% versus prior quarter, underscoring our brand's expanding reach and relevance and customer loyalty.\n\nNorth America's operating margin was 19% in Q4, contracting 270 basis points from the prior year, primarily due to investments in growth in labor, including enhanced store partner wages and new partner training, as well as inflationary headwinds, partially offset by pricing and sales leverage. Our disciplined actions to closely manage labor hours, reduce waste and prioritize discretionary spend also contributed to the segment's margin performance as we build a strong foundation for progressive margin expansion in years to come. Moving on to International. The segment delivered third quarter revenue of $1.8 billion, down 1% from the prior year or up nearly 12% when excluding a 12% unfavorable impact from foreign currency translation.\n\nThis double-digit revenue growth in constant currencies was driven by sustained strength in all major markets outside of China, as well as an 8% increase in total store count over the past 12 months. The growth was partially offset by a 5% decline in comparable store sales as the impacts of COVID continued in China. As Howard discussed, our China market continued its recovery in Q4, navigating through reoccurring COVID outbreaks and turbulent consumer mobility. The market posted a comp decline of 16% in Q4, a meaningful sequential improvement from a 44% decline in Q3.\n\nDespite this depressed traffic, the China team's outstanding leadership and strength of our brand were markedly evident in the quarter as reflected in record levels of store development, growth in delivery and the highest-ever customer connection scores. Outside of China and excluding the impact of foreign currency translation, our diverse international markets across the globe sustained incredible momentum in Q4. Collectively, the market's revenue growth exceeded 30% in the quarter when excluding a 19% unfavorable impact of foreign currency translation. International segment's net-new stores reached a quarterly record at 518, climbing to more than 18,000 stores in total, setting the stage for a new era of growth, with a rapidly expanding footprint around the world.\n\nOperating margin for the International segment was 14.5% in Q4, down 750 basis points from the prior year, mainly driven by deleverage related to COVID restrictions in China, lower government subsidies, as well as partner investments. The contraction was partially offset by pricing and strong sales leverage across markets outside of China. Shifting to channel development. The segment's revenue grew 16% to $484 million in Q4 or up 18% when excluding a 2% impact from foreign currency translation driven by growth in both the Global Coffee Alliance and our global ready-to-drink businesses.\n\nChannel Development continued to play a vital role in differentiating, diversifying and amplifying our brand by creating customer occasions outside our stores. As a result, Starbucks remains the market leader in both the total U.S. at-home coffee and ready-to-drink categories. Building on the success of our newer platforms, the segment's robust innovations continued in the quarter, including the introductions of ready-to-drink Starbucks Pumpkin Cream Nitro Cold Brew in the U.S.\n\nand bottled Frappuccino Smoothie in China, to name a few. The segment's operating margin was 50.6% in Q4, down 170 basis points from the prior year, mainly driven by business mix shift. Let's now move on to our fiscal 2023 outlook, which reflects the beginning of a new era of growth. Our guidance remains consistent with what we shared at our Investor Day in September.\n\nSo today, I will reaffirm and refine the guidance specific to fiscal year 2023. And we'll also introduce an outlook on a few below-the-line metrics that were not part of our Investor Day guidance. Starting with the first building block of our growth, comparable store sales growth. We expect fiscal 2023 U.S.\n\ncomparable sales growth to grow in the range of 7% to 9%. For China, we're expecting outsized comp in fiscal year 2023 as we lap the severity of the lockdowns in the market. Given the quarterly shape of the fiscal 2022 baseline, we expect China comp to be negative in the first quarter, followed by outsized comp in the balance of the year. Our fiscal 2023 global comp growth is expected to be near the high end of our long-term target range of 7% to 9%, consistent with what I shared at Investor Day.\n\nAnd global comp in Q1, reflecting negative comp in China, is expected to be at the low end of the annual guidance range, then expanding in subsequent quarters. Moving on to the second building block, new store growth. We expect our U.S. store count to grow by approximately 3% in fiscal year 2023.\n\nIn China, we will continue to rapidly expand our store footprint, with approximately 13% growth expected in fiscal year 2023. We expect our global store growth to reach approximately 7%, with over 75% of the growth coming from outside of the U.S. as we continue to diversify our portfolio globally. With this powerful combination of global comp and store growth, coupled with our Channel Development performance, we expect our consolidated revenue growth to reach the range of 10% to 12% in fiscal year 2023 despite an approximately 3 percentage point unfavorable impact expected from foreign currency translation.\n\nWithin fiscal 2023, the unfavorable impact of foreign currency translation is expected to reach approximately 4 percentage points in the first half of the fiscal year, tempering to approximately 1 to 2 percentage points in the back half of the year. Despite the considerable pressure we now expect from foreign currency translation, which could abate, we remain confident in our revenue guidance range for the full year. We have a solid path to capture strong demand, maximize opportunities unlocked from our reinvention plan and deliver attractive revenue results. Our third building block is operating margin.\n\nGlobally, we expect solid margin expansion in fiscal year 2023. In terms of a quarterly shape, we expect operating margin to be tempered in Q1 and Q2, with meaningfully higher margins in Q3 and Q4 as margin benefits accumulate from the continued unlocking of the reinvention plan, coupled with the expected recovery in China. In addition to the quarterly shape of operating margin, here are a few points to consider. We expect over $1 billion incremental investments in fiscal year 2023, half of which will reflect the annualization of the fiscal 2022 investments.\n\nWe expect headwinds related to supply chain and commodity inflationary pressures to continue in fiscal 2023, albeit to a lesser extent relative to fiscal 2022. Headwinds will be managed through sales leverage, pricing and productivity from the reinvention, resulting in positive margin expansion as the year progresses, as I previously mentioned. The fourth building block is capital allocation. We expect our capex in fiscal 2023 to be approximately $2.5 billion.\n\nAs we shared during our Investor Day, we also expect to return approximately $20 billion to shareholders in the next three years between dividends and share buybacks. We remain committed to targeting an approximately 50% dividend payout ratio as reflected in the recently announced dividend increase, and we'll also resume our buyback program in fiscal 2023. We expect the buyback benefit on EPS to be initially limited until fiscal 2024, when the benefit is expected to reach approximately 1%, calculated net of interest expense. In regards to interest expense, we expect between $540 million and $560 million of interest expense in fiscal 2023, up from $483 million in fiscal 2022.\n\nThis increase, driven by incremental debt issuances in fiscal 2022 and fiscal 2023 as outlined in our capital allocation strategy. Importantly, we remain committed to our BBB+ credit rating and leverage cap of 3x rent-adjusted EBITDA. As for tax rates in fiscal 2023, we expect our effective GAAP and non-GAAP tax rates to be in the mid-20% range. This is up from our fiscal 2022 GAAP and non-GAAP tax rates of 22.4% and 23.1%, respectively, which benefited from certain discrete tax items that are not expected to repeat to the same degree in fiscal 2023.\n\nFinally, based on the current environment, we expect foreign currency translation to have approximate 4 percentage point unfavorable impact on fiscal 2023 earnings growth. Despite that, we continue to expect fiscal 2023 GAAP EPS growth to be at the high end of the 15% to 20% range. Fiscal 2023 non-GAAP EPS growth is expected to be at the low end of the long-term range of 15% to 20% as the benefits of the reinvention investments will take time to amplify. It's important to note that Q4 fiscal 2022 included approximately $0.05 of nonrecurring items, largely from discrete tax benefits.\n\nAnd considering the quarterly EPS shape, we expect it to mirror the quarterly shape of operating margin, which will also have a meaningful step-up in the second half of the fiscal year. In closing, here are key takeaways from my discussion today. We are incredibly proud of our Q4 performance, underpinned by the experience our partners create for our customers each and every day. Our 2023 guidance sets the stage for another year of record performance.\n\nImportantly, we recognize that our future growth is dependent on our investments in our partners, stores and customers. As we lean in and solve the challenges of our business, together with our partners, we are confident of our path to unlock a new era of growth, creating value for all stakeholders, partners, customers and shareholders. Once again, our success is earned through our more than 450,000 Green Apron partners working across the globe to elevate the Starbucks experience each and every day. Their commitment and their unwavering focus will continue to be the cornerstone of our new era of growth.\n\nWith that, we will open the call to Q&A. Operator?\n\nOperator\n\n[Operator instructions] Your first question comes from Andrew Charles with Cowen. Please state your question.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nGreat. Thanks. I had two questions on the Rewards Together program. First, can you talk about what differs about this program versus the Stars Everywhere program that Starbucks ran about six or seven years ago, when you partnered with New York Times, Lyft and Spotify, that was ultimately discontinued? And then my other question is just on the data sharing.\n\nCan you talk about the new capabilities this program is going to afford you and how the data sharing will work between you, Delta and any other new partners that you guys bring on? Thanks.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nThank you for the question. This is Howard. I'm sitting with Brady Brewer, chief marketing officer of Starbucks, and he'll take your question. Brady?\n\nBrady Brewer -- Chief Marketing Officer\n\nYeah. Thanks for the question. Really, the Reward Together program is about taking like-minded leading loyalty programs and linking them directly to Starbucks Rewards. And the intent is that whether or not you are with an airline like Delta, you can earn miles faster at Starbucks, and you can get additional Starbucks benefits when you fly with Delta.\n\nAnd we're looking at a number of leading brands. And so this is creating direct tech-to-tech connection to link our loyalty programs and make the experiences better for both brands and both sets of customers. In terms of the data, we're really sticking with our continued focus on using data to make the experience better but being very thoughtful and disciplined about the data that we capture, but using it to make the experience better and inform our business. So we're excited about the early stages of Reward Together.\n\nWhat we've seen, as you heard on the call, is extraordinary demand to link accounts in a way that was overwhelming relative to our expectations. So we're excited to see this build in the future.\n\nOperator\n\nThank you. Your next question comes from Jeffrey Bernstein with Barclays.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nThank you very much. Howard, since the Analyst Day, the top question we've heard on Starbucks is related to the new long-term comp guidance of 7% to 9%. And it does seem like you're quite confident on that in fiscal '23. It seems like you have a pretty good line of sight, and these quarterly results support that.\n\nAnd I get the feeling fiscal '23 is driven by menu pricing and the China bounce-back. But with that said, the focus, I guess, we're hearing is more looking six to 12 months out, with an even larger system. And in the face of a slowing macro and potential recession, it seems like your product will be more discretionary. So just wondering your confidence or maybe if you could prioritize the drivers to support that 7% to 9% comp, just because yourselves and even your peers, it's just been very difficult to be able to sustain that level without it being driven by price.\n\nSo especially going into a potential recession, you're confident six to 12 months out that we could still be talking about 7% to 9% for the next couple of years. Any color or prioritization would be great. Thank you.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nThanks, Jeff. Well, let's try and kind of go through the question based on our history, what we've seen in the near term and why we're so confident. If you go back many years, although this is an unprecedented time, we have demonstrated, time and time again, that there is an affordable luxury to Starbucks that our customer base has been willing to support and the loyalty to Starbucks continues. Now in the past, we did not have the inherent benefit of the Rewards program, which as you heard in our prepared remarks, is generating significant revenue for Starbucks, which is highly predictable, and a relationship with that customer base is extremely loyal.\n\nThe other thing that's different from the years past and which gives us so much confidence is that we've always monitored whether or not our customer base was getting younger every year. We've never wanted to see our customer base get generationally older. We wanted to see it get younger. Not only has it gotten younger, but that young customer, that Gen Z customer, tends to have significantly more discretionary money at their disposal.\n\nAnd their loyalty to Starbucks has been quite significant and predictable. Then you have the pricing power of Starbucks, which we're certainly not going to try and raise prices during this time. But certainly, we've demonstrated, over the last 12 months or so, that we've got almost 6% price increases and we haven't seen the loyalty and the transactions abate. I think customization, which we spoke a lot about in our prepared remarks, is obviously giving us -- and the ticket is becoming more accretive as a result of the modifiers, and those modifiers seem to be more consistent and greater with cold beverages, which is now over 75% of the U.S.\n\nbusiness. And then I think we look at the promotional plan that we have for the balance of the year and we look back on our history in terms of the beverages that have succeeded, we look back on the short-term history in terms of what beverages have really been home runs, and I can honestly say we sat through a beverage lineup of innovation a few weeks back and we really had to cull the amount of beverages because we knew we couldn't handle it because there were just too many that we felt so good about. The last thing I'd say, and this is not as quantitative as I would like but it's real, is that during the pandemic and certainly in the last year, Starbucks has picked up consistently -- consistent market share, both in our category and our ability to intercept traffic as a result of the strategic nature of our real estate multiple formats, and we certainly can't avoid this conversation and not talk about the overwhelming success in revenue and how accretive drive-throughs have been. And so net-net, we're highly concerned and humbled by the environment.\n\nThere isn't a day that goes by in which the lens of every decision we're making is not made -- is made through the concern of what's happening in America and around the world. But we feel that we've got the resources and the know-how, the history and the innovation to produce the kind of numbers that we feel very confident about. Thank you.\n\nOperator\n\nYour next question comes from Sara Senatore with Bank of America.\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thank you so much. I have a question and then a follow-up, please. So the question is really about, you just mentioned the premiumization and customization and how that seems to be more common with cold beverages.\n\nI guess that feels like it's been a tailwind for a little while now. How much further can you push this, if you will? So cold accounts for 76% in total. How much higher can that be? And as you think about customization, you could share sort of what percentage of orders are customized or something that could give us a sense of how far along you might be in that penetration throughout.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nSure. Yeah. I'll start -- sure, go ahead.\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nI'm sorry. And just a question about China. I just wanted to clarify, as you talk about the restrictions, it's really about mobility, not about challenges in opening new stores. Thanks.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nYeah. In terms of China, that's 100% correct. There's no issue with regard to opening stores. In fact, we're opening stores at record numbers.\n\nAnd Belinda is on the phone, and if you have a follow-up question about China, she certainly can answer it. In terms of your question about the -- our ability to extend cold and modifiers, a few things. One, cold has certainly surprised us all at Starbucks. But our ability to customize beverages is a significant competitive advantage.\n\nThere is no other coffee company anywhere in the world that has our ability to respond instantaneously to a customer's request about customization, nor there isn't a coffee company that has our ability behind the counter in terms of flavors, syrups, modifiers, foam, etc., to provide the customer what they want. I think cold is in its early stages in terms of what's coming. And the innovation we have around cold through the year will continue to drive awareness and I think, attachment. However, no one should kind of walk away and think about the fact that our coffee -- our hot coffee business is not growing.\n\nIn fact, it's growing nicely, but cold has kind of taken over. But we have significant innovation plans for hot. So I think the percentage of revenue cold versus hot, I think you'll see hot go up as a result of the innovation we have around the hot platform. And I'll give it to Brady, just to follow up on your question as well.\n\nBrady Brewer -- Chief Marketing Officer\n\nYeah. I think the -- as Howard said, hot coffee is growing, but cold beverage, over the last few years, has just accelerated, and that added an entire stack of sales volume into the stores. What we're seeing, and Sara mentioned, is that the cold-customized plant-based beverage platform is particularly appealing. The younger you go, the colder the beverage.\n\nWe've seen significant year-over-year growth in Iced Espresso, which is our biggest product category. We're continuing to now see growth in hot espresso. Refreshers, Nitro, Cold Brew are all growing significantly. But as Howard said, modifiers have grown in double digits year over year.\n\nNow over 60% of our beverages are customized. And why is that important? It's important because what our customers have discovered is that their favorite beverage is not possible to buy anywhere else. I think that links to the earlier question about navigating rough times too, is this is a beverage you can only get at Starbucks and you can't make it home. And increasingly, customization has enabled that in our stores.\n\nSo we're just getting started. Lots of growth opportunity ahead.\n\nOperator\n\nThank you. Your next question comes from Lauren Silberman with Credit Suisse.\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nThank you for the question. I wanted to ask about China. Can you talk about your composition of locations in China across Tier 1, Tier 2 and lower-tier cities and just in terms of unit growth, where you're growing across those tiers? And then any color you can provide on trends you're seeing in Tier 1 versus other cities would be helpful. Thank you.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nSure. Belinda Wong, who runs Starbucks China, is on the phone from China, and I think obviously the best person to answer the question. So Belinda, please?\n\nBelinda Wong -- Chief Executive Officer, Starbucks China\n\nThank you, Howard. Thank you for the question. Starbucks continues to lead the market in brand share and preference, fueled by our premium positioning, a competitive advantage founded on the exceptional coffee experience delivered by our partners and the deep connections cultivated with our customers. We're very delighted to see the robust growth of the -- of China's coffee market in recent years with the entry of new brands and players.\n\nDifferent brands offer different value propositions, targeting different segments and locations, but together, we'll accelerate coffee culture and overall category adoption. In terms of our new store development strategy, as I have shared during Investor Day, we will build -- we will follow our purpose-built store strategy. And we will go deeper into optimizing our store portfolio, increasing the density in key trade areas in our top 20 cities, in the existing cities that we're in. And we'll also go wider into entering -- continue entering into new cities that we're not in yet.\n\nThere are plenty of opportunities to grow in those two areas. And thirdly, we will go smarter. We have a very strong store development system that's built by our incredible team in the local market. Powered by data, we have more accurate data to understand where we should be opening the format and the size, and not just the third place experience, but we're able to accurately project where is best placed in terms of our new stores to fulfill omnichannel customer needs in all the cities, be it new or existing cities that we operate in.\n\nAnd lastly, we're going to go greener. As I've shared before during Investor Day, we're going to open 2,500 greener stores by 2025 as part of the portfolio. So we're very confident in the way we're going to grow our new stores and comprehending the increase in the China market. Thank you.\n\nOperator\n\nThank you. Your next question comes from John Ivankoe with J.P. Morgan.\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nThank you. For several calls now, we've been talking about the record number of discrete customers that Starbucks has. And obviously, that's very admirable to be able to talk about that, just having the breadth of the customer base. And I would like to put that in context, 55% on MSR.\n\nPresumably, that's a customer that you could get to come to your brand a lot, in other words, to actually have increased frequency relative to the brand of the past. So can you talk about the frequency opportunity that you have, I mean, I guess, in two parts? I mean, one, you're kind of bringing back that 2019 customer to come back as often today as they used to three years ago, kind of the first part of the question. And then, secondly, what are the frequency-driving opportunities that you have for some of the new customers? I mean talk about that as both part of the MSR program, as well as other initiatives that you may have.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nBrady?\n\nBrady Brewer -- Chief Marketing Officer\n\nSure. Thank you, John. While transactions are still lower than FY '19 or pre-COVID levels, what we are seeing is transactions continue to grow. And what is -- a part of this is that products sold, as measured by units per store per day, have been consistently higher than FY '19.\n\nSo what we're seeing is more group orders. Starbucks Rewards frequency is a function both of our SR members visiting frequently, but we're also adding so many new members. And what we're doing is acquiring customers who are lower frequency and bringing them into the program, which helps increase their frequency. The SR program tends to see a very significant increase in frequency in the first year of membership.\n\nAnd so SR is a strong driver of that for us.\n\nOperator\n\nThank you. Your next question comes from Jon Tower with Citi.\n\nJon Tower -- Citi -- Analyst\n\nGreat. I just want to follow up on the China recovery. And curious to understand what's embedded in your expectations for the year for the China outlook. Specifically, it sounds like, obviously, you're betting in your guidance the idea that there's a reopening in the back half of the year.\n\nSo what's the risk to the numbers, particularly the comp and the earnings recovery in the back half of this year should COVID -- zero-COVID policy stay in place?\n\nHoward Schultz -- Interim Chief Executive Officer\n\nRachel, do you want to start that? And if Belinda wants to add anything. Rachel?\n\nRachel Ruggeri -- Executive Vice President and Chief Financial Officer\n\nYeah. Thank you for the question. The way we've considered the recovery in China is really, as we said in the beginning, based on mobility. And so when we talk about an outsized performance in the back half of the year, it's as we lap the severity of the lockdowns.\n\nSo even though there may still be challenges, if you recall, we have, toward the end of Q2, started to see the severity of the lockdowns with a negative 23% comp in that quarter, followed by a negative 44% comp in the following quarter. So we're basing our expectations of recovery based on the laps and the increased mobility. Certainly, there's -- as we've indicated today, it's nonlinear, but that's how our actual assumptions for recovery are based, which is part of our guidance.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nBelinda, do you have any -- sorry. Go ahead, Belinda.\n\nBelinda Wong -- Chief Executive Officer, Starbucks China\n\nYeah, yeah. Let me just add to the fact that how pleased we are to see a solid sequential improvement in Q4 in terms of our revenue and comp sales growth. It's humbling to see what a strong positive correlation we're seeing between easing restrictions and our business recovery. I mean the incredible sequential improvement on our 90-day active members enthusiastically coming back to our stores as soon as the mobility restrictions eases, it really gives us a lot of confidence on our ability to rebound as soon as the mobility restrictions are lifted.\n\nSo I just wanted to add that. Thank you.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nBelinda, can you just add one more thing, if you don't mind, the -- what you've been -- what you and the team have been able to do given the restrictions on digital and delivery, please?\n\nBelinda Wong -- Chief Executive Officer, Starbucks China\n\nYeah. Despite the short-term COVID disruptions, as we shared at Investor Day, we remain laser-focused on executing our China growth agenda with great discipline and confidence, right? As you heard, we achieved record high-quality new store growth. And now, we have 6,021 new stores across 230 cities, and those new stores continue to achieve best-in-class returns and profitability. We also focused on our fast-growing omnichannel business, and that continued to gain great momentum.\n\nAs Howard shared, Starbucks Delivers, sales grew 35% year on year to a record 24% of our sales mix. That's pretty incredible. And total mobile ordering sales mix now reached 44%. That's something we're very pleased to see, and it's going to be here to stay as we unfold more occasions from our customers.\n\nCustomers' engagement, as I said before, Rewards active members coming back, we're very pleased to see that. And that's really close to our historic high as well. And we are achieving the highest customer connection score. Our partners are really on the ground, serving our customers.\n\nWe're learning every day as to how to operate our stores better. We're increasing our muscle and our operational capability. We're getting smarter in our supply chain and our store development. So I'm very pleased to see.\n\nAnd also, one more thing. In terms of our partner engagement, we have achieved record-low full-time retail partner turnover in FY '22. That really demonstrates the partner investments that we have made over the past years are really paying off. So we're very humbled and -- but well-positioned and excited to capture the future growth opportunities.\n\nThank you.\n\nOperator\n\nYour next question comes from John Glass with Morgan Stanley.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThanks very much. On the reinvention plan, inside of '23, can you help us prioritize what you think drive sales the most? You talked about retention improving. You've talked about some equipment upgrades. If there's a way to sort of rank order what you think sort of benefits the business, or if there's a cadence, should we think about certain of these initiatives benefiting one part of the year versus the other? And inside of that, can you just talk about speed of service and where you are, where you want to be? It would seem to me, just based on personal experience, that that's still an issue and maybe a gating factor to unlocking greater traffic growth over the next couple of quarters.\n\nThanks.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nFrank, can you take the reinvention question, please, and then Sara could talk about speed of service?\n\nFrank Britt -- Executive Vice President, Chief Strategy and Transformation Officer\n\nSure. The partner experience as the core of the operating model of Starbucks is designed to drive retention, improve connection scores, both to the partner and customer. And the secondary effect, to answer your question about top line growth, is it creates more capacity that allows us to capture that incremental demand that sometimes is challenged in the current operating environment. And so the core of the reinvention agenda, of course, is the combining of innovation around store, customer and partner.\n\nBut at the end of the day, it's designed to give us the capacity to engage the customers how they want to be engaged, in service of supporting their needs and ultimately, the performance.\n\nSara Trilling -- Executive Vice President and President of Starbucks North America\n\nThank you. Thank you, Frank. Thank you, John. I just want to start out with just an acknowledgment.\n\nWe certainly don't have a demand issue in our stores. As we've talked about, we've got total weekly active customers that continue to grow. We're benefiting from incredibly high average weekly sales. And so your call-out about the opportunities, with speed, with service, is top of mind with all of us.\n\nI mean notably, over the last quarter, we did see some improvement during peak in our drive-through business in those window times, which is a metric that we continually keep an eye on and really orient our focus in our retail stores, with leaders observing and coaching during that daypart specifically. All I can say is that I acknowledge the opportunity ahead. And what we hope to see with the reduction in turnover, the increase with more tenured partners and overall stability in our stores, that you'll continue to see improvement with speed, with service, whether that's in those peak hours in cafe and drive-through or over the full dayparts.\n\nOperator\n\nThank you. Your next question comes from David Tarantino with Baird.\n\nDavid Tarantino -- Robert W. Baird -- Analyst\n\nHi. Good afternoon. Howard, I think you mentioned that you're willing to support some of the license partners outside the U.S., if I heard that correctly. And I just wanted to see if you could elaborate on what you mean by that statement and whether you're seeing pockets of issues outside the U.S.\n\nwith all the pressures in the macro environment. Any elaboration on that would be helpful. Thanks.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nSure. I'll start and respond, and then I'll give it to Michael Conway, who runs International. I think Starbucks has some very unique long-term relationships that go back, in some cases, in terms of the Middle East, Mexico and Latin South America, Korea, some of these relationships go back 25, 30 years. And there's others.\n\nAnd so there is a tremendous level of loyalty, friendship that we have well beyond the business relationship. So we're in constant contact side-by-side with our partners to ensure the fact that they know that if something did come up, we would be a backstop and be there for them. That has not, in any way, been the case, and they have not indicated anything. But we certainly want to be the kind of partner that we can look back on with great pride that we were there for them.\n\nI'll give it to Michael Conway, who is working side-by-side with them every day.\n\nMichael Conway -- Group President, Starbucks International\n\nThank you, Howard. That's right. We're keeping a close eye on the headwinds that we know are here, both from foreign exchange perspective and inflation perspective. But what I can say is that, so far, we're not seeing any negative impacts.\n\nOur business outside of China internationally grew over 30%. We're having double-digit comps in all of our company-operated markets and across all the regions. And so we're staying very close to them. But at the same time, we feel confident that between the strength of our brand, the convenience that we're bringing, the fact that, certainly over this last quarter, we saw travel start to pick up, it was a strong summer and mobility is continuing to open up, we see a lot of tailwind in our business.\n\nAnd we'll stay close to our business partners should they see challenges.\n\nOperator\n\nYour next question comes from Nicole Miller with Piper Sandler.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nGood afternoon, and thank you for taking the question. I wanted to ask about the -- you gave some commentary earlier about the employees. And it sounds like they would have been surveyed in terms of working conditions and benefits. And clearly, you've done the same for consumers.\n\nSo the two part question, number one, thinking about how you talk to survey the employees and customers, has the process changed for either? And then the second part, part B, where do they overlap? Where is the intersection really of shared ideas between the employees and the customer relationship? Thank you very much.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nWhy don't Frank and Sara take a shot at that? Thank you for the question, Nicole.\n\nFrank Britt -- Executive Vice President, Chief Strategy and Transformation Officer\n\nYeah. So thank you. So we have a very advanced, what we call, listening capability, where we are constantly sensing how our partners are doing, those who proudly wear the Green Aprons in the store. There is a process that happens on a sort of short-term basis, just to sort of monitor.\n\nAnd then we have a more comprehensive process which we do quarterly. We then deconstruct that. We do a tremendous amount of correlation analysis using some very advanced capabilities we have in the analytics and data science arena. And we try to be very precise about the things we're responding to base on the first principle that we've espoused now for quite a while, which is this idea that we should be creating the new Starbucks with partners and for partners.\n\nAnd so I think we have come a long way in that arena. And yet, as we often say, we're pleased but not satisfied. As it relates to the connection to the customer side, which I'll let Sara further elaborate on, we know, as we've talked about before, there is a direct correlation between partner engagement, which is the sum total of the surveying you've mentioned, and customer engagement. And we know that correlation is real, and it's amplified and you can see it every day in action.\n\nAnd so we try to spend a lot of time understanding that connection between the two. In the context of the brand, which Brady speaks to quite a bit, we know that care is the number one factor in the brand equity equation of Starbucks. And we know the partner is the epicenter of that care. And so that is the fabric that binds the lens of brand experience as measured by the customer and realized experience as measured by the partner in the store.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nThanks, Frank. And Sara?\n\nSara Trilling -- Executive Vice President and President of Starbucks North America\n\nThank you, Howard. I would just kind of pull up and offer kind of a broad range perspective, going back to the reinvention overall. And that is that the investments that we're making are directly designed to make it easier for our partners to do their job and to enable them to meet the growing demand in our stores and create new ways with that additional capacity to engage with our customers. We do track partner engagement on a regular basis.\n\nAnd we also mapped that engagement to the activity that we're launching in our stores, so that we can understand the connections, if there are pain points or if there are opportunities, and continue to check and adjust and to design around those learnings looking forward. The other thing I think we're quite excited about is launching some new listening mechanisms related to partner engagement. Our partner app is an example of that, which we're currently piloting and testing. And as we look to the future, we acknowledge that it is an era of co-creation.\n\nAnd those who are closest to the frontline, serving our customers, have a deep and rich understanding of what's needed, and we need to enable them to be able to serve.\n\nOperator\n\nThank you. The last question comes from Danilo Gargiulo with Bernstein. You may ask your question.\n\nDanilo Gargiulo -- Bernstein -- Analyst\n\nThank you. And first of all, Howard, thank you very much for the kind words on Italy and its coffee culture. I wanted to ask a question on the differences that you're seeing in terms of customer behavior or demographic about incremental unique customers that you're seeing across your stores. And in particular, what is attracting them to the brand compared to your existing base?\n\nHoward Schultz -- Interim Chief Executive Officer\n\nBrady?\n\nBrady Brewer -- Chief Marketing Officer\n\nYeah, can I ask a clarifying question? Was that about Italy specifically?\n\nDanilo Gargiulo -- Bernstein -- Analyst\n\nNo. That was about the Starbucks system as a whole, so the 9% -- 7% to 9% unique customers that you've seen this quarter.\n\nBrady Brewer -- Chief Marketing Officer\n\nOh, great. Yeah, I think the relevance of the brand, really, I think as Sara outlined a bit, is not only are we seeing in the U.S., for example, a larger population of seven-day active customers than we've seen ever before. When we get deeper into that, what we see is that our customer base is becoming younger. In the U.S., 51% of our customer base is now Gen Z and Millennial.\n\nAnd in fact now, our customer base is quite diverse. And I think around the world, we continue to attract both young customers and diverse customers. And when you go into our stores, you see that the relevance of Starbucks is not the coffee your parents drink, but the coffee that young people are choosing every single day. Our brand position right now, we have the strongest brand affinity of any away-from-home coffee brand around the world, and it's seen as the first choice for coffee away from home.\n\nSo the younger you go, the stronger the brand affinity gets. And the more diverse you go, the stronger the brand affinity gets. And so for all of those reasons, we continue to cater to a very diverse and increasingly young customer base with those cold-customized plant-based beverages and the strategy is working, and we'll continue to do so. Thank you.\n\nHoward Schultz -- Interim Chief Executive Officer\n\nOn behalf of all of us at Starbucks, I wish you and your families a wonderful Thanksgiving vacation, and we look forward to speaking with you at the end of Q1. Have a great holiday season. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTiffany Willis -- Vice President, Investor Relations\n\nHoward Schultz -- Interim Chief Executive Officer\n\nFrank Britt -- Executive Vice President, Chief Strategy and Transformation Officer\n\nSara Trilling -- Executive Vice President and President of Starbucks North America\n\nRachel Ruggeri -- Executive Vice President and Chief Financial Officer\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nBrady Brewer -- Chief Marketing Officer\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nBelinda Wong -- Chief Executive Officer, Starbucks China\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nJon Tower -- Citi -- Analyst\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nDavid Tarantino -- Robert W. Baird -- Analyst\n\nMichael Conway -- Group President, Starbucks International\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nDanilo Gargiulo -- Bernstein -- Analyst\n\nMore SBUX analysis\n\nAll earnings call transcripts"
}