{
  "companyName": "Jumia Technologies AG-ADR",
  "companyTicker": "JMIA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/jumia-technologies-ag-adr-jmia-q2-2022-earnings-ca/",
  "content": "Jumia Technologies AG-ADR (JMIA -3.89%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen. Thank you for standing by. Welcome to Jumia's results conference call for the second quarter of 2022. [Operator instructions] At this time, all participants are in listen-only mode.\n\nAfter management's prepared remarks, there will be a question-and-answer session. I would now like to turn the call over to Safae Damir, head of investor relations for Jumia. Please go ahead.\n\nSafae Damir -- Head of Investor Relations\n\nThank you. Good morning, everyone. Thank you for joining us today for our second quarter 2022 earnings call. With us today are Sacha Poignonnec and Jeremy Hodara, co-founders and co-CEOs of Jumia, and Antoine Maillet-Mezeray, CFO.\n\nThis call is also being webcast on the IR section of our corporate website. We will start by covering the safe harbor. We would like to remind you that our discussions today will include forward-looking statements. Actual results may differ materially from those indicated in the forward-looking statements.\n\nMoreover, these forward-looking statements may speak only to our expectations as of today. We undertake no obligation to publicly update or revise these statements. For a discussion of some of the risk factors that could cause actual results to differ from the forward-looking statements expressed today, please see the risk factors section of our annual report on Form 20-F as published on April 29, 2022, as well as our other submissions with the SEC. In addition, on this call, we will refer to certain financial measures not reported in accordance with IFRS.\n\nYou can find reconciliations of these non-IFRS financial measures to the corresponding IFRS financial measures in our earnings press release, which is available on our investor relations website. With that, I'll hand over to Sacha.\n\nSacha Poignonnec -- Co-Founder and Co-Chief Executive Officer\n\nThank you very much, Safae. Welcome, everyone, and thanks for joining us today. I would like to share a few highlights of our Q2 performance and give you an update on our strategy and guidance. We are committed to taking the business to breakeven and in that regard, have delivered a strong quarter with very good progress on each building block of our path to profitability.\n\nNumber one, usage growth. As you know, scale is a driver of profitability. Orders and quarterly active consumers were up 35% and 25%. GMV grew by 21% in Q2, 34% on a constant currency basis.\n\nThis happened in a volatile macro context with increasing pressure on consumer spend and access to supply for our sellers. It also happened with very strong discipline on marketing investments from our side. For us, it's a clear sign that our focus on relevant everyday products, competitive prices and consumer experience is paying off. Number two, monetization acceleration.\n\nRevenue was up 42% and 56% on a constant currency basis. We posted the fastest marketplace revenue and gross profit growth rates of the past five quarters at 17% and 14%, respectively. We want larger scale to be a catalyst for revenue growth and the diversified monetization engine we have built allows us to drive revenue from both consumer usage and the assets of our platform. Number three, cost efficiency.\n\nCost discipline is a top priority for us even more so in the current context. We drove usage growth and monetization acceleration with lower-than-expected marketing investments. Sales and advertising expense reached USD 41 million in H1 compared to our guidance of USD 50 million to USD 55 million. G&A was another area of increased efficiency for us with G&A, excluding share-based compensation expense being flat year over year, and declining sequentially by 12%.\n\nSo overall, some very good progress in Q2. The macro picture is challenging. However, the fundamentals of our business have never been stronger. If we now look ahead, I'm turning to page four.\n\nOur strategic focus is to make strong progress on profitability. We have outlined here our near-term guidance, which reflects this continued focus. On usage, despite the macro, we aim to maintain robust usage growth, and we reiterate our guidance of GMV growth in excess of 15% for the full year in USD terms. On monetization, we plan to accelerate.\n\nWe expect gross profit in H2 of USD 75 million to USD 85 million. This implies year-on-year growth of 27%, up to 44%, which is at least double the growth rate of Q2, so a significant acceleration. On the cost efficiency front, we are doubling down on the cost discipline. In particular, we expect to drive further marketing efficiencies, leveraging the long-term investments we made over the past year in brand awareness and consideration.\n\nFor H2, we expect sales and advertising of USD 35 million to USD 45 million, implying year-over-year savings of 18% up to 37%. So in summary, we're going to keep growing usage. We're going to accelerate gross profit growth and do this with even more cost efficiency. As a result, and I'm now turning to page five.\n\nWe believe that we have turned the corner and are past the peak of adjusted EBITDA losses that was reached in Q4 of last year in 2021. For H2, we expect losses of USD 87 million to USD 107 million, which implies a reduction versus H1 of 5% to 22% and versus last year, a reduction of 12%, up to 29%. Finally, we reiterate our yearly guidance for 2022 of USD 200 million to USD 220 million, and we expect adjusted EBITDA loss to start decreasing on a yearly basis starting next year. The results of our clear strategy and consistent execution are coming nicely together, allowing us to reduce adjusted EBITDA losses going forward.\n\nAnd now Jeremy and Antoine will give more color on the results.\n\nJeremy Hodara -- Co-Founder and Co-Chief Executive Officer\n\nThanks a lot, Sacha. Hello, everyone. I'll start with the progress on the first building block of our past profitability, the usage growth, and we are on page seven. Usage growth is the result of coordinated efforts across all the areas of the business, and we've been working relentlessly across the platform to earn and to keep the trust and the loyalty of our customers.\n\nWe have outlined on the page recent examples of what we are doing on the marketing, commercial logistics and tech fronts to support the usage growth. On the marketing front, we are investing in both consumer adoption and retention, and we are seeing a very strong level of engagement on our platform. During the Jumia anniversary campaign, our video content views reached a record of 116 million, up 55% year over year. This demonstrates our thorough understanding of what resonates with customers and our ability to produce engaging content for them.\n\nOn the commercial front, we offer consumers a wide range of relevant products and services with a particular focus on everyday categories. This is even more important in a challenging macro context where consumers can rotate away from higher-value discretionary items toward staples and everyday products. While we are seeing sustained volume growth across categories, FMCG was the fastest-growing category in terms of items sold in Q2, up 95%. On the logistics side, we remain focused on improving the speed and the cost of our deliveries, offering our consumers even more convenience.\n\nIn Q2, 60% of shipped packages reached consumers within 24 hours of placing the order. This is a great achievement considering the volume step-up we experienced as part of the Jumia anniversary campaign. And last but not least, we are reaping the benefits of our sustained technology investments over the past year to enhance user interface and experience. This supported a 17% uplift in conversion rate year over year in the second quarter.\n\nOur consistent and disciplined execution on these four levers is driving the robust usage growth momentum you are seeing on page eight. On page eight, there is broad-based growth momentum across all reported usage metrics. Quarterly active consumers reached 3.4 million, up 25% as we continue to acquire new consumers and improve the retention rate of existing ones. Orders reached USD 10.3 million, up 35% driven by both new consumer adds and the increased purchase frequency of returning consumers.\n\nThese developments drove robust GMV growth despite material FX headwinds. GMV reached USD 271 million, up 21% year over year and 34% on a constant currency basis. And you will note that the FX headwinds to GMV are much larger in Q2 than in Q1 last quarter with 13 points of percentage adverse impact to GMV growth compared to 8 percentage points last quarter. We had 10 of our 11 local currencies depreciating against the dollar in the first half of 2022 compared to the first half of 2021.\n\nIn particular, the Egyptian pound, the West African CFA franc, both depreciated by 10% against the dollar, while the naira in Nigeria depreciated by 7%. Notwithstanding the effect growth momentum in the business remain robust. We are driving not only robust but also high-quality growth with significant improvement in cohorts and repurchase dynamics, as you can see on the page nine. You've heard us talk in the past about the discipline with which we deploy consumer incentives and marketing investments with a focus on cohort quality.\n\nYou've also heard us talk about the importance of everyday product to support repurchase dynamics. This is now clearly demonstrated by the retention and purchase frequency data that you see on the page. The average 90-day repurchase rate of the new consumers acquired in Q1 2022 reached 44%, up by over five points versus Q1 last year. This is driving an uplift in purchase frequency with a number of quarterly orders per quarterly active consumers, increasing by 8% year over year, reaching over three orders in Q2.\n\nThe strategic focus we placed on everyday product categories was an important driver of these improvements. On page 10, you can see the continued shift of our GMV toward everyday categories, which went from accounting for 57% of our GMV in Q2 2020 to 66% in Q2 2022. Within the brackets of every categories, the lifestyle services, which include food delivery and JumiaPay app service so their share in GMV doubled from 9% in Q2 2020 to 18% in Q2 2022. Within the everyday physical good categories, the home and fashion categories remain consistently the largest two product categories, each commanding a mid to high-teens share of GMV.\n\nAverage order value stood at USD 26.3 in Q2 as we further penetrate more affordable, smaller ticket size categories. Let's now move on to JumiaPay starting with the TPV on page 12. Jumia's TPV increased by 31% year over year and 45% on a constant currency basis, supported by the robust GMV growth. On-platform penetration of JumiaPay as a percentage of GMV reached 27% in Q2, up from 25% in Q2 last year as we focused on increasing the penetration of JumiaPay in a disciplined and gradual manner.\n\nTurning to transactions on Page 13. JumiaPay transactions reached 3.4 million in Q2 this year, up 25% year over year, supported by accelerating volume growth across the business and in the food delivery category in particular. Overall, 33% of orders placed on the Jumia platform in Q2 2022 were completed using JumiaPay compared to 35% last year. The growth in JumiaPay transactions in our e-commerce and food delivery platform outpaced the growth of JumiaPay app transactions as JumiaPay penetration is almost 100% on the JumiaPay app, the reduced share of JumiaPay app in the transaction mix led to a decline in the overall JumiaPay transaction penetration as a percentage of orders.\n\nOverall, the growth momentum of JumiaPay on platform remains very robust. JumiaPay has been a tremendous driver of convenience and security for our consumers, while opening up a broad range of relevant digital services. Starting from 2023, we expect JumiaPay to turn into a monetization driver as we offer this solution to third-party merchants of platform. And now I'll hand over to Antoine, who will walk you through our financial performance in more details.\n\nAntoine Maillet-Mezeray -- Chief Financial Officer\n\nThank you, Jeremy. Hello, everyone. I will start with the monetization performance, which speaks to our progress on the second building block of our path to profitability, monetization acceleration. Let's first unpack revenue growth dynamics on Page 15.\n\nRevenue reached USD 57.3 million in Q2 '22, up 42% year over year and 56% on a constant currency basis. The largest contributor to revenue growth was first-party revenue, which increased by over 90% year on year, supported by the strong momentum in the FMCG and grocery set category in particular. The second observation I'd like to make here is that the new revenue streams such as value-added services and marketing and advertising are starting to have a material contribution to revenue growth. The combined contribution of value-added services and marketing and advertising to revenue growth surpassed the combined contributions of commissions and fulfillment revenue.\n\nThe growth across a broad range of revenue streams is allowing us to continue making growth investments in the form of consumer incentives, which were up by USD 3.6 million year on year in the second quarter. Let's now dive deeper into the marketplace revenue trajectory on Page 16. Marketplace revenue posted its fastest growth rate of the past seven quarters, up 17% year on year and 28% on a constant currency basis with a number of revenue streams reaching record levels. I'd like to reiterate the point I made on the prior slide, which is the diversification of revenue streams.\n\nHere, you see clearly the growing contribution to marketplace revenue from marketing and advertising and value-added services, which reached an all-time high in Q2 at 41% of Marketplace revenue compared to 33% a year ago. And this is the result of the very strong growth rates we've been driving across these two activities. Marketing and advertising revenue reached an all-time high of USD 4.6 million surpassing the previous record rate in Q4 '21, up 76% year on year, the fastest growth rate in over two years. This was supported by an acceleration in a number of campaign run, which was up by over 140% in Q2 '22 versus Q2 '21.\n\nValue-added services accelerated by 32%, partly as the result of increased logistics revenue from local and international sellers. On the flip side, fulfillment revenue reached USD 7.7 million down 7% year on year due to a broader deployment of the next day free delivery. This is a trend we are comfortable with as one, free next-day delivery in relevant areas is an important driver of convenience, supporting consumer adoption and repurchase. And we have built a strong and diversified monetization engine that makes us less reliant on consumer shipping fees.\n\nLast but not least, commissions revenue reached a six quarter at USD 10.6 million, surpassing the prior peak of Q4 '21. This corresponds to a 13% year-on-year increase, supported by the robust GMV growth. This is net of consumer incentives. If we exclude the impact of consumer incentives, commissions revenue was up 21% year on year.\n\nI'd like to point out here that the increase in commission revenue is yet to fully reflect the impact of commission increases, which were undertaken in May and June '22. We expect the impact of these increases to materialize in the second half of 2022. The strong marketplace revenue growth is driving an acceleration in gross profit growth. Gross profit growth reached a five-quarter high at 14% year on year, supported by the robust growth in Marketplace revenue.\n\nOn a constant currency basis, gross profit growth reached 24% year on year. We continue to invest into price competitiveness and free shipping with an increase in consumer incentive from USD 4.5 million in Q2 '21 to USD 8.2 million in Q2 '22. Excluding the impact of consumer incentives, gross profit accelerated by 23% year on year and 36% in constant currency, while the margin as a percentage of GMV increased to 14.2%. While we have meaningfully accelerated monetization growth in Q2, we are working on a number of initiatives that will allow us to drive even faster growth in the second half of '22.\n\nWe have outlined some of these initiatives on page 18. We are working across all revenue streams to drive either faster growth, enhanced margins are a combination of both. With respect to first-party activity, first-party revenue grew at an average north of 100% year on year over the past three quarters, thanks to strong volume growth in the FMCG and grocery category. This is allowing us to negotiate volume rebates with our suppliers, helping us expand our first-party gross profit margin.\n\nWithin marketplace revenue, we are working on a number of levels to further accelerate growth and expand margins. On the commissions front, as mentioned earlier, we implemented commission increases in May and June '22, leveraging the robust volume growth experienced over the past year. We expect the full impact of these increases to reflect into the gross profit in the second half of '22. The value-added services revenue also has meaningful growth potential.\n\nThe deployment of next day free delivery and Jumia Express items for consumers is allowing us to better monetize the Jumia Express service that we provide to sellers, i.e., the sellers payers for the service. The revenue associated with Jumia Express is booked under value-added services. Last but not least, we remain in very early days of marketing and advertising monetization on our platform. For advertisers looking to reach African consumers online with the purchase intent and drive measurable results, Jumia is the advertising platform of choice.\n\nWe are leveraging this unique positioning to drive increased take-up of our ad solutions by our sellers and third-party advertisers. In addition, we are currently in the process of monetizing the assets of our platform, selectively allowing third-party participants to make use of them, starting with our logistics platform. 18 months into the launch of our Logistics-as-a-Service offering, we are now generating over USD 1 million in quarterly revenue from this activity. Our offering solved the material pain point for companies across a broad range of industries.\n\nWe intend to leverage our position to further optimize our pricing and expand both revenue and margin from this activity. While we expect these various initiatives to drive sustained growth over many years to come, they will positively impact gross profit as early as the second half of '22. We expect gross profit of USD 75 million to USD 85 million in the second half of '22, implying year-on-year growth of 27% to 44%, and a sequential increase of 29% to 46%. I would like to point out here that our near-term guidance does not reflect any material contribution from off-platform payment processing activities of JumiaPay, which are in the very old days of the development.\n\nWe intend to drive off-platform rollout in a very disciplined and gradual manner, and hence, we do not expect any relevant revenue contribution before '23. Let's now move on to costs, starting with fulfillment expense on page 20. Fulfillment expense reached USD 27.8 million, up 46% year on year and up 62% on a constant currency basis. This trajectory is driven by robust volume growth and high inflationary pressures.\n\nWith respect to volume growth drivers, fulfillment expense includes both the costs associated with our e-commerce orders and Logistics-as-a-Service packages. The former reached USD 10.3 million, up 35% year on year, while the latter more than doubled year on year to USD 2.6 million. With respect to input cost inflation. As you know, fuel costs increased significantly over the past few months.\n\nThe cost of packaging also went up, and there is obviously wage inflation. In this context, we are working on a number of initiatives to mitigate the impact of inflation, ranging from scale efficiencies to drive trade and shipping cost savings to productivity enhancement in our warehouses to reduce ending -- end packaging costs. Moving on to sales and advertising expense on page 21. After a period of marketing investment ramp-up that started in June '21, we are now stabilizing the level of investment.\n\nSales and advertising reached USD 22.2 million in Q2 '22, and the year on year growth rate decreased from 115% in Q2 '21 to 30% in Q2 '22. You will note here that the effect impact is more moderated on sales and advertising expense compared to other lines of our P&L with only 6% points. That's because a large part of our sales and advertising expenses denominated in USD corresponding to online marketing costs, including search and social media cost. Our H1 '22 sales and advertising expense came in lower than expected at USD 41 million compared to our guidance of USD 50 million to USD 55 million.\n\nResilient usage growth allowed us to remain very disciplined and stand lower than expected in marketing. Building on that, we intend to drive more marketing efficiencies in the second half of '22. We expect sales and advertising of USD 35 million to USD 45 million in H2 '22, implying a year-on-year decline of 18% to 37%. Moving on to technology and G&A cost on Page 22.\n\nTechnology continues to be an important area of investment for us to support the long-term growth of our business both on the e-commerce and payment front. Technology expense reached USD 14.3 million in Q2 '22, up 70% year on year and 80% on a constant currency basis. This is largely a result of headcount increases completed in the second half of '21. On a sequential basis, the technology expense increase was much more moderate than 10% quarter-on-quarter.\n\nG&A, excluding share-based compensation, reached USD 26.6 million in Q2 '22, flat year on year, and up 11% on constant-currency basis. On a sequential basis, G&A, excluding share-based compensation, was down 12%, mostly as the result of local tax efficiencies. We remain very disciplined when it comes to G&A overhead cost in particular. We are currently on a hiring phase, which is driving headcount decreases since we are not replacing leaders.\n\nThis will allow us to keep G&A cost base relatively stable going forward. I want to make an important distinction here. The height of the pandemic, i.e., '20 and '21 was not a period of capacity expansion and G&A cost of rent for us, quite the opposite. G&A, excluding share-based compensation, was USD 120 million in '19, and we bought it down by 11% to USD 107 million in 2020 and kept it stable in 21 at USD 108 million.\n\nWe have already done a fair amount of work to rightsize our G&A cost base, but we will continue further optimizing our organizational structure and cost base. Turning to adjusted EBITDA loss on page 23. Adjusted EBITDA loss reached USD 57.2 million in Q2 '22, demonstrating that we are past the peak of adjusted EBITDA losses that was reached in Q4 '21. Adjusted EBITDA loss in Q2 '22 was up 37% year on year, and 49% on a constant currency basis.\n\nThis is a clear deceleration compared to Q1 '22, where adjusted EBITDA loss was up 70% year on year. For the second half of '22, we intend to start reducing adjusted EBITDA loss on a year-on-year basis. We expect H2 '22 adjusted EBITDA loss of USD 87.4 billion to USD 107.4 million. This implies a year-on-year reduction of 12% to 29% year on year.\n\nLet's now move on to balance sheet and cash flow items on page 24. Capex in Q1 '22 was USD 3.7 million mostly relating to technology equipment purchases. We are reducing our full year '22 capex guidance from USD 15 million to USD 25 million to USD 10 million to USD 15 million as we are slowing down the phasing of logistics capacity expansion. Net change in working capital had a neutral impact quarter as an increase in trade payables related to the Jumia anniversary campaign was offset by increases in trade receivable and inventory.\n\nCash utilization for the quarter was USD 63.7 million with the main difference versus adjusted EBITDA losses relating to capex and cash adjustment from provisions. At the end of March 22, we had a liquidity position of USD 351 million comprised of USD 54 million of cash and cash equivalents and USD 297 million of short-term deposits and other financial assets. With that, I'll hand over to Sacha for concluding remarks.\n\nSacha Poignonnec -- Co-Founder and Co-Chief Executive Officer\n\nThank you, Jeremy. Thank you, Antoine. I think we have clearly made very good progress over the first half of this year, delivering very strongly on each building block of our path to profitability. We have very strong momentum to double down on those profitability efforts.\n\nGMV growth in H1 was the highest in the past two years. Last year, in the same Q2 earnings call, we promised to the market that we will accelerate usage growth, and that's exactly what we did. Looking ahead, we intend to maintain growth, and we have reiterated our guidance. In Q2, marketplace revenue growth was the highest of the past seven quarters.\n\nGross profit growth was the highest of the past five quarters. And in H2 of this year, we intend to double if not triple the growth rate of gross profit to reach 27% to 44%. Importantly, we expect to drive the growth of the usage and the acceleration of the monetization with strong cost discipline, in particular, for H2, higher marketing efficiency. You've already seen the pace of our sales and advertising investments slowed down sequentially in the first half of this year.\n\nFor the second half, we intend to reduce sales and advertising by 18% to 37%. We are also working, of course, on initiatives to drive efficiencies across the full cost structure. On fulfillment, we are focused on generating scale efficiencies and productivity enhancements to mitigate the impact of inflation. We also remain very disciplined on the G&A front.\n\nYou have seen our G&A expense, excluding share-based compensation come down over the past two quarters, and we intend to maintain the discipline. As a result, we expect adjusted EBITDA loss year over year starting to reduce in the second half of this year. And beyond that, we expect the loss to decline on a yearly basis starting next year. We are very much aware of the increased market focus on profitability.\n\nOur strategy and business execution are very much aligned with that. I think our performance and the guidance we have provided speak clearly to that. Importantly, there is no disconnect here between the near-term profitability objectives and the long-term attractiveness and strength of our platform as we pursue our scale and profitability objectives, we are building an even more attractive and relevant platform for our consumers, as well as win-win partnerships with our sellers and broader ecosystem participants. Thank you for your attention, and we are now ready to take your questions.\n\nOperator\n\n[Operator instructions] Our first question is coming from Aaron Kessler with Raymond James. Please go ahead.\n\nAaron Kessler -- Raymond James -- Analyst\n\nGreat. Thank you. A couple of questions. First, maybe just if you can talk about kind of the plan to further drive the kind of gross profit less incentive growth over the next several quarters and maybe specific to incentives kind of how should we think about payments going forward as well? Second, increase on the marketing revenues, I think as you highlighted, if you have any more color around that, should we think about this increase is pretty sustainable going forward as well, kind of change on marketing revenue? And maybe third, just commission increase, can you just quantify kind of how much that is as a percentage?\n\nSacha Poignonnec -- Co-Founder and Co-Chief Executive Officer\n\nI think maybe it was me that you were breaking a little bit, so I'll try to answer, but if I'm off topic, please let me know, right? The first question is on the gross profit and the incentive part, right?\n\nAaron Kessler -- Raymond James -- Analyst\n\nYes, gross profit less fulfillment and your plans to expand that? And second part of that question is announced.\n\nSacha Poignonnec -- Co-Founder and Co-Chief Executive Officer\n\nSo the first one is on the gross profit, Aaron? Or on the gross profit and particularly do you want to hear about the incentives?\n\nAaron Kessler -- Raymond James -- Analyst\n\nYes, gross profit minus fulfillment kind of plans to expand that amount over time?\n\nSacha Poignonnec -- Co-Founder and Co-Chief Executive Officer\n\nYes. Yes. So look, I think on this one, I think we give a bit less guidance than on the gross profit because there is a lot of unknowns on the fulfillment efficiencies and the inflation that is underlying, right? So that's why we give guidance on the gross profit for H2. And it's a bit harder for us to give a guidance on the gross profit after fulfillment because this -- the fulfillment right now is a lot impacted by inflation.\n\nOf course, as we said, we have a lot of initiatives to drive efficiencies and savings on fulfillment, but it's harder, I would say, to predict definitely in order to drive the EBITDA reduction or the loss reduction that we aim for H2, we want to expand the gross profit after fulfillment, right? And that's our objective. And we have not given a precise guidance over that because of the nature of fulfillment efficiencies at the moment. But definitely, we want to drive that forward. Now, advertising revenues as we said and we are still, we believe, in the early days, to some extent of this revenue stream and we have a very big addition for those in the long term.\n\nWe think that we have a very unique value proposition for both the big brands and the big sellers. We have also a lot of smaller sellers who are using our solutions of sponsored ads and sponsored products. And then, we have also a lot of third-party advertisers who will come to Jumia in order to reach consumers. And this revenue stream being in the early days and also being, to some extent, dependent on our campaigns.\n\nI think you see that over time, there's been some volatility. So there's going to be some fluctuation of growth over time, but we believe that overall, it's one of the revenue streams, which is in the midterm going to grow very well and very fast, right? So there will be fluctuation. As you know, you've seen the last -- if you look at the few quarters in 2021, of course, Q4 was much bigger because of Black Friday, right? And so here, we'll see in Q3, Q4. But generally speaking, this is one that we intend to grow fast, and we believe we're still in the early days of this one.\n\nAnd then, commission increases, we are very careful about that. So we have passed on increases, and we're going to keep doing that. At the same time, we want to do that in a very thoughtful way because as the marketplace, of course, the commission level is very important for the sellers. And we want to do that in a thoughtful way, and I would say, almost in partnerships with sellers, right? So we're going to, I think, continue to see some commission growth driven by the volume growth and the commission increase that we are passing but we want to do that in a thoughtful way.\n\nAaron Kessler -- Raymond James -- Analyst\n\nGot it. Great. Well, thank you.\n\nSacha Poignonnec -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Aaron.\n\nOperator\n\nOur next question is coming from Lamont Williams with Stifel. Please go ahead.\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nHi. Thanks for taking my question. The first question I have is on what are you seeing in your consumer base as a result of the macro, are you seeing trade down for your orders, anything you can point to there? And what is your guidance contemplating from a macro standpoint going for the back half of the year and into '23?\n\nSacha Poignonnec -- Co-Founder and Co-Chief Executive Officer\n\nLook, I think -- it's a big question. I wish I would know what's going to happen, right? I think -- what we're seeing in terms of consumer, and I would say I'm going to speak on the sellers because both are impacted by the macro, right? So, of course, the consumers are impacted by the inflation across the board and in particular, commodity and food prices. The consumer sentiment is under pressure and the spending is under pressure. On the seller side, the sellers are also under pressure because of weaker local currencies, right? And a lot of the sellers depend on access to hard currencies in order to trade, in order to import, in order to operate.\n\nAnd so, we see also some sellers struggling with access to supply and ability to import products or to even just go into production, right? So we see that at the time I mean, I don't want to make it sound like nothing is happening, but challenging macro for us is nothing new. It's something that we have been exposed pretty much from day one, and we are used to navigating periods of high volatility, hyperinflation. And in the past, we have sometimes fared better than other channels in period of hyperinflation or increased consumer price sensitivity because at the end of the day, we have a lot of competitive advantages to appeal to the consumers. We have price transparency.\n\nWe have a very healthy marketplace flywheel, where the consumers can benefit from multiple sellers competing together. We have the ability to offer also the 1P where we can decide to price ourselves and intervene, if you will, on the market. And we have access also to cross-border channels. We have a very attractive base of sellers in China that we can work with when we see gaps of supply and gaps in certain categories.\n\nSo I think what we are seeing now and what we've seen in Q2 and what we're seeing and what we're saying for H2 is that we're going to keep growing. And we're going to keep growing while accelerating monetization and savings and marketing. So I think we are quite confident. We are quite confident that despite the macro people can trade down, so as long as they need to buy products, they will come to Jumia and they will look for options, and we will be well positioned.\n\nSo I think the guidance we give on keeping growing in the context of macro challenges and savings and investments of marketing, combined with monetization, I think it's a very strong sign of confidence.\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nOur next question is coming from Catherine O'Neill with Citi. Please go ahead.\n\nCatherine O'Neill -- Citi -- Analyst\n\nGreat. Thank you. My first question is on the JumiaPay monetization potential. Could you provide a bit more detail on how you're thinking about the monetization plan and the timing of launches of different products and services and how meaningful that could be for 2023? Secondly, on sort of advertising and marketing spend and incentives.\n\nI guess you're fairly comfortable that when you cut sales and marketing spend as you plan to year on year that that won't detrimentally impact the growth? And on the other side, how should we think about the incentives going into the second half? And then finally on capex. I know you've taken down your capex guidance for this year. Is that sort of a permanent reduction or are you pushing some of that capex spend out into 2023?\n\nSacha Poignonnec -- Co-Founder and Co-Chief Executive Officer\n\nJumiaPay monetization for us is a very big strategic priority that we are -- as you mentioned, undertaking at the moment, right? So in the past couple of quarters, we obtained our licenses to offer merchant payment processing services in Nigeria and Egypt, which is great because those are two largest markets, right? And we have been, over the last few months preparing the launch and starting to pilot it, right? So we are actually lives in Egypt with a number of pilot merchants, and we are about to go live in Nigeria with some pilot merchants. And we were operating JumiaPay only for our platform. And so, we are undertaking a number of changes and adaptations in order to operate for third-party merchants and creating features and product specificities, which work for that. And it's a bit too soon for us to give guidance in terms of how much revenue we expect, etc., in 2023.\n\nBut it's already live. It's something that -- the first step for us was to obtain the license, which is a very big achievement. The second step was to adapt the product and start piloting it, which is ongoing. And the third step will be to sell it, right? So I think probably in the coming maybe one or two quarters, we'll be able to give an update on the pilot, and then probably more precise guidance.\n\nBut again, we don't expect revenues yet this year. Probably next year. How much? Is a bit too soon to tell. We are also, of course, looking at more countries to be in a position to offer those services in the other countries.\n\nAnd I think we are very uniquely positioned to offer payment processing services because JumiaPay has been processing the payments for Jumia after all. And we believe we're one of the biggest merchants online. And so, we believe that JumiaPay is very, very attractive and providing a very good service for merchants. And we know it because it's providing the service to Jumia.\n\nSo we look forward to updating you on this as soon as we can. In terms of consumer incentives and sales and advertising. You are right that we want to drive that very meaningfully and very carefully or very thoughtfully, I should say. And we certainly want to continue to invest and to continue to support the consumer adoption and the consumer loyalty, and we want to continue to see some growth of the usage.\n\nAnd so, I think here, those levels of sale advertising and consumer incentives, they are, to some extent, discretionary, right? So we decide what we think is the right amount to invest based on what we think is the best return that we can get and the best output that we can get in terms of consumer uptake and so on. And I think we feel good with this level for H2. We change and we can change those on a dynamic basis. I think you see the strength of the brand.\n\nYou see the strength of the cohorts that we have disclosed and brought you some numbers during this quarter. You see the strength of the value proposition in terms of assortment and delivery. So we believe that the amount for H2 are appropriate and will lead to continued growth and in a good and healthy way. We are able to accelerate or to decelerate if we see that we can or we need to.\n\nSo now we believe that this is the right amount. And then, in terms of capex, I think, to some extent, those capex -- I mean, all of those capex are in local currency, right? So I think here, some of that the reduced guidance -- some of the reduced guidance is due to the fact that in dollar terms, we can invest less and we get the same in local terms. I think it's more something that it's not a permanent reduction. You have seen, we are generally asset light, and we are generally low capex.\n\nAnd so, I think it's not a permanent reduction. It's something that we assess all the time. And those capex are mainly about fulfillment centers, equipment and certain new locations that we decide to upgrade for our sellers to do drop off and so on and so forth. And so, we are generally very flexible with that.\n\nAnd we can reassess capex almost as we need. And we believe that certainly, we want to stay asset-light in the future and keep that flexibility.\n\nCatherine O'Neill -- Citi -- Analyst\n\nGreat. Thank you.\n\nOperator\n\n[Operator instructions] So, Sacha, there are no further questions in queue. So do you have any closing comments you'd like to finish with?\n\nSacha Poignonnec -- Co-Founder and Co-Chief Executive Officer\n\nWell, thank you very much for joining as always, and we are available if there are any follow-ups, and we look forward to a great second half of the year. Thank you very much, everyone. Take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSafae Damir -- Head of Investor Relations\n\nSacha Poignonnec -- Co-Founder and Co-Chief Executive Officer\n\nJeremy Hodara -- Co-Founder and Co-Chief Executive Officer\n\nAntoine Maillet-Mezeray -- Chief Financial Officer\n\nAaron Kessler -- Raymond James -- Analyst\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nCatherine O'Neill -- Citi -- Analyst\n\nMore JMIA analysis\n\nAll earnings call transcripts"
}