{
  "companyName": "SSR Mining Inc.",
  "companyTicker": "SSRM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/ssr-mining-inc-ssrm-q3-2022-earnings-call-transcri/",
  "content": "SSR Mining Inc. (SSRM -0.32%)\nQ3 2022 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to SSR Mining's third quarter 2022 results conference call. As a reminder, all participants are in listen-only, and the conference is being recorded.\n\n[Operator instructions] I would now like to turn the conference over to Alex Hunchak from SSR Mining. Please go ahead.\n\nAlex Hunchak -- Director, Corporate Development and Investor Relations\n\nThank you, operator, and hello, everyone. Thank you for joining SSR Mining's third quarter 2022 conference call, during which we'll provide an update on our business and a review of our financial performance. Our third quarter 2022 consolidated financial statements have been presented in accordance with U.S. GAAP.\n\nThese financial statements have been filed on EDGAR, SEDAR, the ASX and are also available on our website. To accompany our call, there is an online webcast, and you will find the information to access the webcast in our news release relating to this call. Please note that all figures discussed during the call are in U.S. dollars, unless otherwise indicated.\n\nToday's discussion will include forward-looking statements, so please read the disclosures in the relevant documents. Joining us on the call today are Rod Antal, president and CEO; Alison White, CFO; and Stew Beckman, COO. Now, I will turn the call over to Rod for his opening remarks.\n\nRod Antal -- President and Chief Executive Officer\n\nRight. Thanks, Alex, and hello to you all, and thanks for joining us. In the third quarter, our business was clearly impacted by the suspension of the Copler mine. I'm pleased to report that operations restarted at the end of September and ramped up smoothly.\n\nDespite the bump in the road to Copler, our business remains in an incredibly strong position with a robust balance sheet that has enabled us a capital return yield of more than 5% over two consecutive years. Looking forward, we're in excellent shape with all four of our assets poised for a strong Quarter 4 where we expect to return to significant free cash flow generation. Some key points from the quarter. Reflecting on the negligible contribution from Copler and the delayed ounces from Marigold, we produced 107,000 gold equivalent ounces.\n\nYear-to-date production is now 441,000 gold equivalent ounces. Our third quarter all-in sustaining costs were $1,901 per gold equivalent ounce after absorbing more than $30 million in cash costs incurred at Copler during the quarter. Year to date, our all-in sustaining cost is $1,331 per dollar equivalent ounce. I'm gonna speak a little bit more about guidance later on in the presentation.\n\nFinancially, our balance sheet and free cash flow outlook supported the repurchase of $100 million in shares under our NCIB year to date. Our aggressive execution on the NCIB, which is only announced in June, has the company on track for nearly $160 million in capital returns in 2022, a plus-5% capital return yield. On the growth front, we received the EA for the first stage of the Cakmaktepe's Extension project at Copler in the quarter. With the infrastructure construction underway, it keeps us on track for first production in 2023.\n\nAs a reminder, the project will add more than 1.2 million ounces to the Copler life of mine plan for an incremental capex of around $70 million. The results from the C2 PFS are expected next year in an updated technical report for Copler, and we are planning to publish a new technical report for Marigold that will incorporate exploration success and potential production growth. In the close of the year, we are planning to release exploration updates for Marigold, Seabee and Copper Hill. This is in addition to the positive drill results we just released for the Cakmaktepe's Extension.\n\nLastly, we continue to execute on our strategy of redeploying proceeds from non-core asset sales in our core jurisdictions with the announcement of the Kartaltepe transaction in October. So just moving on to the next slide on ESG. And I want to highlight our core values in the relation to some of the initiatives that we have. In 2022, we have continued to deliver against the goals outlined in our annual sustainability report.\n\nAnd as an example, we continue to roll out our integrated management systems where full implementation is expected by year-end. Furthermore, we are progressing the development of a water stewardship strategy, as we seek to continually reduce our environmental footprint going forward. There'll be more to come in our update early next year. On Slide No.\n\n5. As we advance into '23, it's worth highlighting our long-term stable platform of 700,000 ounces of annual gold production. With all operations returning to steady state in the fourth quarter, we remain confident in our ability to maintain and grow on this production baseline through 2030 and possibly beyond. The solid foundation, coupled with the abundant growth targets being progressed across the portfolio, means that this production growth is just the baseline for us to continue to build on.\n\nOn the Slide 6. As a company, we've established a proven history of discipline and accretive M&A as well as project development. This includes the sale of Pitarrilla, which closed in the third quarter and was another piece in our non-core asset sales that have generated $245 million in sale value since early 2021, more than two times the street consensus subscribed to those assets. As I noted, we have successfully redeployed those proceeds into our core jurisdictions.\n\nFirst, with the Tiger acquisition, expanding our Seabee land package earlier this year and most recently with the Kartaltepe transaction that expands our ownership of the entire Copler District to 80%. This more recent transaction provides material operational, financial, and exploration synergies, including the elimination of further -- sorry, future ore purchases, payments to account for the previously existing ownership differential. Copler is our cornerstone asset, and we are pleased to increase our exposure to the district's longer-term growth and excellent exploration potential. Given our strong track records of operations and project execution, as well as our robust balance sheet, we continue to thoughtfully evaluate strategic opportunities across the sector, but we remain disciplined in our approach.\n\nOn to Slide 7. Over the last two years, we have returned our strong free cash flow generation, which is reflected in our capital return programs. To that effect, so far this year, we returned $144 million to shareholders through the base dividend and share buyback program. And more impressive since the beginning of 2021, we have returned more than 90% of our free cash flow generation to shareholders, which is delivering on one of the key promises post the merger.\n\nI want to move on to Slide 8 to discuss the quarter. A few points that are relevant to consider at the end of the third quarter. Copler restarted, as I mentioned, at the end of the quarter, and ramp-up of the sulfide plant has gone extremely well, which was a significant achievement for our team. The year-to-date production of 441,000 ounces and all-in sustaining cost of $1,331, reflects the suspension of Copler and the delays of recovering gold at Marigold.\n\nTheir operations back to fee state, we expect to return to strong free cash flow in Quarter 4 and beyond. We're definitely excited by the stable of low capital intensity growth opportunities and continue to advance each one of these where a number of updates are expected before year-end. Moving on to Slide 9. I just want to make a few comments on guidance.\n\nWe are on track for a strong quarter 4, but have been unable to claw back the lost production and are now revising our full year production guidance to 620,000 to 655,000 ounces. This reflects the slower-than-expected leaching of the stacked high-grade ounces at Marigold, which Stew will elaborate on further, as well as the shutdown of Copler. At Puna, they have done a great job in meeting the original guidance, but unfavorable metal prices have impacted the gold-to-silver ratio, meaning less GEOs on a conversion as compared to our original guidance. And finally, CB remains on track for the previously announced improved production guidance that was announced last quarter, which is a great result for that team.\n\nOur all-in sustaining cost guidance has increased to $1,315 to $1,345 per gold equivalent ounce to reflect this due production guidance. This implies a Quarter 4 production of around 200,000 ounces, and thus far, in Quarter 4, we are on track to meet that target. As I mentioned, we have a number of exploration updates due before year-end. And moving into next year, we plan on releasing the PFS for C2 and a new technical report for Marigold.\n\nInternally, we're encouraged about the future for each one of the assets and the exploration results this year continues to support this view. So with that, I'm going to now turn the call over to Alison who will then discuss our financial performance, starting on Slide No. 10.\n\nAlison White -- Chief Financial Officer\n\nThank you, Rod, and good afternoon or good day to everyone on the call. This quarter, we produced nearly 107,000 gold equivalent ounces, bringing year-to-date production to 444,000 gold equivalent ounces. Gold equivalent sales of 97,000 ounces in the quarter drove revenue of $167 million. Attributable net loss for the quarter was $26 million, or a $0.12 loss per diluted share, and adjusted attributable net loss was negative $14 million, or a $0.07 loss per diluted share.\n\nIt is worth highlighting that attributable and adjusted attributable losses include more than $40 million in care and maintenance costs incurred at Copler during the suspension of operations that occurred for almost the entire quarter. On the right side of the slide, I will touch on the reported $0.07 loss per diluted share that is calculated based on the company's definition of adjusted attributable net income or loss per share. Attributable net loss of $0.12 per share was adjusted for transaction costs associated with the sale of Pitarrilla, tax adjustments and minor adjustments for foreign exchange fluctuations during the quarter. Turning to Slide 11, we we can talk about SSR's financial position.\n\nAt the end of the quarter, the company maintained a cash and cash equivalent balance of nearly $800 million with net cash of more than $450 million. The strong cash balance reflects $100 million in share repurchases, $44 million in dividend payments to shareholders, $53 million in debt repayment, and $35 million in dividends to joint venture partners, thus far, during 2022. With our existing net cash position and the expectation of a strong fourth quarter of free cash flow, I would like to reiterate our three priorities with respect to capital allocation within the business. First and foremost, we will continue to reinvest in growth within the business, including our exceptionally high return C2 and Cakmaktepe Extension project, which will account for approximately $300 million in total growth capital through 2025.\n\nSecond, we are committed to maintaining a robust balance sheet. The weather volatility in the commodity price environment and to ensure all of our capital commitments, debt servicing requirements and base dividend payments are fully funded even in the event of a potential downturn in the gold price cycle. Our base dividend at $0.07 a share can also weather gold price downturns as it is payable to a gold reserve price of $1,350 per ounce. We expect the $88 million remaining on the term loan to be repaid in full by the end of 2023.\n\nOverall, we have generated $371 million in free cash flow or $300 per gold equivalent ounce produced since the start of 2021. Finally, we remain committed to capital returns to our shareholders as the third pillar of our allocation program. This year, we have repurchased $100 million in shares year to date. Coupled with our 40% dividend increase that was announced earlier this year, we have returned nearly $150 million to shareholders, marking our second consecutive year with a capital return yield above 5%.\n\nSince the start of 2021, we have returned approximately $335 million to shareholders and produced 1.2 million ounces during the same period, returning $270 to shareholders per gold equivalent ounce produced in that period of time. Considered in aggregate, we have a clear capital allocation framework in place that we routinely execute on, and we will continue to be disciplined in our approach to capital returns well into the future. And with that, I'll turn it over to Stew for an operational update.\n\nStew Beckman -- Chief Operating Officer\n\nThank you, Alison. As always, I'll start with EHS&S. We were pleased to restart operations at Copler at the end of the quarter following the completion of improvement initiatives required by the Turkish authorities. The suspension was disappointing but did allow us to raise a number of our processes and systems to improve our performance.\n\nThe smooth start-up of operations is a testament to the work by the team. Positively and separately, we received a number of outstanding permits in Turkey during the quarter. We will continue to work hard to maintain and build upon these relationships, ensuring positive contributions to our stakeholders and host communities. Safety and the care of our teams, communities, and the environment are core values, and we believe are also foundational to the business performance.\n\nMoving on to Slide 13, and I'll talk about Copler. At Copler, the operation ramped up smoothly in the third quarter, an impressive accomplishment by our team, given the length of the suspension. As discussed on the Q2 call, we were able to accelerate maintenance on the Autoclave 1 during the suspension, including the completion of partial relining of the face bricks. As a result, there is no scheduled major planned maintenance in the sulfide plant for the remainder of the year, allowing us to operate the order close without major interruptions throughout fourth quarter.\n\nOperating time and production was very limited in the third quarter, so per ounce costs are not really meaningful. For the full year, we expect to produce 180,000 to 190,000 ounces at an all-in sustaining cost of $1,345 to $1,375 per ounce. The reduced production guidance reflects our careful and measured reset of the operations, as well as later-than-expected access to oxide ounces. With respect to the growth initiatives, we've received the EA for the first phase of the operation of Cakmaktepe Extension, and construction on infrastructure is well underway, and we remain on track to deliver first production in 2023.\n\nWe are also progressing the C2 project through PFS and expect to release the results of this more optimized project to the market next year. We're excited about the potential of both these high-return, low-capital-intensity growth projects. The previously discussed Cakmaktepe transaction will also provide -- also help us to drive long-term cost and operational synergies, while allowing the exploration team to sync their teeth into a number of highly potential exploration targets across the district without the extra complexity of mixed ownership proportions. For example, our Cakmaktepe Extension, half of the holes drilled in the October exploration release were on Cakmaktepe ground, growing the deposit across the lease boundary and further reinforcing our rationale for the transaction.\n\nMoving on to Slide 14, and we'll update on Marigold. Marigold, again delivered quarter-on-quarter improvement, though production timing continues to be impacted by the stacking of finer material from the North pits. Production of 52,000 ounces at an all-in sustaining cost of $1,444 per ounce was behind expectations, but we are starting to see a positive trend with respect to leaching in the fourth quarter. A couple of the drivers for the slower-than-previously predicted leach rate were, and we ended up with more tonnes of fine material presenting in the North pit than schedule.\n\nThis is a good thing. And it was coincidental with less durable material coming from the Mackay pit and drove the proportional fines in the heap leach up. Also, on advice from some subject matter experts, based on experience at other sites, we've started slowing the application of the leach solution when leaching is first started, with an aim to improve overall performance of the heap leach. As a result, reflecting on the year-to-date leach cycle delays due to the stacking of final war as well as the lingering challenges with shovel availability, we now expect full year production of 195 to 205 ounces at an all-in sustaining cost of $1,410 to $1,440 per ounce.\n\nThe very poor performance of the Komatsu PC7000 shovels has been compensated for by delayed retirement of older dig units, and we expect to stack at about the budgeted ounces by the end of the year. Stacking of higher-grade material continued in the quarter with more than 135,000 ounces -- recoverable ounces stacked at a grade of 0.63 grams per tonne, which is very high for Marigold over the second and third quarters. In addition, October was a monster month with 48,000 recoverable ounces stacked to the pad in just one month. As a result, we are forecasting a strong production in late Q4, which will carry into the first half of 2023.\n\nJust as a comment, another comment, we have had a number of internal and external reviews of the heap leach performance across the year and are confident that the gold will be recovered, and that it is just timing. Permitting continued to advance at Valmy, and the EA is expected of the expanded Valmy pit remains on track for 2024. We have an exploration release coming in the next few weeks, which aims to bring more mineralization and ultimately reserve within the Valmy EA areas. We will build as much of this as possible into the updated Marigold technical report that we expect to release to the market in 2023.\n\nMove on to Slide 15, please. Seabee Q3 was generally in line with plan. Following the record first half production, the mine continued to improve its underlying performance, but grades were lower. As a result of Q3, we expect to hit the lower end of our previously upgraded full year production of 150,000 to 160,000 ounces, an extremely impressive outcome for the operation.\n\nAll-in sustaining cost of $715 to $745 an ounce is also in line with prior expectations. We are slightly ahead of schedule to mine a reserve area of very high grade later in Q4. Also, we are advancing exploration of the extension of that very high-grade zone that delivered the out-of-reserve spectacular first half production. This zone pinched out just below the last stope, but appears to open back up a couple of levels down, and we expect that we'll be able to mine this area in 2023.\n\nWe just need to do a bit more drilling and prove up the zone before we can commit it to the mine plan. The plant has been operating at record throughputs, and we have a good-sized run-of-mine stockpile in front of it. Just as a reminder that the Seabee plant typically has capacity beyond that of the mine, and so usually operates with little to no ROM stockpile. There are many highly prospective targets of the future development of Seabee.\n\nWe have continued to advance drilling and modeling at the Porky West target, which is potentially open pit option for Seabee. If successful, Porky, along with extensions to the resource now being exploited, could potentially provide an exciting pathway to reframe Seabee. Most importantly, we continue to push hard on extending our understanding of the resources and reserves around the current mining areas such as the testing of the very high-grade area that I mentioned earlier. Supporting the longer-term vision for Seabee, we are also judiciously exploring the many targets within the very large end Seabee and recently acquired Tiger tenement, aiming to bring more into our medium- and long-term resource pipeline.\n\nMove on to Slide 16, and I'll briefly discuss Puna. Puna has continued its steady production and remains well on track for guidance of $825 -- 8.75 million ounces of silver at an improved all-in sustaining cost guidance of $15 to $15.50 an ounce. Q4 has been another strong quarter so far for the asset, and we are really pleased with the team and their success in Argentina despite a number of local headwinds. Let's jump to Slide 17 to highlight some of the exploration initiatives that we progressed through the quarter.\n\nWe progressed exploration programs across the business in the third quarter and are preparing to release results from these efforts in the coming months. As you saw, resource development and extension drilling yielded a number of exotic results at Cakmaktepe Extension as we hire additional growth of the ore body to complement the production profile already outlined in the last technical report back in Q1. Also, in Turkey, we have been having some great success drilling at the Copper Hill target, which is our copper prospect, surprisingly, in the Black Sea region. An update on that project is expected by the end of the year.\n\nI've already discussed Seabee exploration. In Nevada, exploration progress both near-mine and regionally drilling at continues at Trent Canyon and Buffalo Valley and near-pit drilling at new Millennium is showing encouraging results. We have six rigs on site and are undertaking geophysical studies to grow our understanding of the opportunities. An update of these exploration wins is expected imminently, and some proportion of the new Millennium drilling should be included on the next update of reserves and resources.\n\nLastly, at Puna, we kicked off drilling for the first time since 2018. We're currently focusing on in-fit and near-mine targets, and the team are really energized by some of the intercepts and grades that we've seen so far. The aim is, obviously, to grow the mine reserve and extend the current known life of the Chinchillas mine in Puna. And currently, we are exploring the distal and regional targets that show promise, delivering a much longer life at Puna.\n\nDrilling of some of the more regional targets around Chinchillas and Pirquitas will begin in the coming months. So in summary, we plan to release exploration updates for Copper Hill, Seabee and Marigold in the next few months with the release of Puna next year. These exploration programs all aim to deliver a high return build-out of our medium- and longer-term production profiles. Before I hand it over to Q&A, a goodbye.\n\nIt's been very gratifying being part of the team building up and transforming Alacer and then subsequently SSR. I'll leave the business in great hands with a fantastic management team, bolstered by my role being split into EVP growth role, which John Ebbett is leading and the new EVP operations in ESG role. We have a fantastic business with huge potential. Both John and the new EVP ops are very accomplished and capable, and I'm sure that they'll leverage off our successes so far and lead the business to bigger and brighter achievements in the future.\n\nThank you very much. Back to you, Rod.\n\nRod Antal -- President and Chief Executive Officer\n\nRight. Thanks, Stew, and thanks, Alison. I also just want to take the opportunity to recognize the significant contribution Stew has made to the business as he leaves all four operations in excellent shape and poised for a strong fourth quarter and beyond. We all wish him nothing but success for the future and note that his replacement will be announced very shortly.\n\nOur business is in a very strong position, and we are moving forward at full stride into the last quarter. With all assets back to steady state, we expect to return to strong free cash flow. We have a number of potentially positive catalysts ahead. We look forward to sharing these updates in a steady flow of news releases over the coming months and presenting a much stronger results when we speak again early next year.\n\nSo with that, I'm now going to turn the call over to the operator for questions. Thank you very much.\n\nOperator\n\nThank you, Mr. Antal. [Operator instructions] Our first question is from Ovais Habib with Scotiabank. Please go ahead.\n\nOvais Habib -- Scotiabank -- Analyst\n\nThanks, operator. Hi, Rod and SSR team. Just a couple of questions for me. So at Marigold, Stew touched on the fines that's at Marigold.\n\nI believe these are toward the North pit. Question is, do you have enough met tests completed around and in the North pit to be comfortable going forward in dealing with the fines? And also, is the high grade mostly located around the North pit as well?\n\nRod Antal -- President and Chief Executive Officer\n\nYes. So the -- so yes, to all of your questions. So yes, the higher grade came out of the North pit. We have done the test work.\n\nAnd as I said in my talk, we've had a number of different people review those. And we don't believe that we have any problem with the heap leach. And based on their experience from other sites, we expect that we'll eventually see this -- the gold. And as you can see, we've stacked quite a lot of gold.\n\nWe did stack it quite late as well. So we're expecting this wave of gold to come out over this quarter and into the next quarter. We have practically finished mining the fine material as well.\n\nOvais Habib -- Scotiabank -- Analyst\n\nAnd that's -- the mining of the fine material was ended in Q4. So was that in Q4 or that's --\n\nRod Antal -- President and Chief Executive Officer\n\nIt's ending imminently. We're almost at the end.\n\nOvais Habib -- Scotiabank -- Analyst\n\nGot it. And do you have other high-grade areas within these pits that you're going to be targeting going into 2023?\n\nRod Antal -- President and Chief Executive Officer\n\nNot in the North pit. We finished those pits. They were only of the small pits. It's as per the mine schedule at best.\n\nOvais Habib -- Scotiabank -- Analyst\n\nPerfect. OK. Thank you for that. And just at Copler, so in terms of Copler, are you now back at nameplate capacity at the sulfide plant, in terms of -- or is there a ramp-up that we should expect in Q4?\n\nRod Antal -- President and Chief Executive Officer\n\nNo. The sulfide plant came up very well and came up quite quickly. In fact, I was extremely pleased. And given my experience of starting these types of things up after a long shutdown, and I think that reflected the work that we did.\n\nI think you just need to remember, we shut everything down. So unfortunately, we had to shut down the mining of the oxide, mining works, exploration, and we even shut down the infrastructure work in the district. So as we restarted, the sulfide plant came up well and really quickly. It's very stable, and it's running very well.\n\nI wouldn't expect that. We also had to restart mine operations. So that took a bit longer because we had to rally the troops for. Obvious reasons, we didn't keep an idle very large mining workforce on-site, so we're getting them back to site and getting the mine ramp back up.\n\nIt means that took a little bit of time, and that impacted the grade that we're feeding the plant and also delayed us getting a bit of access up to Cakmaktepe to bring down some ounces there that we were planning to bring in. And we also added a back-end waiting for gold grade toward the end of the year. So that's given that we were delayed for that period, that's pushed out as well. So we are mining in the pits.\n\nWe are mining from the Cakmaktepe area and hauling that down. The other thing that we did was when we brought the sulfide plant back online, given that's where we had the issue very carefully. We first started recirculating it and stacking. And then once we were comfortable with it, we then brought the sign-on back on just to make sure that we didn't have any kind of hiccups as we were doing that.\n\nAnd as a result, that's delayed some of the leaching out of the oxide plant as well. And just to give you a bit of perspective, we still haven't seen the cyanide and gold coming out since we started the leaching there. So that leaching cycle just takes a little while to restart. So again, we're very confident that we're in a very solid position and the place is running really well.\n\nIt just takes -- it's just going to take a little bit of time for us to get the oxide ore coming out and get the grades back up and the sulfur.\n\nOvais Habib -- Scotiabank -- Analyst\n\nAnd thanks for that update as well. But on Cakmaktepe, in terms of accessing the oxide material, do we see the -- see you guys start processing that material in Q1 of next year? Or this is kind of moving toward as you wrap up going toward the second half of the year?\n\nRod Antal -- President and Chief Executive Officer\n\nI think I'll just -- I think just to remember, as I let you talk about in detail. There's two parts of Cakmaktepe. There's the old residual mine that we had up there that we produced gold from a couple of years ago that has some residual ounces that we had expected to bring into this quarter. And then, there's the new Cakmaktepe Extension.\n\nSo just not to confuse people because I think, they are two different things. And one is a new project, which is earmarked for next year. One is the residual ounces that we're -- we've gone up there to mine the last piece of this quarter.\n\nOvais Habib -- Scotiabank -- Analyst\n\nThanks for the clarify on that, Rod. So yeah, I'm talking about the new Cakmaktepe. So can you give us a little bit more color on how things are progressing there?\n\nRod Antal -- President and Chief Executive Officer\n\nYeah, so it's progressing well. We've been doing the infrastructure work, so we have to move some public roads. So we've constructed some overpasses, so that we can separate our mine fleet from the -- our haul fleet from the public roads. We've been building some separate roads.\n\nWe're in the process of doing the preliminary work for relocating. We have to remit a telecommunications power. We have to move some power lines and some water lines. And so we're busy doing that work at the moment, and that's progressing quite well.\n\nAnd our expectation has always been like in '23 for the start of it.\n\nOvais Habib -- Scotiabank -- Analyst\n\nPerfect. That's all for me, guys. Thanks for taking my questions.\n\nRod Antal -- President and Chief Executive Officer\n\nThanks, Ovais.\n\nOperator\n\n[Operator instructions] The next question is from Cosmos Chiu with CIBC. Please go ahead. Mr. Chiu, your line is open.\n\nCosmos Chiu -- CIBC -- Analyst\n\nOh, sorry, I was muted. Hi, Rod. Thanks, Alison. And all the best, Stew.\n\nMaybe my first question is on Marigold. I'm going to ask about the sustainability of the higher grade being stacked, the 0.63 gram per tonne versus your 0.48 gram per tonne reserves. But it sounds like it's positively correlated the grade with the fines in the North pit. So Stew, as you mentioned, as you come to an end in terms of mining out the North pit, should we see sort of the grade revert back to the mean fairly soon?\n\nStew Beckman -- Chief Operating Officer\n\nYeah, Cosmos, you're exactly right, we will revert to the mean. Yeah, that's why it's the mean. We will go back there. But we actually had a windfall in the oxide, so -- sorry, in those North pits, and they reconciled high.\n\nSo we ended up with more material coming out of those pits than was in the reserves, so we're pretty happy with that. But yes, those areas have finished now, and we had expected to have high grade through this period while we were treating them.\n\nCosmos Chiu -- CIBC -- Analyst\n\nGreat. And then, I might have missed it. But Stew, did you mention how much longer these fines are taking in terms of the leach cycle for the gold to come out? I know you're expecting it to come out in Q4 and to 2023. How much longer is it?\n\nStew Beckman -- Chief Operating Officer\n\nWell, I don't think we've actually quantified it in months because it's not a -- it doesn't come out necessarily in a step. So it sort of drags on with a long -- with a relatively long tail. I did also mention one of the directors we got from -- I think it came from John Mars and the experience from some of the other sites when they have the fine material was when you initially start the leaching to start at a much lower rate and saturate the pole first. So it doesn't mobilize the final material within that and then coal stratification and then sort of make it take even longer to leach out.\n\nAnd so we've got two impacts in this quarter. We've got the impact of stacking more fine material, plus we've also started the leach cycle slower. So we're putting less leach liquor on it for the first couple of weeks, and then stepping it up. So it's a bit of a -- it's a bit hard in the exact weeks.\n\nAnd as you know, it depends -- and given that we're coming toward the end of the year, we try to stack in the narrowest paths of the heap leach that we can get it out by year-end, but it's also a function of where we're on the pile of stack. So it is a pretty difficult question. We have been doing work with Forte Dynamics as well and doing quite -- which is work that's been going over the whole year to put together three-dimensional leach plants and a much higher fidelity of what was placed where exactly on the heat to get a better prediction of what is coming off it.\n\nRod Antal -- President and Chief Executive Officer\n\nYeah. And I think the other thing I'd just say, Cosmos, the work that Stew's talked about just gives us a high level of confidence moving into this sort of next phase. But having this extra stack is a great position to be in. But having back-end-loaded plans, when things like this happen, it really doesn't give you any time to recover.\n\nAnd so I think we're a little bit of a consequence of that as well. So I just wanted to alleviate anyone's fears out there that the goal is not going to come. We backed ourselves to the end of the year. We've got the gold up on the pads, the lead cycle has been solid, and we had anticipated in our models, and we don't have time to catch it is really simply what's happening.\n\nCosmos Chiu -- CIBC -- Analyst\n\nGot it. Maybe moving on to Copler here. You might have answered this question as well. But as I work through the math, it's great to hear that you did 18,000 ounces in the month of October.\n\nBut it sounds like, from my math, you still need to increase that, on average, of about 16% in November and December. Is that a function of tonnage and grade from Stew and -- both your comments, it sounds like it is both, but I just want to confirm.\n\nRod Antal -- President and Chief Executive Officer\n\nSorry, can you repeat that? We didn't quite understand the question.\n\nCosmos Chiu -- CIBC -- Analyst\n\nSo you did 18,000 ounces. I think you need -- in October, you need 60,000 ounces to hit your guidance for Copler for the year, 60,000 ounces in Q4. So if I work out the math, you need to improve by about 16% from the 18,000 ounces in October. I'm just wondering if that improvement in November and December, on average, is based on tonnage grade or both.\n\nI think, Stew -- I think you did kind of mention that it might be both, but I just want to confirm.\n\nRod Antal -- President and Chief Executive Officer\n\nJust Copler.\n\nStew Beckman -- Chief Operating Officer\n\nYeah, so Copler. So we're seeing the oxide coming down a bit later, and we're seeing the grades a bit lower as a result of the mine ramping up and some work we've had to do to try and rearrange the mine plant. It won't be tonnage that drives it. It will be timing and a bit of growth.\n\nRod Antal -- President and Chief Executive Officer\n\nYeah. And I think, Cos, you probably -- I don't know. I think you came in a little bit later, but in the discussion -- that's OK. Just, again, just to clarify.\n\nOn Stew's discussion, we talked about the -- getting the mining contractor back on site. Getting the mining going has -- was a little bit slower than we anticipated. And getting that ramp-up to access the high grade, which is we expect to sort of now start to come for the sulfides I'm talking about, we're on -- we're moving down that direction. So all things are pointing to us meeting that restated guidance.\n\nCosmos Chiu -- CIBC -- Analyst\n\nGot it. Thanks. Rod, I did come in a bit late. It took me 10 minutes to sign on.\n\nMaybe something on the financial front. Hopefully, I'm not shooting myself in the foot again. I read something in the MD&A. I don't think it's a big deal.\n\nBut you did mention that as a result of what happened to Copler, not in compliance with the term loan covenants, you don't have a lot due on that. But I just want to confirm, is that -- should we be concerned?\n\nAlison White -- Chief Financial Officer\n\nSo no, I wouldn't be concerned, Cosmos, but the fact of the matter is that's where we were at the end of the quarter. And so we felt that from a disclosure perspective, it was important to inform everybody. We have continued to make payments on the loan as they've come due even during the closure. And as I mentioned in my comments, too, and I'm sorry if you missed this as well, but we do anticipate actually being able to close out that loan by the end of next year.\n\nCosmos Chiu -- CIBC -- Analyst\n\nGreat. And then, Alison, since I have you here, the cash cost and the all-in sustaining cost in the quarter was impacted by a $31.1 million sort of cost related to the Copler suspension. I just want to make sure. Are there any costs that we should be aware of that's leading into Q4? Are these -- I would imagine these are onetime costs.\n\nI just want to make sure that none of these onetime costs leading into Q4. It doesn't sound like it since it's already restarted, but I just want to confirm.\n\nAlison White -- Chief Financial Officer\n\nSo your assumption is correct. There's -- none of those costs are going to bleed into Q4, Cosmos. Those were all onetime costs specifically related to the closure and standby-type costs for labor and other things, so that we could ramp up as quickly as possible once we got the OK to reopen.\n\nCosmos Chiu -- CIBC -- Analyst\n\nGreat. And then, maybe one last question. This might be a difficult question, but I might ask you anyways. Rod, when you restarted, when you got the permits back in September 22, restarted Copler, at that point in time, did you consider updating guidance? And if you did, what has changed between then and now?\n\nRod Antal -- President and Chief Executive Officer\n\nNo, it's a good question, Cos. Look, I think when we did the Quarter 2 results call, we said we're going to do everything we can to claw back the lost time and lost production. And we had a plan, as we always do, there's a few levers that we had in the business to help us to try to chase that as a goal. As it transpires with the -- then the clarity around the slower leaching at Marigold, the impacts of gold-to-silver ratio at Puna and then some of the other initiatives that we had around chasing those residual ounces at Cakmaktepe, we just don't have the time to be able to do it.\n\nUnfortunately, we did a lot of things to try to capture it. But chasing the high grade at Seabee that Stew mentioned, we just have been able to catch it. So no, it wasn't considered. We wanted them to see how the operations were traveling, so we could have a more accurate representation.\n\nIf we're going to recon, obviously, we want to be able to hit it. So it wasn't the appropriate timing. But look, we did everything we could. It's disappointing to us all that we couldn't capture it.\n\nIf, for instance, your Marigold hadn't underperformed in this last quarter in terms of the gold production, then we've probably been in a good position, but we're not. So that's where we are. But look, I think the business fundamentally is very strong coming out of this into the fourth quarter, which is going to be around 200,000 ounce consolidated view of the business, moving into a really good 2023 and all the good things that come with that was free cash flow and other things, we're in good shape. But we've had a bump in the road, and now we're looking forward.\n\nCosmos Chiu -- CIBC -- Analyst\n\nGreat. Thanks, Rod. And I perfectly understand. And once again, thanks for answering my questions.\n\nAnd all the best, Stew.\n\nRod Antal -- President and Chief Executive Officer\n\nThanks.\n\nStew Beckman -- Chief Operating Officer\n\nCosmos, thank you.\n\nOperator\n\nThis concludes the question-and-answer session. I'd like to turn the conference back over to Mr. Antal for any closing remarks.\n\nRod Antal -- President and Chief Executive Officer\n\nGreat. Thanks, everyone, and thanks for joining us today. And as we mentioned, we're looking forward to a much more positive full year results in early next year and closing this year off in a very strong position to set us up for what will be a great 2023. So with that, good day to you all.\n\nAnd thanks for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlex Hunchak -- Director, Corporate Development and Investor Relations\n\nRod Antal -- President and Chief Executive Officer\n\nAlison White -- Chief Financial Officer\n\nStew Beckman -- Chief Operating Officer\n\nOvais Habib -- Scotiabank -- Analyst\n\nCosmos Chiu -- CIBC -- Analyst\n\nMore SSRM analysis\n\nAll earnings call transcripts"
}