{
  "companyName": "Companhia Energetica de Minas Gerais",
  "companyTicker": "CIG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/companhia-energetica-de-minas-gerais-cig-q2-2022-e/",
  "content": "Companhia Energetica de Minas Gerais (CIG -0.23%)\nQ2 2022 Earnings Call\nAug 16, 2022, 2:00 p.m. ET\n\nOperator\n\nGood afternoon, everyone. Welcome to Cemig's second quarter 2022 earnings video conference call. We inform that this call is being recorded and will be available at the company's IR website, where you will also find the company's presentation. Should you need simultaneous interpreting, the feature is available by clicking the globe icon located on the bottom of the screen, choosing interpretation, and then the language of your choice, Portuguese or English.\n\nShould you choose to follow the call in English, you can also select mute original audio to mute Portuguese original audio. Now I would like to turn the floor to Carolina Senna, investor relations superintendent. Please, Carolina, you may proceed.\n\nCarolina Senna -- Investor Relations Superintendent\n\nGood afternoon. I'm Carolina Senna, Cemig's investor relations, superintendent. We now start Cemig's second quarter 2022 earnings call and webcast with the following executives: Dimas Costa, chief commercial officer; Eduardo Soares, chief legal and regulatory officer; Leonardo George de Magalhaes, CFO and IR officer; Marco Da Camino Ancona Lopez Soligo, chief participation officer; Thadeu Carneiro da Silva, chief generation and transmission officer. For the initial remarks, we turn the floor to our CFO and IR Officer, Leonardo George de Magalhaes.\n\nLeonardo de Magalhaes -- Chief Financial Officer\n\nGood afternoon, everyone. Thank you very much for being here with us and this conference call for the results of the second quarter of 2022. Once again, we are bringing results that we understand to be sound and consistent. On Slide 3, we have our main highlights related to the second quarter of 2022.\n\nAdjusted net profit of BRL 1.1 billion, 62% higher quarter-on-quarter comparison and also robust cash generation EBITDA close to BRL 1 billion, BRL 1.8 billion is significant variation when compared to the second quarter of 2021, 37% higher. And other highlights involve operating efficiency. We had another voluntary redundancy program with almost 300 employees enrolled and a total program cost of BRL 49 million. And this helps the company in its efficiency and it's paid off in around eight months even when we hire then the same number of employees.\n\nSo we are now bringing in employees that are starting their career that helps in the culture of the company. They're very motivated and they are also at a lower cost. And with 300 employees, we understand we will do have these positive results. And the fourth topic here, the fourth highlight in the quarter that involves the tax credits on ICMS and because of the Law 14385/22 that was approved our tariff adjustment already paid BRL 2.8 billion.\n\nAnd that is related a period that is over 10 years of tax reimbursements that is. This is a different interpretation from what the company had taken. We had understood that we should return to consumers 10 years of tax credits and over that would be already a result for the company. And because of that change, we had to make a provision in our balance sheet of BRL 1.3 billion, that's why the adjusted result is much higher than the real result in this quarter.\n\nBut other distributors also made the same provision. And we understand that that deserves the special note. With the management of this tax credit in our results, we had good arguments to advocate for our rights, even if we had to face a legal discussion on the topic and we do understand we have good arguments in our financial statements. We mentioned that we are talking to our legal aids about possible developments here.\n\nSo unfortunately, we cannot disclose much more information, but we still maintain our position. We understand that we do have good arguments to take this subject forward. And that's it in this part of the provision, we maintain our position. In terms of our rights, we believe it makes sense to discuss that in the next stages, whether in legal or administrative areas.\n\nIn terms of renewable investments, we invested BRL 137 million a year. In GT we have in our strategic planning already approved from BRL 1 billion to BRL 2 billion up to 2025, we had this investment in this quarter and we hope that very soon we can bring you good news in terms of distributed generation and centralized generation as well. On the next slide we have our investment program. We have a very bold investment program for this year, almost BRL 4 billion.\n\nAnd just in distribution alone, this is an important year for us. That's the last year before the tariff review BRL 3.2 billion in investments. We have invested in the first half of the year, basically BRL 1 billion in the distributing company far from the BRL 3 billion that we had planned for the year. But we have a special highlight here for July that is out of the investments in the semester, but we invested a lot more, almost BRL 300 million.\n\nAnd we are confident that investments in the second quarter, and we have already contracted services and materials and we believe that investments in the second half of the year will accelerate. And that's why I believe that we have a second semester with an execution performance that is much higher than what we have seen in the first half of the year. The second quarter, we were able to invest a lot more than we invested in the first quarter of 2022, but even considering the figures of July that we have just posted here, we will have a second half of the year with higher investments when compared to what we have seen in the first half of the year. And we will try to get to the 3.2 that is our original planning.\n\nAnd this is just, also for transparency and showing our commitment to the market and showing our performance. We want to bring you, this is like quarter-on-quarter to show you how the execution is going. Now, in terms of the alignment to the ESG practices of the company, it is very important related to the S from ESG. We have approved a policy here for human value, diversity and inclusion policy with the board.\n\nAnd Cemig is a company with 100% of renewable. So sustainability issues, sustainability topics, part of the company's history, we are implementing a very important program called the Minas LED. We are going to switch the public lighting of 600 municipalities to LED. We are going to have a lot of savings for the city halls and the city administrations as well.\n\nAnd we are also acquiring almost 1.6 renewable energy certificates. And we got a certification of these certificates that we issued and we are certified by important agencies. Now talking about the financial results of the company. Our trading strategy is posting excellent results.\n\nWe have a great strategy here that is a winning one. In this second quarter of 2022, we increased 18.4% the volume of energy sold to consumers to the free market. And I highlight here once again that trading now is divided between Cemig Holding and Cemig GT. And remember that the transferring of contracts from -- to Cemig Holding is going to provide better transparency for the numbers, and we will also provide us a better tax efficiency.\n\nWe also talked about the renewal of our headcount, thanks to the voluntary redundancy program and also equity income with positive results here in the second quarter of 2022. Part of that related to our investments in Santo Antonio. We were able to revert provisions in that in the second quarter. Also, PIS, COFINS tax credits had a negative effect on our results, but this is a onetime-off situation as I mentioned.\n\nAnd the volume of electricity distributed this quarter was higher in 1.34% year-on-year, a little bit lower in the captive market, but in transport, 3.7% higher. So total, again, over 1% growth in the market, also very similar to what we have seen in terms of growth in other markets in Brazil. And this quarter, we had a negative effect of the FX because of FX variation and also the marking to mark of our euro bonds and -- but there was a negative effect of BRL 294 million. If you look at it, we did have a positive effect into 2Q 2021, BRL 408 million and compared to the negative effect of BRL 249 million.\n\nThat's a negative effect for the second quarter of 2022. In the next slide here on Page 8, we have consolidated results. We can see the results that have nonrecurring events that affected the results for 2022. But there is something here that draws our attention.\n\nIt has to do with the financial write-off of reimbursements to be received. We did have that in our financial statements related to indemnities and reimbursements that we are going to receive from plants of Lot B that were auctioned in 2015. We capped them. And the most significant here is Tres Marias and we had BRL 800 million posted, and we expected to receive these amounts now by a resolution has defined the criteria that should be used for the evaluation reports.\n\nWe developed the report. We are going to send this report early in August. On the other side, even with that reduction of BRL 172 million in the results, we have BRL 650 million to receive. And I think this is more of a tangible amount now because we are closer to receiving that.\n\nWe are discussing now about this report, and we expect to receive that amount in the near future. About the consolidated result in the quarter, we see that the adjusted net profit increased 47%, and also the EBITDA increased 25%. When we analyze the second quarter of 2022, the most significant event was really the provision of the PIS and COFINS tax credits. But with EBITDA growing 37% and net profit 62% net of non-recurring events, that is the company when thinking about its current operations adjusted by those onetime-off events is still posting positive results.\n\nWe'll talk about operating costs and expenses. And I will turn the floor to Carolina, and she will move on in the presentation.\n\nCarolina Senna -- Investor Relations Superintendent\n\nOK. Now talking about consolidating operating costs and expenses. Here, we see that there was an increase of 14.3%, but we usually say that these are quality costs. We had already announced that 2022 would be an investment year.\n\nWe would invest in IT in a relevant amount. And we are already seeing results in the improvement of service and also investments and disconnections and reconnections. These are expenses that bring benefits to the company, and we are also seeing that in regards of higher collection. We also have our programs here, a voluntary redundancy program and part of that is inflation that has helped increasing the costs in 2022.\n\nNow the debt profile, the consolidated results. In 2024, you already know that we have $1 billion debt to be paid, and that debt goes up if the FX goes up. And we already included here in our schedule BRL 1 billion that was issued by Cemig D, which is due in 2027. It's important to show the progress of our ratings.\n\nFrom 2018 to 2022, we went up in the ratings agencies, and we are AA+ with Fitch and S&P, and we are AA at Moody's. So we see that we had a growth in -- an increase in our cost of debt. That's because of the Cemig rate, and it has to do with the macroeconomic scenario. But we think that 2024, this cost will come down.\n\nOn the other hand, we are at a very low level of leverage. We are at one time net debt over adjusted EBITDA. Therefore, we are in a very comfortable situation in terms of our debt or leverage. And consolidated cash flow, we started 2021 with a cash of almost BRL 3 billion.\n\nWe are ending the second quarter of 2022 with almost BRL 3.8 billion. Part of the cash came from CVA tax credits, and we paid almost BRL 1 billion in debt. And also, we paid dividends at the end of July. We raised BRL 1 billion at Cemig D.\n\nThe investments that we already talked about, we are at an accelerated pace for investments in 2022. Now talking about Cemig D. We can see that what affected strongly the results here were the tax credits already mentioned by Leonardo before. And on the other hand, we did have an additional revenue of the use of infrastructure distribution.\n\nWe know that the results were a little lower than the first quarter. But we understand that with the adjustment now in the second half of the year, 8.8% for Cemig D on average, we will have an improvement in the cash generation of the company. The electricity market, it was up 1.34%. As mentioned in the captive market, we had a slight drop of minus 0.8% in rural.\n\nWe can highlight that because many rural clients do not remain in this category because they did not meet the criteria of ANEEL. They were recategorized for commercial clients, which increased in 18%. And as we mentioned, Cemig D is still having a problem with GD. Currently 5.7 of used energy come from injected energy.\n\nBut with the Law 14,300 after January of 2023, this will no longer be a problem for distributing companies. And next year is a year of tariff review, and our market is going to be adjusted as well. In terms of filing losses, we are still -- we're in the regulatory limits. This is an achievement, and our goal is to maintain ourselves within that criteria.\n\nAnd we are moving on with the same initiatives: maintaining inspections, change in meters and also, we are legalizing the illegal connections. And just with that, we saved BRL 160 million when we comply with the regulatory losses. Now talking about delinquency. We have some highlights here.\n\nWe have collection rate very close to 100%. This is a very successful result. We are increasing our digital payment options. PIX has a great contribution here.\n\nThis growth allowed us to decrease costs in 6.74%. The highest level of collection here for a distributing company still come from special agencies and the higher cost of -- that's the highest cost of collection when we compare that to other receiving options and losses. When we compare the first half of 2021 -- of the first -- to the first half of 2022, we have some differences here. And when we look at that increase, we did have an increase here, but collection was up in 56%.\n\nAnd we are still working on disconnections so that we can control the delinquency levels of the company. Now going back a little bit here because the market already knows about the tariff adjustment for Cemig D. The anniversary is May 27, 28 but this year was a postponement. And the adjustment only happened after June 22.\n\nIt was an average of 8.8%. We have not seen the effect of this adjustment in covering Parcel B, and we will only be able to see these results now in the second half of the year. And what we already mentioned is that in the second quarter, we posted in our liabilities BRL 2 billion coming from PIS and COFINS tax credits, higher than the 10 years as we had understood. And within this adjustment that goes up to May 27, 2023, we should reimburse BRL 2.8 billion.\n\nSo what I mentioned before already, we were successful in raising BRL 1 billion in Cemig D with two debentures series with average tenures of five and seven years, and here our opex and regulatory EBITDA, we see that the opex we are performing a little bit over the regulatory opex. But it's important to show that we are committed here and we are maintaining that commitment to end the year within the regulatory limits. And in the second half of the year, this average of 8.8% increase in tariffs will contribute to meet that commitment. And in the EBITDA we are over the regulatory limits as we have achieved in the past.\n\nNow Cemig GT's results. We see the recurring result was surprising. We grew the EBITDA an 87%. Even highlighting here the fact, which Leonardo already mentioned the reimbursements for the company, Gasmig, we have that once we consolidate Gasmig results, we always bring you the slide to show its performance.\n\nWe see that EBITDA was up 0.6% and this result is in line with the expected recurring EBITDA for Gasmig. Last year, we had an increase because of thermo dispatch. It was an exceptional year, but we are very happy about Gasmig's results. This is a recurring result.\n\nAnd now we are going to start our Q&A session.\n\nOperator\n\n[Operator instructions].\n\nCarolina Senna -- Investor Relations Superintendent\n\nWe have a question about the payment of dividends and interest on equity. Is there a possibility of payments of interest on equity and dividends to be quarterly payments? Leonardo, can you comment on that?\n\nLeonardo de Magalhaes -- Chief Financial Officer\n\nOur bylaws define the payments of those every six months. Considering our investment program, we consider that our policy now is the right one. If we maintain 50% of payout for payments at every six months, we can assure payments for our investors. And this way, we can also carry out our investment plan in a sustainable fashion.\n\nThat's why you understand that we are able to maintain our policy of payment at every six months. And I understand that there is an expectation of results for this year and the second half of 2022. We believe we are going to have a very attractive return for our investors.\n\nCarolina Senna -- Investor Relations Superintendent\n\nThere is another question from Andre Domingos from AZ Quest Investments. About the plans, which concessions are due in 2026 and 2027? Are you going to require renewal? Can you talk about the process? And about the bond that is due in 2024, what is the strategy of the company? Are you going to prepay it in 2023? Or are you going to extend the debt?\n\nLeonardo de Magalhaes -- Chief Financial Officer\n\nNow about the plans you are talking about Emborcacao Nova Ponte and Sao Cemig, right? They represent an important share of our generation. And yes, we are interested in renewing these concessions. We are working on this topic, and we are considering the periods of times that are stated in the regulation. We are paying attention to that.\n\nThere is a work group discussing the alternatives, the best scenario to renewal these concessions. And we are very interested in these renewals. Now about our bonds for 2024, I don't know if you remember, Andre, and everyone else as well, of course, is that in 2021, in the first half of 2021 in our Cemig Day, we posted a strategy about the liability management for the bonds when we said that we were going to have an initial tranche where we would buy back 500 million in those bonds, we would have a second one up to 2023. And then we believe we have around $500 million to pay that on maturity or close to maturity with no type of premium, then that should work.\n\nAnd what I can tell you that we have executed the first trench and our strategy is right to work that process in stages for this liability management. So the company will maintain its strategy. And we understand that this movements buying back bonds, they are natural and they should be happening ahead. When the company understands that this is the right moment at the price of the bond in the secondary market, the FX rate and so on.\n\nSo we have defined the strategy. We'll keep the strategy, we understand this as the right strategy, but now we are just waiting for the best moment to be able to execute this liability management in order to reduce the concentration of this bond in the longer term. If we can -- if we are going to extend that, well right now, if we compare that the cost of issuing new bonds in the international market, the costs are too high. So it would be better for the company now to have a local issuance.\n\nSo this is what we foresee now for this current scenario and that's our expectation.\n\nCarolina Senna -- Investor Relations Superintendent\n\nOur next question is about the divestment of Taesa, please. I would like to know more information about the possibility of divestment of Taesa. I will turn the floor to our participation officer, Marco.\n\nMarco Da Camino Ancona Soligo -- Chief Participation Officer\n\nHello, thank you very much for your question and good afternoon to everyone. Well, the company is interested in divesting in some of its stakes. Taesa is one of them. Right now, we are talking to stakeholders and as soon as anything relevant happens, you will know about it.\n\nWe will inform you as usual. That's it. Thank you.\n\nCarolina Senna -- Investor Relations Superintendent\n\nNext question from Pedro Kretzer. He's asking about the reduction of installed capacity that went down to 180 megawatts when compared to the first quarter of 2021. And he would like to know why this reduction happened? I would turn the floor to Thadeu. And also there is a question related to the companies approach for green hydrogen energy?\n\nThadeu Carneiro da Silva -- Chief Generation and Transmission Officer\n\nThank you for your question. There were two reasons that caused the reduction of our installed capacity. First, we sold our stake at Renova. And second, we diluted our stake in Santo Antonio, and that happened at the end of the first half of the year.\n\nAbout green hydrogen, possibilities we are working on that with Gasmig, and we want to have off takers and involve Gasmig, thanks to its penetration and the state so that we can have green hydrogen when we needed. Thank you very much.\n\nCarolina Senna -- Investor Relations Superintendent\n\nNext question from [Inaudible] sell-side analyst. MME has opened a public hearing about the assured power review of HPPs. Can you comment on preliminary data? I will turn the floor to Dimas, our commercialization officer.\n\nDimas Costa -- Chief Commercial Officer\n\nGood afternoon [Inaudible]. Thank you for your question, and good afternoon, everyone. Yes, in fact we have that reduction of a shared power and Cemig is following that. But there are two different blocks within this sector of the generation sector.\n\nWe are following that up and we do not have a final position. Right now this is in the hearing stage and we are analyzing that with the whole segment, but there is not a clear position on that yet.\n\nCarolina Senna -- Investor Relations Superintendent\n\nThank you very much, Dimas. Now moving on, we'll turn the floor to our financial officer for his final remarks and talk about the final slide, which is the slide that we bring to the market with our commitments.\n\nLeonardo de Magalhaes -- Chief Financial Officer\n\nWell, every quarter, we published this slide, all the commitments made with investors and how these commitments are going. You can see that a number of them have been achieved. They are related to the technical and operating efficiency of the company in terms of divestments. Also, they have been done such as light and Renova.\n\nWe still have and are working in our divestment processes. And these are very complex processes, and they involve a number of resources. And I'm sure that in the midterm, we'll be publishing other investments. And we understand that those assets are very complex already, and we were successful in divesting there.\n\nWe will continue with digital transformation, restructuring, retirement benefit plans. We have a strong IT, and we see good results with our clients. And we have aimed progress, and this is going to add value to the company, the renewal of generation concessions, also investments in renewable generation sources in the second half of the year. In the short term, we expect to bring good news to the market about our investments, investments we have planned already and also the growth of retail electricity sales.\n\nThis is an opportunity to increase margins. Well, this second quarter was marked by the provision of those tax credits as mentioned. And also, this was the last quarter before our tariff adjustment, which will have a full effect of the tariff adjustment in the third quarter of 2022. This allows us to be very optimistic regarding the future results of the company.\n\nIn the second quarter -- in the third quarter, we'll have an investment with our investors so that we can talk more about our strategy. And you will know about the date when it comes up and it is defined. So that's it, thank you very much for your participation.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCarolina Senna -- Investor Relations Superintendent\n\nLeonardo de Magalhaes -- Chief Financial Officer\n\nMarco Da Camino Ancona Soligo -- Chief Participation Officer\n\nThadeu Carneiro da Silva -- Chief Generation and Transmission Officer\n\nDimas Costa -- Chief Commercial Officer\n\nMore CIG analysis\n\nAll earnings call transcripts"
}