{
  "companyName": "Vipshop Holdings",
  "companyTicker": "VIPS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/19/vipshop-holdings-vips-q2-2022-earnings-call-transc/",
  "content": "Vipshop Holdings (VIPS -0.87%)\nQ2 2022 Earnings Call\nAug 19, 2022, 7:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, good day, everyone, and welcome to Vipshop Holdings Limited second quarter 2022 earnings conference call. At this time, I would like to turn the call to Ms. Jessie Zheng, Vipshop's head of investor relations. Please proceed.\n\nJessie Zheng -- Head of Investor Relations\n\nThank you, operator. Hello, everyone. Thank you for joining Vipshop's second quarter 2022 earnings conference call. With us today are Eric Shen, our co-founder, chairman, and CEO; and David Cui, our CFO.\n\nBefore we begin, I would like to remind you that the discussion today will contain forward-looking statements made under safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from our current expectations. Potential risks and uncertainties include, but are not limited to, those outlined in our safe harbor statements in our earnings release and public filings with the Securities and Exchange Commission, which also applies to this call to the extent any forward-looking statements may be made.\n\nPlease note that certain financial measures used on this call, such as non-GAAP operating income, non-GAAP net income and non-GAAP net income per ADS are not presented in accordance with U.S. GAAP. Please refer to our earnings release for the reconciliation of our non-GAAP measures to GAAP measures. With that, I would now like to turn the call over to Mr.\n\nEric Shen.\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\nGood morning, and good evening, everyone. Welcome, and thank you for joining our second quarter 2022 earnings conference call. Our second quarter results came in better than expected driven by improving macro conditions toward the end of the quarter with the COVID-19 pandemic effectively under control. Supply chain and logistics efficiency largely recovered, and the consumer segment also picked up gradually.\n\nOur top-line performance was helped by a month-on-month recovery in consumption, especially more resilient trends in June. Even though sales were still under pressure, our bottom line increased. And the margins improved year over year, thanks to greater disciplining operations. This sector result demonstrates the resilience of our business model, as well as the strong execution and the flexibility of the entire company to address external uncertainties.\n\nNotably, we are doing a good job supporting the core brand that are pure to the value of our consumers. This has translated into strong brand partnerships and improved customer loyalty. During the quarter, core brands continued to outperform in sales momentum. Our buyers team worked more closely than ever to engage with brand partners.\n\nWe helped them navigate through an uncertain environment with extensive support from customer engagement, category planning, to marketing campaigns. Brand partners was pleased to use our merchant platform with new features to manage and grow their business. In turn, we secured more supply of unique and quality products at competitive price. In addition, we have been consistently refreshing our brand mix.\n\nWe added more new trendy and high-end brand in both apparel and the nonapparel categories, targeting different customer groups. Accordingly, we load out several new channels such as little pink box, VIP trends, and the VIP luxury to support the growth of these new brands while creating a new feel of shopping of our customers. In the second quarter, we successfully turned more high-value customers into paid members. Active Super VIP customer grew by 21% year over year and contributed 38% of online net GMV.\n\nThey once again showed their superior value with stable repeat purchase and outside amid a few cautious segments. With the future recovery highly dependent on the macro development, we are strategically anchored in discount retail for the long term. We are convinced that consumers always desire for great brands, great selection, and great value, especially as they become more rational in spending today. We will continue to enhance our value proposition, adapting our business as needed to best serve our brand partners and the customers.\n\nAt this point, let me hand over the call to our CFO, David Cui, who will go over our financial results.\n\nDavid Cui -- Chief Financial Officer\n\nThanks, Eric, and hello, everyone. During the second quarter, we delivered solid profitability on decent top-line performance that beat our prior guidance. Our initiative to focus on core brands has been working well. And our gross margin increased to 20.5% from 20.1% a year ago.\n\nThis was achieved as we identified many opportunities to streamline the cost structure in both apparel and nonapparel categories and managed to improve category gross margins effectively. We also made less, less efforts to drive operational efficiency. Notably, we continue to see some leverage from marketing as we became more rational in spending as to acquiring and retaining customers. As a result, our non-GAAP net income increased year over year to RMB 1.6 billion, and non-GAAP net margin expanded by 1.5% to 6.5%.\n\nAdditionally, we remain committed to our $1 billion share buyback program announced in March. We have repurchased $177.1 million of our ADS during the second quarter. Looking ahead, we'll remain focused on our merchandising strategy and looking at ways to operate our business more efficiently. Maintaining healthy and sustainable profitability continues to be our near-term financial priority in an uncertain environment.\n\nNow, moving to our detailed quarterly financial highlights. Before I get started, I would like to clarify that all financial numbers presented below are in renminbi, and all the percentage changes are year-over-year changes unless otherwise noted. Total net revenues for the second quarter of 2022 were RMB 24.5 billion as compared with RMB 29.6 billion in the prior-year period, primarily attributable to soft consumer demand for discretionary categories amid a changing macro environment with COVID-19 resurgence in China. Gross profit was RMB 5.0 billion as compared with RMB 6.0 billion in the prior-year period.\n\nGross margin increased to 20.5% from 20.1% in the prior-year period. Total operating expenses decreased by 18.7% year over year to RMB 3.9 billion from RMB 4.8 billion in the prior-year-period. As a percentage of total net revenues, total operating expenses decreased to 16.1% from 16.4% in the prior-year period. Fulfillment expenses decreased by 13.7% year over year to RMB 1.8 billion from RMB 2.1 billion in the prior-year period.\n\nAs a percentage of total net revenues, fulfillment expenses was 7.2% as compared with 6.9% in the prior-year period. Marketing expenses decreased by 60.5% year over year to RMB 555.6 million from RMB 1.4 billion in the prior-year period, primarily attributable to more prudent marketing strategy. As a percentage of total net revenues, marketing expenses decreased to 2.3% from 4.8% in the prior-year period. Technology and content expenses increased by 11.3% year over year to RMB 411.8 million from RMB 369.9 million in the prior-year period.\n\nAs a percentage of total net revenues, technology and content expenses increased to 1.7% from 1.2% in the prior-year period. General and administrative expenses were RMB 1.2 billion as compared with RMB 1.0 billion in the prior-year period. As a percentage of total net revenues, general and administrative expenses was 4.9% as compared with 3.4% in the prior-year period. Income from operations was RMB 1.3 billion as compared with RMB 1.5 billion in the prior-year period.\n\nOperating margin increased to 5.2% from 5% in the prior-year period. Non-GAAP income from operations was RMB 1.6 billion as compared with RMB 1.7 billion in the prior-year period. Non-GAAP operating margin increased to 6.3% from 5.9% in the prior-year period. Net income attributable to Vipshop shareholders increased by 17.4% year over year to RMB 1.3 billion from RMB 1.1 billion in the prior-year period.\n\nNet margin attributable to Vipshop shareholders increased to 5.2% from 3.7% in the prior-year period. Net income attributable to Vipshop shareholders per diluted ADS increased to RMB 1.97 from RMB 1.56 in the prior-year period. Non-GAAP net income attributable to Vipshop shareholders increased by 8.4% year over year to RMB 1.6 billion from RMB 1.5 billion in the prior-year period. Non-GAAP net margin attributable to Vipshop shareholders increased to 6.5% from 5% in the prior-year period.\n\nNon-GAAP net income attributable to Vipshop shareholders per diluted ADS increased to RMB 2.45 from RMB 2.10 in the prior-year period. Looking forward to the third quarter of 2022, we expect our total net revenues to be between RMB 21.2 billion and RMB 22.4 billion, representing a year-over-year decrease rate of approximately 15% to 10%. Please note that this forecast reflects our current and preliminary view of the market and operational conditions, which is subject to change. With that, I would now like to open the call to Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from the line Thomas Chong of Jefferies. Please go ahead.\n\nThomas Chong -- Jefferies -- Analyst\n\n[Foreign language] Thanks, management for taking my questions. Congratulations on a very solid set of results, with top and bottom line exceeding market expectations. When we come into the second half, given the global macro headwinds that we are facing right now, how should we think about the second half outlook, as well as the recovery momentum in July and August? And my second question is relating to competition. How should we think about the competitive threat from livestreaming, online shopping, and short-form video site? Thank you.\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJessie Zheng -- Head of Investor Relations\n\nOK, so turning to your first question. Understandably, we have seen from March to May, the whole e-commerce sector has been very hard hit by the COVID-19. But we have seen the year-over-year trend is -- having been improving into June and also July and August. We have a better June promotion than expected.\n\nAnd sales in July continued to show some slight month-on-month recovery. And in August, that momentum continued. But on the other hand, there is some still uncertainty regarding the recovery momentum. It's highly dependable, dependent on the macro developments, especially, you know, as well as the weather conditions.\n\nActually, the e-commerce industry is very -- especially as we are apparel-focused, we are very sensitive to the weather conditions, and that may -- unfavorable weather may delay the demand for auto and winter closing. And also, with the new COVID flareups, consumers are still cautious about spending. And the whole macro backdrop is not comparable to what we had seen for last year. So, there is still some uncertainty ahead.\n\nTurning to your second question on livestreaming -- competition from livestreaming. There is no big change in the competitive landscape, and we think competition is actually levering off. You know, livestreaming has been there for over two years and they are doing fine, especially in standardized items, which they are performing much better than apparel categories. But we are more specialized in apparel categories, which is still a very sophisticated segment and difficult for livestreaming platforms to absorb all the market share.\n\nWe have been monitoring data of the livestreaming platforms, and we think their traffic and the business momentum has been relatively stable.\n\nThomas Chong -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nThank you for the questions. We will now take the next question from Ashley Xu of Credit Suisse. Please proceed with your question.\n\nAshley Xu -- Credit Suisse -- Analyst\n\n[Foreign language] Thanks, management, for taking my question. My first question is about our SVIP strategy. Have seen that the growth has been quite good even during the COVID emergence? So, just want to check what's the key driver of the growth. And my second question is related to the recent cold weather impact on our strategy, both in consumer behavior and also merchandising.\n\nThank you.\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJessie Zheng -- Head of Investor Relations\n\n[Foreign language]\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJessie Zheng -- Head of Investor Relations\n\nOK. On the first question related to SVIP, we have been focusing on growing our SVIP customers for several quarters. And, you know, they now contributed around 38% of our online net GMV, and we expect this contribution to be higher in the coming quarters. We have a number of SVIP membership privileges to offer to them to incentivize the high-value customers into SVIPs.\n\nFor example, we have extra 5% benefits, we have Super VIP sales day on the 28th of every month, and also Super VIP membership stores. Now we increasingly focus on creating a different shopping experiences for them, offering them best sellers, brands, and categories on a time-limited basis so that they can really feel they are constantly seeking out values on our platform. So, we also have a variety of cross-platform programs to incentivize more high-value customers into SVIPs. So, we are pretty confident that SVIPs in terms of their customer base and ARPU, as well as GMV contribution will be growing going forward.\n\nOn the second question related to our merchandising strategy in response to the recent extremely weather conditions, actually, we have a lot of -- plenty of time from our brand partners for autumn and winter clothing. For example, by the end of August, we're going to launch our campaign for autumn apparel if the weather conditions is favorable enough. We don't have a problem with availability of the product supply from our brand partners because we have been highly engaged with them as to how we should prepare for the coming seasons. For example, we have been working with down jacket brands for the winter clothing to stock as many SKUs as possible just in case weather gets colder before we expect.\n\nSo, that's how we work with our brand partners. We don't have a problem for the inventory time from the best of our brand partners.\n\nOperator\n\nThank you for the questions. Next question will come from the line of Alicia Yap from Citi. Please go ahead.\n\nAlicia Yap -- Citi -- Analyst\n\nThank you. [Foreign language] Thanks for taking my questions. Congrats on the strong results. I have two questions.\n\nThe first one is, it seems like your 3Q guidance is a bit conservative considering what you have bid for your second quarter. And also, it seems like you've also been seeing improving trends in July and August. And then second question is on margin. This quarter margin actually improved quite a lot.\n\nAre there any further room to improve or the 2Q level will actually set as the new base for the future quarters? Thank you.\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJessie Zheng -- Head of Investor Relations\n\nOK. Our Q3 guidance of negative 10% to 15% actually takes into account a number of factors. For example, we expect there will be some back and forth in COVID-19 cases. And also, it takes time for consumer confidence to gradually recover.\n\nAnd lastly, we are not quite sure about the weather conditions in July, whether it's going to be cold enough for us to launch the autumn marketing -- the marketing campaign for autumn clothing. So, we'd better be a little bit conservative, but we will try our best to achieve the top-line performance. On the margins, I'll start by -- I'll start with a few points, and David will add some details later. We did scale back some of our marketing expenses in the second quarter, and that turned into a very good profitability.\n\nBut for the long term, for the coming quarters, our goal is still trying to bring customers back to a positive growth trajectory. We'll spend as needed, and we'll take opportunities whenever we can to acquire customers. But we'll continue to be quite rational. At the same time, we are confident that we can maintain healthy and sustainable profitability because we have been very good at managing our cost and expenses.\n\nAnd we have a proven track record to provide financial stability. David?\n\nDavid Cui -- Chief Financial Officer\n\nYes. In the first half of this year, we have been focusing on the improvement of our operational efficiencies. And we have been very disciplined in our spending. And our goal for the second half is still to maintain a quality business scale.\n\nAnd while improving the operational efficiencies, and we have to balance our profitability and the growth. We will potentially looking into opportunities to acquire new customers. That means that we could increase our marketing expenditures, but we have to be really disciplined in that initiative. So, having said all this, we are confident that our profitability, our net margin will at least remain stable for the second half.\n\nOperator\n\nThank you for the questions. Our next question comes from the line of Tian Hou of T.H. Capital.\n\nTian Hou -- T.H. Capital -- Analyst\n\n[Foreign language] So, related to the inventory buildup overseas and also in China, we saw the orders also declined. So, it seems like the inventory numbers and manufacturing are going to build up. In the past, the VIP is really good at it to help those manufacturing to get rid of inventory. It's a good opportunity for us.\n\nSo, I would like to have Mr. Shen to give us some color in the second half how Vipshop is going to capture such opportunity like the what we did before?\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJessie Zheng -- Head of Investor Relations\n\nOK. Let me share a few of my observations here. So, first, you know, we work with a lot of primary domestic brands and also some of the international brands. But that's not quite relevant to the export environment because they rely on imports.\n\nAnd we've seen some productions kicked off, you know, in the recent months. And second, on the inventory, there are a few things about inventory today. First, because of the COVID-19, there are a lot of -- many offline stores are struggling. Inventory is definitely building up.\n\nAnd second, since there have been a lot of lockdowns in the past months, some of the brands may have scaled back of their -- scaled back some of their productions. But things are getting better now. So, they are starting to pick up momentum in terms of placing orders. So, generally speaking, I think we should -- we potentially should benefit from a favorable inventory cycle because we do see excess inventories nowadays, and the amount of which is actually -- has actually exceeded the level we have seen for last year.\n\nAnd in addition to securing the supply, the unique kind of quality supply from our brand partners, remember, we also have the made-for-VIP shop line, which is quite stable, and is a long-term channel for us. So, we think we don't have a problem with the inventory, and we have the ability to secure the best supply from our brand partners.\n\nOperator\n\nThank you for the questions. Our next question comes from Eddy Wang of Morgan Stanley. Please proceed.\n\nEddy Wang -- Morgan Stanley -- Analyst\n\n[Foreign language] Thank you for taking my question. My first question is related to your revenue growth. When should we expect that our revenue growth will, you know, turn to positive territory again in the following quarters? The second question is that it will be mainly driven by the user growth, you know, for the revenue growth turning into the positive territory. Thank you.\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJessie Zheng -- Head of Investor Relations\n\nSo, on the question of whether it's our GMV or revenue growth would be driven by customer growth in the coming quarters, yes, I think our goal is to try to bring our customers to positive growth starting from the third quarter. Because now, in the second quarter, we've seen a drastic decline in the customers, and we've seen fewer customers shopping our platform because of the COVID impact mostly related to the factor that people cannot move around as freely as before. For example, last year, there were 100 people shopping on our platform. But in the second quarter, this year, it was 83 people.\n\nAnd because it's on a rolling basis, so entering into the third quarter, we may face additional pressure on customer base. That's why we will spend as needed to bring our customers to positive growth starting from this quarter.\n\nOperator\n\nThank you for the questions. We'll now take the next question is from Wei Xiong of UBS. Please proceed.\n\nWei Xiong -- UBS -- Analyst\n\n[Foreign language] Thank you, management, for taking my questions. And I have two follow-up questions. First is we just talked about we want to see the user growth returning to positive territory starting from the third quarter. Just want to ask what's the marketing strategy, user acquisition strategy, and marketing expense plan around this goal.\n\nAnd my second question is, given that our third quarter guidance has more conservatism built in based on the macro uncertainty, do we see a bigger chance to see a very strong result rebound in the fourth quarter given the year-end promotion, as well as the low base last year?\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJessie Zheng -- Head of Investor Relations\n\nIn terms of our customer acquisition strategy, we are trying to increase spending in acquiring new customers from the third quarter because in the past several quarters, because of the COVID restrictions, we have more or less stopped new customer acquisition in certain geographies. Now, we are trying to restart our investing in this region. Our strategy continues to be pre-installation, app store, and the targeted marketing for new customers. At the same time, we're trying to put back the old customers who used to shop with us in the past year or in the first quarter.\n\nWe are trying to reactivate this group of customers by leveraging target marketing. And we are trying to bring back the 17% of the customers who were able to shop with us because of various COVID restrictions. Second, in terms of our -- in terms -- we are -- actually, in terms of the Q4 outlook, we are actually quite confident under the condition that if we can turn our customer into the growth trajectory in the third quarter because as long as we bring our -- bring new customers in, we are going to see some upside in the fourth quarter performance because that's going to be the peak season for us. And in the past several quarters, we have been able to take the economic downturns as opportunities to optimize our merchandising portfolio and increase the customer mind share for discount retail among our customers.\n\nSo, we are pretty confident we'll see some upside in the fourth quarter if everything, you know, goes on well.\n\nOperator\n\nThank you for the questions. Sorry, please continue.\n\nDavid Cui -- Chief Financial Officer\n\nYeah. Yeah, I'll just add something here. So, when we're implementing all these marketing initiatives in the third quarter and the quarter after, we will not sacrifice our profitability. We'll be really careful when we launch this program.\n\nWe will try to do a much better job as compared to what we did in the past and to ensure the ROI on all those programs is good.\n\nOperator\n\nThank you. We have our next questions from the line of Andre Chang from J.P. Morgan. Please ask your question.\n\nAndre Chang -- JPMorgan Chase and Company -- Analyst\n\n[Foreign language] So, let me translate my two questions. The first question is about the seasonal impact on the gross margin and the product mix. So, historically, the second quarter is a peak season for apparel sales, which lead to higher gross margin. But this year, is there any change of the mix? And also, does that mean the gross margin seasonal decline into third quarter will be milder than usual? Second question is about the capex, which seems to be doubling in the second quarter.\n\nWhat's the driver? And are we still going to invest at this pace in the current macro environment? Thanks.\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJessie Zheng -- Head of Investor Relations\n\nOK. On the gross margin, we think seasonality actually does not impact our gross margin that much. In the second quarter, gross margin tends to be lower because of the promotion and because apparel sales -- apparel demand was rather weak. And in the third quarter, there are not so much.\n\nSo, many promotions, and we may sell less apparel. I just want to try to share that we actually have taken many cost-saving initiatives this year to try to stabilize and improve our gross margin. For example, we have stopped delivering coupons at the cost of our own benefits. We are trying to be prudent in giving additional coupons to customers.\n\nWe're trying to engage brand partners to do that at some time. Second, we have stopped investing in those channels, which proves not to be that economical. So that is part of our cost-saving initiatives as well. And lastly, we have done a lot of -- taken a lot of measures to try to optimize the cost structure, the process ceiling related to gross margin.\n\nFor example, we are trying to handle customer returns in a better way without sacrificing our benefits. So, these initiatives are proved to be very effective, and we are quite confident that we will maintain a relatively stable gross margin going forward.\n\nDavid Cui -- Chief Financial Officer\n\nThe capex, the capital expenditure in the quarter is largely for Shenzhen outlet. So, we will add three new or less in this year. A lot of the times, the payments for the land use rights are upfront, and the cash outflow is not necessarily in line with the opening of the outlet. But if we look the capex for Shenzhen outlets, year over year, the amount should be quite comparable.\n\nThis particular quarter maybe appears a lot more. But over the year, it should be quite comparable.\n\nOperator\n\nThank you for the questions. Our next question comes from Natalie Wu of Haitong International. Please go ahead.\n\nNatalie Wu -- Haitong International Securities -- Analyst\n\n[Foreign language] Let me translate myself briefly, and I have two. The first one is regarding the previously mentioned user growth turning positive, I just wanted to clarify if this refers to the year-on-year growth of the active customer number in the third quarter. And if yes, that actually translates to 2.2 million active users. If the cost of the user addition is kept constant, which also translates to RMB 200 million to RMB 400 million in terms of the additional sales marketing expenses, just wondering how does that align with the margin -- a stable margin profile as we just mentioned previously? And second one, regarding the bargain power.\n\nSo, just wondering, during the current situation, given that the suppliers affected from COVID has been witnessing an intensified issue for inventory stock. Just curious, does that help enhance your bargain power and get a more favorable offer? Thank you.\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJessie Zheng -- Head of Investor Relations\n\nOK. First, on the customer acquisition cost, it's not a single mass. It doesn't mean that adding 2 million customers, we will have to spend RMB 200 million to RMB 400 million every quarter. We may have to spend a little bit more on acquiring new customers.\n\nBut reactivating old customers, especially the active customers in the past quarter doesn't -- is not that expensive. It's much lower than RMB 100 per customer. So, we don't have to spend that much. We can ensure you that our marketing spend as a percentage of total revenue is not going to be higher than what we have seen for the same period of last year.\n\nAnd we are going to leverage a combination of great brands, great selections, and great prices, and as well as better personalized recommendation to achieve our goal of positive customer growth. Second, on the inventory, we have plenty of inventory as I've mentioned just now. We work very closely with our brand partners on securing the best supply of unique and quality products, and most of them are still on the consignment model. If we are buying out supplies, we probably have to -- will probably have a much higher bargaining power.\n\nBut because it's on consignment model, and we don't have to, you know, increase the percentage we take from brands. It is still within the normal range. And actually, we want to keep certain support for the core brands, and we may -- we can't afford to decrease the take rate a little bit to make sure that they can grow faster on our platform with a stronger supply of any kind of quality product offerings because core brands can really help deliver value to our customers and increase consumer mindshare for Vipshop as a discount platform. So, that's how we work with our brand suppliers.\n\nWe can support them and create a win-win situation for both parties.\n\nOperator\n\nThank you very much. Oh, sorry. Please go ahead.\n\nDavid Cui -- Chief Financial Officer\n\nYes, just to add clarity to your first question regarding the customer acquisition. A large portion of the customer addition should come from the calling back of the existing registered -- I would call the active registered customers. The cost for calling back those people is relatively small, yeah.\n\nOperator\n\nThank you management. Due to the time constraint, that concludes today's question-and-answer session. At this time, I will turn the conference back to Ms. Jessie Zheng for our closing remarks.\n\nJessie Zheng -- Head of Investor Relations\n\nThank you for taking the time to join us today. If you have any questions or follow-up, please don't hesitate to contact us. We look forward to speaking with you next quarter.\n\nDuration: 0 minutes\n\nJessie Zheng -- Head of Investor Relations\n\nEric Shen -- Co-Founder, Chairman, and Chief Executive Officer\n\nDavid Cui -- Chief Financial Officer\n\nThomas Chong -- Jefferies -- Analyst\n\nAshley Xu -- Credit Suisse -- Analyst\n\nAlicia Yap -- Citi -- Analyst\n\nTian Hou -- T.H. Capital -- Analyst\n\nEddy Wang -- Morgan Stanley -- Analyst\n\nWei Xiong -- UBS -- Analyst\n\nAndre Chang -- JPMorgan Chase and Company -- Analyst\n\nNatalie Wu -- Haitong International Securities -- Analyst\n\nMore VIPS analysis\n\nAll earnings call transcripts"
}