{
  "companyName": "InnovAge Holding Corp.",
  "companyTicker": "INNV",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/14/innovage-holding-corp-innv-q4-2022-earnings-call-t/",
  "content": "InnovAge Holding Corp. (INNV 1.99%)\nQ4 2022 Earnings Call\nSep 13, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the InnovAge fourth quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Ryan Kubota, director of investor relations. Please go ahead.\n\nRyan Kubota -- Director of Investor Relations\n\nThank you, operator. Good afternoon, and thank you all for joining InnovAge's fiscal 2022 fourth quarter earnings call. With me today is Patrick Blair, president and CEO; and Barbara Gutierrez, CFO. Dr.\n\nRich Feifer, chief medical officer, will also be joining the Q&A portion of the call. Today, after the market closed, we issued a press release containing detailed information on our quarterly and annual results. You may access the release on our company website, innovage.com. For those listening to the rebroadcast of this presentation, we remind you that the remarks made herein are as of today, Tuesday, September 13, 2022, and have not been updated subsequent to the initial earnings call.\n\nDuring this call, we will refer to certain non-GAAP measures. A reconciliation of these measures with the most directly comparable GAAP measures can be found in our fiscal fourth quarter 2022 press release, which is posted on the investor relations section of our website. We will also be making forward-looking statements, including statements related to our remediation measures, including scaling our capabilities as a provider, expanding our payer capabilities and strengthening our enterprise functions, future growth prospects, the status of current and future regulatory actions and other expectations. Listeners are cautioned that all of our forward-looking statements involve certain assumptions that are inherently subject to risks and uncertainties that can cause our actual results to differ materially from our current expectations.\n\nWe advise listeners to review the risk factors discussed in our Form 10-K annual report for fiscal year 2022 and our subsequent reports filed with the SEC. After the completion of our prepared remarks, we will open the call for questions. I will now turn the call over to our president and CEO, Patrick Blair. Patrick?\n\nPatrick Blair -- President and Chief Executive Officer\n\nGood afternoon. Thank you, Ryan, and thank you, everyone, for joining us this afternoon. I want to start by expressing my continued appreciation for our InnovAge employees across the country for everything they are doing to support our participants, each other, and our business during these challenging times, and our federal and state partners for their ongoing collaboration and support, and to our shareholders for their ongoing interest in the company. This quarter represents a continuation of the transformational journey in InnovAge.\n\nI remain confident that we're pursuing the right foundational actions to keep the business strong and healthy while navigating this difficult moment. Our primary focus continues to be resolving the issues that led to the enrollment sanctions in Sacramento and Colorado. This includes following the lead of our regulators, ensuring they are completely satisfied with the improvements we're making and the quality of healthcare we're delivering. We're tackling these opportunities across every InnovAge center, whether in the audit process or not.\n\nI'm genuinely encouraged by our progress in the last 90 days. By some measures, we are at and even ahead of our expected timeline for near-term operational improvements in medium-term capability development. The financial results for the quarter highlight needed investments in the quarter, which we've made, and the economic realities of frozen enrollment across roughly half our business. While some of these costs are temporary, some will be permanent as we believe they're critical to ensuring a highly compliant and effective care delivery model going forward.\n\nThe results also serve to crystallize the opportunity and importance of accelerating the development of our payer capabilities to effectively manage total cost of care. While disappointing, we do not believe the results reflect the strategic and operational progress made across the enterprise. I will go into detail later in my prepared remarks. Last quarter, I introduced the three key dimensions of our transformational work, achieving operational excellence as a provider, expanding our core payer capabilities, and strengthening critical enterprise functions.\n\nRegarding operational excellence as a provider, we're making meaningful progress across eight core initiatives, which I'll expand on shortly. These initiatives are designed to help us earn the right to be released from sanctions and return to accepting new participants in Sacramento and Colorado, while also providing the blueprint for a standardized and scalable PACE platform. Regarding our risk-bearing payer capabilities. We've concluded the assessment of our current state across the areas of provider network management, evidence-based site of care management, resource management of third-party care delivery, claims payment, and risk for accuracy.\n\nWhat's more, we've already begun to strengthen these core business processes, have identified quick wins, and developed a robust pipeline of initiatives that we believe will improve quality and lower medical costs. We've also made large strides in strengthening our enterprise capabilities, and we are adding new talent and performance standards to the organization. Success in the business starts with great participant care delivered by purpose-driven individuals. To guide and align our leaders, we've launched a five-pillar performance management framework, which defines operational success in clear and measurable key results across the pillars of people, service, quality, growth, and financials.\n\nAs an example, we're measuring service through a quarterly participant satisfaction score. In the fourth quarter, it was 81%. We look forward to improving this metric, along with others in fiscal year '23. We will have implementation work ahead of us, but my leadership team and I will be held to the performance standards this fiscal year.\n\nOn the talent front, we've made tremendous progress adding both leadership and center-level caregiving roles. The momentum and culture we're building, coupled with the inspiring initiative pace is attracting top caliber talent to InnovAge. In August, we welcomed Dr. Rich Feifer, who joined us as chief medical officer.\n\nAnd this month, Kathy Andreasen assumed the role of chief people officer. Rich brings significant experience focused on optimizing performance across both the provider and payer domains. Kathy brings decades of experience as a CPO from the high-growth technology and service industries, where she was instrumental in scaling talent management capabilities. I would also like to note the addition of Jim Carlson as our new board chairman.\n\nJim brings decades of both public company leadership and board experience that I believe will be instrumental in accelerating our strategy and execution. To begin today's discussion, I'd like to start with a regulatory update by market, updates on our eight key operational excellence initiatives. Perspectives on the quarter, with a specific focus on the interplay of operating and medical cost, and then I'll share some concluding thoughts. On the regulatory front, we're continuing our work to resolve the audit findings, working closely with CMS and our state partners.\n\nOur job is to ensure every requirement is fulfilled and every question from the regulators is answered. We're making excellent progress systematically remediating the deficiencies that led to the sanctions. And as I mentioned earlier, proactively making these operational changes broadly across the organization. We're measuring our progress monthly against a set of jointly developed audit performance measures.\n\nImportantly, we have been intentional to build the performance measures into a dynamic dashboard for efficient communication and progress report. The regulators are using our performance against these measures to assess our progress and to determine when to begin the audit validation process, which is the final audit step before sanction can be released. As we've said before, the actual timing of sanction release will ultimately be determined by our regulatory partners. Starting with Sacramento.\n\nWe have achieved five consecutive months of target performance against key audit measures. CMS and the state have acknowledged our progress and we are working closely to determine the remaining steps before entering the validation process. We don't know the date when sanctions will be released, but we are confident we're on the right path. In Colorado, CMS accepted our corrective action plan in April and the Colorado Department of Health Care Policy and Financing accepted our plan in June.\n\nWe've taken what we've learned in Sacramento, and we're applying it to Colorado, and we're very pleased with our progress. We are working intensely to satisfy all the requirements as quickly and as thoroughly as possible and our performance over the next few months will be critical to reaching the validation stage. In New Mexico, the audit began in October 2021. In July, we were verbally notified that no enrollment sanction would be taken.\n\nThere are immediate corrective actions that we must take to remediate all aspects of the audit and are working with CMS in the state, all while continuing to enroll participants. Similarly, in San Bernardino, the audit began in March 2022. We were verbally notified by CMS in August that no enrollment sanction would be taken. But again, while continuing to enroll new participants, we are implementing immediate corrective actions in working with CMS in the California Department of Healthcare Services in all remaining aspects of the audit.\n\nFor our two markets not under active audit, Pennsylvania and Virginia, we are currently not aware of planned audits but have proactively deployed self-audits based on our learnings in California, Colorado, and New Mexico. In Florida, we remain on pause in our Tampa and Orlando de novo centers until we have greater clarity on when our current sanctions will be released. To sum up, we believe we've identified the root causes, which led to the sanctions and are addressing them wherever they exist. We're not only making progress across markets under sanction, but we're also beginning to see some evidence that we're earning back the trust from our government partners.\n\nIn May, I shared with you that we were focused on eight operational process improvement initiatives to address the root causes of the audit deficiencies, which began in earnest in February. We believe excellence in these areas will not only reduce future compliance risk but is also bedrock to a repeatable operating playbook. We communicated that we expected to complete these initiatives by calendar year end, and I'm pleased to report that we're making strong progress and are largely tracking ahead of schedule. Specifically, as of September 1, we've made progress among the following dimensions: filling critical personnel gaps in each of the centers.\n\nWe reduced the number of critical open positions by approximately 60%. Physicians, nurses, and home care workers continue to be the most challenging areas, but we're making steady headway. We have also increased our overall FTE headcount by approximately 150 over the last six months to approximately 2,000, including 1,300 clinicians; standardizing the process of our interdisciplinary care teams who plan, coordinate and deliver care. We've implemented new processes and tools for these mission-critical care teams across all 18 centers.\n\nOur focus now is continuous performance monitoring and training, improving the timeliness of scheduling and coordinating care with external providers outside the centers. Approximately 95% of participants are being scheduled within target time frames and backlogs have been largely eliminated. We're now optimizing staffing, productivity measures and tools, improving the efficiency and reliability of transportation for our participants. Driver open positions have been reduced by approximately 90%.\n\nAdditionally, transportation is running additive on-time percentage of approximately 80%. We are also in the process of implementing new scheduling and routing tools, which we believe will improve efficiency in a meaningful way. Standardizing our wound care program across the enterprise. We've secured local in-network contracts across all centers, and we are finalizing a few national partnerships with the goal to further improve quality and reduce costs in this area.\n\nReducing documentation outside of the EMR, we've completed training and proficiency examinations on how best to utilize the EMR for care documentation across all targeted centers. Improving our telephonic response times is strengthening our home care network and reliability. It's taking us longer to achieve our targeted results for these two initiatives due to the reliance on technology enhancements and the inherent challenges of the home care workforce shortage. In the near term, we made solid progress through improved processes, resulting in increased productivity.\n\nWithin home care, these open positions are included in our critical hiring initiative discussed earlier. We're pleased with our progress. And in the coming months, we'll be focused on ensuring we have the structure in place to sustain and continuously improve in all of these areas. Now turning to the quarter.\n\nWe reported revenue of $172.9 million, which represents a sequential decline of 2.5% compared to last quarter. We ended the quarter serving approximately 6,650 participants. For the fourth quarter, we reported center-level contribution margin of $23.6 million and a corresponding center-level contribution margin ratio of 13.6%, which represents a decrease of 2.2% sequentially when compared to the third quarter of fiscal year 2022 center-level contribution margin of $28 million. To be clear, we're working through a unique transitional period as we return to a sense of normalcy from the heights of COVID while also navigating the odds.\n\nWe're focused on getting participants back into the centers, consistent with pre-COVID levels. And we're making long-term investments to fundamentally transform our ability to execute scale. Starting with revenue. Net census overall is down approximately 2% sequentially, driven by a decline of approximately 6% in sanction markets.\n\nThe sanctions in Colorado have heavily impacted the overall picture, as it represents approximately 47% of our total census. We have invested resources to improve our overall enrollment in nonsanctioned markets to help offset these dynamics. These investments are bearing fruit as we assume gross enrollment increases of 34% in nonsanctioned markets resulting in net census growth of approximately 3% in these markets over the same period. As you know, most of our rates are contractually determined and factor in healthcare inflation.\n\nOur Medicare rates in fiscal year 2022 were approximately $3,900 PMPM, which represents an increase of 4.5% versus fiscal year 2021. Regarding Medicaid rates, we recently received updated rates for Colorado, Virginia, and Pennsylvania. Barb will provide more detail in a few minutes. We appreciate that our Medicaid rates are set with some discretion by state agencies and believe the process is intended to address the cost pressures we have experienced, caring for our frail participants.\n\nCenter level costs were up sequentially, impacting center level contribution margin due to increasing headcount and higher wages for some roles. We also made staffing investments to address a unique period when our participants are returning to our centers, causing stress on our organization to provide care and fully reopen centers, while also covering the needs of many participants who are uncomfortable returning in person. We have invested meaningfully in our centers as noted earlier, but believe strongly in the ROI of this approach, both in terms of long-term compliance and reduced provider costs, including inpatient post-acute stays and long-term care born from optimal center staffing. Separately, we also continue to observe elevated external provider costs.\n\nOn a sequential basis, overall external provider costs were lower by approximately $4.5 million due to lower census and a decrease of $90 PMPM but remain above historical levels. As we dug further into the data, we've learned a lot more about our costs than we knew a quarter ago. As with most healthcare cost trends, the drivers are multifaceted and include lower average daily attendance in our centers due to COVID. Prolonged staff vacancies, turnover, and productivity loss during audit periods and fewer new participants entering the risk pool, and the deconditioning of participants post COVID.\n\nLet me spend a couple of minutes on each. Average daily attendance. PACE is a center-based model for good reason. Our ability to engage daily with our participants and proactively manage early warning signals is impaired when participants do not come into the center.\n\nWhile COVID subsided in the fourth fiscal quarter, participant fear and concerns on returning to the center did not. This had a negative impact on our internal provider costs. We can't quantify the precision, but believe it was a factor. To address this, we quickly actioned a dedicated initiative focused on increasing daily attendance, which in the last three months has improved by approximately 50% from when we began a focused effort in May.\n\nWe believe getting participants back in the centers will improve our ability to manage these costs. Staffing turnover and lost productivity. A critical factor in optimizing care efficiency, including the total cost of care is the focused attention of our frontline caregivers. Two competing factors have created challenges.\n\nThe first involves caregiver staffing turnover and vacancies. This is a challenge all provider organizations are facing. The second involves the significant time and energy devoted to audit remediation, which we estimate is occupying approximately 15% of our caregivers' time and approximately 30% of center-focused leadership time, thus requiring incremental temporary staffing to compensate. As we stabilize our staffing and emerge from the audits, we expect these temporary costs to gradually reduce.\n\nRisk pool and deconditioning. Enrolling new participants is critical to maintaining a balanced risk pool. Because we have been unable to enroll younger, healthier community-based participants, we have not been able to offset the cost of longer-tenure participants. To better understand these dynamics, we engaged a third party to review the specific impact of COVID on our business.\n\nAmong the findings, the percentage of our participants in the first two years of their InnovAge tenure decreased from 46% pre-COVID to 41% when comparing participants from first quarter 2022 with fourth quarter 2019, which skewed our risk pool toward longer-tenure, frailer participants. Further, we have also confirmed that after a COVID diagnosis, our participants often experience higher cost over pre-COVID levels. The analysis referenced earlier indicated that participant expense was approximately 88% higher on average in the calendar year post-COVID diagnosis. This is consistent with emerging medical literature that people are more susceptible to a range of other conditions post-COVID.\n\nIn many cases, this deconditioning of our participants has led to higher rates of long-term care placement. Like other risk-bearing government program payers, the capabilities to improve quality and lower medical cost trends are a core part of the operating model and a key reason why government payers are increasingly working with private companies. As I referenced in the last call, these capabilities exist within InnovAge today, but their effectiveness is mixed. We weren't prepared to handle such a multifaceted set of trend drivers at once.\n\nSince we've gotten our arms around the drivers, we've developed a set of initiatives that we call clinical value initiatives, or CVIs to mitigate the cost trends in key service categories like inpatient assisted living and SNF. For example, we've begun to action initiatives to reduce unnecessary readmissions within 30 days, ensure care is delivered in the most appropriate site of care and that our risk scores reflect the acuity of the populations we serve. Additionally, the largely untapped advantage that PACE organizations have over traditional managed care organizations is that we're also delivering the care, and approximately one-third of the total cost of care occurs within our four walls. While we admittedly need to start with the basics, we believe at maturity, we can generate a meaningful reduction in annual medical cost.\n\nTaken together, the results of the fourth quarter reflect continuous investment in the business. Remember, we're making material investments in the centers because we firmly believe in the power of the center-based PACE model to keep participants out of higher-cost settings. It may cost more to operate our PACE centers going forward than it has in the past, but we're building capabilities that will enable us to better manage external provider costs, which we believe will allow us to maintain an attractive long-term margin profile. And with that, I'll turn it over to Barb to review the quarter in detail.\n\nBarb Gutierrez -- Chief Financial Officer\n\nThank you, Patrick. I will provide some highlights from our fourth quarter and fiscal year-end financial performance for 2022, an update on Medicare and Medicaid rates for fiscal year 2023, and some insights into the trends we are seeing as we head into the new fiscal year. As with our previous earnings calls, I will refer to sequential comparisons relative to the third quarter in order to provide a more meaningful picture of our performance. We ended the fourth quarter and fiscal year 2022 with 18 centers and a census of just over 6,650 participants as of June 30, 2022.\n\nCompared to the prior year, this represents an ending census decrease of 2.8% compared to the fiscal third quarter, census declined 4.4%. We recorded over 82,800 member months in fiscal year 2022, a 3.9% increase compared to the prior year after including the Sacramento census, which was not consolidated until the second half of fiscal year 2021. Revenue grew 9.5% to $698.6 million for fiscal year 2022, primarily driven by member-month growth and a mid-single-digit increase in both Medicare and Medicaid rates. Medicaid rates in fiscal year 2022 include a temporary rate increase from the American Rescue Plan Act or ARPA, in Colorado and Virginia.\n\nFourth quarter revenue decreased by 2.5% to $172.9 million compared to the previous quarter, primarily due to decreased member months as a result of the ongoing enrollment sanctions in Colorado and Sacramento. External provider costs for the full year were $383 million, 23.8% higher than the prior year, and $98.7 million for the fourth quarter, a decrease of 4.4% compared to the fiscal third quarter of 2022. The year-over-year increase was primarily due to an increase in member months coupled with higher cost per participant. The cost per participant drivers includes: one, the lingering effects of COVID from the third quarter kept inpatient costs elevated associated with higher acuity and drove greater post-acute care utilization; two, increased housing utilization in assisted living and nursing facilities; three, increased permanent housing rates as mandated by certain states.\n\nAs we mentioned on the last call, this includes the ARPA-funded public policy adjustment in Colorado that increased assisted living rates by more than 30% effective January 1, 2022. And four, increased outpatient and specialist care expenses, in part as a result of our participants seeking healthcare services that were delayed during the onset of the pandemic in fiscal year 2021. During the quarter, external provider costs declined 4.4% from the fiscal third quarter of 2022 due to a decline in post-acute utilization as the impact of increased utilization in the third quarter, particularly from COVID, began to subside. Our cost of care, excluding depreciation and amortization of $180.2 million was 16.7% higher year over year, driven by an increase in member months and the overall cost per participant.\n\nThe primary cost drivers include increased headcount as we continue to make progress filling vacancies, adding approximately 150 new employees over the last six months, higher wage rates and temporary labor associated with the ongoing competitive labor market, the financial impact on operations as a result of all centers being opened for a full year and preopening losses associated with new de novo locations. Sequentially, cost of care increased 9.5% to $50.5 million due to increased headcount as we continue to fill vacancies and increased labor costs associated with ongoing audit remediation and compliance efforts, some of which will be temporary in nature. Center level contribution margin, which we define as revenue less external provider costs and cost of care, excluding depreciation and amortization, was $135.4 million for the fiscal year ended June 30, 2022, compared to $174.1 million in the prior year. For the fiscal fourth quarter, we reported a center-level contribution margin of $23.6 million compared to $28 million in the fiscal third quarter of 2022.\n\nSales and marketing expense was $24.2 million for the fiscal year ended June 30, 2022, increasing 8.8% year over year, primarily due to an increase in headcount and costs associated with organizational realignment. For the fourth quarter, sales and marketing expense of $5.1 million decreased approximately $1.1 million or 17.2% compared to the third quarter, primarily due to lower marketing spend as a result of the sanctions. Corporate, general and administrative expense was $101.7 million for fiscal year ended June 30, 2022, a decrease of 23.2% year over year. The full year decrease is primarily due to $58.5 million in fees incurred during fiscal year 2021 as a result of the Apax transaction.\n\nOffsetting the decrease related to the Apax transaction included an increase in headcount to bolster our organizational capabilities, costs associated with organizational realignment and full year financial costs associated with regulatory requirements of being a publicly traded company. These increases in expense are partially offset by lower bad debt expense compared to fiscal year 2021. For the fourth quarter, corporate general and administrative expense increased 11% to $27.4 million. The increase over the third quarter was primarily due to costs associated with third-party consultants to develop and implement our eight core provider initiatives, assess our risk-bearing payer capabilities and to strengthen our enterprise capabilities that Patrick touched on previously, as well as increased legal costs.\n\nNet loss for the fiscal year ended June 30, 2022, was $8 million compared to prior fiscal year net loss of $44.7 million. For the fourth quarter, we reported a net loss of $13.5 million. For the fiscal year ended June 30, 2022, we reported an earnings per share loss of $0.05, both basic and diluted. Our basic and fully diluted weighted average share count for fiscal year 2022 was 135,519,970 shares.\n\nAdjusted EBITDA, which we calculate by adding interest, taxes, depreciation and amortization, and one-time adjustments for transaction and offering related costs and other nonrecurring or exceptional costs to net income was $34.3 million for the fiscal year ended June 30, 2022, compared to $85.3 million in fiscal year 2021. Adjusted EBITDA for the fiscal fourth quarter was negative $0.6 million compared to positive $1.9 million in the fiscal third quarter of 2022. Adjusted EBITDA margin for the fiscal year ended June 30, 2022, was 4.9% compared to 13.4% in the prior year. For the fiscal fourth quarter, we reported an adjusted EBITDA margin of negative 0.4% compared to positive 1.1% in the third quarter of 2022.\n\nThe decrease to adjusted EBITDA compared to the third quarter was due to elevated inpatient costs as a result of higher acuity, increased housing costs, additional costs associated with audit remediation and compliance efforts, higher cost of care due to a competitive labor market, and increased headcount. De novo center losses, which we define as net losses related to preopening and start-up ramp through the first 24 months of de novo operations were $2.3 million for the fourth quarter, primarily related to our Tampa and Orlando centers in Florida. As Patrick mentioned, we have committed to CMS and the Agency for Healthcare Administration, or ACA, that we have proactively paused the remaining steps in the expansion process to allow us to focus exclusively on resolving our active audit issues before proceeding in Florida. Turning to our balance sheet.\n\nWe ended the quarter with $184.4 million in cash and cash equivalents and had $86.4 million in total debt on the balance sheet, representing debt under our senior secured term loans, convertible term loans plus capital leases and other commitments. For the fiscal year ended June 30, 2022, we had $38.2 million of capital expenditures. Finally, while we have been making progress on our remediation efforts associated with the sanctions, the inherent uncertainty and open timeline around sanction release prevents us from providing forward-looking guidance for fiscal year 2023. That said, we do want to provide some additional visibility around the following areas where we are able.\n\nFirst, regarding census. We are continuing to enroll new participants in our nonsanctioned centers, resulting in net census growth in the low single digits and expect those trends to continue into fiscal year 2023. As a reminder, we lose approximately 2% of our center census on a monthly basis, primarily driven by involuntary disenrollment. While the majority of these losses are involuntary, we have repurposed our sales teams in sanctioned markets to focus on retention efforts to reduce voluntary discipline.\n\nRegarding revenue. As you know, our rates are contractually determined and are based on cost for PACE or comparable populations. Our Medicare rates are based on county rates as determined each calendar year by CMS, coupled with prospective risk score adjustments made by CMS in January and July. When converted to a fiscal year basis, Medicare rates increased 4.5% in fiscal year '22 over fiscal year '21.\n\nFor fiscal year 2023, we are expecting a combined net mid-single digit rate increase comprised of the following. A low single-digit Medicare Part B increase, partially as a result of sequestration fully resuming in July, a mid-single-digit Medicare Part D increase and for Medicaid, a mid-single-digit rate increase, inclusive of 10% in Colorado, which includes go-forward funding effective July 1 that offsets the increase in assisted living facility rates that went into effect in January, 5% in Virginia; 3% in Pennsylvania, effective January; no rate increase in fiscal year 2023, in New Mexico; and as previously disclosed, a mid-single-digit rate decrease in California, effective January 1, 2022. Next, an external provider cost perspective. We expect external provider costs to remain elevated compared to historical levels, in part due to the post-COVID acuity effect on our participants, although tapering in the near term relative to the second half of fiscal year 2022.\n\nFor our cost of care, we expect cost pressures to also remain elevated as we continue to work through audit remediation and add to our workforce. However, we do anticipate that these costs will begin to moderate as our New Mexico and San Bernardino centers receive corrective action plans from their respective audits without enrollment sanction. Regarding corporate G&A. We are continuing to evaluate the organization to optimize the business and refine our payer capability road map.\n\nAs Patrick indicated earlier, we are focused on eight key provider operational excellence initiatives and building up our payer capabilities. Going forward, we want to ensure that we have the structure in place to sustain and continuously improve the ongoing effectiveness of these initiatives. Regarding sales and marketing, we continue to make prudent decisions as we balance staff retention with our need and desire to grow, only after our remediation efforts are complete. With new leadership in place, we are making investments in our sales and marketing capabilities, while closely managing our cost structure, and we'll utilize our sales teams, nonsanctioned markets for participant outreach and voluntary disenrollment mitigation in the near term.\n\nWe believe the recent financial results reflect a transitory period for the business, influenced by several factors, including our participant profile, audit remediation efforts, and labor market dynamics. As Patrick stated, some of the costs reflected in our quarterly results will be temporary while some will be permanent. We believe that all of the investments we are making into the core of our business, coupled with the development of our payer capabilities will help us to effectively manage total cost of care, while simultaneously working to ensure we have a highly compliant and effective care delivery model for the future. I will now turn the call back to Patrick for his concluding thoughts.\n\nPatrick? \n\nPatrick Blair -- President and Chief Executive Officer\n\nThank you, Barb. My ongoing commitment to all stakeholders continues to be doing everything in our power to proactively strengthen our operations organizationwide in order to earn the right to be released through sanctions to avoid future issues and to be a sustainably high-performing PACE provider able to serve participants for years to come even in more locations across the country. While I'm pleased with our strategic and operational progress over the last three months, I'm correspondingly disappointed with the quarter financially, but remain resolute. I'm confident that we're on the right path.\n\nWe're working hard on it across the organization and are making modified progress on all the important fronts. I'm particularly pleased with our great team, including our new center-based and enterprise leaders. As with all significant transformations, solid outcomes are always preceded by a compelling strategy, laser focus, effective execution, and a team with the right attitude and perseverance. It may take time, but thanks to the efforts and support of our internal team and partners, my conviction that we'll succeed, grows every day.\n\nOperator, with that, we can now open the line for Q&A. \n\nOperator\n\nThank you. [Operator instructions] Please stand by while we compile the Q&A roster. And our first question comes from the line of Jason Cassorla from Citi. Your line is open.\n\nJason Cassorla -- Citi -- Analyst\n\nGreat. Hey, guys. Thanks for taking my questions. Just on the census front, the breakdown of the 6% decline in sanctioned markets versus the 3%, I call it net growth in nonsanctioned markets, if I heard that right, was definitely helpful.\n\nAnd you highlighted investing in resources in those nonsanctioned markets to grow census. So maybe in that context, can you just delve a little bit deeper into the investments in those nonsanctioned markets? And if those investments can be made in sanctioned markets once those are lifted, as well as what kind of capacity you have in those nonsanctioned centers that continue to grow at that level. And then if we should think about that 2% level of sequential decline in the steady-state environment until the audits are remedied. Or any color around forward census trends that we should consider would be helpful.\n\nThanks.\n\nPatrick Blair -- President and Chief Executive Officer\n\nWell, thank you, Jason. Great question to get us started. I'll start with some of the investments we've made in our nonsanctioned markets to help drive growth while we're under sanctions, in a couple of our key markets. The first I'd point to is we've been very selective in adding a few sales leaders to the organization.\n\nWe added a new Chief Sales and Marketing Officer that comes with a long track record of driving growth in senior programs. And he's done a great job of really sizing up the sales organization and making changes where appropriate, as well as building a much stronger accountability model as it relates to making sure we're out in the market, and we're doing everything we can to make seniors in the community aware of PACE. We've also made a number of investments in our CRM system, which just, again, helps with accountability, helps with throughput, and the acceleration of sales activity from building awareness all the way through to enrollment. And I'm also really excited about the work that our sales team is doing now with our clinical leaders to make sure that we are very focused on making sure that every individual that joins InnovAge is a good fit for the program.\n\nSo, a lot of great work and a lot of great investment in that area. I think these are investments that we've also started to make and apply to other markets. So, while we're still under sanction in Colorado and Sacramento, we still began to roll out these changes and ensure that once the sanctions are lifted, we're really committed to as fast a ramp up back to historical levels of productivity than we've seen in the past. So, there's a very focused effort to get to ramming speed, so to speak, for our sanctioned markets once they are released from sanctions.\n\nSo let me ask Barb to comment as well.\n\nBarb Gutierrez -- Chief Financial Officer\n\nHi, Jason, it's Barb. So, a couple of things if I make sure I caught all your questions, but if I didn't, please let me know. So, I think one of your questions was around the disenrollment rate. And maybe just reading between the lines, does that differ between the sanctioned and nonsanctioned locations, and it doesn't.\n\nSo that 2% on average, 2% per month on average is just pretty typical across all of our centers regardless if they're on sanction or not. And then I think your second part of your question was a little bit about capacity in our centers. And so generally speaking, we have said for -- since we went public that we do have capacity in our existing centers. So part of our growth strategy is around that organic growth, and we do have capacity in our existing centers kind of ranges depending on the center and the size.\n\nBut generally, we've got about 50% capacity across the enterprise in order to grow. So we do have a lot of organic growth capacity.\n\nJason Cassorla -- Citi -- Analyst\n\nGot it. And then just really quickly on a follow-up there. Just the 2% level of sequential decline in aggregate. Is that a fair way to think about the steady state kind of declines until we kind of get on the other side of these sanctions at this point? Or are there other nuances that we should be thinking about just as we think about the go forward?\n\nBarb Gutierrez -- Chief Financial Officer\n\nYeah. I think it's in that range to a little bit more neutral. So, I think to really bifurcate what's going on, right, is that we have natural disenrollment in every center. And in about half of our business, we're not enrolling new participants, but we are growing in the other half of our business.\n\nSo, I think Patrick referred to those -- we kind of referred to those low single-digit kind of increases net-net. So, it's kind of in that range, going forward.\n\nJason Cassorla -- Citi -- Analyst\n\nGot it. OK. That's extremely helpful. Thank you.\n\nAnd then just as my follow-up here, just on your balance sheet cash position. Maybe just to start, it looks like capex spending in the fourth quarter almost doubled compared to what you've done in the previous nine months leading up to the fourth quarter. So maybe just to start, where was that capex allocated? Was it generally just related to audit remediation activities or was it for other areas? And then just as a follow-up, obviously, your remediation is top of mind, but you're hanging out right now with over $180 million in cash, only about $86 million of debt on the balance sheet. Are there ways you can leverage that cash position for investments or otherwise? Or will you kind of be taking more of a wait-and-see approach perhaps until the audits are completely remedied at this point? Just any color on spending priorities, just given your pretty hefty cash position and the audit remediation considerations, anything there would be helpful.\n\nThanks.\n\nBarb Gutierrez -- Chief Financial Officer\n\nYeah, sure. So, one thing on the de novo is just to clarify, I used the wrong proposition. So, the $2.7 million should have been through the fourth quarter, not in the fourth quarter. So that $2.7 million related to de novo was composed primarily in Tampa and Orlando.\n\nSo that's where the investments are being made. In terms of the cash position, yes, you're right, we're fortunate. We have a fair bit of cash on the balance sheet. We are always looking to optimize how we invest that, and we definitely are looking at ways how to optimize that investment.\n\nBut I think in terms of what we do long term, it is a little bit more of that wait and see. We're really trying to be focused on investing in the business and stabilizing the business so we can turn around and grow. And so, it is a little bit more of that wait and see in terms of the cash approach.\n\nJason Cassorla -- Citi -- Analyst\n\nOK. Thanks. \n\nOperator\n\nThank you. One moment for our next question. Our next question will come from the line of Sarah James from Barclays. Your line is open.\n\nSarah James -- Barclays -- Analyst\n\nThank you. So, it sounds like you guys are having a lot of productive conversations with regulators at the state and federal level. And I'm wondering if they're giving you a sense of what went on, how much of it was really across the industry and COVID versus what was company-specific?\n\nPatrick Blair -- President and Chief Executive Officer\n\nWell, thank you, Sarah. This is Patrick. Our conversations with our regulators, both CMS and the states are very focused on InnovAge and very focused on the work we're doing and the work we're collaborating on to address the deficiencies identified in the audit. The notion of what's happening in the broader industry related to PACE and the impact of COVID or anything related to similar deficiencies.\n\nIt's just not a conversation that we're focused on. We've really stayed focused on our own work with the regulators and are really pleased, as you said, really pleased with the progress that our teams are making, and I can't say enough about the collaboration that we're getting from our regulators.\n\nSarah James -- Barclays -- Analyst\n\nRight. And then it sounds like you guys are making a number of changes that are going to have a long-term impact. There's some on the staffing and wage side that could be a longer-term headwind, but then it sounds like there's a lot of efficiency and cost of care initiatives that can be a tailwind. How do you think about your long-term margin evolving?\n\nPatrick Blair -- President and Chief Executive Officer\n\nMaybe I'll start, and then I'll give it to Barb. Well, I think we still hold a lot of confidence that we can achieve a very attractive margin profile for the company going forward. As we discussed before, our center level costs are a smaller percentage of our total cost than our external provider cost. And so, the notion is, yes, it may require more investment in our centers than we've made in the past, but we feel very confident that there is a significant opportunity for us to get an ROI from those investments by doing a much better job on managing our external provider cost.\n\nAnd so, we feel very confident that that's a formula that we can execute on, and we're already starting to see some wonderful progress on the part of our teams. Barbara, anything you'd like to add.\n\nBarb Gutierrez -- Chief Financial Officer\n\nNo. I think just to sum up, Patrick, I think, Sarah, that we did have some -- we've had some headwinds in FY '22 really related to some COVID expense and expense labor market challenges, no different than the broader industry. And so, we're really focused on these other initiatives, the payer initiatives and the operational initiatives to turn the tide here to be accretive to our overall margin profile going forward. So, a little early to tell.\n\nWe've really been in the assessment phase and the planning phase, if you will, and we're moving into the execution phase. So, a little early to tell that that will -- quantify how much of that will have an impact on our margin, but we're [Inaudible] more margin.\n\nSarah James -- Barclays -- Analyst\n\nGreat. And last question is just on the contract labor you guys talked about. Could you give us an idea of what percent of your clinical staff is contract labor now versus pre-COVID? And is there any way to size the dollar impact from that?\n\nBarb Gutierrez -- Chief Financial Officer\n\nI'll make some just real high-level estimation. So, I think that we don't think that it's any higher now than I think it was previously. I mean, I think it's just proportional to the overall labor market. I think as a percent, it's probably about under 10% of our overall workforce.\n\nSo, I think it's just one -- it's one component. Obviously, it's a more expensive component, and we've obviously used that to backfill in places for critical roles.\n\nSarah James -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question will come from the line of Jamie Perse from Goldman Sachs. Your line is open.\n\nJamie Perse -- Goldman Sachs -- Analyst\n\nHey. Good afternoon. I was hoping we could start with Sacramento and some of your comments there. First, the five months of being on target with performance, what specifically are you tracking there? And maybe just any incremental color you can give on what does the metrics you're tracking and how the key ones are faring versus your targets?\n\nPatrick Blair -- President and Chief Executive Officer\n\nSure. Thank you, Jamie. I would start with my opening remarks that we are using a set of measures that we jointly developed with CMS and our state partners. The sorts of things that you would see in those measures are things related to ensuring service orders are scheduled and provided timely that participant or caregiver requests are identified and appropriately documented.\n\nThere's measures related to care plan timeliness and completion. There's measures related to the frequency of our assessments consistent with our care plan development with our members. And then things related to just the responsiveness of our interdisciplinary team overall. So it's a variety of measures that we jointly developed with our regulatory partners that really have formed the foundation for understanding our progress in a common language between InnovAge and our partners.\n\nAnd as you mentioned, in Sacramento, in particular, we've had some very strong and consistent performance over the last several months. And that progress is being acknowledged by our regulatory partners, and we're in close conversations to determine what are the next steps necessary to enter the validation phase, which is the final phase before sanctions can be released. But the timing of that, as we said many times, still resides with the regulators.\n\nJamie Perse -- Goldman Sachs -- Analyst\n\nOK. Thanks for that. One other quick one just on the comments related to higher costs associated with longer tenure patients on the platform. My sense is that the revenue associated with those patients is also higher.\n\nSo, can you talk to what the margin profile or patient contribution profile of patient looks the first couple of years on the platform versus as they are more tenured on the platform? Any color on that would be great.\n\nBarb Gutierrez -- Chief Financial Officer\n\nYeah. Hey, Jamie, it's Barb. So just -- I'll just jump on it. So really, this is really nothing different than analyzed over time over this period.\n\nAnd that is as participants age in the program, they become more frail for our services and often are at a different higher cost setting. So that's really what we're referring to. I think without putting any numbers to it. I think you get the concept that those higher cost settings, obviously are -- erode our margin on those because of that.\n\nNow to your point about, do we get more revenue related to that? To some degree. On the Medicare aspect, their risk scores are increasing, so to some degree, we get more revenue. But on the Medicaid aspect, which really pays for those [Inaudible] costs, that's not necessarily risk adjusted. And in fact, it's not risk adjusted.\n\nSo, we get some revenue to some degree, but not commensurate with necessarily the needs of that population.\n\nJamie Perse -- Goldman Sachs -- Analyst\n\nOK. Thank you for the color. \n\nOperator\n\nThank you. Our last question comes from the line of Madeline Mollman William Blair. Your line is open.\n\nMadeline Mollman -- William Blair -- Analyst\n\nYes. Hi. Thank you so much for taking my question. I would just ask two things.\n\nOne is we're curious about the impact of inflation on your costs, particularly related to fuel and transportation. And I know that you said the 2023 rate is pretty much set. But going forward, would -- if inflation remains elevated, is there any room for you to negotiate rates or to work with CMS to take inflation into account? \n\nPatrick Blair -- President and Chief Executive Officer\n\nWell, thank you for the question. And yes, this is an important part of our discussions with our state partners actually throughout the year. And certainly, as we're in the midst of a rate-setting cycle, is to ensure that the discretion that states have to address the cost that we're experiencing inflationary costs, as you referred to, is a critical part of all those conversations. It's something we pushed very hard for.\n\nI think Colorado was probably a good example of very successful discussions with our partners on what's driving our cost. But with that, let me ask Barb to punctuate.\n\nBarb Gutierrez -- Chief Financial Officer\n\nYeah. And I think in addition to what Patrick just said, some of the things that the states have actually done, certain states, we've received those ARPA funds. And in fact, that is meant to help us cover those inflationary costs, whether it's wage rates or whatever it might be. The states have some discretion on how they allocate those funds, but we have received ARPA funds from both -- from a number of states, Colorado, in particular, that Patrick was just referring to really folded that into our rates effective July.\n\nSo, I think that's one of the ways we cover it.\n\nPatrick Blair -- President and Chief Executive Officer\n\nI might just add one closing thought on that, is that it's important to recognize there can be some lag between when we're experiencing those costs and reporting those costs and when they're actually recognized in our rates. So sometimes, we don't have a tight matching between our inflation and the state's rates. So, I just wanted to add that as well. \n\nMadeline Mollman -- William Blair -- Analyst\n\nThank you so much. OK. [Inaudible] dialed in for Matt Larew. One other quick question.\n\nI know you said that you voluntarily sort of paused progress on your centers in Florida, but I was curious if you are -- when you decide to continue pursuing de novos, will you try to retain approval in states such as Indiana, California and Kentucky that you previously had planned to? Or are you going to pursue new states?\n\nPatrick Blair -- President and Chief Executive Officer\n\nWell, I'd like to separate those into different buckets. California being an existing state, I would just reinforce, there are several markets in California that are very attractive to us, and we've made inroads and progress in a handful of markets. And when we're in a position to be released for sanctions, we'll certainly be pushing to move quickly on opportunities that may exist. Still work to do, but we'll certainly treat California as priority.\n\nThey have a lot that they're looking to accomplish with long-term care type services, and we're going to be a great partner to them. Kentucky and Indiana are also a bit different. Kentucky is a market where we've actually already invested in a center there, and we're beginning to think through what are our options and what is the timing in Kentucky, that's still a very attractive center for us. And then Indiana is another market that is certainly attractive, but we've not made final decisions about how to proceed in Indiana, and we're working through that as we speak now, but very much interested in de novo expansion when the time is ripe and when we feel confident, we have the support of our regulatory partners.\n\nMadeline Mollman -- William Blair -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThank you. Now I'd like to turn the call back over to Patrick Blair for any closing remarks.\n\nPatrick Blair -- President and Chief Executive Officer\n\nWell, thank you very much, operator. And before we close, I just wanted to take a minute to just reinforce how much we've accomplished as an organization over the last seven to nine months. I'm just extraordinarily proud of our team and their unwavering commitment to the company; that continues today. I believe our future is very bright and the path forward is clear.\n\nIt's our commitment to continue to bring clarity during this transitional period to all of our stakeholders as we have relevant updates to share. And with that, I'll close and thank everyone for their continued interest in InnovAge. Have a good evening. \n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRyan Kubota -- Director of Investor Relations\n\nPatrick Blair -- President and Chief Executive Officer\n\nBarb Gutierrez -- Chief Financial Officer\n\nJason Cassorla -- Citi -- Analyst\n\nSarah James -- Barclays -- Analyst\n\nJamie Perse -- Goldman Sachs -- Analyst\n\nMadeline Mollman -- William Blair -- Analyst\n\nMore INNV analysis\n\nAll earnings call transcripts"
}