{
  "companyName": "Nio Inc.",
  "companyTicker": "NIO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/nio-inc-nio-q3-2022-earnings-call-transcript/",
  "content": "Nio Inc. (NIO -2.40%)\nQ3 2022 Earnings Call\nNov 10, 2022, 7:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by for NIO Inc. third-quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode.\n\nToday's conference call is being recorded. I will now turn the call over to your host, Ms. Eve Tang from Capital Markets. Go ahead, Eve. \n\nEve Tang -- Investor Relations\n\nGood morning, and good evening, everyone. Welcome to NIO's third-quarter 2022 earnings conference call. The company's financial and operating results were published in the press release earlier today and are posted at the company's IR website. On today's call, we have Mr.\n\nWilliam Li, founder, chairman of the board, and the chief executive officer; Mr. Steven Feng, chief financial officer; Mr. Stanley Qu, senior vice president of finance. Before we continue, please be kindly reminded that today's discussion will contain forward-looking statements made under the safe harbor provisions of the U.S.\n\nPrivate Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties. As such, the company's actual results may be materially different from the views expressed today. Further information regarding risks and uncertainties is included in certain filings of the company with the U.S.\n\nSecurities and Exchange Commission, the Stock Exchange of Hong Kong Limited, and the Singapore Exchange Securities Trading Limited. The company does not assume any obligation to update any forward-looking statements, except as required under applicable law. Please -- please also note that NIO's earnings press release and this conference call include discussions of unaudited GAAP financial information, as well as unaudited non-GAAP financial measures. Please refer to news press release, which contains a reconciliation of the unaudited non-GAAP measures to comparable GAAP measures.\n\nWith that, I will now turn the call over to our CEO, Mr. William Li. William, please go ahead.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Hello, everyone. Thank you for joining NIO's third-quarter 2022 earnings conference call. [Foreign language] In the third quarter of 2022, NIO delivered a total of 31,607 smart electric vehicles, up 29.3% year over year, setting a new quarterly high. [Foreign language] Based on our latest technology platform, NT2.0, we have launched and delivered three new products, which has improved the competitiveness of our product lineup in all aspects and enabled NIO to enter more premium segments, capitalizing continuous demand growth.\n\n[Foreign language] In October, overcoming the production and supply chain volatilities, we delivered 10,059 vehicles, representing a 174.3% increase year over year. We will continue to collaborate closely with our supply chain partners to stabilize components supply and further accelerate the vehicle production and delivery. We expect that the total number of deliveries in the fourth quarter of 2022 to be between 43,000 to 48,000. [Foreign language] Next, I would like to share some recent highlights of our R&D and operations.\n\n[Foreign language] In September, at the show cars of ET5, a smart electric midsize sedan began to be on display in our stores. Store traffic reached a record high, and order intake witnessed a strong growth momentum. On September 30, we officially kicked off the delivery of ET5, and the preliminary user satisfaction rate exceeded our expectations. [Foreign language] Over the past couple of months, Banyan, the digital system of NT2, has iterated and upgraded multiple times with continuous user experience improvement.\n\nWe have strong confidence in the market competitiveness of the new models based on the NT2 platform. [Foreign language] With respect to the sales and service network, we now have 399 new houses and new spaces in 149 cities and 280 service centers and delivery centers in 163 cities. [Foreign language] In terms of the charging and swapping network, NIO has installed a total of 1,210 power swap stations and provided 14 million battery swaps for users. NIO has installed 2,065 charging stations with 5,765 power chargers and 6,077 destination chargers in place.\n\nIn the meantime, our power map has connected to over 590,000 third-party chargers in China and more than 380,000 chargers in Europe. [Foreign language] Since we entered the Norwegian market the last September, our products and services have been well-received by local users, and the user community has been growing rapidly, which has laid a solid foundation for and boosted our competency in entering more markets in Europe. [Foreign language] On October 7 this year, we held NIO Berlin 2022, where we comprehensively introduced our products and the services to users in Europe, marking our official market entry in Germany, the Netherlands, Denmark, and Sweden. [Foreign language] NIO Berlin drew a lot of attention and recognition from users and the auto industry in Europe.\n\nWe are now organizing large-scale test drives and kicked off user delivery in Europe. [Foreign language] Yesterday, NIO ET7 won the 2022 Golden Steering Wheel award granted by the prestigious German magazine, Auto Bild, as ET7 was voted the best car in the medium and upper-class category. Both our products and innovative technology have been highly recognized by the users, industry experts, and professional media in Europe. [Foreign language] To better serve user communities in Europe, we plan to open new houses and new spaces in 10 major European cities, such as Berlin, Frankfurt, Rotterdam, Copenhagen, and Stockholm.\n\nWe also plan to install 20 power swap stations in Europe by the end -- by the year-end and another 100 by the end of 2023 so that more users can experience NIO's chargeable, swappable, and upgradable power system in Europe. [Foreign language] In addition, we have established an R&D center in Berlin for localized development and deployment of digital cockpits and [Inaudible] to continuously improve the intelligent digital experience of local users. [Foreign language] On September 27, NIO announced the collaboration with Danish Society for Nature Conservation and to the Danish Nature Foundation on the Clean Parks initiative. NIO hopes to actively engage with the local communities, share the responsibilities, and jointly make contributions to a more sustainable future.\n\n[Foreign language] On September 30, upholding NIO's original aspiration of Blue Sky Coming, NIO released the first new Environmental, Social, and Governance Report 2021, where NIO shared it's ESG management practices and performance in 2021. [Foreign language] In 2022, NIO has further advanced in product core technologies, charging and swapping networks, as well as the sales and service network, which has laid a solid foundation for us to compete in the global market for the long run. In spite of the operation challenges brought forward by the changing macro environment, we believe that NIO is fully capable of staying focused on product and the technology innovations, as well as service capability improvement, while further optimizing the cost of structure and improving operational efficiency to introduce more beyond experience products and services to users worldwide. [Foreign language] As always, thank you for your support.\n\nWith that, I will now turn the call over to Steven to provide the financial details for the third quarter of 2022. Over to you, Steven.\n\nSteven Feng -- Chief Financial Officer\n\nThank you, William. I will now go over our key [Technical difficulty] for the third quarter of 2022 and be mindful of the length of call. I will reference RMB only in my discussion today. I encourage [Inaudible] to refer to our earnings press release, which is posted online for additional details.\n\nOur total revenues in the third quarter were 13.0 billion RMB, representing an increase of 32.6% year over year and 26.3% quarter over quarter. Our total revenues are made of two parts: vehicle sales and other sales. Vehicle sales in the third quarter were 11.9 billion RMB, representing an increase of 38.2% year over year and 24.7% quarter over quarter. The increase in vehicle sales year over year and quarter over quarter was mainly attributed to higher deliveries as a result of more diversified product mix offered to our users.\n\nOther sales in third quarter were 1.1 billion RMB, representing a decrease of 8.5% year over year, an increase of 48.2% quarter over quarter. The decrease in other sales year over year was mainly due to the decreased revenue derived from sales of automotive regulatory credit, offset by the increase in other revenues in line with the incremental vehicle sales. The increase in other sales quarter over quarter was mainly attributed to the increased revenue derived from sales of automotive regulatory credits and increase in other revenues in line with incremental vehicle sales. Gross margin in the third quarter of 2022 was 13.3%, compared with 20.3% in the third quarter of 2021, and 13% in the second quarter of 2022.\n\nThe decrease of gross margin year over year was mainly attributed to, first, the decreased revenue derived from sales of automotive regulatory credits with high sales and margin; second, the decrease of vehicle margin; and third, the reduction on the sales margin resulting from expanding investment in power and service network. The increase of gross margin quarter over quarter was mainly attributed to sales of automotive regulatory credits with high sales margin. [Inaudible] vehicle margin in the third quarter was 16.4%, compared with 18% in the third quarter of 2021, and 16.7% in the second quarter of 2022. The decrease of vehicle margin year over year was mainly attributed to the increased battery cost per unit, which was partially offset by the decrease in subsidization in user vehicle financing arrangements.\n\nVehicle margin remained stable quarter over quarter. Our R&D expenses in the third quarter were 2.9 billion RMB, representing an increase of 146.8% year over year and 37% quarter over quarter. The increase in R&D expenses year over year and quarter over quarter was mainly attributed to the increased partner costs in research and development functions, as well as incremental design and development costs for new products and technologies. SG&A expenses in the third quarter were 2.7 billion RMB, which is an increase of 48.6% year over year and 18.8% quarter over quarter.\n\nThe increase in SG&A expenses year over year and quarter over quarter was primarily due to: first, the increase in personnel costs related to sales and general corporate functions; second, increased expenses related to the company's sales and service network expansion; third, increase in marketing and promotion activities to promote our vehicle in China and Europe. Loss for operation in the third quarter were 3.9 billion RMB, representing an increase of 290.2% year over year and 36% quarter over quarter. Other losses in the third quarter of 2022 was 495.6 million RMB, representing an increase of 528.2 million RMB from other income of 32.6 million RMB in the third quarter 2021, an increase of 305.6 million RMB on the second quarter of 2022. The increase of other losses over the third quarter of 2021 and second quarter of 2022 was mainly due to the loss from the revaluation of our oversales RMB-related assets as a result of the depreciation of RMB against U.S.\n\ndollars in the third quarter of 2022. Net loss in the third quarter was 4.1 billion RMB, which is an increase of 392.1% year over year and 49.1% quarter over quarter. Net loss, attributable to NIO's shareholders in the third quarter of 4.1 billion RMB, represent an increase of 44.9% year over year and 50.9% quarter over quarter. Our balance of cash and cash equivalent, restricted cash, short-term investment, and long-term deposits were 51.4 billion RMB as of September 30, 2022.\n\nNow, this concludes our prepared remarks. I will now turn the call over to the operator to proceed our Q&A session.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] For the benefit of all participants in today's call, please limit yourself to two questions. And if you have additional questions, you can reenter the queue.\n\nAt this time, we will pause momentarily to assemble our roster. Our first question comes from Ming-Hsun Lee from Bank of America.\n\nMing-Hsun Lee -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] Previously, your capacity is capped by component suppliers, especially the welding part, as well as the chips. So, could you also update your latest capacity -- component capacity, if there is no COVID control impact? Thank you.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you, Ming, for your question. Yes, regarding the production in October, there has been some impacts due to several reasons, and the impact is around several thousands. One, the factor is because of the subframe, like you mentioned, but we expect that this will be resolved in November. And then, the second reason is the new EDS for ET5.\n\nWe actually have a new EDS plant next to our Factory 2, and the automation level of the new EDS fund is very high. We only need to have around 30,000 people to support the overall operation of these new EDS plants. Due to the ramp-up volatilities of the EDS, overproduction is affected by around 2,000 to 3,000. And the third reason is the COVID-19 situation.\n\nI believe this has impacted the production for around one week. So, of all speaking, all those factors have affected the production in October, but we have resumed normal production now, and we expect to have a new production line for the new EDS next week. And probably by the end of this month, this new EDF line will be ready, and we can ramp up the production. We have already solved the subframe issue.\n\nAnd I believe, probably in December, ET5 production will not be an issue. And as of now, I don't believe there is any production issue for the ET7 and the ES7.\n\nMing-Hsun Lee -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] The U.S. semi-ban, how will this impact the development for the industry and also NIO? Besides NVIDIA currently can sell A800 chips to China if compared to A100, how do you see the impact to the progress of our autonomous driving training? [Foreign language]\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you for your question. Regarding the Chips Act, I believe that this may affect the chip used for cloud training. Right now, I believe that we have sufficient chips like the A100 to satisfy the need for the AD training in the long run. But at the same time, we are also exploring different opportunities.\n\nFor example, where considering working together with some cloud service providers, and we are also evaluating some long-term solutions to support the integration of our AD solutions. As of now, I don't actually see any impact on overall operations. [Foreign language]  \n\nMing-Hsun Lee -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language]\n\nOperator\n\nOur next question comes from Paul Gong with UBS. Please go ahead.\n\nPaul Gong -- UBS -- Analyst\n\n[Foreign language] So, my first question is regarding the ET5 order. Just now, you mentioned that the satisfaction level has beat your expectations, but you didn't mention how the order intake has been. How do you see the order intake since the launch and especially after the late October after Tesla launch, another wave of price cuts. Do you see any impact from there? This is my first question.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you, Paul, for your question. Of course, I understand regarding the ET5 orders, the more important thing for us is, right now, to find a way to deliver the ET5 users and shorten the waiting time for the users. So, generally speaking, order is not an issue for us regarding the ET5. Regarding the ramp-up of ET5 because this is still at a relatively early stage, so we would like to pay more attention to the quality improvement and make sure we can stabilize the quality of the ET5, the demand for ET5 is very strong as we expected.\n\nOf course, if a strong -- if the order can be even stronger, the stronger the better. But it -- but, at the same time, we don't want the user to wait for a really long time. If we come back to Tesla, Tesla often cuts its prices. So, we don't actually think this affects the users demands regarding new products.\n\nIf we look at the specific product, like the Model 3, there is a big price gap compared with other products. And if we compare the Model Y with ES6, we don't actually believe that we are competing in the same segment. So, if we look at the pricing of our product and the positioning of our product, strictly speaking, we're not competing with Tesla in the same segment.\n\nPaul Gong -- UBS -- Analyst\n\n[Foreign language] So, my second question is regarding the expenses, including both R&D and SG&A. It seems to be climbing up a lot Q on Q this quarter. Is that just temporary because you have new products and trying to explore the new market in Europe? Or is it more like structural? And if so, what is your expectation for its trend going forward? \n\nStanley Qu -- Vice President, Finance\n\nHi, Paul. This is Stanley. The increase of SG&A in Q3 compared with Q2 is because our sales and service network in China and also in Europe since we entered more country market in Europe this third quarter and also some marketing and promotion activities -- more marketing and promotion activities in Q3 compared with Q2. For the long term, I think -- also you can check with -- you can check this result from Q3.\n\nSG&A as a percentage of sales revenue will continue to be optimized along with the improvement of our operation efficiency. I think in 2023 and also the coming years, you will see a stable trend for further improvement of this issue. Thank you, Paul.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Regarding the R&D expenses, yes, we do see some increase in the third quarter compared with the second quarter. This is mainly because of our new product development cadence, as well as other initiatives like the battery chipsets and the test and the validations when we enter new markets, as well as the employee cost and the ETD cost. This is actually part of our or plan, and we don't think that there is any other additional R&D expenses that is out of the planning of the company. [Foreign language] Regarding the R&D operations, I believe, right now, we have entered a relatively stable phase regarding the R&D development work, as well as the operations.\n\nSo, for us, we believe when it comes to the R&D expenses, including the human resources cost, it will stay at a relatively stable level. For example, probably every quarter, it should be around 3 billion RMB. Of course, at the same time, we will continue to improve the system efficiency of our R&D efforts and -- but for some time -- for now, I believe it will stay at this level to make sure we can have more product and technology innovations to provide better experience for the users. [Foreign language]\n\nPaul Gong -- UBS -- Analyst\n\n[Foreign language] So, what is roughly the ratio of Europe accounts for this quarter? \n\nStanley Qu -- Vice President, Finance\n\nYes. Hi, Paul. Europe is now at quite an initial stage. So, currently, the overall expense is not a big percentage of the overall SG&A.\n\nNow, the -- the sales and marketing team for our Europe business is about 500 headcount. So, yeah. That's basically the information for our Europe business.\n\nPaul Gong -- UBS -- Analyst\n\nOK. Thank you very much. [Foreign language]\n\nOperator\n\nOur next question comes from Tim Hsiao with Morgan Stanley. Please go ahead.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] So, my first question is about the production and delivery. So, I think based on the fourth quarter guidance, basically, the average delivery in November, December could be around 17,000 to 19,000. So, what would be the peak monthly output NIO can reach by end of this year? And how does the trajectory looks like into first half next year with the supply chain bottleneck [Inaudible] issue, given the unchanged COVID policy, and more new model, new players, and a likely longer time for supplier to expand their capacity to improve their production yield? [Foreign language]\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] [Inaudible] it's quite difficult for us to make estimation regarding the impact of the COVID control and prevention measures on the operation of the company. But if we talk about the supply chain and the vehicle production, I believe the vehicle production, typically, we should be able to meet the delivery target with that for next year. And if we speak of the supply chain, we do see some challenges. For example, in December, we will face some constraints regarding the supply of the silicon carbide.\n\nBut if we look at 2023, I believe the supply chain and the production capacity have the ability to meet the demands and the target we set up for ourselves. [Foreign language] For 2023, I believe for the vehicle production, we will be -- have -- we will have a relatively sufficient production capacity to meet the demand. And if we can achieve a 150,000 production capacity on one shift, I believe the production of the vehicle will be carried out in a very smooth manner.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] So, my second question is about the profitability because based on our own observation, we noticed the life cycle of smart EV in China is actually getting shorter rather than longer than traditional cars. So, considering the very sizable R&D and manufacturing investment, what would be the more reasonable terminal growth or operating margins should we -- we should look for, especially, I think the competition is getting more intense? Thank you.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you for your question. Regarding the smart electric vehicles, I believe we have a much faster iteration cycle compared with the traditional vehicles. And we believe the iteration cycle should be around three years. And this is how we iterating our smart technologies in NIO.\n\nOf course, different companies have different strategies and the different iteration cycles. But in NIO, if we look at our technology platforms -- and we believe with one technology platform, so we actually have the same kind of hardware and software for all the vehicles based on data technology platforms. So, for example, previously, we have explained, we have the NIO Technology 1.0 and the NIO Technology 2.0 for all the products. Based on NIO Technology 1.0, they have the same kind of software and hardware when it comes to the smart technologies, and that's the same for NIO Technology 2.0.\n\nAt the same time, we also have the unified battery pack, and we also share a lot of commonalities when it comes to the vehicle platforms. Of course, previously, we mentioned we would like to offer different kind of [Inaudible] to meet the diversified demands and take for different users. So, if we think about the technology platforms and of vehicle platform strategy, I think the 20% to 25% vehicle gross margin is not a very big challenge for us. But if we look at 2022, specifically, the cost of the battery skyrocketed.\n\nSo, of course, at the same time, we have increased the price of our products. And even against this backdrop, we have, I believe, achieved a relatively reasonable vehicle gross margin. Previously, we have also achieved a 20% vehicle gross margin in the past. Like in the past, we didn't have the battery cost increases.\n\nSo, this is a relatively reasonable vehicle gross margin for our products. In the future, if the battery cost can come down to a reasonable level, I think it's possible for us to regain the 20% to 25% vehicle gross margin with our product. In addition to that, with our vehicle technology vertical integration, including the battery, the chipset, I believe we will have more room to improve for the vehicle gross margin, and it's possible for us to achieve a 25% to 30% vehicle gross margin. If we look at the mass market, I believe the challenge is much bigger because if we combine all the companies in the mass market right now, I think the overall gross margin is actually negative.\n\nOf course, BYD is an exception because they have the vertical integration of the batteries and other technologies. So, if we do not have the vertical integration capabilities in the mass market, it will be quite challenging to survive in the mass market. But if we have these capabilities in place, I think it's possible for us to also achieve 20% to 25% with other mass market products. Thank you, Tim.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language]\n\nOperator\n\nOur next question comes from Bin Wang with Credit Suisse. Please go ahead.\n\nBin Wang -- Credit Suisse -- Analyst\n\n[Foreign language] My question, first one is about your guidance. You're actually asking [Inaudible] Number one, the ET5 will be higher volume than BMW 3 Series? And then, two, guidance in start, you will break even in the number four quarter next year. And number three, guidance in start this year, you have an 18% to 20% gross margin for the vehicle. Did you maintain its guidance for this quarter? Thank you.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you, Bin, for your question. Of us speaking, that's still the direction we're aiming for. For the core business of NIO, we are still aiming to achieve breakeven in the third quarter of 2023, and this is still our plan. At the same time, we're also working on different strategic new business.\n\nFor example, we have two new brands and the battery chipset and the smartphone business at the same time. So, if we look at 2023, the investment for those strategic new business is going to be around 3 billion RMB to 4 billion RMB. It means that probably around 1 billion RMB every quarter. If we take all those strategic NIO business aside, we are still very confident to achieve breakeven for NIO core business in the fourth quarter of 2023.\n\n[Foreign language] So, for the second question regarding ET5, you mentioned previously the -- one of co-founders mentioned that the ET5 volume is going to exceed the volume of the BMW 3 Series in an event. And of course, this is not a guidance, but because I believe ET5 is much, much better than BMW 3 Series, so we are very confident to achieve this target. [Foreign language] For the vehicle gross margin, in 2022, I believe there's still many challenges for us, especially when it comes to the lithium carbonate cost. Right now, the lithium carbonate cost is still stays at a very high level.\n\nPreviously, it has dropped to around 400,000 RMB, and now it's going back --actually reached a new high that is around 600,000 RMB. This has significantly affected the battery cost. And for us, this is actually out of our control, and it's very difficult for us to predict. But I believe we can still remain a relatively stable vehicle gross margin in the fourth quarter compared with the third quarter.\n\nFor the lithium carbonate cost, I would like to probably share some insights. I don't think that the price or the cost of the lithium carbonate is due to the supply situation. Because right now, if you look at the car companies in China, I don't think that there is any car companies that cannot deliver their products because of the battery shortage. So, of course, in the future, we believe the lithium carbonate cost will go down, but we cannot predict when.\n\nThis has a relatively big impact on us because for all of the products, we have a relatively high battery capacity. Averagely speaking, for each of our vehicles, the battery is around 80 to 90-kilowatt hours. So, if the lithium carbonate cost stays at a very high level, this is going to have a big impact on the vehicle gross margin. For us, maybe I can give you some numbers which will probably help you to understand the situation.\n\nIf we think about 100,000 RMB cost for the lithium carbonate, this is actually affecting our vehicle gross margin by around 2.02%. And if we can see the lithium carbonate cost drop from 600,000 to 400,000, then this is going to improve our vehicle gross margin by around 4%. So if the lithium carbonate cost can drop to even lower, probably around 100,000 RMB, which is a reasonable price for the lithium carbonate, then it means that our vehicle gross margin can improve by probably around 8%. So, this is the reality we are facing.\n\nBin Wang -- Credit Suisse -- Analyst\n\n[Foreign language] Actually, we [Inaudible] ET5 order today, you actually can only get the car in February or March. This is coupled with [Inaudible]products [Inaudible] Model 3. So, my question is about what Model Y [Inaudible] they launch a product called ET5 vehicle. And we see this going to be showcased in the upcoming NIO Day in December this year.\n\nThank you.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] So, for the product lineup in the first quarter of next year -- in the first half of next year, we're going to have five new products. And I believe, probably, one of them is going to be like the Model Y2 Tesla like you mentioned. But for us, we focus more on the overall volume of all the product lineup. We are in the premium market segment.\n\nSo, our philosophy is to satisfy the diversified user demand with high efficiency. In the price range from 300,000 to 500,000, we will provide a different product to satisfy the diversified user demand and the taste. So, I believe that with our product lineup, we should be able to achieve a good overall delivery volume that can meet our expectations. I don't actually expect that one product can fill around over or probably can sell over 100,000 units in China.\n\nFor example, for ET5, if it can sell probably over 30,000 units per month, it's going to be a very common street car, and I don't think this is good for the ET5 or for NIO. [Foreign language] For the mass market, this is a different story. We just had a meeting today with the mass market team. And for us, we believe the mass market product can sell probably over 50,000 units per month for one model because this is different in the market segment and the different target user group.\n\nBin Wang -- Credit Suisse -- Analyst\n\n[Foreign language]\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\nThank you, Wang Bin.\n\nBin Wang -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Jeff Chung with Citi. Please go ahead.\n\nJeff Chung -- Citi -- Analyst\n\n[Foreign language] So, my first question is about the sales volume growth into November and December. So, in order to meet our medium quarterly target, 43,000 units and if the month-on-month improvement to be linear at around 37%, we should be reaching around 19,000 units monthly run rate by December. So, from which -- could you break down the volume of ET5? And the second question is if this ramp-up pace is going to be nonlinear with most of the wait happening concentrated in December, so could you tell us what kind of elements will be determined our run rate overshoot in December but not in November? Thank you.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you, Jeff, for your question. In November, we will do need some time to ramp up the production, including ET5, considering the factors I just mentioned like the EDF. In December, except the silicon carbide I just mentioned, I believe we will have more production compared with the production of November. Of course, in December, we hope that we can still achieve over 20,000 production run rate.\n\nJeff Chung -- Citi -- Analyst\n\n[Foreign language] I have no more questions. Thank you.\n\nOperator\n\nThe next question comes from Nick Lai with JPMorgan. Please go ahead.\n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\n[Foreign language] I have two simple question really. The first question is about the cash burn and capex [Inaudible] as we move into '23 and '24 and also take into account of incremental investment capex, as well as [Inaudible] The second question, again, is on the AI and chips price strategy. And if you can just talk about the potential automotive [Inaudible] if you have enough stock of NVIDIA A100 chips but also looking for carbon solution. That related algorithm, but what about the chips that's been used in the car? Thank you.\n\nStanley Qu -- Vice President, Finance\n\nHi, Nick. This is Stanley. As introduced by William and myself, we will further improve our SG&A operating efficiency. And furthermore, our R&D expense will keep stable compared with -- relatively stable compared with 2022.\n\nSo, operating, cash flow-wise, I think, we are quite optimistic to achieve a positive working like operating cash flow in future years. So, our cash burn mainly depends on the capital investment. Now, we are planning our next year's budget. And from the -- generally, I think the total [Inaudible] of capex in next year will not increase so significantly compared with this year.\n\nBut, you know, we are planning more like sales and service network. And also, we are planning more production and also supply chain capacity. So, at this moment, I won't give you the clear guidance. And we are also confident that our cash on hand can supply our ongoing operation until breakeven is finally achieved.\n\nThank you.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Of us speaking, we understand there are still many uncertainties in the market. But I believe with our current cash reserves and also the bank facilities, we should be able to support the company's operation until we breakeven. So, we don't think this is going to be a huge challenge for the company. [Foreign language] Regarding the chipset, previously, we have already addressed the AI training chipset that is the NVIDIA A100.\n\nAnd now, I would like to probably elaborate more on the onboard chipset. We are the first company in the world to launch our product that is equipped with NVIDIA orin which is actually six months earlier than other companies. We also have a very close collaboration with NVIDIA. But at the same time, last year, we have already kicked off the R&D of our AD chipsets.\n\nRight now, we have around 500 people working on the AD chipset. I believe is commonly acknowledged that AD chipset is closely coupled with the AD algorithm. If we can use the AD algorithm to define the design of the AD chipset, the overall efficiency can be significantly improved, which can also contribute to our vehicle gross margin. The overall progress of the AD chipset R&D is on track, and we have seen some positive achievement from the team. \n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\n[Foreign language]\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you. [Foreign language]\n\nOperator\n\nThe next question comes from [Inaudible] with CICC. Please go ahead.\n\nUnknown speaker\n\n[Foreign language] So, my first question is about -- in the current external environment, everyone encountered a lot of difficulties in production. So, in the longer term, will we consider switching from OEM mode to self-build production? Are there any difficulties in obtaining qualification and will it optimize our new product, the ramp-up speed or manufacturing cost? And my second question is regarding to R&D investment and capex, about the boundary of our in-house R&D. As we can see that in the third quarter, on the expense -- further expense extent to 2.8 billion RMB. So, considering the current capital market environment and the much more intense competition in Chinese EV market in a few years, will we adopt a more conservative strategy for R&D and capex? So, under what circumstances we will address our current strategy and whether our organization is flexible enough to adjust? And the last question is about just mentioned MPV models.\n\nSo, what do we think of the MPV market? Will we launch the new product pipeline in this segment in the future. That's all my three questions.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] For the Factory 2, we are still working together with JC. I believe our joint manufacturing corporation has been quite positive. Regarding the vehicle production, I believe the vehicle production capacity can support the company's delivery target in the short term. Previously, I've already mentioned that for one plant, we should be able to achieve 150,000 units under one shift.\n\nAnd if we combine the two plants together, the Factory 1 and Factory 2, then you need that under one shift we should be able to achieve a production capacity of 300,000 units. If we double this to two shifts, then the production capacity can also be doubled. When it comes to the supply chain, of course, there are some volatilities for the whole industry, not just for NIO. But as we ramp up our production capacity and delivery, I believe we have the capability to mitigate the risk of the supply chain.\n\nFor the second question regarding the boundaries of our investment. Previously, I have already mentioned we do have a sufficient cash reserve to support the company's operations. And when it comes to the overall investment for R&D, every quarter, we expect to have -- to invest around 300,000 RMB for -- 300,000 -- actually, for 3 billion -- sorry. Every quarter, we expected to invest around 3 billion RMB for R&D efforts.\n\nSo, this includes all the R&D initiatives we have explained previously. For the capex, we will improve the efficiency on the capex investment, and we do have a very strict management regarding the finance and the investment of the company.\n\nSteven Feng -- Chief Financial Officer\n\nOK. With regard to the MPV market, our strategy is very simple. In the short term, we have no plan to launch MPV model. Of course, long term, we'll keep watching this market.\n\nAlso look at that, this market is very hot. For the supply side, several Chinese brands have launched their high-end MPV model. But from the demand side, at least right now, the MPV segment still remains a rich market, but that's why we would like to keep watching and then see what to do in the next several years.\n\nUnknown speaker\n\n[Foreign language]\n\nOperator\n\nOur next question comes from Yuqian Ding with HSBC.\n\nYuqian Ding -- HSBC -- Analyst\n\n[Foreign language] I got two questions. First is to follow up on the margin side. So, next year's gross profit margin improvement, will that be mainly coming from the increasing economic scale? Could we have some quantification over there? Because we see -- from the mix side, with more ET5 in the mix could be coming down a little bit. And also, we talked about Q4 breakeven.\n\nIs that based on the current lithium price assumption or in our Q4 breakeven assumption that basically baking normalizing of the lithium price? And the second part is to ask what's the [Inaudible] pilot on the autonomous driving side with our timeline to push for [Inaudible] pilot. And when do we expect the -- our autonomous driving capability to improve from hub selling vehicle items to support materially on the margin side?\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Thank you, Yuqian, for your question. As of now, of course, the lithium carbonate cost is not going down as we expected in the fourth quarter. But like I explained previously, I don't believe this is a supply issue because if we look at the market right now, all the car companies can actually get sufficient supply of the batteries. For us regarding the lithium resources, we have seen some lithium resources enter the market in the past year -- in the past.\n\nAnd we expect probably next year, the cost of the lithium carbonate is going to be around 300,000 RMB to 400,000 RMB. When it comes to the budget planning of the company, of course, we would like it to be more conservative. So, our assumption is around 400,000 RMB. This is basically over judgment regarding the lithium carbonate cost probably for the next year.\n\n[Foreign language] For the autonomous driving, I believe we will still need some time to see the contributions of autonomous driving to the vehicle gross margin and the overall gross margin. There are several factors. Part is because of the feature and function development and partly because of the legislation. Recently, we do see some positive progress on the legislation front.\n\nFor example, MIT has launched some pilot programs for the autonomous driving, and for us, we believe it will still need probably one to two years to get mature when it comes to autonomous driving technologies and also the legislations. So, in the short term, we expect probably there will not be any significant contribution for -- from the autonomous driving to the vehicle gross margin and the overall gross margin.\n\nOperator\n\nOur next question comes from [Inaudible] with CITIC Securities. Please go ahead.\n\nUnknown speaker\n\n[Foreign language] So, my first question is about inventory. So, the inventory is around 6.7 billion RMB on Quarter 3. It is nearly doubled compared with Quarter 2. So, does this number imply around 10,000 more inventory cars on your balance sheet? My second question is about ET5.\n\nIt was really hot on September. But recently, we see some negative comments and news on the social media because of its poor performance on energy efficiency. So, I was wondering what your next move to deal with the consumers' concerns? Thank you for taking my questions.\n\nStanley Qu -- Vice President, Finance\n\nHi, [Inaudible] This is Stanley. For the inventory increase in Q3, I think mainly two reasons. One is about our increase of inventory cars in Q3. You know, our production was naturally impacted by our rear subframe in Q3, so we increased the production of ES6 and ET6 in Q3.\n\nSecondly, it's because of the increase of the component inventory to secure the production in the coming months. We stored more key materials like chips and also other raw materials in Q3. So, all those factors lead to the increase of our inventory stock.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Yes, for the ET5, different tires may have a different impact and the different performance when it comes to the -- our consumption. If the users choose a performance higher then the power consumption will be higher. But if the user choose the long-range tire or the low-resistance tire, then the power consumption performance is going to be much better. So, we would also like to remind our users, if you really enjoy driving and handling and you would like to experience the acceleration of ET5 within four seconds, then of course, you can go with the performance tire.\n\nBut if you care more about the drive range, then it's better for you to go with the long-range tire, which will have a much better performance when it comes to the range. [Foreign language]  \n\nOperator\n\nAs there are no further questions at this time -- as there are no further questions, now, I'd like to turn the call back over to the company for closing remarks.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\nThank you once again for joining us today. If you have further questions, please feel free to contact the NIO's investor relations team through the contact information provided on our website. This concludes the conference call. You may now disconnect your lines.\n\nThank you.\n\nDuration: 0 minutes\n\nEve Tang -- Investor Relations\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\nSteven Feng -- Chief Financial Officer\n\nMing-Hsun Lee -- Bank of America Merrill Lynch -- Analyst\n\nPaul Gong -- UBS -- Analyst\n\nStanley Qu -- Vice President, Finance\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nBin Wang -- Credit Suisse -- Analyst\n\nJeff Chung -- Citi -- Analyst\n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\nUnknown speaker\n\nYuqian Ding -- HSBC -- Analyst\n\nMore NIO analysis\n\nAll earnings call transcripts"
}