{
  "companyName": "LegalZoom.com, Inc.",
  "companyTicker": "LZ",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/legalzoomcom-inc-lz-q2-2022-earnings-call-transcri/",
  "content": "LegalZoom.com, Inc. (LZ -1.40%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the LegalZoom second quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Danny Vivier, head of investor relations.\n\nDanny Vivier -- Head of Investor Relations\n\nThank you, operator. Hello, and welcome to LegalZoom second quarter 2022 earnings conference call. Joining me is Dan Wernikoff, our chief executive officer; and Noel Watson, our chief financial officer. As a reminder, we will be making forward-looking statements on this call.\n\nThese forward-looking statements can be identified by the use of words such as believe, expect, plan, anticipate, will, intend, and similar expressions and are not and should not be relied upon as a guarantee of future performance or results. Results could differ from those contemplated by our forward-looking statements. We caution you to review the Risk Factors section of our reports and filings with the Securities and Exchange Commission for a discussion of factors that could cause our results to differ materially. The forward-looking statements we make on this call are based on the information available to us as of today's date, and we disclaim any obligation to update any forward-looking statements, except as required by law.\n\nIn addition, we will also discuss certain non-GAAP financial measures. Our CEO and CFO use these measures in making decisions regarding our business, and we believe these measures provide helpful information to investors. Reconciliations of all non-GAAP measures to the most directly comparable GAAP measures are set forth in the Investor Relations section of our website at investors.legalzoom.com. The non-GAAP financial measures are not intended to be considered in isolation or as a substitute for results prepared in accordance with GAAP.\n\nNow I'll turn the call over to Dan.\n\nDan Wernikoff -- Chief Executive Officer\n\nThanks, Danny, and good afternoon, everyone. I came to LegalZoom almost three years ago to lead our product transformation. During the pandemic, that journey took a detour. We leaned in hard with strong tailwind created by COVID, and we clearly benefited from it.\n\nAs we look ahead to a different macro environment, it's a clear reminder that products win markets, and our product is needed more now than ever before. In today's call, I'll outline how we are sharpening our focus along with clear actions to adjust to a different environment. I want to be clear in today's earnings call that while the conflicts caused by lapping COVID are difficult, I don't place claim on the macro for our performance. Instead, I see our inability to gain material share in a very large untapped market the issue and the accountability for that is squarely on me.\n\nToday, I'll spend a bit more time talking about how we are adjusting to the current environment in the short term while also reiterating our opportunity in the long term. But first, I'll give a brief overview of Q2 results. Q2 revenue came in at $164 million, up 9% year over year. Transaction revenue was down 9% in the period, while subscription revenue offset this weakness growing 32%.\n\nOur business formations declined 16% in the second quarter, while the U.S. Census formation data was down 12%. During the quarter, we adjusted our marketing strategy, reverting to a more conservative lower funnel-focused approach given the external environment. This intra-quarter shift drove inefficiencies in our spend.\n\nAdjusted EBITDA was $18 million in the second quarter. Similar to reverting to a more conservative marketing approach, we've been taking quick actions to manage expenses. We've completed a reduction in force and expect to eliminate hiring outside our most critical roles, primarily in product and tech in the near term. We're driving durable efficiencies, automating the order process, and driving down variable costs, leading to faster order fulfillment.\n\nIn post-tax season, we brought staffing levels down. And going forward, we're adjusting our mix of experts to a more variable cost structure that will align with demand. We continued to repurchase shares under our current authorization during the quarter. Given our confidence in the business, we are and intend to remain active in the back half of the year.\n\nDuring the quarter, we continued to make progress against our three growth vectors: scaling the core business, building an SMB ecosystem, and integrating experts into the core experience. We know we need to meet customers where they are, especially in this recessionary environment, and that means segmenting the lineup and innovating against the needs of cost-sensitive SMBs up to those seeking attorneys at an affordable price. Lineup testing remains on track. 20% of traffic is exposed to the test, and we have a pipeline of variant lineup tests in development.\n\nOur goal remains a national rollout by the end of this year, recognizing testing will be ongoing for some time. Although optimizing a new lineup will take some time, early results are promising, showing an increase in conversion rates, formation growth and share gains. The results are strongest in mobile, and we'll continue to apply those learnings back into the desktop experience. We're also seeing a mix shift in favor of subscription revenue, aligned with our long-term strategy of reducing both the upfront cost to form a business in our dependence on a transactional business model.\n\nIn the past, our product experience was limited to the formations workflow and the artifact of a transactional focus. The priority is to address this as MyLZ. MyLZ is a newly created experience that will become the hub of SMB compliance, driving engagement and therefore retention while also creating a channel to introduce new services when SMBs need them after and outside of the formations channel. In the second quarter, 98% of new formations customers created a MyLZ account, up from 28% a year ago.\n\nTime on site is increasing as well. The integration with Wix is a great example of the opportunity with MyLZ. LegalZoom customers can now create a custom website by linking directly to Wix from their MyLZ accounts. And soon, our customers will see a personalized site sight directly from their MyLZ account without any effort, leveraging the data they provide in their formation.\n\nAnd finally, a quick update on LZ Tax. We exited the second quarter with over 22,000 paying subscribers, generating over $35 million of annualized recurring revenue. Having fully launched 12 months ago to our LLC base, there's a clear synergy between our core legal services attacks. This service is very early in its life, and there is significant room to improve.\n\nOur channel outperformed during peak season, with attach rates now stabilized in the pre-tax season levels. Given what we've learned, we have opportunities to make the service more accessible and relevant to SMBs that are pre-revenue through pricing and packaging changes. And beyond pricing, we also had operational challenges in our first year that made engagement with accountants and completing a return to owners. To be clear, the Net Promoter Score when engaging with our experts was the highest of any experience we deliver.\n\nBut the process outside of that interaction was too complex. As a result, we are seeing higher attrition than forecasted. We can do better and are turning our attention to the next evolution of this service. The need is there, the channel is incredibly powerful in dollars to win.\n\nStepping back and taking a longer view from the end of 2019 when I started, we are a vastly different company in business. Over 75% of our employee base and our entire leadership team is new since I arrived. We've gone from forming under 300,000 SMBs to being on pace to do greater than 450,000 this year. We had just over 900,000 subscribers, we now have close to $1.4 million, with subscription revenue 80% higher than it was in Q2 2019.\n\nPart of that is due to the launch of LZ Tax and the acquisition of Earth Class Mail, further building out our ecosystem of services and incrementally reducing our dependence on the formation macro. Business formations are still healthy and have stabilized at more than 50% above pre-COVID levels. Remote work is enabling side-hustles and new SMB tools and platforms are lowering the barrier to create a business. We're confident in the health of business formations, and we'll also continue to expand our services beyond the formation stage.\n\nThat said, since we went public about a year ago, conditions have changed as the macro moved from a tailwind to a headwind, we have to acknowledge that we still have a largely transactional business model. While we continue to drive improvements in mix, roughly 60% of our total revenue is still a result of transaction volume and the new subscriptions attached to a formation. While we made progress detaching our performance from the macro, we haven't made enough and our back half '22 guidance will illustrate that. During the IPO, we talked about extending our brand position and scaling our marketing efforts.\n\nThat's going to change as we begin leveraging the brand lead we have and doubling down on the product. Leaders consolidate in down markets and the key measurement for us will be demonstrating material share gains. Reducing brand spending commitments will also allow us to be more nimble. The reduction in media spend will impact our transaction and first year subscription revenues.\n\nAdditionally, as the economy contracts, we anticipate SMBs will spend less and scrutinize existing spend more, which affects our attach and renewal opportunities, particularly for our registered agent and compliance products. Given these adjustments, we are reducing full year revenue guidance by 7 points from a midpoint of $655 million or 14% year-over-year growth to a midpoint of $614 million or 7% growth. With this top-line reduction, we are managing expenses closely. As I mentioned, we are reducing CAM, limiting hiring to only the most critical roles, primarily in products, eliminating discretionary spend and accelerating our platform investments that drive durable efficiencies.\n\nDespite our top-line revision, we are increasing our full year adjusted EBITDA guidance to $55 million or 9% of revenue. For the rest of the year, our focus will be on product-driven share gains, more efficient growth with reduction in expenses and lowering CAM, primarily in brand spend, allowing us to err on the side of being nimble and responsive to this environment. Given these changes, in 2023, we expect to grow share by 15% as a result of the new lineup while also delivering an adjusted EBITDA margin of 15% as we begin to rely more on a product-led strategy to drive growth. The last two-and-a-half years have been a dynamic period for small businesses.\n\nWe've seen the fear of the unknown due to COVID unlock into strong formations growth, small business innovation and industry and sector rotations that continue to evolve with our understanding of and policies related to COVID. We've seen SMBs transform their businesses, filling in critical gaps in the economy all while changing how they work. It's been an unprecedented time, and we're inspired by the ingenuity of the entrepreneurs that continue to build. We try to run LegalZoom with the same mentality.\n\nWe're evolving our business model, innovating in new adjacent spaces and doing it with a team that is adjusting how we work to evolve with the environment we're operating within. We're focused on what we can control and seek to mitigate the risks we can. I'm more confident than ever in the growth opportunity in front of us and feel the changes we are making now will make us even stronger in the future. And with that, I'll hand the call over to Noel.\n\nNoel Watson -- Chief Financial Officer\n\nThanks, Dan, and good afternoon, everyone. I'll start today with a review of our performance in the second quarter and end with our outlook for the remainder of the year. Total GAAP revenue in the period came in at $164 million, up 9% year over year at the top end of our guidance range. As expected, transaction revenue was down 9% year over year at $67 million as we continue to lap challenging comparisons from the prior-year surge in business formations.\n\nWe completed 113,000 business formations in Q2, down 16% compared to the same period last year. Average order value came in at $296 in the second quarter, up sequentially from the first quarter and in line with typical seasonal patterns in the business. Year over year, AOV was up 5% due to an acceleration of fulfillment and discontinuation of our lower-priced DIY trademark products. Going forward, we expect AOV to decline year over year in the second half, primarily driven by the phased rollout of our premium offering.\n\nAs we've discussed, we expect the introduction of free SKU to drive significant volume and share growth without a cost [inaudible] transaction revenue. Subscription revenue continued to perform nicely in the second quarter, coming in at $91 million, up 32% year over year. That said, we are expecting subscription growth to slow materially beginning in the third quarter and into next year. The primary driver is the impact of the slowing macro environment on our formation volumes, which in turn reduces the number of gross additions, particularly within our registered agent and compliance-related subscription offerings.\n\nWe are also beginning to see pressure on our retention rate for these core products, which we believe is a result of increasing spend sensitivity among our SMB customers. ARPU was $252 in the second quarter, up 10% year over year. We expect similar growth in the back half of the year, thanks to higher ARPU services like LZ Tax and Earth Class Mail, becoming a greater share of our subscription business. Partnership revenue was down 21% year over year in the second quarter to $6 million as we lap legacy partnerships no longer in line with our strategic direction.\n\nWe expect partner revenue to remain steady on an absolute dollar basis for the remainder of the year. Now turning to expenses and margins, where all of the following metrics are on a non-GAAP basis. Gross margin came in at approximately 67% of revenue in the second quarter down from 68% in Q2 of last year. The slight year-over-year decline was largely driven by prior investments we've made to grow our in-house PPAs supporting LZ Tax.\n\nSales and marketing costs were $68 million in the second quarter or 41% of revenue, up from 39% in Q2 of last year. Customer acquisition spend came in at $45 million, up 2% year over year. We incurred approximately $6 million of creative production costs in the period, and we do not expect to incur in the second half of the year. As Dan mentioned, efficiencies were below expectations, largely due to intra-quarter shifts in our spend allocation.\n\nWe plan to reduce our immediate spend in the back half of the year and pivot to lower-funnel direct response channels, which we believe provide the greatest degree to reflexibility to help us navigate an uncertain operating environment. Technology and development spent spread of $11 million and general and administrative spend of $13 million, both ticked down in the second quarter on an absolute dollar basis. We are rigorously managing our fixed cost structure and reducing nonessential discretionary spend. We are also limiting new hire activities to only the most critical roles, which we expect will largely follow in the tech and dev line item.\n\nAdjusted EBITDA was ahead of the top end of our guidance range of $18 million for the quarter, compared to $22 million in the second quarter of 2021. Deferred revenue declined $1 million in the period. In the second quarter, we continued to execute on our $150 million share repurchase authorization. We repurchased a total of 2.96 million shares of our common stock at an average per share price of $12.85 for a total repurchase of $38 million.\n\nWe have continued to repurchase shares in the third quarter. As of June 30, 2022, we have cash and cash equivalents of $216 million and no debt outstanding. We stand in on the key drivers of our revised guidance earlier in the call, I'll focus my comments now on the specifics of our guide for the third quarter and full year 2022. For the third quarter of 2022, we expect total revenue of $149 million to $151 million or 1% year-over-year growth at the midpoint.\n\nWe expect subscription revenue growth to decelerate in Q3, driven by multiple quarters of declining formation volumes, pressure on our core retention rates and a slight impact to LZ Tax seasonality. LZ Tax revenues skewed toward the first half of the year and tax [inaudible]. We expect adjusted EBITDA of $16 million to $18 million or 11% of revenue at the midpoint. As Dan mentioned, we are pulling noncommitted brand spend in the third quarter to allow for greater flexibility.\n\nWe expect customer acquisition spend to decline year over year in the third quarter, but we'll continue to respond dynamically based on market conditions. For the full year of 2022, we expect total revenue of $612 million to $616 million with 7% growth at the midpoint. We expect adjusted EBITDA of $55 million or 9% of revenue at the midpoint. In 2023, we are committed to managing expenses and realizing efficiencies from our infrastructure investments and our focus on driving leverage on our margins.\n\nAs Dan mentioned, we expect to grow share by 15% while also delivering an adjusted EBITDA margin of 15%. And with that, let's open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question will come from the line of Ron Josey from Citi. Your line is open.\n\nRon Josey -- Citi -- Analyst\n\nGreat. Thanks for taking the question. Noel and Dan, I wanted to follow up maybe on my last comment on just growing share in 2023. Can you just talk about the drivers on what might lead to that continued share gain as sub growth expected to decline materially in the back half of this year with formation slowing down.\n\nSo I guess a two-part question, Dan and Noel. One is what gives you confidence on share gains in '23, is it the new products that are being launched in the national rollout. And then just bigger picture, maybe more on macro and business formations overall. What do you think needs to happen to maybe turn these results around overall to achieve those share gains going forward?\n\nDan Wernikoff -- Chief Executive Officer\n\nThanks for the question, Ron. Yeah, on the first point, there's two big goals we've put out for '23. One is to demonstrate margin of 15%, which is just -- it's the thing we can control, which is cost and ensuring that we're driving efficiencies as we scale this business. And the other is a 15% share gain.\n\nThe share gain is an early reflection of what we see when we innovate on our lineup. And we talked about this in the past. We've had a lineup that is premium-priced DIY solution. And we know that we're a premium brand and many customers are willing to pay that premium on top of what they would be able to do with the Secretary of State, but we also know that there are other types of customers out there.\n\nSo there's people who are seeking expertise, legal expertise from an attorney but they can't afford it. And so we have a premium component to the lineup. And then separately, there are people who are cost-sensitive, but really want some extra guidance. And so we're going after that group as well with the freemium components to our lineup.\n\nSo early indication, and again, we've been testing this and sequencing different variants in different states. And the read that we're getting is very positive. We see customer growth relative to the control, which is our existing lineup. We see share gains.\n\nWe see a mix shift going more aggressively toward a subscription model versus today's transactional model. And all of that's making us confident. So when you start to look at it in some components of the test like mobile, for instance, we see even a higher acceleration, which is giving us some indication of what we have to do to even see higher conversion rates than what we're seeing today. So yes, it's a reflection of what we expect to see from a completely rebuilt lineup and a set of new offerings that are going to be in market next year.\n\nOn the macro, that's a question that I think is multilayered. I mean, what we've done as we go into this guide, is we've really been thoughtful about what we think is going to be happening in the back half. And there's different sets of data that we have than maybe some of our peer group as well. And I'll just walk through a couple of things.\n\nSo first off, just the macro itself, relative to our expectations has been a little softer than we thought it would be. But one of the things that we haven't talked as much about is we also have visibility into dissolution. And so we can see how businesses are not only forming, but we can also see failure rates. And we talked about this in prior calls that our 13-month retention rate has been going down while some of our older cohorts have been going up and overall churn has remained relatively stable.\n\nIf you really think about the root cause of that, it's dissolution. Dissolution from our data peaked at the end of last year, but you still have to work through that because we have an annual subscription renewal process. And so we're seeing some of that impact or some of that headwind still play out. The good news is the dissolution rates are getting lower than they had been all throughout 2021.\n\nAnd so we want to see that resolve itself as well before we start to get bullish on the macro. And then I'd say the last piece as you think about how we're considering our guidance, we are anticipating, if we aren't already in one, that will be in a recession and that that would impact some of the attach metrics that we have and some of the retention metrics that we have as well. And so that's just us being maybe a little bit conservative. But we want to see that completely stabilize before we turn the corner and have a little bit more of a bullish point of view about the macro.\n\nNoel Watson -- Chief Financial Officer\n\nAnd Ron, I just wanted to build on Dan's earlier comment around share gains. Just to also note, and we've talked about being willing to trade off in the transaction revenue for the benefit of subscription. And this is an example where incremental customer growth, formations growth, there is a trade-off with average order value because we're offering a free SKU. And so it's really leveraging the benefit of the ecosystem that we've been building out on the subscription side to help drive long-term customer value, but at the trade-off of the upfront transactional revenue.\n\nRon Josey -- Citi -- Analyst\n\nGreat. Thank you, Dan. Thank you, Noel.\n\nDan Wernikoff -- Chief Executive Officer\n\nThanks, Ron.\n\nOperator\n\nOne moment for our next question. Our next question comes from the line of Andrew Boone from JMP Securities. Your line is open.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nGood afternoon, guys, and thanks for taking my questions. Two, please. I want to understand more of the macro. It sounds like you guys are seeing a deterioration in terms of business formation in terms of the data you have.\n\nIf you look at this morning, Census bureau kind of reported July was down 4%. So are you seeing something different than what's publicly available via the Census bureau or how should we think about that? And then just going to marketing efficiency on a go-forward basis, can you guys just talk more about what your plans are in terms of increasing efficiency? And just help us understand what changes there?\n\nDan Wernikoff -- Chief Executive Officer\n\nThanks, Andrew. Yeah, on the macro, I mean, it may be slightly redundant with what I just answered, but we definitely saw the macro a little bit lighter than we had expected. And yes, there was a publish today on the Census data, and it was a 4% decline. We've also noted that there's -- month-to-month, there are anomalies in the reporting that we see from the Census data.\n\nSo if you recall the prior month was much lower. I think the thing that is probably a little bit more of a unique data point that we see is we see the relationship between formations and dissolutions. And as I mentioned, dissolutions are a little bit of a foreshadowing for us around retention and renewal because we have some existing subscriptions that are annual subscribers and they're looking for compliance on their entity. If their business is failed, then we have to reflect that that it will not be a renewal.\n\nAgain, the good news is we're sort of working our way through that. We probably have a quarter or two, and we're starting to see some of that reversal already happening. But that is a little bit of a unique data point that we have. And then separately, I think I mentioned it, we're just -- we are a little bit conservative in how we're thinking about the back half of the year.\n\nSmall business and consumer sentiment is quite low right now. And to Noel's point that he added on, some of our add-on subscriptions are very high ARPU. I mean, when we talk about our accounting subscription as an example, you're talking about $1,500 subscription. And so we do expect those to be impacted if there is a recessionary type environment.\n\nOn the efficiency gains, that's something we've been working at diligently for a long time. Before we could even go into the market with a premium solution, we knew we had to automate everything in our back office. And so we've been working on a project which provide straight-through processing so that orders kind of flow automatically through to the Secretary of State. And then when they return, they can be automatically compiled for the customers.\n\nThat project has gone better than expected, and we continue to accelerate, not just the efficiency, but actually the customer experience because now orders are processed much faster than they used to be. And then we've really considered where we need to grow opex in the future. And we're focusing very much on product and technology as the place we continue to grow. But we also are recognizing that there's areas where we can invest less and run a little bit leaner that are outside of that.\n\nAnd one additional point there is tax, which is we always mentioned in the first season, we were going to solve for the customer experience and not so much for efficiency. Post tax season, we now have a really good sense of the curve. We know what we should expect in terms of the number of CPAs required to support our small businesses and now we're really executing on that.\n\nNoel Watson -- Chief Financial Officer\n\nAnd Andrew, just to build on the marketing efficiencies question, we did experience some headwinds in efficiencies this quarter just as we -- historically, we've been shifting our spend more into our media mix modeling. In this quarter, just given the uncertainty, we actually started to shift back into performance channels, which did create some inefficiencies in the quarter. And we -- the reason we did that is just given the uncertain environment, we wanted more flexibility to be nimble and have performance-based marketing that can react quickly to changes in the macro and so we can respond dynamically.\n\nDan Wernikoff -- Chief Executive Officer\n\nYeah. And actually, thinking about what that means in the back half, it means really bringing down more of our brand spend very specifically. But as we have seen in media mix modeling before, actually, that was look like good returning spend, but media mix modeling is sort of looking back at history. And if you're heading into a new environment, we just want to be cautious in terms of that spend.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThank you.\n\nOperator\n\nOne moment for our next question. Our next question comes to the line of Matthew Pfau from William Blair. Your line is open.\n\nMatthew Pfau -- William Blair and Company -- Analyst\n\nGreat. Thanks, guys. Wanted to dig into the retention comments a little bit more. So you mentioned the dissolutions are one factor that's driving that higher.\n\nI think in the prepared remarks, it was also cited that LZ Tax attrition was higher than expected. Anything else that you're seeing that's driving the expectation to have churn higher in the back half besides just the sort of general macro concerns that you have?\n\nDan Wernikoff -- Chief Executive Officer\n\nYeah. I mean, I think there's a couple of things that and I'll just replay it. I mean, dissolutions is really interesting. We haven't talked about it before on the call, so it's probably worth unpacking.\n\nWhen the macro -- or when COVID hit, we actually saw formations accelerate and dissolutions almost go to 0% growth, which is really unique. They usually move in parallel. As you got to the late stage of stimulus, they were both growing really fast, which is a little bit more of a healthy environment, but we also feel like propped up because of stimulus. As we got then to the end of last year, growth in formations was going down, but actually, the dissolutions was going up.\n\nAnd so that's kind of the worst environment, and that's what we're sort of building out of right now, and you can see that impact over a period of four quarters post that dissolution rate. So that's one thing that's always impacted our 13-month. We've talked about this, the 13-month retention rate has been going down, and it's been offset because of older cohorts, which are actually showing a better profile. And the reality is, as it builds over time, though, that 13-month becomes a little bit larger.\n\nLZ Tax is different. I would say two things happened. We overperformed on the channel, meaning we attached to weigh more people than we thought. And then we were not providing as strong an experience for those customers as we know we can and so the attach rate was down.\n\nThe overall result actually was pretty much what we had expected, but we just got there a little bit differently. And the good news there is we understand pretty much exactly what we need to do to resolve the retention issue in LZ Tax.\n\nMatthew Pfau -- William Blair and Company -- Analyst\n\nVery helpful. And just one follow-up in terms of the subscription guide. So maybe it would be helpful if you could help us understand how seasonality LZ Tax cost in the second quarter? Because I believe even if we just took -- assumed no sequential subscription growth in the back half of the year, we would be decently ahead of 20% subscription revenue growth. So what are the components that are driving that maybe from a numeric perspective, subscription revenue to be sequentially down in the third and fourth quarter relative to the second quarter.\n\nNoel Watson -- Chief Financial Officer\n\nYeah. I'm not sure we're going to break that out into the specifics because there's a few drivers. Obviously, we're still talking relatively small dollars overall. But LZ Tax was a component of the drivers, just the fact that there is some revenue recognition timing that's tied to the timing of tax prep.\n\nAnd so you see it heavier in Q1 and Q2. That is an important component of it. But it's also a reflection of the slowing in our core business, what we talked to in our prepared remarks, is the slowing of business formations growth the last couple of quarters, and that flows into our kind of gross additions on our subscription side. On a -- and there's a bit of a lag in terms of as you start to see that flow through our revenue.\n\nAnd so you're seeing some of our -- the core slowdown as a reflection of prior period slowing formations growth.\n\nMatthew Pfau -- William Blair and Company -- Analyst\n\nGot it. Thanks, guys. Appreciate it.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Elizabeth Porter from Morgan Stanley. Your line is open.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much. It's really encouraging to see the focus on controlling costs, given the tougher environment. But I wanted to ask about just the nascency of the market you guys are in today and kind of the education that's needed.\n\nWhat's the risk that lower CAM could impact demand despite having the new product lineup? Or alternatively, kind of how has the market matured for these solutions over the last year? Thanks.\n\nDan Wernikoff -- Chief Executive Officer\n\nThanks for the question, Elizabeth. Just going back to that margin goal. The vast majority of it is really a combination of reductions through COGS and thinking about the efficiencies around it. Also opex and reductions outside of tech.\n\nAnd a portion will also be nonmedia marketing spend which I think -- that's an area where we can control it. We have some great creative production this year. We probably won't be deploying it in the back half of this year. So it's not like there's a significant amount of CAM reduction required next year to actually get to the margin that we expect to get to.\n\nSo I think we still think it's really important. But what I would say is probably most important, and we've already demonstrated this through testing is having the right offering. And if you looked at our funnel, and you think about the number of people who start with LegalZoom, we get down to a very small portion of them that complete and the biggest drop-off areas that we see that are controllable is when we get to pricing. And so when we think about the opportunity to drive more share.\n\nIt's really completing the orders that are already going through our funnel by segmenting the offerings so that it meets them exactly where they are. So if you're low cost, we want to get you started and into our ecosystem as easily as possible, and we'll monetize them over time throughout their life cycle. If you're looking for an attorney, we also want to capture that. And today, we just don't offer those front and center in our lineup.\n\nSo I think -- that's always been our plan is to sort of first couple of years is make sure we sort of develop the market. But at a certain point, it was -- let's make sure we're innovating in the product to really drive that share gain.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGreat. And then on the segmented lineup and understanding it's still pretty early, but on the free solution, any sort of early reads on how the free product might be attaching subscriptions or partner solutions relative to the paid product.\n\nDan Wernikoff -- Chief Executive Officer\n\nYeah. Great question. And it's -- we have a lot of different tests going at the same time. And so it's hard to give you a very specific answer.\n\nWhat I would say is we definitely see lower attach rates, but we obviously see higher bookings because we're driving significantly more conversion through it when you're talking about subscriptions. And that's exactly how we want it to work. We don't think we'll be able to maintain attach rates to these customers, but we want the number of customers to sort of overwhelm and overcome it to the point where it's just good in the aggregate. And this, by the way, is without customizing any of the subscriptions to also reflect the fact that they're coming in as a free customer.\n\nOver time, you would start to think about how do you segment your subscriptions. So you would have a lower end registered agent subscription, and you would have a premium registered agent subscription. You've really targeted off who's coming into the lineup. So there's -- the interesting thing here is, again, we're looking at a lot of early data and we're encouraged.\n\nAnd this is data that's really using the ingredients that we have in our lineup versus starting to build it out and innovate specifically off those segments.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGot it. Thank you.\n\nDan Wernikoff -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOne moment for our next question. Our next question will come from the line of Mario Lu from Barclays. Your line is open.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thanks for taking the question. The first one is more higher level. In terms of -- as we kind of enter a tougher macro environment, how would you describe the competitive landscape kind of shifting over the past couple of quarters? And do you view your $200 million plus cash on the balance sheet, do you see that as mostly an advantage compared to your peers? Or how we should compare the strategy in terms of capital allocation?\n\nDan Wernikoff -- Chief Executive Officer\n\nYeah. It's -- I think what's interesting is even starting in 2021 at the beginning of the year. Given the fact that formations were starting to really take off, we did see more participation in our category by both low-end providers but also from like adjacencies. And actually, that's made our marketing spends a little bit tougher, right? Because if you think about a lot of the e-commerce players.\n\nI mean, they were spending into this pretty aggressively and a lot of what they were spending into was actually our keywords because they market directly to businesses that are just forming. So I would almost say that that's made a bigger impact from a marketing perspective. And then from a competitive standpoint, we haven't seen anybody do anything that we would say is terribly innovative, but they are competing on price, which is exactly why we're doing the freemium offering. The $200 million on the balance sheet, I think, is a competitive advantage.\n\nI mean, we can be not only a little bit more aggressive and also knowing that we're cash flow positive and playing offense during a time like this and consolidating. And again, that's why we're doing something like freemium, which may -- it may be a trade-off in the short term to really drive lifetime value. And there are things that we're looking at to sort of think about how do we measure success. One is one-year bookings, but one is also lifetime value.\n\nSo there's things that we might do there. But also, there are opportunities to accelerate our roadmap through talent acquisition that I think are real opportunities where it can both be something that we desire to integrate into our platform, but also just an awesome product team because hiring over the last couple of years has been very difficult, specifically in tech. So both of those are opportunities for us.\n\nNoel Watson -- Chief Financial Officer\n\nAnd we think in this environment, there's probably going to be heightened activity or opportunities on the M&A side. And so just having a strong balance sheet allows us to be opportunistic if those opportunities do come our way.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thank you, both.\n\nDan Wernikoff -- Chief Executive Officer\n\nThanks, Mario.\n\nOperator\n\nOne moment for our next question. Our next question is come from the line of Brent Thill from Jefferies. Your line is open.\n\nJohn Byun -- Jefferies -- Analyst\n\nThank you. This is John Byun for Brent Thill. I had two questions. So on the subscription side, obviously, it's been better than expected growth for a while now.\n\nBut is there a way to think about how do disaggregate that between how much is from kind of maybe retention or conversion of the base versus formations additions? And then second, if you could maybe talk a little bit more about the -- I guess, the going-forward trend on AOVs and subs ARPU, what's going to be the dynamic and the drivers related to that?\n\nDan Wernikoff -- Chief Executive Officer\n\nYeah. So on the subs question and disaggregation, and I think you were pointing to the difference between retention versus the acquisition piece. I don't know if we want to necessarily get into breaking out those different components, and they have been those -- as I mentioned before, they have been moving based off both the growth rate in formations and the growth rate and dissolution, but I think that the disaggregation that's maybe a little bit more helpful is there's our core subscriptions that are tied to entity compliance, and that's the registered agent and compliance subscription. And then there's the newer stuff, which is LZ Tax and things like Earth Class Mail.\n\nThose two are untethered by the formations growth right now because there's sort of in an early phase of being developed. And so what we're seeing is really strong growth in those two. And then what you're seeing on the core subscriptions is exactly how we describe it. We're getting to five quarters now of kind of reduced or flat formations.\n\nAnd what that means is we're seeing both the dissolution rate impact them, but also just flat acquisition. The retention rates, though, have remained relatively stable, if you think of the aggregate from a churn perspective. But there's a dynamic underneath it where the 13 month is impacted by dissolution and the older cohorts are hardening better than we had expected. So that's probably how I'd answer that.\n\nAnd I don't know if you want to hit the AOV one, Noel.\n\nNoel Watson -- Chief Financial Officer\n\nYeah. On the AOV and ARPU side, I would say, as it relates to AOV, and we touched on this in our remarks, we expect AOV to be down year over year in the back half. And that's in part due to the testing that we're doing on freemium -- with our freemium offering and that free SKU obviously puts downward pressure on AOV, and we would expect that to continue as that expands its rollout and then normalizes. And then on the ARPU side, we continue to see strength in ARPU.\n\nWe expect that to be durable through the end of this year. And then to the extent that LZ Tax and ECM, which are higher ARPU offerings, continue to become a larger percentage of the mix, then that will continue to put -- provide some upward pressure on our ARPU.\n\nDan Wernikoff -- Chief Executive Officer\n\nYeah. And it really comes down to focusing on the experience in LZ Tax. So we improved retention. And again, we know what to do there.\n\nThen in ECM, we've opportunities to better integrate it. So the acquisition side hasn't yet inflected. And a lot of those changes are being made right now where we will start to see that begin to grow. And again, both of those will change the mix.\n\nJohn Byun -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDanny Vivier -- Head of Investor Relations\n\nDan Wernikoff -- Chief Executive Officer\n\nNoel Watson -- Chief Financial Officer\n\nRon Josey -- Citi -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nMatthew Pfau -- William Blair and Company -- Analyst\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nMario Lu -- Barclays -- Analyst\n\nJohn Byun -- Jefferies -- Analyst\n\nMore LZ analysis\n\nAll earnings call transcripts"
}