{
  "companyName": "Ballard Power Systems",
  "companyTicker": "BLDP",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/ballard-power-systems-bldp-q2-2022-earnings-call-t/",
  "content": "Ballard Power Systems (BLDP 1.70%)\nQ2 2022 Earnings Call\nAug 10, 2022, 11:00 a.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to the Ballard Power Systems second quarter 2022 results conference call. As a reminder, all participants are in listen only mode, and the conference is being recorded.\n\n[Operator instructions] I would now like to turn the conference over to Kate Charlton, vice president, investor relations. Please go ahead.\n\nKate Charlton -- Vice President, Investor Relations\n\nThank you, operator, and good morning. Welcome to Ballard's second quarter 2022 financial and operating results conference call. With us on today's call are Randy MacEwen, Ballard's CEO, and Paul Dobson, chief financial officer. I'm also excited to announce we will be hosting our investor day this fall on November 22.\n\nWe look forward to hosting you in Vancouver. Today, we will be making forward-looking statements that are based on management's current expectations, beliefs and assumptions concerning future events. Actual results could be materially different. Please refer to our most recent annual information form and other public filings for our complete disclaimer and related information.\n\nI'll now turn the call over to Randy.\n\nRandy MacEwen -- President and Chief Executive Officer\n\nThank you, Kate, and welcome, everyone, to today's conference call. I'd like to first report that during Q2, we welcomed David Mucciacciaro as Ballard's new chief commercial officer with global responsibility for sales, marketing, product line management and customer care. Prior to joining Ballard, David was most recently vice president, global sales, M&A and marketing of Magna Electronics. He brings a depth of expertise and strong track record in leading global commercial teams, with over 25 years of sales leadership experience from the automotive industry, including with ZF, Faurecia, Lear, and TRW.\n\nHis skill set will be highly valuable to Ballard as we grow sales and transition into commercial scale deployment. David is already having a positive impact on our commercial activities. Now, getting into the quarter. In Q2, Ballard delivered $20.9 million in revenue and secured new orders totaling $12.3 million.\n\nThis activity translates to an order backlog of $91.2 million at the end of Q2. This is softer than planned, as a number of expected sizable orders have shifted out. We remain excited about our expanding opportunity set across our various applications and regions as reflected in the significant growth of our sales pipeline. We're experiencing record levels of customer engagement, progressing through demonstration programs with multiple platform customers and fully expect to execute on important platform wins in the next 12 months.\n\nOur market focus remains unchanged, targeting large addressable markets of medium and heavy-duty mobility, including bus, truck, rail and marine, as well as select stationary power generation markets. These are the applications where the value proposition is strongest for our hydrogen fuel cell technology. I'll provide a brief update of highlights and our progress on our key applications. We continue to see progress for fuel cell adoption for bus applications in Europe and the U.S.\n\nOur ongoing work with our bus OEM customers and transit operators to pilot small bus fleets and demonstrate our fuel cell's ability to meet customer needs is paying off. Europe is now entering its next stage of deployment, with certain cities moving from a handful of fuel cell buses to now over 100. As examples, recently, public transit operators in Cologne, Germany and West Midlands, U.K. announced plans to deploy additional hydrogen fuel cell bus fleets of 100 and over 120 buses, respectively.\n\nWe are confident Ballard will be positioned to participate in supporting these plans through our strong customer and end-user relationships. In the United States, due to the significant increase in Federal Low-No funding, we are seeing higher customer engagement in California and other states, including a 300% increase in the number of Low-No applications for fuel cell buses. The Federal Transit Administration announced funding in March for $1.1 billion each year for the next five years. We've been working closely with our partners on applications and expect this to support growth in the U.S.\n\nfuel cell bus market. In the truck market, we continue to make steady progress with our partnerships. Our development program with MAHLE remains on schedule. Integration of Ballard's fuel cell module and testing on the concept engine is ongoing and expected to continue throughout the year.\n\nConsistent with our previous messaging, we're leveraging our parallel go-to-market strategy, partnering with both OEMs and vehicle integrators to enable Ballard to support end user demand in the near, mid and longterm, and accelerate the adoption of fuel cell electric trucks. One of our European upfitter partners, Quantron, is planning to unveil a zero-emission truck powered by Ballard fuel cell engine at the IAA 2022 show in Hannover in September. In rail, we are on track with key customers in Europe and North America. Over the past four years, we've been developing a 200-kilowatt fuel cell engine to support Siemens Mobility in the development and commercialization of a two-car commuter train that combines innovation with sustainability.\n\nSiemens has now commercialized the Mireo Plus H, which is a highly advanced second-generation hydrogen train featuring acceleration of up to 1.1 meters per second squared and a top speed of 160 kilometers per hour. The train has the lowest life cycle costs on the market and can be refueled in just 15 minutes. We're thrilled that in June, Siemens Mobility announced the first fleet order of its Mireo Plus H trains for the Berlin/Brandenburg metropolitan region. The seven-train fleet, to be powered by 14 200-kilowatt fuel cell engines, is expected to be commissioned and operated on the network in late 2024.\n\nBy switching from diesel to hydrogen, we're expecting to see reduced annual CO2 emissions by around 3 million kilos and save 1.1 million liters of diesel. We're excited by the long-term partnership with Siemens as a platform rail customer. And in North America, as we look at the locomotive market, we continue to support CP rail as it progresses on its hydrogen locomotive program. We're excited to report that CP is progressing on hydrogen infrastructure.\n\nCP is planning the construction of two hydrogen production and fueling facilities in Calgary and Edmonton, Alberta, with EPC partner, ATCO. The hydrogen infrastructure in each CP site will include a one-megawatt electrolyzer, compression, storage and dispensing for locomotive refueling. Construction of the facility is expected to begin this year, with production and supply of hydrogen being provided to locomotives in 2023. We also see continued momentum in the marine market, specifically in our current target markets of coastal and inland applications.\n\nWe see strong engagement from existing and prospective customers for marine applications, following our achievement of DNV-type approval for FCwave product in the quarter. We've seen a growing opportunity pipeline for these markets and believe our technology and our type approval achievement will set us apart from competitors. In stationary power generation, our total order backlog has increased 36% year over year. This is indicative of growing market opportunities as companies identify hydrogen fuel cells as a competitive alternative to traditional diesel technologies.\n\nOur focus applications for stationary power include backup power for data centers, like the project underway with CAT and Microsoft, grid storage applications and captive power for mines or construction sites. We're increasingly confident in the outlook for this segment of our business as we gain meaningful customer traction on large order volumes in our sales pipeline. Now, looking at our key geographic regions. Our European revenues increased 25% from the first quarter this year as we saw Europe increasingly prioritize energy security and decarbonization.\n\nQ2 was a very busy quarter for European policies as the EU doubles down on investments and new initiatives to boost renewables and hydrogen, as evidenced by the REPowerEU action plan and banning of internal combustion engines for cars by 2035. Post quarter, we continue to see additional policies and funding announcements to support Europe's energy transition. Such initiatives include the approval of grants totaling over EUR 5 billion for 41 large-scale hydrogen-related projects across the continent, and many others to be rolled out over the coming months. This is going to be a catalyst in the European market to drive down the cost of low-carbon hydrogen.\n\nWe are confident Ballard's technology and competitive positioning, including our partnerships, position us well in multiple markets across the continent, and we expect Europe to continue to be a rapid and growing adopter of our hydrogen zero-emission fuel cell technology. In North America, we saw the continued trend of increased sales, with revenue up nearly 30% quarter over quarter and year over year for the region. We anticipate the U.S. Inflation Reduction Act, which was passed by the Senate this past weekend, to have a significant positive impact on the broader clean energy industry, the hydrogen industry and Ballard.\n\nThe act includes nearly $370 billion for domestic energy production and manufacturing, energy cost reduction, as well as lowering national carbon emissions by 40% by 2030. There are provisions for $3 billion in funding for zero-emission equipment and technology at ports, $1 billion for clean heavy-duty vehicles such as buses and garbage trucks, as well as hydrogen fuel incentives, extending and expanding of electric vehicle investment tax credits and introducing hydrogen production tax credits of up to $3 per kilogram. The combination of policies to decrease the cost of infrastructure, vehicles and hydrogen fuel are expected to be catalyst in lowering the total cost of ownership of hydrogen fuel cell technology and accelerate the uptake and pace of adoption. A competitive TCO is a critical driver to the commercialization of fuel cells.\n\nSpecifically, fuel costs are estimated to account for between 30% and 70% of the TCO depending on application. This means that production tax credit on low-carbon hydrogen could reduce the TCO of fuel cell technologies to at or below the cost of the incumbent fossil fuel technology. Amidst this strong U.S. industry backdrop, we continue to invest in our U.S.\n\nplatform. We're growing our current team and capabilities in the U.S., including a manufacturing footprint in Oregon. The new facility is anticipated to be in operation in 2023 and will support our customers who secure Buy America funding by manufacturing our newest generation fuel cell module, the FCmove HD+ in the United States. In Q2, we saw a decrease in revenue contribution from China compared to Q2 last year.\n\nWe await further policy clarity as Hunan's policy planning, the cluster in which the Weichai-Ballard JV facility is included, has been impacted by COVID with lengthy lockdowns, including in Guangzhou. Throughout the quarter, many regions throughout the country were impacted by COVID restrictions and lockdowns. While their manufacturing facility in Weifang has stayed open, day-to-day business operations among companies and government bodies continues to see delays. Despite the recent challenges China has faced, we are confident in the mid and long-term outlook, and continue to evaluate how best to position to expand our operations to take advantage of the policies and long-term market capture.\n\nIn Hong Kong, we observed growing support for fuel cell buses. This quarter, Hong Kong launched its first-ever hydrogen fuel cell bus. This double-decker bus was built by our partner, Wisdom Motor Company, and powered by Weichai-Ballard fuel cell module. This demonstration showcases our fuel cell technology capabilities to meet one of the world's most demanding operating environments, comprising of steep road grades, high passenger loads, the need for fast refueling and the requirement for significant air conditioning.\n\nWisdom provided the bus to fleet operator Bravo, who operates over 1,700 buses and carries over 1 million passengers daily. Bravo's long-term vision is to operate a fleet of zero-emission fuel cell buses. Shifting to our financials in the quarter, we saw further gross margin compression in Q2. The downward pressure was driven by a combination of a shift in revenue mix, the impacts of pricing strategy, higher fixed overhead costs, higher warranty adjustments, increased inflationary supply costs, as well as negatively impacted by net inventory adjustments.\n\nWith volume, cost reduction and improved pricing dynamics, we expect to see margin expansion in 2023 and 2024. Recognizing a challenging and uncertain macroeconomic outlook, we've decreased our planned investments in 2022. We're revising our total operating expense and capital expenditure guidance downwards. Our total operating expense guidance has been revised from $140 million to $160 million to $130 million to $150 million.\n\nCapital expenditure guidance has been lowered from $40 million to $60 million to $30 million to $50 million. With a balance sheet of $1 billion in cash, we continue to evaluate corporate development opportunities. While we've been active in our opportunity evaluation of acquisitions and investments, we remain disciplined on execution to ensure we make the best strategic decisions for value creation. Our opportunity valuation remains focused on expanding across the value chain, simplifying and enhancing customer experience, accelerating fuel cell adoption in target markets and facilitating business scaling.\n\nWe have high conviction in the long-term opportunities for hydrogen and fuel cells and are encouraged by the growing importance governments and customers across the globe are placing on the acceleration of the energy transition. We see converging trends driving energy transition, including net-zero emissions, low-cost renewable energy and energy security. Ballard's resilient business model, world-class fuel cell talent, diverse market exposure across applications and regions, advanced technology, continued innovation, strong partnerships and customer relationships and solid balance sheet set us up for success. With that, I'll turn the call back over to the operator for questions.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] The first question is from Aaron MacNeil with TD Securities. Please go ahead.\n\nAaron MacNeil -- TD Securities -- Analyst\n\nHey, good morning, all. Thanks for taking my questions. Randy, as it relates to the Inflation Reduction Act, how are you thinking about the $0.60 to $3 per kilogram production incentive and the $40,000 per commercial vehicle tax credit in terms of what it could mean for U.S. bookings activity over the next 12 months? I guess, more specifically, do you think that incentive is enough to get some of the customers you're engaging with over the line and moving toward a formal order?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah, Aaron, thanks for the question. I think we view this as a major catalyst in the U.S. market. It wasn't too long ago, maybe two years ago, where the U.S.\n\nmarket really was not a high priority for us. In fact, we had really characterized the U.S. market as a California market. That has clearly changed over the last year.\n\nOf course, we're not quite there. There's still some work to do later this week, I think, to see this pass, of course. But I think the combination of lowering the cost of low-carbon hydrogen, as well as supporting early adopters with the capex cost for vehicles, I think, are very powerful tools. We've seen similar tools to be successful in the U.S.\n\nbefore, and we're expecting this to be a significant accelerator not just for the Bus market, but for the truck market as well. And we're looking at not just fleets with opportunities to refuel at tethered refueling stations, but also longer term for corridor refueling infrastructure.\n\nAaron MacNeil -- TD Securities -- Analyst\n\nUnderstood. And in terms of my follow-up, I'm just wondering if you could give us a bit more detail on the guidance revisions in terms of what sort of specific activities or initiatives were canceled or deferred as you move the spending ranges lower?\n\nPaul Dobson -- Chief Financial Officer\n\nAaron, it's Paul here. So yes, we did lower slightly our guidance on both opex and capex and, as we stated, in responding to a challenging macro environment. I mean you will have noticed that we have been ramping up our costs, $38 million total costs in Q2, $14 million higher than the prior year. And last year, you can see that the pace has been -- from last year, you can see that the pace has been increasing.\n\nWe're investing, as we stated, in research and development product, development, next-generation products, MEAs, plates, stacks, modules. Also focused on cost or product cost reduction, as well as scaling up our production and manufacturing scalability facilities and market development. Also investing in Europe and the U.K. with our corporate development activity as well.\n\nSo yes, we did say that we would be reducing it. And when we say a challenging macro outlook, that encompasses a few different things. It not only encompasses sort of the prudence on any sort of lower priority, less essential spending that we have, so really scrutinizing the prioritization. But that is, by no means, as a message that we are backing off on our commitment to scale up and invest in our products.\n\nWe think that's extremely important, especially as we talk to customers and secure larger orders, they're looking for us to be able to have the best technology, be able to produce it at scale and at quality. And so, we will continue to focus on that. But there is maybe a few areas where we could cut back without impacting that objective. But the other area, too, is that we acknowledge also that there have been supply chain challenges, right? That could -- that we see could persist into 2023.\n\nSo while we are ordering parts and production equipment and such, it is taking longer. The lead times are getting pushed out due to supply chain challenges, which will impact spending in the year. And it also -- the final area is it also acknowledges the reality of us onboarding really well-qualified people. We've done a great job this year and scaled up, I think, by about net 80 people, mostly in engineering, but it's slightly behind the pace we thought we would be at.\n\nWe'll continue to press forward and look for those people, but it is a reality of the environment we're in. So taking that all together, we see our spending to be slightly less than the guidance that we provided on both opex and capex.\n\nAaron MacNeil -- TD Securities -- Analyst\n\nUnderstood. Thanks, guys. I'll turn it over.\n\nRandy MacEwen -- President and Chief Executive Officer\n\nThanks, Aaron.\n\nOperator\n\nThe next question is from Rupert Merer with National Bank. Please go ahead.\n\nRupert Merer -- National Bank Financial -- Analyst\n\nGood morning, everyone. Just a follow-up on the hydrogen PTC outlook. You talked a little about the potential for heavy-duty trucks in the U.S. I'm wondering though, does this change the value proposition in some of your other target markets in the U.S? Do you anticipate you could see an acceleration in power markets, for example, or even interest in rail, in hydrogen in the U.S.?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah. Rupert, I think you're right. This is going to support adoption across a number of market applications. On the rail market, we have been looking at the locomotive market with CP, obviously, in Canada.\n\nBut more broadly, we're seeing a lot more interest from rail operators to decarbonize. And in North America, for freight market, you really don't have opportunity for catenary wire infrastructure. So in my opinion, the only option there is fuel cell technology. And with this change with the production tax credit and the total cost of ownership and for this application, locomotives, you're looking at fuel as the No.\n\n1 cost for rail applications. So we do see that strengthen the value proposition. There's work to do over the coming years to validate the hydrogen fuel cell value proposition. But certainly, the hydrogen PTC outlook is strong as we look forward in that market.\n\nAnd then, I think the other market we're quite excited about for the long term as well is not just transit buses but coaches. And so, the opportunity to see lower-cost fuel, which is important to coach total cost of ownership as well, will be valuable. So it won't be just trucks, but we'll see transit operators, coach operators and the rail market as opportunities as well for the U.S. market.\n\nRupert Merer -- National Bank Financial -- Analyst\n\nHow about the Power market? Do you see any growing opportunities for either energy storage or backup power?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah. So for the backup power market, I don't see the PTC to be a big catalyst, in my opinion. These are typically applications that don't consume a lot of fuel, so it's more about having resiliency and zero emission, and in some cases, the ability for accelerated permitting. So I think those are stronger drivers than the PTC.\n\nThere are, of course, some stationary applications where you will see more primary power, where fuel can become a larger portion of the TCO. That's still, I would say, work in progress in terms of developing those markets for the U.S.\n\nRupert Merer -- National Bank Financial -- Analyst\n\nGreat. I'll leave it there. Thank you.\n\nRandy MacEwen -- President and Chief Executive Officer\n\nThanks, Rupert.\n\nOperator\n\nThe next question is from Jeff Osborne with Cowen and Company. Please go ahead.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nHey, good morning, Randy. I was wondering if we could dig into the gross margin pressure in the past couple of quarters. You had a bit of a laundry list of items. The two I wanted to try to focus on and how they sort of unwind themselves were the warranty charge you mentioned and then also the pricing strategy.\n\nCan you just touch on what the pricing philosophy has been over the past 12 to 18 months of flowing through the P&L now? And then how that sort of unwinds itself as we look at expansion into '23 and '24?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah, Jeff, thanks for the question. Maybe I'll start off, and then Paul can supplement. Maybe I'll start with the pricing strategy. I think what we're seeing is we've moved to our next generation of product, and part of that next generation of product was to introduce new pricing strategy to secure orders and transition customers to that new technology.\n\nSo that, I would say, is a primary driver of that pricing challenge. At the same time, of course, late last year and early this year, we've seen some inflationary pressure on the supply chain side. And so, as we execute against those orders and as some of the supply chain costs have gone up a little, that's impacted, of course, our cost side of that equation. So what we do see is as these -- we're talking about early volumes for these new products.\n\nAs we move to higher volume for these products and as we adjust pricing based on the supply chain changes as well, we do expect to see changes in the gross margin profile and some gross margin progression in 2023 and 2024. I think one of the things that's important to understand, of course, is that with the investments we've made in our manufacturing capacity and still low volumes, our overhead absorption is still diluted at this point. Paul, you want to comment a little bit further on the warranty.\n\nPaul Dobson -- Chief Financial Officer\n\nYeah. So on the warranty, I mean, the impact in the quarter actually wasn't that severe. It is sort of looks like it's amplified because of the size of the revenues. We did book extra provisions, if you recall, in prior quarters for -- in some issues we saw in the lab with some of our products.\n\nWe made good progress on resolving a lot of those and are now fully provided. We believe we're fully provided to resolve that issue with customers. It's important that we have enough warranty provision and stand behind our products as customers try them out and we roll them out. So the warranty impact was -- I would characterize as relatively minor in the quarter, and we don't see that changing much going into the second half of the year either.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nGot it. That's helpful. And maybe just one quick follow-up. I'm not sort of following, Randy, maybe I haven't had enough coffee, but the move toward the new platforms, why do you need to discount? Did you have to do that like when you move from the Mark 9 to subsequent platforms in the past? Or is this really just an issue of moving from sort of tech solutions platform development and monetizing units that way to true commercial terms with the Move HD platform or something else? I'm just trying to understand why and when a platform gets more energy dense, you need to lower the cost?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah. No. It's a discussion we've had with -- particularly with the bus OEMs for some time, of leaning forward on the cost structure to make sure that the total value proposition for the bus operators and the OEMs work as well. And it's not just us that's been doing that, we've been seeing other participants in the value chain supporting this to get the demonstration fleets out in the marketplace.\n\nSo I would say that's part of it. The other is just there is a cost required for these operators to transition from one product to the next product, and part of the way to help incentive them to move to that next product is the pricing strategy.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nGot it. That's all I had. Thank you.\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah. Thank you.\n\nOperator\n\nThe next question is from Michael Glen with Raymond James. Please go ahead.\n\nMichael Glen -- Raymond James -- Analyst\n\nHey, Randy. Just during your opening comments, you -- I sort of missed it, but can you just touch on you're going to establish some manufacturing in the U.S.? Can you just give some thoughts on timing for when that would happen? Or just clarify what you're looking to build on there?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah. Thanks, Michael. This is really kind of our initial manufacturing facility that we look to set up in the U.S. in Oregon, where we already have a relatively small engineering team that will help support this build-out of the facility.\n\nIt's a relatively modest investment initially, it's about $4 million and the ability to manufacture up to about 2,500 modules per year, and we expect that to be online and operational in Q1 2023.\n\nMichael Glen -- Raymond James -- Analyst\n\nOK. And a follow-up. There was -- over in China, I saw that Alfred Wong was moved from Managing Director of China into the CEO of China role. I'm just trying to understand a little bit better, is there a particular reason for that move? Is it indicative of something taking place in the Chinese market?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah. So a couple of things there. One is that Alfred was Managing Director for Asia Pac, and so we moved him to CEO for China. So very much focused on the China market rather than Asia Pac coverage.\n\nSecondly, our organizational structure, we made some changes to be more regional, closer to the customers. So this is part of it, and part of Alfred's career arc as well.\n\nMichael Glen -- Raymond James -- Analyst\n\nOK. Thanks for taking the questions.\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah, thanks, Michael.\n\nOperator\n\nThe next question is from Craig Shere with Tuohy Brothers. Please go ahead.\n\nCraig Shere -- Tuohy Brothers -- Analyst\n\nHi. Thanks for taking the questions.  So there was kind of revenue softness in the quarter for both stationary power and material handling. Do you see that as a bit of an aberration? What are the specific prospects over the next 12 months?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah, Craig, thanks for the question. I don't think we expect to see any major increase on the material handling side over the next 12 months. But the stationary power market is proving to be very active in our sales pipeline. A lot of engagement there in Europe, in North America, and I expect some very positive developments on the stationary power market over the next 12 months.\n\nCraig Shere -- Tuohy Brothers -- Analyst\n\nGreat. And you mentioned all – you're kind of opportunity-rich with all these pilots, demonstration studies, joint ventures and such. Are there some specific mile markers you could share about when we might hear or get specific feedback in a particular area as far as vehicles or rail or marine over specific quarters over the next 12 to 18 months? Like first half next year, we should hear this. Or just some kind of timing feedback mile markers.\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah. I would say on the rail market in Europe. With Siemens, obviously, they have now secured their first commercial order, so we do expect to see more progress on that market over the coming 12 months. I think you'll likely see orders on that front.\n\nIn the marine market, you'll see some markers in terms of actual deployments hitting the water, which is very important to see those products getting demonstrated. So for example, Norled in Norway, we expect to see progress there. These are really important to have the first deployments and not just the sales of the engines, but getting them into vessels and actually powering, providing propulsive power for those vessels for a period of time as well. So I think by the end of 2023, we should have three or four different marine projects that have shown really good progress on water.\n\nAnd then, I would say in the truck market, these parallel paths that we have both with MAHLE will receive, I think, significant technical milestones by the end of 2023 and starting to engage with OEM customers. And then, in parallel with the -- I'll call them the upfitters, the systems integrators, vehicle integrators like Quantron, where you see them demonstrating or unveiling a truck with a fuel cell engine from Ballard and then moving to a sales -- long-term sales relationship with these type of customers. And we see that with others as well, including Wisdom Motor of China.\n\nCraig Shere -- Tuohy Brothers -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Chris Souther with B. Riley Securities. Please go ahead.\n\nChristopher Souther -- B. Riley Financial -- Analyst\n\nHey. Thanks for taking my question. Can you talk -- you talked a little bit about kind of the order momentum, nothing quite where you wanted. Could you talk a little bit about where the push out of that low order levels is happening? Is it just primarily China or any of the other kind of activities, either European bus or Linamar that you thought might be starting to hit? Just wanted to get a better sense of the disconnect between order activity versus what sounds like continued acceleration of the pipeline, and when you think that pipeline is going to all start to hit the inflection point?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah, Chris, thanks for the question. Certainly, on the Bus side, we had expected to receive orders for those two cities that we mentioned with 100 -- over 120 fuel cell buses already this year. They've taken longer for a variety of reasons, including funding and fueling infrastructure delays. But those are still very much strong sales leads for us, and we expect to convert those.\n\nSo that's one example. Another example would be on the rail side. We expected to have larger orders with some customers, they're announceable already. We'll see that, I believe, in the second half of the year.\n\nAnd then, I do think some of the stationary power markets that we've been working with customers on for some time. These are large, really chunky opportunities, project opportunities, and there's some complexity to some of them. And so, it's just a matter of supporting the customers through their project development cycle and moving to orders. So some of these things have taken longer than we expected.\n\nAnd we're still very much -- they're still all live and high probability opportunities. None of them have disappeared. It's really very much a timing issue. But we expect to see very good progress over the coming 12 months.\n\nChristopher Souther -- B. Riley Financial -- Analyst\n\nGot it. OK. That's helpful. And maybe just within the backlog, could you break it down a little bit more by their segment or end market or geography? It sounds like the stationary power is growing, but I wanted to get a sense of how that changes in the mix, as well as kind of the existing Bus customers?\n\nPaul Dobson -- Chief Financial Officer\n\nYeah, just trying to find the data for you. But we've seen the stationary backup -- or the Stationary market, total backlog increased 33% year over year for Q2. I don't have my finger on the Bus market at the moment. But a lot of the order intake, I think 60% of the order intake in Q2 was for Bus and stationary, including some new customers as well.\n\nSo seeing positive, very positive growth in those segments.\n\nChristopher Souther -- B. Riley Financial -- Analyst\n\nOK. And maybe the last one here. Just China, we've seen kind of fits and starts throughout the time there, kind of both market and COVID-specific shutdowns more recently. Can you talk a bit about what the visibility looks like for the second half within China?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah. Just to supplement the question about the backlog as well, one of the things that I really like about our backlog, notwithstanding it's not as firm right now as we'd like to see, as well as our sales pipeline is the diversification we see in there across multiple applications, multiple regions and customers. So there's a lot of richness we see in the order backlog and the sales pipeline, I think, which differentiates us from a number of other players in the fuel cell space. So I think that's something important to highlight.\n\nI don't think there's been any really major regional shift in over the last quarter or so. And to your point about China, very frankly, candidly, still limited visibility for the back half of the year. I would note, there are today just under 11,000 buses and commercial trucks operating in China. About 3,500 of those vehicles have Ballard fuel cell technology inside, so over 30% market share and over 125 million kilometers of on-road service from those vehicles.\n\nSo a very significant data point for Ballard in terms of real-world experience in the China market. And the other thing that's interesting in China is there still are, notwithstanding the policy uncertainty, there's still quite a few hydrogen refueling stations getting built out. So today, there's over 200, I think around 203, hydrogen refueling stations completed and operational in China, but another 63 under construction. No doubt, there's been significant delays on those 63 for a variety of reasons in the China market, but I think that's very encouraging that the fueling stations continue to get built out, notwithstanding a policy uncertainty.\n\nSo I think we'll have more to share at the end of the year. There's a lot of work. We just had a question from Aaron on -- Alfred in China. He's just arrived in China, and he's actually going through the quarantine time period right now and has a number of important meetings coming up in the China market.\n\nChristopher Souther -- B. Riley Financial -- Analyst\n\nOK. That's helpful. Thanks, guys.\n\nOperator\n\nThe next question is from Rob Brown with Lake Street Capital Markets. Please go ahead.\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nGood morning. Just wanted to follow up on the European bus order activity. What's sort of driving that increase in units being deployed in there? And is that happening, I guess, is there a sales pipeline in other cities of that kind of change in order -- in order rates?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah, Rob, great question. I think this is really a situation where you're seeing those transit operators that have trialed fuel cell technology and have, in some cases, trialed battery electric technology and have seen the challenges with both technologies and the opportunities with both technologies. And are deciding for their routes, for their duty cycles and load profiles, that fuel cells meet the market requirements. And so, that's the transition I think that's occurring.\n\nThose operators that have seen the reliability and durability proven out, have seen the performance of the vehicles in the field, and now are amping up their zero-emission requirements and selecting fuel cell technology. And this is not limited to these two cities where we now have visibility on over 100 fuel cell buses. There are a number of other cities that are really scaling up their plans in the European market. I think the macro context in Europe is only going to accelerate this over the coming years.\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nThanks. I'll turn it over.\n\nRandy MacEwen -- President and Chief Executive Officer\n\nThanks, Rob.\n\nOperator\n\nThe next question is from Greg Wasikowski with Webber Research. Please go ahead.\n\nGreg Wasikowski\n\nHey. Good morning, Randy. First question is on getting customers over the line. Is infrastructure the biggest gating factor there, like you just kind of touched on with buses? Or is it mostly wrapped up in supply chain, or maybe something else?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah. So it varies by market application. But what I would say is where you have funding -- government funding requirements tied to deployments, that's often a pacing item. And then, hydrogen refueling infrastructure, I would say those are the top two.\n\nGreg Wasikowski\n\nGot it. OK. And then, back to the PTC, does that at all change your outlook on getting into electrolyzers? And then if so, can you remind us would first priority be to do that organically or potentially inorganically?\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYes. So I think we were expecting a lot of people were negative on the -- whether or not this type of bill would come back, some type of slowing down Build Back Better Bill, this IRA would come through. We actually thought that this would come through this year, so we weren't surprised by it. So I would say our view on electrolyzers is where we have the ability to help the design of MEAs to improve performance and lower cost and in-house a design and production of MEAs, we think we can be additive to an electrolyzer company.\n\nWhat we've seen is that there are scarcity of opportunities in the market. They're all, in my opinion, fairly fully priced in many cases. So it's been challenging to find opportunities that kind of meet our investment criteria. The other thing is that we aren't interested in being a supplier of hydrogen fuel.\n\nMore really looking at that equipment, the sale of the electrolyzer equipment. So I would say this is something that is -- would be a nice to have but is not required. Our customers are not demanding from us that we come to them and support their electrolyzer or green hydrogen production needs. So I would view it as if we found the right opportunity with -- at the right value, and we could add value from a technical perspective, those characteristics would lead to success.\n\nWithout those characteristics, I don't think we'll see us moving forward in that direction. We wouldn't do this organically. You see a number of companies have been moving from -- or adding from their fuel cell technology, whether it's PEM or even solid oxide, adding to their activity set electrolyzers. Our view is that that's a fairly significant and demanding exercise, and there's not a full 100% overlap in terms of the technology.\n\nAnd so, for us, focusing on the fuel cell market opportunity and driving success there is important. So this would only be an M&A opportunity, not something we do organically.\n\nGreg Wasikowski\n\nGot it. Thanks, Randy.\n\nRandy MacEwen -- President and Chief Executive Officer\n\nYeah. Thanks, Greg.\n\nOperator\n\nThis concludes the question-and-answer session. I would like to turn the conference back over to Randy MacEwen, CEO, for any closing remarks.\n\nRandy MacEwen -- President and Chief Executive Officer\n\nGreat. And thank you, everyone, for joining us today. Paul, Kate, and I look forward to speaking with you in the next quarter. Thanks again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKate Charlton -- Vice President, Investor Relations\n\nRandy MacEwen -- President and Chief Executive Officer\n\nAaron MacNeil -- TD Securities -- Analyst\n\nPaul Dobson -- Chief Financial Officer\n\nRupert Merer -- National Bank Financial -- Analyst\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nMichael Glen -- Raymond James -- Analyst\n\nCraig Shere -- Tuohy Brothers -- Analyst\n\nChristopher Souther -- B. Riley Financial -- Analyst\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nGreg Wasikowski\n\nMore BLDP analysis\n\nAll earnings call transcripts"
}