{
  "companyName": "Duck Creek Technologies, Inc.",
  "companyTicker": "DCT",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/12/duck-creek-technologies-inc-dct-q4-2022-earnings-c/",
  "content": "Duck Creek Technologies, Inc. (DCT 2.99%)\nQ4 2022 Earnings Call\nOct 12, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to Duck Creek Technologies' fourth quarter 2022 earnings conference. [Operator instructions] I would now like to hand the conference over to your speaker for today, Brian Denyeau. You may begin.\n\nBrian Denyeau -- Investor Relations\n\nGood afternoon, and welcome to Duck Creek's earnings conference call for the fourth quarter of fiscal year 2022, which ended on August 31. On the call with me today is Mike Jackowski, Duck Creek's' chief executive officer; and Kevin Rhodes, Duck Creek's chief financial officer. A complete disclosure of our results can be found in our press release issued today, which is available on the Investor Relations section of our website. Today's call is being recorded and a replay will be available following the conclusion of the call.\n\nStatements made on this call may include forward-looking statements regarding our financial results, products, customer demand, operations, the impact of COVID-19 in our business and other matters. These statements are subject to risks, uncertainties and assumptions that are based on management's current expectations as of today and may not be updated in the future. Therefore, these statements should not be relied upon as representing our views as of any subsequent date. You should not rely on forward-looking statements as predictions of future events as actual results and events may differ from any forward-looking statements that management may make today.\n\nAdditional information regarding the risks, uncertainties and other factors that could cause such differences appear in our press release and Duck Creek's latest Form 10-K and other subsequent reports filed by Duck Creek with the Securities and Exchange Commission. We will also refer to certain non-GAAP financial measures to provide additional information to investors. A reconciliation of non-GAAP to GAAP measures is provided in our press release with the primary differences being stock-based compensation expenses, amortization of intangibles, change in fair value of contingent earn-out liability and the related tax effects of these adjustments. With that, let me turn the call over to Mike.\n\nMike Jackowski -- Chief Executive Officer\n\nThank you, Brian, and good afternoon, everyone. It's certainly a pleasure for me share with you the success that we achieved in fiscal year '22 and how we're thinking about fiscal year '23. I'm pleased with our fourth quarter performance, which has a strong finish to the year. Deal activity in the quarter was significantly better than earlier in the fiscal year, as we signed a number of exciting wins with carriers of all sizes.\n\nOur Q4 performance reflects good execution from our team and customers adapting to the macro environment, as we expected. While current market conditions remain fluid, we enter fiscal year 2023 with momentum and optimism on our ability to capitalize on our growth opportunities. I'd also like to take this opportunity to spend our best wishes to everyone in Florida and South Carolina that were impacted by the devastation of Hurricane Ian. Duck Creek is proud to support several insurers as they provide critical relief to their customers in this difficult time and help people, families and businesses restore their lives.\n\nOn today's call, I'll review some of our key achievements in fiscal year 2022 and the fourth quarter. And I'll provide an update on market dynamics and our early success with Prima XL, which we will now call Effisoft. Lastly, I will finish by reviewing our key priorities for fiscal year 2023. Let me start with a quick overview of our financial results for both the fourth quarter and the full year.\n\nFor the fourth quarter, we reported total revenue of $80.7 million, up 14% year over year. And this was underpinned by subscription revenue, which is our revenue derived from SaaS of $40.2 million, up 21% year over year. Our annual recurring revenue or ARR was $169.3 million, which resulted in 25% growth over the prior year. This includes just over $5 million of ARR from Effisoft.\n\nAnd we are also profitable in the quarter with adjusted EBITDA of $6.8 million. For the full year, we reported total revenue of $303 million, up 16% year over year. Subscription revenue of $153.5 million, which resulted in 23% year over year growth and adjusted EBITDA of $24.2 million, which increased 43% year over year. Fiscal 2022 was an important year for the company and we delivered a number of notable highlights.\n\nWe exceeded $300 million in revenue, which has nearly doubled in the last four years. We continue to have success executing on our land and expand strategy with important core SaaS deals with highly respected insurance carriers like Secura, Tokyo Marine and Star Insurance. We saw an increased interest in migrating to Duck Creek OnDemand from some of our on premise customers. Last quarter's win with Hollard Insurance was an important example of this opportunity and we signed two additional migrations in the fourth quarter that I'll review in more detail shortly.\n\nWe successfully completed our first acquisition as a public company with Effisoft. We also significantly strengthened our partner ecosystem and we ended the year with more than 64,000 Duck Creek implementation experts across 23 systems integrators. The continued investment that these firms are making in their Duck Creek practices is a great indication of the growth potential they see in partnering with us. On the product front, we strengthen our support for consumer lines, launching our consumer access channel, our policyholder portal and launching digital customer service in partnership with GLIA.\n\nWe expanded the digital capabilities of our platform and ease the burden of integration with the release of additional APIs and extension points, which will provides carriers greater configuration power across our suite. And we expanded the international support of our products, delivering support for localized insurance products for the UK, Spain and Australia, as well as the launch of Duck Creek Producer for international markets. And more broadly on the international front, we made progress on our efforts to expand our global footprint, landing our first Duck Creek OnDemand customer in Europe, considerably expanding our market share in Australia and making instrumental investments in our products to develop localized insurance products. I am proud of what the Duck Creek team has accomplished in a year that saw significant changes in the market and the economy.\n\nWe believe that our low-code SaaS approach empowers insurers to streamline their operations, launch and modify insurance products rapidly and provide an industry leading consumer and agent experience. We're confident that our delivered combination of better business performance and lower operating costs will resonate with customers in all market conditions. Our fourth quarter performance was a strong indication of our success. As we have discussed on recent earnings calls, customer demand and interest in modernizing their core systems to Duck Creek OnDemand, our industry leading SaaS cloud platform has remained quite strong.\n\nDuring the fourth quarter, we signed a number of SaaS wins, including some of the deals that we expected to sign earlier in the year. And while sales cycles in Q4 remain subject to additional scrutiny and reviews, our understanding of how to manage through these additional steps has improved. While customers are still facing some of the same challenges we have discussed in recent quarters, we are encouraged by the sales performance in the fourth quarter and our pipeline entering fiscal 2023. I'd like to highlight some key wins in the quarter, which reflects the breadth of our success.\n\nWe signed two sizable on premise conversion and expansions in the quarter with AXIS Insurance and Co-action Specialty Insurance. AXIS has been a Duck Creek customer since 2016 and experienced great success, more than quadrupling the DWP under management on Duck Creek. As they look to take advantage of our latest product innovations, AXIS chose to migrate their overall on premise installation to the full Duck Creek Suite OnDemand. Speed to market was a major consideration in AXIS' decision to move down demand to help facilitate their aggressive growth goals.\n\nCo-action Specialty Insurance selected Duck Creek OnDemand to upgrade their commercial specialty writers' core policy, billing and commercial templates from their on premise to our cloud SaaS platform. Duck Creek's technology suite will efficiently consolidate Co-action's technology solution on to Microsoft Azure Cloud and to increase their speed to market and ease of connecting with customers and industry partners. We also closed the full suite OnDemand deal in Australia with Catholic Church Insurance or CCI. CCI has been operating on legacy systems and Duck Creek demonstrated the value, expertise and advantages of moving to the cloud with Duck Creek OnDemand.\n\nI'm proud that Duck Creek was chosen to help improve service to their clients through better products and technology. An exciting new customer win in the quarter was with California Fair Plan or CFP, which chose Duck Creek after a competitive market surge of the top technology providers in the space. Duck Creek is doing a full suite replacement that moves CFP away from legacy systems. It was important for them to sign with the partner who offered a full end-to-end capabilities, including distribution management and the full suite of core systems.\n\nCFP has told us that Duck Creek's team, culture, ecosystem and ability to support them long term were critical factors in this field. Aggne as our systems integrator provider was also instrumental in partnering for supporting Duck Creek and helping the California Fair Plan deliver on their overall strategy. Next, I'm thrilled to welcome Michigan based Franklin Mutual Insurance Company as our latest distribution management customer. Franklin Mutual Insurance offers its products through an independent agent network.\n\nAnd as part of their distribution strategy, they require a single technology solution that can operate as a sole source of truth for agency and producer data, which will allow them to execute on their plans for significant growth. Duck Creek proved to be the solution of choice to help them to continue to maintain positive relationships with their agency force by leveraging cost effective and modern technology. We also signed some important expansions with our existing customers, including Star Insurance Group and Slide Insurance, who added additional digital enablement services and capabilities. We are very excited about a new go to market offering in digital customer service.\n\nIt creates a great opportunity for carriers across the globe to seamlessly support customers in a digital world. This is built on the capability and new strategic partnership with ecosystem partner GLIA that we announced in Q2. And in Q4, we signed a significant deal with one of our existing customers, MedPro Group, a member of the Berkshire family and the largest medical professional liability provider in the industry. The combination of GLIA and Duck Creek is essential for MedPro to create a seamless digital experience to modernize and enhance its customer service capabilities.\n\nWe were also pleased with the very strong start we achieved with Effisoft. We closed the acquisition in July and have made great progress on our integration plans. We've been thrilled with what we have seen with the business since its closing. The product is world class and an obvious market leader globally in the reinsurance category.\n\nWe have received incredible feedback from customers on the capabilities of Effisoft's reinsurance management solution and how it drives substantial performance improvements and cost savings across an insurer's entire reinsurance offering. There is exciting momentum in the marketplace for RMXL, and we are pleased with the growing pipeline and the cross sell opportunity within our base. We had an important early success with Effisoft in the fourth quarter, including wins with QBE, which made an additional buy up to support their global strategic work. And in this instance, implementing QBE's European operations division.\n\nQBE is obviously an important reinsurance management customer and we're thrilled to partner with them across our international business. We also won a key deal with France-based Matmut to undergo a major upgrade from their on-prem installation to our SaaS-based reinsurance management solution. This migration is consistent with the traction we see across our core business to transition on-prem customers to modern cloud based SaaS. Turning to fiscal year 2023, we are focused on building upon our success in the fourth quarter and executing on our growth strategy.\n\nSome of our key priorities this year include: expanding our efforts to migrate on premise customers to the cloud. Now that we have successfully completed a number of on premise migrations, we are taking those learnings to create a more standardized migration road map for customers. As we have done historically, we will focus on situations where a migration is part of a broader strategic effort for the customer to bring a greater portion of their business onto the Duck Creek platform. Our second priority is to increase our footprint globally.\n\nEffisoft will help with our international expansion plans as we look to leverage our global footprint in several different countries. They have strong customer relationships with a number of international insurers, including AXA, Beasley, Covia, QVE and Allianz among others. Having feet on the ground and referenceable customers in different countries is critical in our market. We believe there's a sizable opportunity to build upon Effisoft's success with our core systems modules.\n\nWe will also continue executing our cross sell and up sell strategy. There continues to be a substantial opportunity to expand our penetration of both core and non-core systems among our existing Tier 1 and Tier 2 customers. In addition, we believe there is a sizable opportunity to continue cross selling distribution management, as well as begin selling Effisoft's industry leading reinsurance management solution back into our installed base of more than 150 customers. On the product front, we will continue to invest in our leading SaaS insurance platform with new targeted capabilities to extend our products, platform and low code configuration tools, lead AI and advanced analytics more natively into our platform, build additional international insurance products and drive additional efficiencies to improve subscription gross margins through our focus on multi tenancy automation and customer self-service.\n\nFinally, we will continue to expand and deepen our partner ecosystem. We recently hosted our annual partner summit, which highlighted the great momentum we have with our solution and delivery partners. We have developed a compelling partner program that is differentiated in how closely aligned Duck Creek is with our partners in pursuing new business opportunities. We are focused on leveraging our relationships with leading partners like Accenture, Capgemini, Coforge and EY, among others, to drive a greater %age of our new business wins through the channel.\n\nFinally, I'm thrilled to welcome Talvis Love to our board of directors. Talvis is SVP and chief information officer of Baxter International, where he is responsible for the development and delivery of IP, digital strategies, cybersecurity and risk across the enterprise. He also held previous CIO and technology positions at Cardinal Health and TD Bank. Talvis' extensive experience with technology, enterprise architecture and cyber security will be an invaluable addition to our board.\n\nBefore I turn the call over to Kevin, I just want to finish by reiterating our excitement about the future of Duck Creek. We have the best SaaS cloud core systems platform in the market and we continue to strengthen our solution each and every quarter. Customer interest in moving to the cloud remains very high and we are in a great position to benefit from this trend for years to come. We are focused on executing on our strategic priorities that will effectively balance investing for growth and generating profitability.\n\nWith that, let me turn the call over to Kevin to walk you through the numbers. Kevin, over to you.\n\nKevin Rhodes -- Chief Financial Officer\n\nThanks, Mike. Today, I'll review our fourth quarter and fiscal year 2022 metrics and results in detail, and I'll provide guidance for our first quarter and full year fiscal 2023. First, SaaS ARR at the end of the fourth quarter was $169.3 million, up 25% year over year. Reflecting on our performance this past year, while we experienced some elongated sales cycles earlier in the year, we had a strong fourth quarter performance as we closed in some of the opportunities that we're building up in our sales funnel.\n\nAs Mike noted, we had some good cloud migration deals in the quarter and still believe we can drive incremental subscription revenue growth within our base, as they continue to adopt our SaaS solutions in addition to driving deals for new logos. Going forward, we are going to calculate ARR as an annual value of all contracts in force at the end of the quarter. We believe this will better represent our future expected revenue and will eliminate the timing of deals that are signed at quarter end. Total revenue in the fourth quarter was $80.7 million, up 14% from the prior year period and well ahead of our guidance.\n\nWithin total revenue, subscription revenue, which is comprised solely of subscriptions to our SaaS products was $40.2 million, up 21% year over year. In the fourth quarter, subscriptions represented 73% of our software revenue. Effisoft, which closed on July 12 contributed approximately $2 million of revenue, of which, subscription revenue contributed approximately 40% during the quarter. Revenues from on-premise software licenses was $7.8 million and maintenance was $7.2 million This represented 19% of total revenue, which was higher than in recent quarters and seasonally high for us in the fourth quarter, as we had several on-premise renewals in the quarter that impacted license revenue.\n\nServices revenue was $25.4 million, down 6% year over year. We continue to embrace our strong systems integrator network and we are happy to have those integrators run point on most of our implementations. We are often subject matter experts and run alongside our partners to ensure implementations are on time and on budget, meeting our customers' expectations for a high return on their investment in our platform. SaaS net dollar retention as of the end of the fiscal year was 108%.\n\nSaaS net dollar retention in the quarter reflected the cumulative impact of the churn that we have discussed on prior earnings calls, as well as a lower mix of upsell activity. As we look ahead, SaaS net dollar retention is likely to be below some of the historical levels that we have seen. In large part due to the fact that on premise migrations are not typically captured in our retention calculation. That has historically been a small part of our overall bookings, but is expected to increase going forward.\n\nNow let's review the income statement in more detail. These metrics are non-GAAP unless otherwise noted and we provide a GAAP to non-GAAP reconciliation of our financials in our press release. First, on a GAAP basis. Our gross profit for the fourth quarter was $47.5 million and we had a loss from operations of $2.1 million.\n\nWe had a net loss in the quarter of $2.4 million or $0.02 per share based on weighted average basic shares outstanding of 132.6 million. Turning to our non-GAAP results. Gross profit in the quarter was $50 million or gross margin of 62%, up 40 basis points compared to 61.6% in the fourth quarter of fiscal 2021. Subscription margin in the quarter was 64.5%, up 120 basis points compared to 63.3% in the fourth quarter of fiscal 2021.\n\nTotal adjusted gross margin was better than expected in the quarter due to strong subscription margin and a greater mix of license revenue. We are pleased with the continued strength in our subscription margin, but I want to remind you that there can be quarterly variation due to the timing of when revenue recognition begins for certain contracts and the timing of expenses at the early stages of new deployments. We believe our subscription margins are an important demonstration of the scalability, ease of use and the performance of our SaaS platform. Professional services margins were 39.2% in the quarter and were in line with our expectations than our long term target in the high 30% range.\n\nWe continue to balance sustainable utilization rates and our ongoing efforts to increasingly leverage our systems implementation partners. Turning to profitability, adjusted EBITDA for the fourth quarter was $6.8 million, which was ahead of our guidance, due primarily to a combination of better than expected revenue and lower than expected expenses. Adjusted EBITDA margin was 8.4% for the quarter, up 170 basis points from 6.7% in the prior year period. This represents our 15th consecutive quarter of adjusted EBITDA profitability, an important indication of our ability to profitably generate high levels of subscription revenue growth.\n\nNon-GAAP net income per share in the quarter was $4.5 million or $0.03 based on approximately 133.9 million fully diluted weighted average shares outstanding. For the year, non-GAAP net income was $15.1 or $0.11 per share based on approximately 133.5 million fully diluted weighted average shares outstanding. Turning to the balance sheet and cash flow. We ended the quarter with $273 million in cash, cash equivalents and short term investments and we remain debt free.\n\nFree cash flow in the fourth quarter was $15.7 million, which was up meaningfully from $6.9 million in the fourth quarter of fiscal 2021. For the full year, we generated $8 million of free cash flow, compared to negative $11 million in fiscal 2021. I would now like to finish with guidance, beginning with the first quarter. We expect total revenue of $75.5 million to $77.5 million.\n\nSubscription revenue of $40.5 million to $41.5 million. We expect adjusted EBITDA at breakeven to $1 million and our non-GAAP net income is expected to range from negative $1 million to breakeven or $0.01 to breakeven on a fully diluted basis. For the full year of fiscal 2023, we expect total revenue of $328 million to $336 million. Subscription revenue of $175 million to $179 million.\n\nAdjusted gross margins are projected to be at 60%. We expect adjusted EBITDA of $25 million to $27 million and our non-GAAP net income is expected to be in a range of $15 million to $17 million or $0.11 to $0.13 on a fully diluted share basis. There are several things to keep in mind as you think about our outlook. We continue to take a prudent approach to forecasting deal close rates.\n\nAs Mike mentioned, our go to market team did a great job in the fourth quarter adapting to increased scrutiny we have seen on transactions in recent quarters. While we are encouraged by this performance, the environment remains fluid and I believe it's too early to assume further improvements. We expect subscription gross margin to expand by 100 basis points and 150 basis points year over year. On a total gross margin basis, this will be more than offset by our proactive efforts to bring down professional services margin to a sustainable level, as well as a lower mix of license revenue, as we do not expect the fourth quarter performance in fiscal 2022 to repeat itself in fiscal 2023, given some of the migrations that were booked in the quarter.\n\nIn terms of seasonality, please keep in mind that the first quarter is typically our lowest bookings quarter, and we would expect sequential improvement in the SaaS ARR to be relatively modest. And finally, we expect Effisoft to contribute approximately $12 million to $14 million of revenue for the full year of fiscal 2023. Effisoft will not make a meaningful impact to our adjusted EBITDA this year as we will continue to make additional investments to integrate them into our business, into our SaaS platform. To wrap-up, we are very pleased with how we performed in the fourth quarter.\n\nWe are at the early stages of a large global growth opportunity and we were well-positioned to build upon the fourth quarter results in fiscal 2023 and beyond. And with that, we would like to open up the call for Q&A. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Dylan Becker with William Blair. Your line is open.\n\nDylan Becker -- William Blair and Company -- Analyst\n\nHey, guys. Thanks for taking the question. Maybe a higher level kind of macro perspective for you Mike here. As these are highly strategic discussions with those customers, there's probably again a multiyear kind of road map in place before it actually gets to that decision in point.\n\nI guess how are you thinking about the resiliency of the core system modernization initiatives among carriers? And if there maybe has been any shift in priority relative to how they're allocating their internal IT resources?\n\nMike Jackowski -- Chief Executive Officer\n\nSure. Thanks for the question, Dylan. Yeah, I would say, even in the macro uncertainty, we continue to see strong demand for technology solutions. So the pipeline continues to build, we continue to have very thoughtful conversations with existing customers, as well as new customers.\n\nAnd I think as insurers are looking at how to respond to changes in the marketplace, they know that technology is going to play a key role in responding to these changes. These are changes like reducing overall expenses through automation or making product and pricing changes. However, what we are seeing is that, carriers are being a little more conservative in terms of committing to big long term multiyear, multi transformational initiatives. So they're going through some extra steps in terms of their decisions.\n\nThey are going into their fiscal year 2023 planning. And we think that we've adjusted very well to this new environment in terms of our overall forecasting and we've worked this into our guidance. So under the current environment, this is what we expect. If things don't get worse, we think we're going to do quite well as per our guidance for fiscal year 2023.\n\nDylan Becker -- William Blair and Company -- Analyst\n\nYeah, that makes sense. And I would think that again that strategic road map helps add from a visibility perspective as well. If you think about to those conversations and the value of the integrations and the partner ecosystem of being able to kind of build on top of the Duck Creek platform, how much of that has that served as a driver of broader adoption as well? It seems like a channel you guys have been investing in, but wondering how that ease of implementation cost of the upfront burden there from some of these more complex systems maybe plays out as well? Thanks.\n\nMike Jackowski -- Chief Executive Officer\n\nYeah. Thanks, Dylan. We do think it matters, obviously, we obsess every day about how we can lower the cost of implementation for insurance carriers, how we can bring that burden down. And one way we do, do that is by preintegrating or pre plumbing into many of the industry solution providers that are out there.\n\nAnd that's why now in our ecosystem we have over 80 solution providers, and within that we've pre built over 100 integrations with them. And a lot of these just serve to displace workdays that would otherwise be workdays to integrate with our solution. So we do think that that is a key element and a differentiator of ours and that's why we're investing in that space as well.\n\nDylan Becker -- William Blair and Company -- Analyst\n\nGreat. Thanks, guys.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Alex Sklar with Raymond James. Your line is open.\n\nAlex Sklar -- Raymond James -- Analyst\n\nGreat. Thank you. Mike, I want to ask about the faster cadence of on-premise migration you're talking about for year. What's driving that change? I think in the past you've talked about waiting for the customers ready? Is that just a function of the customers are ready now? Or is there anything proactive that you all are going to encourage those moves?\n\nMike Jackowski -- Chief Executive Officer\n\nYeah, Alex. I would say that our philosophy on migrations has not fundamentally changed. We're not taking an approach to force customers down this path. We really want to focus on a strategic inflection point for them.\n\nBut back to your question around what has changed and how this is accelerating? I think one item is just our formation event this past spring where a lot of customers came to the event, they saw the investments we're making in the cloud product. That certainly triggered a lot of discussions. They're also seeing -- we're being much more deliberate of sharing our road map with our customers so that they can see that the investments that we're making. And I think many of them are drawing the conclusion that being on that strategic code line is going to be very, very important for them.\n\nSo that's advanced several of the discussions with many customers. So we're pretty excited about it and we're going to continue to focus on lowering that cost and coming up with more repeatable models to bring them into the cloud and we think that'll help us hit our objectives in fiscal year 2023 as well.\n\nAlex Sklar -- Raymond James -- Analyst\n\nOK. Great. And Kevin, on the implied kind of profitability ramp as the year progresses, can you just talk about how much of that's being driven by the Prima XL acquisition? How much is seasonality? How much are kind of efficiencies that you're still going to get?\n\nKevin Rhodes -- Chief Financial Officer\n\nYeah, sure. I mean, as one part of my prepared comments, we're not really going to look for a lot of contribution from Effisoft in year from an EBITDA perspective as we make some of those investments and bringing them into our platform, etc. What we are seeing is obviously with the guide we are going to see acceleration of EBITDA come throughout the year. Fourth quarter as you might -- as we just discussed, has a seasonally higher amount of license revenue in it than any other quarter.\n\nSo I'd say, it's probably a little bit more back weighted toward the fourth quarter. But in general, that's what we're looking at.\n\nAlex Sklar -- Raymond James -- Analyst\n\nOK. Thank you, all.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Rishi Jaluria with RBC Capital Markets.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thanks so much for taking my questions. Maybe I wanted to go back to talking about the migrations and some of the success that you're seeing with existing customers and migrating them to the cloud. Can you maybe talk a little bit more about what sort of incentives you are giving customers if any to -- not force them, obviously, because I know that's not your approach.\n\nBut to maybe give software incentives to drive those migrations. And when we think about like a multiplier uplift, from the early migrations, what does that tend to look like? And then I've got a follow-up.\n\nMike Jackowski -- Chief Executive Officer\n\nSure, Rishi. In terms of incentives, we're in deep discussions with our customers around their overall approach to migrate. And we're looking at -- we developed a tooling internally to help them offset some of the things that they have to take care of. So we have some automation on how we're doing that.\n\nBut in terms of the overall financials, they understand that our SaaS product is a different product, so they have to move to that. So we'll come up with a mechanism of which we would, in essence, over time sunset their on-premise agreement and then move them over to the new SaaS fee or structure. But in terms of the way that our deals look on the SaaS side of things, they look like typical new customers SaaS deals for us, because customers understand that they're going to realize more value that's tied to that overall product.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nGot it. That's helpful. And then when we think about international, you talked about some of the efforts you're making to grow the presence there and then bringing in some of the learnings from Effisoft. Longer term, how should we be thinking about the international business? Right now, it's still mid to high single digits as a percent of revenue.\n\nOver time, how should we be thinking about what that looks like for Duck Creek as a whole? Thanks.\n\nMike Jackowski -- Chief Executive Officer\n\nYeah, Rishi, you're right. Today, our international business is mid to high single digits. I do want to highlight that we classified as international, it's contracted international. We do have several customers that have a contract that sit on U.S.\n\npaper and they will have usage rights internationally. But we are excited about some of the recent momentum that we've had. Last quarter we talked about Hollard in Australia, this quarter a win with Catholic Church. And we have a buildup of our pipeline in Europe and some things happening there.\n\nSo I think over time what you can expect is, we will have more bookings internationally relative to our international presence, so our growth rate. Now I don't think you're going to see us kind of jump up to double digits anytime soon in terms of our overall share of revenue. But we think we're going to grow more internationally than we will organically in the U.S. And we're pretty excited about some of the discussions that we are having with carriers outside of the U.S.\n\nright now and excited about the progress we're going to make in fiscal year 2023. And then finally, we think the acquisition with Effisoft helps us. It helps us with relationships with international players, as well as a global footprint to build off of as we engage in those conversations and look at our go to market strategy as well.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nAwesome. Thank you so much.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Parker Lane with Stifel. Your line is open.\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nYeah. Hi. Thanks for taking the questions and congrats on the quarter. Curious with the uncertainty that's out there right now, if you're seeing customers demand or ask for shorter deal durations or if that's something that you've actively engaged in over the last quarter or if that's not the case? Thanks.\n\nMike Jackowski -- Chief Executive Officer\n\nYeah. Thanks, Parker. I would say that we have seen more conservative behavior from our customers and I think that -- the way that that's manifesting itself in our deal flow is, especially in the Tier 1s and 2s, perhaps smaller deal sizes to start out. We're not seeing that deal duration is shrinking on us.\n\nWe think that when customers do these types of projects, they tend to be committed over the long term. They know that they have to go through a substantial project, get that live. And once they start building premium they have to be committed to the platform. So we're not seeing -- I'm going to say the length of the term of our contracts be reduced.\n\nWe are seeing in the larger carriers our average deal size reduced, but we do think that still represents good buy up opportunity in the future. So nothing concerning for us, it's just out of the gate. We're going to get less, but I'm not going to say a shrinkage of the deal term or the length.\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nGot it. Understood. And then I think it was last quarter that you had a couple of contract renegotiations or reworkings and maybe there was an anticipation of some of that in the future again with all the disruption out there. Was there any of that during the quarter or do you anticipate any of that in your 2023 guidance?\n\nMike Jackowski -- Chief Executive Officer\n\nThe answer is no, there is nothing this quarter that came up. And Kevin, you could talk about some of the assumptions that you made coming into the Q4 guide and how that's impacting us.\n\nKevin Rhodes -- Chief Financial Officer\n\nYeah. I think from a guide perspective -- sorry, Parker, could you just repeat the question really quickly from me? I was a little distracted by that. What you are asking about the guide?\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nYeah. Last quarter, you called out some contract renegotiations or at least one large one that impact. Yes, I'm wondering if there's any of that baked into the FY '23 guide?\n\nKevin Rhodes -- Chief Financial Officer\n\nNow I got it. OK. So we did bake in the course churn assumptions that we would have in 2023. I will say like a couple of things, like I made a comment last quarter that are being a little bit conservative at about $600,000.\n\nThat actually did play out well for us, but we were able to actually fall for that in the fourth quarter. That's why we did have a little bit better contribution in the fourth quarter. But in general, I would say we are pretty much in line with what we'd expect from normal kind of churn in 2023 and it's all taken. Nothing unusual there.\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nOK. Appreciate you taking the question. Thanks.\n\nMike Jackowski -- Chief Executive Officer\n\nThanks, Parker.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Saket Kalia with Barclays. Your line is open.\n\nSaket Kalia -- Barclays -- Analyst\n\nOK, great. Hey, guys. Thanks for taking my questions here. Mike, maybe just to start with you.\n\nI was wondering if you could just comment on the competitive backdrop at all or just anecdotally on waiting rates. I mean, I know that that can ebb and flow kind of quarter to quarter, but as you sort of do a postmortem on the year, how do you feel about sort of the win rate and sort of the shots that you're getting on goal as you think about just the competition in this market?\n\nMike Jackowski -- Chief Executive Officer\n\nYeah. I would say, overall we're pleased with our competitive positioning. We have not seen broadly that our win rates have changed. Some of our competitors are aggressively going into their installed base and migrating several of their on-premise customers and we don't always get an opportunity to compete with that.\n\nBut I will say that, for instance this quarter, several of the deals that I mentioned were highly competitive with some of the most notable players in our industry and we feel like we're getting great feedback and we're coming out on top. So I think broadly, not a lot has changed in terms of the overall win rate that we've seen over this past year.\n\nSaket Kalia -- Barclays -- Analyst\n\nGot it. That's really helpful. And Kevin, maybe for you, help us understand how the ARR methodology is going to change? And I think it makes a ton of sense. I understand historically we haven't guided to ARR here, but are there any comments or just any sort of guide rails that you want to make sure we know as we think about ARR for next year?\n\nKevin Rhodes -- Chief Financial Officer\n\nYeah, sure. I think fundamentally, I'm simplifying the metric, which is the same metric that it's always been, which is -- but it's the timing of deals when they use to come in. I think our -- I know our old method was, take the revenue in the quarter and multiply that by 12. And so, the way our methodology of revenue in the past was trying to -- there was a cutoff period, if you will, in the quarter that you would either not -- would or not take revenue in the quarter based on provisioning and that sort of thing.\n\nAnd I think I'm just simplifying it to be honest with you. At the end of the quarter, through the end of the quarter, if we land a contract, then we're going to include that in our ARR calculation. Looking back over time, because we did look at that, it doesn't really change what we've done historically from an ARR perspective, there's just some timing that we had one quarter versus another, but not material. But for me in the future, I just think it makes sense to simplify it.\n\nAnd make sure that at the end of the quarter, I've got a contract in place, whatever that contract value is for that year is what we're going to put in the ARR count.\n\nSaket Kalia -- Barclays -- Analyst\n\nGot it. It makes a ton of sense. Thanks, guys.\n\nMike Jackowski -- Chief Executive Officer\n\nThanks, Saket.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Alex Zukin with Wolfe Research. Your line is open.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for taking the question. I'm sorry, I missed a little bit of it. So if the questions were done, I apologize.\n\nI guess I wanted to ask what the -- what's driving NRR at that $108 million level deterioration? And what gives us confidence or what gives you guys confidence that that's going to stay stable from here? And then I have a quick follow-up.\n\nKevin Rhodes -- Chief Financial Officer\n\nYeah. When you think about net dollar retention rate, there's ARR and there's net dollar retention rate, right? And I think you're asking about the net dollar retention rate of $108 million. It has been higher traditionally on that. When you -- when you break down what our growth is, right? There's upsells like more capacity.\n\nThere's cross sells, take reinsurance management and cross sell it across the base. And then there's new logo activity and then there's like migration to the cloud. When you think about what doesn't get included in the net dollar retention rate is those last two categories. Typically new logos and then migration activity don't get included in the net dollar retention rate.\n\nAnd we're seeing a bit more of our bookings in the future come through the new logo activity and migration activity. And so, that's why we think that the $108 million is not a bad number. It's not affecting when you think about a SaaS business at $108 million to $110 million, $115 million, it is actually a very good number. We're retaining customers, they're happy customers, and we're still upselling those customers.\n\nBut as a percentage of overall bookings, we think that that's going to be a little bit lower. And then ARR captures all four of those activities. It captures all four, so you can see with the 25% growth year over year in ARR activity, that's more indicative of capturing all of that.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nAnd then just a clarification question. I guess if the $12 million to $14 million that's coming from the acquisition, how much of that is going into subscription? And given the changed -- the simplification of the ARR calculation, that is likely going to change some of the patterns around seasonality that we've seen. So I just want to understand, are we going to get a look back at a bridge to the previous years of ARR calculated under this new method so that we can better understand those seasonal trends?\n\nKevin Rhodes -- Chief Financial Officer\n\nSo I can make it simpler for you, Alex. It's about $5 million that we had from ARR from the acquisition. So we said that earlier, you must have missed it. That's no problem.\n\nAnd then in terms of our bridge, like, as we look at the ARR calculation that we have today and we look back over time, it doesn't substantially change. Like, there is no bridge that's needed to be given because effectively in one quarter versus another quarter, if you're missing just a small amount in one quarter, it's made up in the next quarter. So our ARR calculation in general over the last several years is still very consistent with the new methodology. And just to remind, our new methodology is basically just any deal that we close within the quarter and the value of that on an annualized basis will capture in ARR.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nGot it. And just about $12 million to $14 million for next year, is that going all into subscription or how is that getting broken out?\n\nKevin Rhodes -- Chief Financial Officer\n\nI'm sorry. Yeah, the $12 million to $14 million, 40% of that approximately is subscription.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPerfect. Thank you, guys.\n\nKevin Rhodes -- Chief Financial Officer\n\nYou're welcome.\n\nMike Jackowski -- Chief Executive Officer\n\nThanks, Alex.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Pete Heckman with D.A. Davidson.\n\nYour line is open.\n\nPete Heckman -- D.A. Davidson -- Analyst\n\nThank you. Good afternoon, everyone. Given your comments on win rates and maybe a little bit more momentum in the business, it's a little bit -- it's certainly early, but I guess has there been anything change in your mind that Duck Creek shouldn't be able to get back 20% to 25% of subscription revenue growth once we've lapped just one customer loss and some of this slowdown?\n\nMike Jackowski -- Chief Executive Officer\n\nYeah, Pete. Obviously, you could see what's in the high end of our guide for next year. And we do think our guide is reflective of the two dynamics, right? The challenging selling environment that we're seeing because of the macro environment where we made some adjustments to, and then we did talk about some of the churn that we've recently had. But with that said, if the environment were to normalize and get back to the buying behaviors that we had seen two years ago or a year ago even.\n\nYes, we think that this business and the opportunity in front of us would definitely normalize above 20% subscription growth. We feel very confident on that. There's a lot of opportunity that's out there. You could see, there continues to be a lot of pent up demand as carriers look at replacing their legacy systems and a ton of opportunities in Tier 1s and 2s.\n\nNow what's going to happen this fiscal year with some of the macro uncertainty and their buying behaviors. We're still watching very closely how they react to that. The good news is, we're seeing carriers already work new additional rates into the system. So even the first half of the year AM Best reported that the top 100 carriers have taken over 10% of rate increases.\n\nSo that's good, because they're getting to a place where they're going to at least try to offset some of the inflation that they've seen. But we're still seeing some conservatism in buying. But I can say long term, we are very ambitious and we believe that if everything normalizes on the buying side that this business should expect subscription growth over 20%.\n\nPete Heckman -- D.A. Davidson -- Analyst\n\nOK. That's good to hear. And then just in terms of the balance sheet, how are you thinking about additional M&A, potentially other uses of capital? And then what would you consider is going to be the minimum cash that you want to keep on the balance sheet? Or would you be willing to go into a net debt position?\n\nMike Jackowski -- Chief Executive Officer\n\nYeah. I mean, I think right now the way we look at it is, we're going to be a disciplined acquirer. And I want to emphasize even as we went off of Effisoft, that was something that I got very proactive on and some that strategically said, this is a space we want to be in and it had a halo effect of being a European based business that helps our global expansion as well. And I think with the cash on the balance sheet, we will always look to be a disciplined acquirers.\n\nSo if it's a right thing that drives the right growth strategy, I think it's something that we would go after in action. And right now, we feel really good about our capital position. With the cash on the balance sheet, the fact that we carry no debt that we have lots of dry powder, so to speak, to go after what we need to. But I think right now it's more opportunistic.\n\nAnd I think we're in a good position as we sit today.\n\nPete Heckman -- D.A. Davidson -- Analyst\n\nOK. I appreciate it.\n\nOperator\n\nThank you. [Operator instructions] Please stand by for our next question. Our next question comes from the line of Kyle Peterson with Needham & Company. Your line is open.\n\nKyle Peterson -- Needham and Company -- Analyst\n\nHey, good afternoon, guys. This is Kyle Peterson on for Mayank. Thanks for taking the questions. Just wanted to kind of square with the commentary.\n\nI think you guys kind of hinted that some of the bookings and demand seem to actually improve as the quarter progress, which kind of a rental contrary to what we're seeing with a lot of other software companies in the space. Is some of this just your kind of geographic mix business that you guys are a little heavier on the domestic front and have a smaller international business today? Or is there anything else going on that we should be mindful of with regards to bookings?\n\nMike Jackowski -- Chief Executive Officer\n\nYeah. Kyle, I wouldn't say that our Q4 result was because of our international presence or geographic outreach. What I would say is, I've been talking about the fact that many deals throughout the year we've seen push and we were excited that a couple of deals that did push, we did finally get closed and then we had a couple of close on the timeframe that we expected. And that helped.\n\nAnd then our seasonal bookings, Q4 is typically one of our stronger quarters. We do expect bookings to be lighter in Q1 because from a seasonality perspective, it is usually one of our lighter quarters. So we're planning for that in our overall guide and you could see that in the overall numbers. But I think to answer your question more broadly on this overall concept when others are reporting the opposite.\n\nOne thing that I'll say is, insurance is an industry that tends to do quite well through economic up and down just because for many aspects of insurance, it's not a discretionary expense like retail would be or like marketing expense would be. You need to have an insurance to have a mortgage on your house, to drive your cars or we need insurance to run our business. And I think that helps. And now really what it's about is carriers addressing the inflation and can they get rates to offset it, because they are seeing an impact in their loss ratios.\n\nAnd that takes a little bit of time. And some of them are working that in their rates. Now they're going to step their fiscal year 2023 budgets. So we still think it's going to be conservative in fiscal year 2023.\n\nBut again, I think compared to other industries, I think it's an industry that we'll probably work through some of the economic uncertainty better than other industries.\n\nKyle Peterson -- Needham and Company -- Analyst\n\nGot it. That makes sense. And that's helpful. And maybe just a quick follow-up on inflationary pressures impacts you guys are kind of seeing in your own business.\n\nThere's profitability overall, but particularly in the services gross margin side was really impressive in light of what a lot of -- whether it's be PSIs or other companies in the space have been kind of reporting here, are you -- how are you guys kind of managing wage pressure and just other cost inflation? I know you guys kind of guided toward the services growth margins cooling off a little bit in the coming quarters. But how you guys been able to navigate that and how should we think about inflationary pressures in your business over FY 2023?\n\nKevin Rhodes -- Chief Financial Officer\n\nYeah. Maybe I'll cover that. I mean, we all are going to have wage inflation. We're all going to have cost inflation from vendors.\n\nWe've done actually a really good job recently of doing some good negotiations on the vendor side to keep some of that inflationary growth in check. But we're also focusing on making sure that where we can get CPI increases in the business that we're able to generate that to offset some of that inflation that one would experience on the cost side as well. So when you can kind of neutralize that a little bit from a revenue versus the expense side, that's a lot better. So I think that that's a good way to approach it.\n\nAnd if you will, all of that is baked into our guidance, both on the expense side, as well as the CPI increases.\n\nMike Jackowski -- Chief Executive Officer\n\nAnd Kyle, I'll just add. I think one thing we're quite proud of is the discipline that we've run this business. You could see we hit some strong profitability to finish the fiscal year and I think we do run the business with discipline. And then as Kevin said, we have some mechanisms on the revenue side that could help us PWP based pricing if they raise premiums, it's not in every -- it's kind of a stair step approach, so we don't always get it, but in many circumstances we do, as well as CPI and many of our contracts.\n\nSo we think we got protections on both sides as we exercise vigilance on the expense side and the revenue side.\n\nKyle Peterson -- Needham and Company -- Analyst\n\nGot it. That's really helpful and appreciate the color. Thanks, guys.\n\nOperator\n\nThank you. I'm not showing any further questions. I would now like to turn the call back over to Mike for closing remarks.\n\nMike Jackowski -- Chief Executive Officer\n\nOK. Thank you, everybody, for participating in our Q4 and fiscal year '22 earnings call. We're proud to end our fiscal year with a strong Q2 that exceed our expectations for all key metrics. We're also thrilled to close the deal with Effisoft, which positions Duck Creek to be the leader in reinsurance management and also a fist in our ambition to expand globally.\n\nWe head into fiscal year '23 with terrific momentum as we finish fiscal year '22 with our SaaS ARR of $169.3 million up 25% from prior year. And let me just wrap by again emphasizing that we have an enormous opportunity to continue to grow as the insurance industry continues to migrate core systems to the cloud. Thank you and have a good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Denyeau -- Investor Relations\n\nMike Jackowski -- Chief Executive Officer\n\nKevin Rhodes -- Chief Financial Officer\n\nDylan Becker -- William Blair and Company -- Analyst\n\nAlex Sklar -- Raymond James -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nSaket Kalia -- Barclays -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPete Heckman -- D.A. Davidson -- Analyst\n\nKyle Peterson -- Needham and Company -- Analyst\n\nMore DCT analysis\n\nAll earnings call transcripts"
}