{
  "companyName": "Angel Oak Mortgage, Inc.",
  "companyTicker": "AOMR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/angel-oak-mortgage-inc-aomr-q2-2022-earnings-call/",
  "content": "Angel Oak Mortgage, Inc. (AOMR -5.78%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Angel Oak Mortgage second quarter earnings call. At this time, all participants are in a listen-only mode. A brief question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, Randy Chrisman, chief marketing officer at Angel Oak Capital. Thank you, Randy. You may begin.\n\nRandy Chrisman -- Chief Marketing Officer\n\nGood afternoon. Thank you for joining us today for Angel Oak Mortgage REIT second quarter 2022 earnings conference call. This afternoon, we filed a press release detailing our second quarter 2022 results, which is available in the investors' section on our website at www.angeloak.reit. As a reminder, remarks made on today's conference call may include forward-looking statements.\n\nForward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those discussed today. We do not undertake any obligation to update our forward-looking statements in light of new information or future events. For a more detailed discussion of the factors that may affect the company's results, please refer to our earnings release for this quarter into our most recent SEC filings. During this call, we will be discussing certain non-GAAP financial measures.\n\nMore information about these non-GAAP financial measures and reconciliations to the most directly comparable GAAP financial measures are contained in our earnings release and SEC filings. This afternoon's conference call is hosted by Angel Oak Mortgage REIT's chief executive officer, Robert Williams; chief financial officer, Brandon Filson; and Angel Capital's co-CIO, Namit Sinha. Management will make some prepared comments, after which we will open up the call to your questions. Additionally, we recommend viewing our earnings supplement posted on our website at www.angeloakreit.com.\n\nNow, I will turn the call over to Robert.\n\nRobert Williams -- Chief Executive Officer\n\nThank you, Randy, and thank you, everyone, for joining us today. In the second quarter of 2022, Angel Oak Mortgage REIT demonstrated resilience against the continued volatile environment that saw further increases in interest rates and widespread dislocation across fixed income and securitization markets. In spite of these challenges, AOMR celebrated the one year anniversary of its IPO. We are proud of the growth of the company in our first year of being publicly traded.\n\nSome notable one year milestones include: our target asset base more than doubled to $3.2 billion; the purchase of over $1.5 billion of high-quality non-QM loans; and as of today, an increase in our loan financing capacity since IPO of over $1 billion to a total of $1.9 billion. Additionally, with today's dividend announcement, we have paid $1.83 per share in dividends, well covered by distributable earnings. We remain fully aligned with the Angel Oak ecosystem, which continues to demonstrate its strategic advantages, and our strategy remains consistent. We deploy capital into our targeted, high-quality, non-QM mortgage loans, programmatically securitize these loans to lock in a fixed cost of funding in term structural leverage, and reinvest capital into our targeted assets.\n\nAs I mentioned, we again observed an extremely volatile and uncertain fixed income market in the second quarter as the Fed continued to increase interest rates, exerting downward pricing pressure on our mark-to-market assets. This impact was partially offset by our interest rate hedging strategy. As a reminder, we do not hedge credit spreads, which widened significantly during the quarter, putting material short-term pressure on book value. We faced an extremely limited securitization market and did not find it beneficial to execute a securitization during the quarter.\n\nHowever, we remain vigilant and were able to execute a securitization in July. We will continue to monitor the securitization market daily. Securitization of current loan production is generating attractive returns with potential upside. We expect book value will stabilize over the next few quarters.\n\nWith that said, we continue to believe our non-agency asset portfolio, methodical growth, and sound liquidity management strategy position us well to withstand market volatility. As we stated last quarter, the Angel Oak ecosystem enables AOMR to effectively customize our desired loan characteristics as markets evolve, which includes the ability to adapt to and capitalize on higher mortgage rates. So far in 2022, non-QM loan volumes have retreated slightly but remain strong. Home price appreciation, while appeared to flatten slightly, has continued, and delinquency rates remain near historical lows.\n\nAngel Oak's growth continues to be driven by quality origination as our recently originated loans have higher average FICO scores and lower average LTVs and DTIs than prior years. Looking forward, we believe we can continue to capitalize on our key differentiators, which I would like to highlight. First, origination of non-QM loans on a large scale requires unique capabilities that takes years to develop and refine. Extensive underwriting and verification must be conducted for a non-QM loan, which creates a high barrier to entry.\n\nAngel Oak has invested substantial time and capital over 11-plus years to develop thorough and efficient systems of underwriting and origination, providing enormous amounts of data which we alone can utilize. Second, Angel Oak Mortgage Lending, as the loan originator, has the ability to adjust their credit, borrow, and origination as circumstances evolve. As mentioned previously, this includes the ability to increase or decrease mortgage rates in a volatile rate environment. Due to our proprietary access to Angel Oak's ecosystem, we can similarly purchase loans with our desired characteristics.\n\nImportantly, members of the mortgage and portfolio management teams meet daily to discuss credit and current pricing metrics, enabling AOMR to quickly adjust to changing market conditions. Third, Angel Oak has unmatched experience and marketplace brand recognition in aggregating non-QM loans and executing on securitizations. Over the years, Angel Oak has completed over 30 securitizations, including four for AOMR in 2021 and 2022. These securitizations lock in long-term financing and net interest margin while reducing our liquidity risk.\n\nAs stated, because non-QM loans typically carry a meaningful spread to conventional mortgage rates, we can often achieve superior returns with lower leverage than many of our peers. We remain confident we can achieve strong portfolio growth over time, supporting a robust and durable distributable earnings, cash flow, and dividends. As such, we are pleased to declare a second quarter 2022 dividend of $0.45 per common share, payable on August 31st, 2022 to shareholders of record as of August 22nd, 2022. With that, I'm pleased to turn it over to Brandon.\n\nBrandon Filson -- Chief Financial Officer\n\nThanks, Robert, and thanks, everyone, for joining us. For the second quarter of 2022, we had a GAAP net loss of $52.1 million or $2.13 per common share and distributable earnings of $22.8 million or $0.90 per common share. Q2 annualized distributable return on average equity was 23.1%. The difference between GAAP and distributable earnings is attributable to the growth of our income-generating investment portfolio, the impact of realized gains from interest rate hedges, and the add back of unrealized losses on our mark-to-market loan and securitized loan portfolios.\n\nIn the current quarter, we saw our target asset portfolio increase from $2.7 billion to $3.2 billion, representing a 19% increase. Interest income for the quarter was $29.7 million, a 10% quarter-over-quarter increase. Net interest margin was $16.4 million, representing a slight quarter-over-quarter decrease due to the increased financing cost on our loan portfolio during Q2. GAAP book value per share was $14.73 on June 30th, 2022, including the impact of our $0.45 per share common dividend paid in May, down from $16.80 as of March 31st, 2022.\n\nThis 12.3% decrease was driven by unrealized mark-to-market losses on our whole loan, on balance sheet securitizations, and R&D portfolios. This quarter, we introduced a new non-GAAP book value measurement, which we call economic book value. Economic book value includes valuing all securitization obligations to their fair value. We believe this new metric will provide meaningful information to investors on the current value of the company.\n\nEconomic book value was $16.05 per share on a diluted basis on June 30, 2022, down 8.8% from $17.61 per share as of March 31st, 2022. During the second quarter, we purchased $257 million of non-agency mortgages. Increased coupons of our new loan purchases are beginning to have an impact on our loan portfolio. The weighted average coupon of loans on our portfolio increased from 4.52% to 4.68% from the end of Q1 to the end of Q2.\n\nThe weighted average coupon of loans purchased in June and July were 6.46% and 6.93%, respectively. The latest locks on our loans are affiliated mortgage companies are over 7.5% weighted average coupon. Note that due to the loan origination process, our loan purchases in any given month will typically reflect loan locks from one to two months prior. Turning now to our securitization activity.\n\nAs Robert previously stated, we did not find an accretive opportunity to execute a securitization during the second quarter. While our target is and continues to be to execute one securitization per quarter and we do not attempt to time the securitization market, the illiquidity and dislocation of the securitization market during the second quarter prevented us from identifying an accretive securitization opportunity. However, July proved to be a bit more accommodative, and we completed our fourth securitization since our IPO of $185 million securitization, where we placed 86% of the capital structure at a 5.8% weighted average cost of funding. The deal included 407 loans with a weighted average coupon of 5.22%, an average credit score 730, loan-to-value ratio of 75.1%, and a debt-to-income ratio of 32.1%.\n\nThis transaction was also rated by Fitch, with a senior tranche receiving a triple A rating. While the securitization will not have the absolute return generation of some of our previous securitizations, it is still an important step in fixing liquidity and funding costs through the life of the loans. The securitization deal freed up additional cash, reduced loan financing facilities by over $150 million, and helped to clear out lower coupon loans to be replaced with loans over 7% and weighted average coupons. Going forward, we will continue to target at least one securitization each quarter.\n\nHowever, we could have a quarter with more than one securitization, or in this securitization market may decide to co-mingle our loans with loans from other Angel Oak affiliates to ensure that we are taking advantage of the securitization market and focused in diligent way. Turning to expenses. Our operating expenses for the second quarter were $7.3 million. Overall, operating expenses decreased by approximately $2.9 million in the current quarter compared to Q1 2022.\n\nThe key driver of this decrease in operating expenses, that there were no securitization costs in the quarter and a reduction in due diligence and transaction expenses as the loan purchase volume decreased in the quarter. With regard to our balance sheet, at June 30th, we had $16.1 million of cash and cash equivalents. Our recourse debt-to-equity ratio was 3.4 times. We have a total of $1.3 billion in residential whole loans, $983 million of residential mortgages and the securitization trusts and $923 million of RMBS, including $74.7 million in retained AOMT securities from the pre-IPO securitizations, unencumbered assets total of over $160 million and undrawn loan financing capacity of over $540 million.\n\nAdditionally, note that as of July 31st, we held $39.8 million in cash and cash equivalents and reduced our borrowings after the July securitization. As of June 30th, we had loan financing facilities with seven financial institutions. We increased our total loan financing capacity by $340 million to $1.64 billion in the second quarter. This was done by closing an additional line with a new counterparty.\n\nSubsequent to quarter end, this line was increased an additional $240 million, bringing our total loan financing capacity to 1.9 billion. This, combined with our unencumbered asset balance as of the end of the quarter, demonstrates our commitment to a sound liquidity management strategy during this period of rising rates. Given the strong income-generating foundation of our portfolio and significant distributable earnings coverage, we declared a $0.45 cent per share common dividend paid on August 31st, 2022 to shareholders of record as of August 22nd, 2022. This implies an annual dividend rate of over $1.80 per share or yield over 12% as of the closing price on August 8, 2022.\n\nLastly, in the second quarter, we repurchased approximately 190,000 common shares for approximately $3 million through our 10b5-1 stock repurchase plan. This plan expired on July 18th and was not renewed. For additional color on our financial results, please review the earnings supplement available on our website. I will now turn it back to Robert for closing remarks.\n\nRobert Williams -- Chief Executive Officer\n\nThank you, Brandon. We are proud of Angel Oak's resilience amid this challenging environment. Going forward, we continue to believe that we are differentiated in several ways. First, as part of the Angel Oak ecosystem, we are aligned with the most seasoned and experienced originators and managers of non-QM mortgages, providing unique access to a steady flow of investments.\n\nSecond, we have a strong balance sheet with ample liquidity to execute on our strategy; and third, superior credit underwriting. We are focused fundamentally on credit, and credit metrics remain better than ever. This has always been core to Angel Oak and will not change. In summary, our portfolio remains strong.\n\nWe are confident that we can operate in this complex environment by focusing on strong underwriting and sound liquidity. As always, I would like to thank the entire Angel Oak team for their hard work and contributions to our successes. With that, we'll open up the call to your questions. Operator?\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] One moment, please, while we poll for questions. Thank you.\n\nOur first question is from Don Fandetti with Wells Fargo. Please proceed with your question.\n\nDon Fandetti -- Wells Fargo Securities -- Analyst\n\nYeah. So good to see the securitization done. I guess if you think about the next couple of quarters, you know, the coast is certainly not clear. A lot of uncertainty.\n\nHow are you thinking about managing your cash position and future securitizations? You know, good to see the cash position moved back up in July, but I didn't know if you felt like you needed to build up a larger position.\n\nNamit Sinha -- Co-Chief Investment Officer\n\nYeah. Hi, this is Namit. So, on the liquidity side, obviously the -- we keep a close tab on, not just the cash but also on the unencumbered assets because sometimes we don't want to run a very big cash position, but at the same time you could have a decent chunk of loan sitting unlevered, or without any financing which could be turned into cash on very short notice. So, we look at that in combination.\n\nAnd we, obviously, are going to monitor the market and act accordingly. On the securitization side, you know, we are definitely seeing some green shoots right now. No, as you said, it's a pretty choppy environment. And things have gone back and forth over the last few months in terms of the strength of the market as it relates to securitizations.\n\nBut, you know, we are prepared to go, as Brandon mentioned, we are prepared to go into a co-mingled securitization with other funds or potentially a stand-alone as the need arises and as the market presents opportunities, which at the very moment, I would say, that it looks like a decent opportunity. And obviously, you know, it could change again tomorrow with the CPI print and etc., [Inaudible] It's a very data-sensitive macroenvironment that we are living in. But to the extent that we continue to see the standard we are seeing over the last couple of weeks, we would obviously look to tap into the securitization market more frequently than we have in the last quarter.\n\nDon Fandetti -- Wells Fargo Securities -- Analyst\n\nAnd then just one housekeeping question. What was the denominator of the share count for the $0.90 of DE this quarter?\n\nBrandon Filson -- Chief Financial Officer\n\nIt was our fully diluted share count since I was in [Inaudible] we didn't do the undiluted.\n\nDon Fandetti -- Wells Fargo Securities -- Analyst\n\nOK. So, what's that number, Brandon?\n\nBrandon Filson -- Chief Financial Officer\n\nI don't have that right off the top of my head, but I can give that to you, for the fact.\n\nDon Fandetti -- Wells Fargo Securities -- Analyst\n\nOK. Got it. All right, I'm all set. Thank you.\n\nOperator\n\nThank you. Our next question is from Chris Kotowski with Oppenheimer. Please proceed with your question.\n\nChris Kotowski -- Oppenheimer and Company -- Analyst\n\nOh, good afternoon. Thank you. I guess, first of all, looking at Slide 8 on the details on your securitization. You know, it just struck me, in prior securitizations, there was a, you know, big spread, as you would expect, between the A tranche and the B and lower tranches, whereas here there is hardly any [Inaudible] at all.\n\nI'm wondering why that would be. And then also, maybe I missed it, but did I hear you say the total cost of the financing was something like 5.6% because I see the coupon here is 5.22%?\n\nNamit Sinha -- Co-Chief Investment Officer\n\nYeah. Hi, this is Namit again. So, what you see in the coupon is just the coupon on the bonds, and they can be priced at a discount. That reflects through spread.\n\nSo if you were to look at the actual spread at which these bonds were priced, the A1s were priced at 240 over A2s which is the Double-A was priced at 370 over; and the A3s, which is a single A was priced at for 425 over. But obviously, the coupons on the bond is limited by the coupon on the loan itself. So all three of them carried the same coupon but then priced at different discount prices.\n\nChris Kotowski -- Oppenheimer and Company -- Analyst\n\nI'm not sure I understand that. But I guess what's the overall cost of the securitization, too, and how much did you retain?\n\nNamit Sinha -- Co-Chief Investment Officer\n\nSo, the end weighted average cost of funding on the securitization was 5.8%. And we retained tranches at triple B and below as shown in the slide.\n\nChris Kotowski -- Oppenheimer and Company -- Analyst\n\nOK. And so presumably, these were mainly lower coupon loans originated late last year, early this year?\n\nNamit Sinha -- Co-Chief Investment Officer\n\nYes. So that the average coupon on the loan pool that was securitized was 5.22%. So, it is materially lower than the coupon that we are locking in today, which is in excess of 7.5%.\n\nChris Kotowski -- Oppenheimer and Company -- Analyst\n\nOK. Then I'm also wondering, can you walk us through exactly the difference between the GAAP book value and your new measure? And I read that sentence as the bottom in the economic book value marks the amortized cost liability balances of our nonrecourse financing obligation. I read that a couple of times and I'm not sure exactly what it means. So, what's the underlying concept behind this new measure?\n\nBrandon Filson -- Chief Financial Officer\n\nYeah, it's really related to our on-balance sheet securitizations we did in 2021. So, the obligation related to 21-4, 21-7 securitizations, where at the time we didn't elect the fair value option for that securitization, meaning that we're not marking that to fair value, it's just basically staying at cost. And those bonds were issued nearly at cost. So unlike, that Namit was just mentioning, some of these bonds being issued at a discount, those were essentially at par.\n\nSo, they're staying at par. But in a rising rate environment, the bonds we sold are going to be worth a bit less. And that's what we're adjusting back out on those two earlier securitizations. So those bonds that were issued at par during 2021 are now trading at a bit of a discount.\n\nAnd we marked down the liability in that economic book value calculation accordingly.\n\nChris Kotowski -- Oppenheimer and Company -- Analyst\n\nOK. All right. And then last for me is on Page 8, you know, where you have the build back to the distributable earnings and the 24.7 million of add back on the derivative. Normally, I always -- and the 38 million on the losses on the residential loan funds.\n\nI mean, normally, it always seemed to me like in theory, those two lines should be going in different directions, you know, because presumably the derivative hedges are hedging the residential loans. Is the issue here that the marks on the residential loans are primarily credit hedges? What explains the pattern, I guess? Let me leave it there.\n\nRobert Williams -- Chief Executive Officer\n\nWell, part of it is just a timing thing because as we have to roll those hedges, you know, we take realized gains. The other part you mentioned, you hit it on the head a little bit, is some of the mark-to-market losses we had in the loan book were due to spread widening, which is not being edged. So, we had a little bit of a rate rally. So, we had some unrealized losses on the hedge, but that was counteracted by the spread widening on the loan book.\n\nAnd so you're looking at -- if you think about the loan side, and that's also a cumulative effect throughout the quarter, or the unrealized on the hedges is more of a -- you know, because we are having to roll those hedges every couple of months. So, these just are the latest hedges we put on, did lose some value from an unrealized basis near the end of the quarter.\n\nChris Kotowski -- Oppenheimer and Company -- Analyst\n\nOK. And then, I mean, I guess -- I don't know how to quantify this, but the securitization that you were able to do, I guess, how much of the, you know, I guess backlog of kind of low coupon [Inaudible] you know, back half of '21, early '22, you know, mortgages where you're able to clean up with that? I mean, obviously, I guess it's 185 million, but I'm just kind of curious how much -- how that compares to, you know, similar kind of what's the pool of remaining similar kind of, you know, low coupon loans left on your balance sheet?\n\nNamit Sinha -- Co-Chief Investment Officer\n\nYeah. So, I mean, as you rightly said, the deal was 185 million. And that leaves us with the rest of the loans that we are working through the securitization. And the coupon drift is expected to be higher as we take any cash release coming out of the securitizations and reinvest in 7.5 coupon loans.\n\nSo effectively, the idea is to keep bringing these deals out. On average, as you -- as Brandon mentioned in the call earlier, that the coupon is right in that context. So, the coupon that we're starting off on the entire pool is still a relatively low coupon pool of loans. And the only way to make the coupon to go up is to effect these securitizations on these lower coupon loans and then reinvest the cash into the 250, 300 basis points higher coupon loans that we are making today.\n\nChris Kotowski -- Oppenheimer and Company -- Analyst\n\nOK. All right. That's it for me. Thank you.\n\nOperator\n\n[Operator instructions] Our next question comes from Matthew Howlett with B. Riley. Please proceed with your question.\n\nMatthew Howlett -- B. Riley Financial -- Analyst\n\nOh, hey, guys. Thanks for taking my question. I'll start off with the state of the non-QM market. There's been a lot of headlines on some originators holding, you know, these expectations of consolidation.\n\nJust want to hear from you guys on the Angel Oak, how you're positioning to take advantage of the market, and just sort of what's the update on the state of the industry.\n\nNamit Sinha -- Co-Chief Investment Officer\n\nYeah, you rightly said. I mean, there's obviously been pain in the industry over the last three or four months with the extreme levels of oil in the industry as well. And obviously, I would say that you're right, we saw some headlines around a couple of originators holding and then there are more that are struggling, I would say. In that kind of an environment, we do expect Angel Oak to sort of cement its leadership position and take advantage from a market share standpoint.\n\nYou know, obviously, you know, it's not all clear by any means. And given where we are in the macro, there are certain events that could happen, starting from the CPI print tomorrow that could make the environment even tougher going forward, or it could improve over time. So, the amount of uncertainty in the macroenvironment is still pretty high. But that said, given what is happening from a competitive landscape, it does present us with a big opportunity to cement ourselves as a leader and increase the market share.\n\nFrom a volume standpoint, you know, we are doing very healthy clips of volume at our affiliate originators. They are down from our peak, but definitely, you know, at very healthy levels that we have the ability to grow without taking any expanded risk from a credit standpoint because of the competitive landscape shifting and some of the originators losing their ability to make these loans. So broadly speaking, I would say that while, you know, the overall challenges in the market is not a great thing to have, the silver lining there for us is that the stability of our platform allows us to increase our market share and take advantage of the situation.\n\nMatthew Howlett -- B. Riley Financial -- Analyst\n\nYeah. I mean, the coupons that you're getting at is over 7.5%. I mean, you know, for the credit line, they just look, you know, tremendous. And I guess that's my next question.\n\nI mean, how aggressive do you want to get in terms -- you've expanded your, you know, the credit lines and liquidity looks terrific. In terms of -- you know, you think you did about 37 million of acquisitions post quarter in of whole loans. I mean, how aggressive do you want to get in the back half of the year, you know, to continue to raise rates like this? Is it depending on the securitization market sort of coming back and taking some loans off the line because it just seems to me that these are going to be very high returning loans if, you know, if you continue to put them in the portfolio? Just talk a little about the acquisition pace in the back half of the year.\n\nNamit Sinha -- Co-Chief Investment Officer\n\nYeah. So, we're obviously very mindful of the fact that the loans being created today have very high total return potential. That also needs to be married with being disciplined around managing the securitization of the existing pipeline. And so, we are working on both ends effectively.\n\nActively looking to hit the securitization market as it presents the opportunity. As I mentioned earlier, we are seeing some green shoots around in that market with spreads coming in. And more than spreads, it's actually the level of demand. And it could be driven potentially by a change in -- you know, there are certain -- you know, that the investor base has been very reluctant in the last three to four months.\n\nAnd that seems to be showing up as a different over the last few weeks, where we are seeing more deals come out that are multiple times oversubscribed. So, quite aside from the spread, we are very encouraged by the investor participation in these deals. That gives us more visibility around our ability to securitize not just the lower coupon loans, but also cement the high returns on the higher coupon loans that we are originating today. So, to the extent that you have more visibility going forward over the next two or three or four weeks, we are definitely going to look at how aggressive you want to be in originating these high coupon loans and buying into the entity.\n\nMatthew Howlett -- B. Riley Financial -- Analyst\n\nGreat. So, if I heard you correctly, the securitization market, that things are beginning to tighten across the stack or triplet As?\n\nNamit Sinha -- Co-Chief Investment Officer\n\nYeah. We have seen some of that happen over the last week or two weeks. As I said, we have -- I just want to caveat that with the fact that, you know, over the last three, four months, we have had multiple periods where we saw improved execution and then went back. But we definitely are seeing levels of participation and subscription that looks very healthy right now.\n\nMatthew Howlett -- B. Riley Financial -- Analyst\n\nGreat. Thanks and appreciate the economic book disclosure. It makes things much easier to understand. So, I appreciate that new disclosure.\n\nThat's it for me. Thank you.\n\nRobert Williams -- Chief Executive Officer\n\nThank you, Matt.\n\nOperator\n\nThank you. There are no further questions at this time. I would like to turn the floor back over to management for any closing comments.\n\nRobert Williams -- Chief Executive Officer\n\nThank you, everyone, for your time and interest in Angel Oak Mortgage REIT. We look forward to connecting again with you next quarter. In the meantime, if you have any questions, please feel free to reach out to us and have a great evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRandy Chrisman -- Chief Marketing Officer\n\nRobert Williams -- Chief Executive Officer\n\nBrandon Filson -- Chief Financial Officer\n\nDon Fandetti -- Wells Fargo Securities -- Analyst\n\nNamit Sinha -- Co-Chief Investment Officer\n\nChris Kotowski -- Oppenheimer and Company -- Analyst\n\nMatthew Howlett -- B. Riley Financial -- Analyst\n\nMore AOMR analysis\n\nAll earnings call transcripts"
}