{
  "companyName": "Harmony Biosciences Holdings, Inc.",
  "companyTicker": "HRMY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/harmony-biosciences-holdings-inc-hrmy-q3-2022-earn/",
  "content": "Harmony Biosciences Holdings, Inc. (HRMY -0.11%)\nQ3 2022 Earnings Call\nNov 01, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. My name is Gretchen, and I will be your conference operator today. At this time, I would like to welcome everyone to the Harmony Biosciences third quarter 2022 financial results conference call. [Operator instructions] I will now turn the call over to Luis Sanay, head of investor relations.\n\nPlease go ahead.\n\nLuis Sanay -- Head of Investor Relations\n\nThank you, operator. Good morning, everyone, and thank you for joining us today as we review Harmony Biosciences third quarter 2022 financial results and provide a business update. Before we start, I encourage everyone to go to the Investors section of our website to find the materials that accompany our discussion today, including a reconciliation of our GAAP to non-GAAP financial measures. At this stage of our life cycle, we believe non-GAAP financial results better represent the underlying business performance.\n\nOur presenters on today's call are John Jacobs, president and CEO; Dr. Jeffrey Dayno, chief medical officer; Jeffrey Dierks, chief commercial officer; and Sandip Kapadia, chief financial officer. Moving on to Slide 2. As a reminder, we will be making forward-looking statements today, which are based on our current expectations and beliefs.\n\nThese statements are subject to certain risks and uncertainties. Our actual results may differ materially, and we undertake no obligation to update these statements even if circumstances change. We encourage you to consult the risk factors referenced in our SEC filings for additional details. I would now like to turn the call over to our CEO, John Jacobs.\n\nJohn? \n\nJohn Jacobs -- President and Chief Executive Officer\n\nThank you, Luis, and thank you, everyone, for joining our conference call today. We delivered another strong quarter in Q3 as we continued to execute on our three-pillar growth strategy, and we are excited about the momentum we see in the business, positioning us well for the remainder of the year. I would now like to highlight our progress on each of the three pillars of our growth strategy in the context of Q3 2022 performance on Slide 3. Starting with Pillar 1, which is to optimize the commercial performance of WAKIX.\n\nIn Q3 2022, we delivered another strong quarter for WAKIX with net sales of $117.2 million, a 45% year-over-year increase for the quarter. Our performance reflects the continued demand for WAKIX and the significant unmet need that remains in the narcolepsy market. For the remainder of the year, we expect continued growth for WAKIX, and we believe that the vast market opportunity, which remains in narcolepsy, provides us with the opportunity to grow Widex for years to come. Let's move on to Pillar 2, which is to expand the clinical utility of WAKIX beyond narcolepsy.\n\nThis morning, we announced top-line results from our Phase 2 proof-of-concept study in patients with Prader-Willi syndrome. top-line data showed a positive signal on the primary outcome of excessive daytime sleepiness, and we intend to advance this clinical program in PWS. Dr. Jeff Dayno will provide more details on the top-line study results later in the call.\n\nWe also continue to make excellent progress on our Phase 3 INTUNE study for WAKIX in idiopathic hypersomnia, or IH. This opportunity, if successful, could be the next potential indication for WAKIX. The IH opportunity is synergistic with our existing expertise and infrastructure, with the same HCP call universe as narcolepsy, which will allow for significant efficiencies for the launch if we succeed. We are excited with the continued advancement of our pipeline programs and are hopeful that these efforts could lead to additional indications for Waxix.\n\nAnd finally, Pillar 3, acquiring new assets through business development to expand our portfolio beyond WAKIX. In late September, we closed our new agreement with Bioprojet, which will enable us to pursue new therapeutics based on pitolisant for the treatment of narcolepsy and potentially other indications mutually agreed to by the parties. If successful, these efforts could expand Harmony's franchise in narcolepsy and potentially other indications by yielding one or more new products with the potential to launch during the WAKIX life cycle. We look forward to providing additional updates as we advance these efforts.\n\nAs we have said before, we began our business development efforts early in our company history, so we could take the time to be thoughtful and prudent in what we acquire and flexible in the types of transactions we're able to consider. Over time, our intention is to develop a broad portfolio of rare orphan neurology assets and/or assets and other neurological diseases where we can leverage our existing expertise and infrastructure. To achieve this, we intend to leverage our strong financial position to acquire additional assets over time and across a range of development stages, including both early and later stage, with the potential to launch both during and after WAKIX life cycle. We are in a solid position to execute on Pillar 3 as our business fundamentals with WAKIX remains strong.\n\nWe had approximately $316 million in cash, cash equivalents and investment securities as of Q3, and we anticipate that we will continue to generate cash moving forward. Overall, I'm extremely pleased with the progress on our three-pillar growth strategy. We remain confident in WAKIX being a potential $1 billion-plus franchise in the coming years via narcolepsy and additional indications. And with that as a foundation, I am truly excited about what we can achieve next at Harmony.\n\nI would now like to turn the call over to Jeff Dierks, our chief commercial officer, to provide more details on our commercial performance. Jeff?\n\nJeff Dierks -- Chief Commercial Officer\n\nThanks, John. We continue to see strong momentum in our business and made significant strides in the third quarter of 2022, both in net revenue and underlying business fundamentals shown on Slide 4. Net revenue for the third quarter was $117.2 million, which represents a 45% increase from the same quarter of previous year. We're also pleased with the 10% sequential growth from the second quarter of 2022, demonstrating continued strong performance and growth for WAKIX in the adult narcolepsy market.\n\nI'd like to take a moment to highlight a few of our underlying business fundamentals on Slide 5 that drove our performance in Q3 2022. The average number of patients on WAKIX increased to approximately 4,600 in the third quarter. The growth in Q3 reflects the continued strong underlying demand for WAKIX, building upon the strong second quarter we saw earlier this year. Q3 top-line prescription demand, new patient starts and refill behavior remained strong through the typical summer seasonality, in part due to the following factors.\n\nFirst, Harmony field sales in-person engagement with healthcare professionals in their office staff increased in the third quarter. Approximately 85% of all Harmony field sales engagements with healthcare professionals and their office staff were in person in Q3, an approximate 10% increase from the previous quarter. The increase in access allowed for further education and engagement with healthcare professionals on the meaningfully differentiated product profile at WAKIX and provided an opportunity for our expanded field sales team to drive WAKIX growth in both new and existing prescribers. Second, the WAKIX prescriber base continued to grow.\n\nWe saw growth in new writers of WAKIX, as well as growth in prescribing from existing WAKIX writers. Growth in new prescribers continue to come from writers of traditional narcolepsy treatments, as well as healthcare professionals, who've been reluctant to prescribe other available scheduled narcolepsy treatments. Existing prescribers continue to find new adult patients with narcolepsy in their practices for WAKIX. Both naive patients as well as existing patients currently on other treatments with the residual symptoms of excessive daytime sleepiness or cataplexy.\n\nThe continued growth in both the depth and breadth of our prescriber base demonstrates the broad clinical utility of WAKIX and what we believe is a significant opportunity for growth in the years to come for WAKIX and adult narcolepsy. Recent market research conducted by Harmony with approximately 70 narcolepsy treating healthcare professionals reinforces our belief and demonstrated strong intent to increase future prescribing of WAKIX. The vast majority of WAKIX writer's surveyed expressed intent to increase their prescribing of WAKIX and cited the patient satisfaction and positive feedback on treatment as a primary driver. And lastly, we saw the impact of our field sales force expansion.\n\nOur expanded field sales team that was in place at the beginning of the second quarter extended the reach and frequency of our educational outreach among narcolepsy treating healthcare professionals in the third quarter. The increase in in-person access, coupled with greater reach and frequency and our education, helped to drive new patient starts among new and existing prescribers. We are excited about what we're seeing from our award-winning sales team and the difference they're making in the narcolepsy community. In summary, we believe our continued strong performance highlights the large remaining opportunity in narcolepsy.\n\nWe are beginning to see an anticipated rhythm to our business, and we continue to tap into this opportunity as the market allows around the typical seasonal dynamic that the pharmaceutical industry as a whole experiences each year. The strong performance and solid underlying business fundamentals of WAKIX affirm our confidence in the future growth opportunity for WAKIX in adult narcolepsy and reaffirms our belief that WAKIX is a potential $1 billion-plus franchise opportunity in narcolepsy and other additional indications. I'll now turn the presentation over to Dr. Jeff Dayno for an update on our clinical development programs.\n\nJeff?\n\nJeff Dayno -- Chief Medical Officer\n\nThank you, Jeff, and good morning, everyone. I will provide an update on Pillar 2 of our company growth strategy to increase the clinical utility of pitolisant toward potential new indications in additional patient populations living with rare neurological diseases. This morning, we announced promising initial top-line data from our Phase 2 proof-of-concept trial in patients with Prader-Willi syndrome, or PWS. On behalf of Harmony, I would like to thank the patients with PWS and their families who participated in this clinical trial.\n\nAs shown on Slide 6, this trial was a randomized, double-blind, placebo-controlled study designed to assess the safety and efficacy of pitolisant in patients with PWS. This proof-of-concept study was not powered to demonstrate statistical significance, but rather was designed for signal detection. This study included patients ages six to 65 years who were evenly randomized in a 1:1:1 fashion to low-dose pitolisant, high-dose pitolisant, or placebo treatment groups. The pitolisant dosing was based on three age cohorts, children six to less than 12, adolescents, 12 to less than 18 and adults 18 to 65.\n\nAnd another objective of the study was to evaluate for a dose response to pitolisant in patients with PWS. The primary endpoint of the study was the evaluation of excessive daytime sleepiness or EDS as measured by change from baseline to end of treatment on the Epworth Sleepiness Scale for children and adolescents referred to as the ESS Chad parent caregiver version of the scale. The demographic data showed the following: a total of 65 patients enrolled in the trial, 91% completed treatment and all but one patient opted to continue into the open-label extension, which is ongoing. Mean age of the study population was 12 to 13, with 51% of the patient's male and 49% female.\n\nOf the total study population, 52% were children, 29% were adolescents and 19% for adults. The top-line study results are summarized on Slide 7. Mean baseline ESS Chad scores ranged from 14.7 to 15.7, representing a moderate to severe degree of EDS at baseline. Mean change from baseline to end of treatment on the ESS Chad scores ranged from negative 3.7 to negative 5.5 across all age groups and dosage groups, representing a clinically meaningful change in the active treatment groups, which is defined as a greater than or equal to two point improvement on this scale as per the American Academy of Sleep Medicine treatment guidelines that were published in September 2021.\n\nIn two of the three age groups, the children and adult groups, there was a clinically meaningful difference with a minimum of two points between pitolisant and placebo, driven by the high-dose pitolisant treatment group. In the adolescent age group, there was a high placebo response of a magnitude of three times that seen in the other two age groups, which resulted in the lack of a clinically meaningful difference between the pitolisant and placebo in this age group. Slide 8 shows the results of a responder analysis from the top-line data, which was defined as an improvement on the ESS Chad parent caregiver version of greater than or equal to three points or a score of less center equal to 10 at end of treatment, which is a more conservative definition of response. Response rates were 70% in the high-dose pitolisant Group, 55.6% in the low-dose pitolisant group and 52.6% in the placebo group.\n\nLastly, Slide 9 shows the snapshot of the overall safety tolerability profile of pitolisant seen in this trial, which was consistent with the known safety tolerability profile of pitolisant. Adverse events were reported in 57% of patients on pitolisant and 65% of patients on placebo. Treatment-related adverse events were reported in 26% of patients on pitolisant and 30% of patients on placebo. The most common adverse events reported were anxiety, irritability and headache.\n\nThere was one serious adverse event in a patient in the placebo treatment group. In summary, we are encouraged with the top-line data, which showed that treatment with pitolisant resulted in a clinically meaningful reduction in the ESS Chad parent caregivers scores in all age groups and across both low dose and high-dose treatment arms, as well as a clinically meaningful difference from placebo in the children and adult subgroups. Pitolisant was well tolerated in this clinical trial, with an overall safety tolerability profile that is consistent with the known safety tolerability profile of pitolisant. Looking ahead, we expect to receive the full data set before the end of the year, which will include the results on the secondary outcomes, including caregiver and clinician global impression scores, as well as measurements of behavioral symptoms, cognitive function and hyperphagia.\n\nThe positive signals observed on the primary outcome of EBS from this proof-of-concept study are promising, and we look forward to receiving the full data set from this initial signal detection study, which will further inform our understanding of the data as we plan to advance our clinical development program for pitolisant in patients with PWS. In the meantime, I want to thank our clinical investigators and their teams who partnered with us in the conduct of this trial, as well as the patients with PWS and their families who participated for whom we are grateful. As we know, there are limited therapeutic options available for people living with PWS, resulting in a significant unmet medical need. Turning to our other clinical development programs shown on Slide 10, we have made significant progress on those as well.\n\nStarting with our development program in idiopathic hypersomnia, or IH, which we are very excited about. After initiating our Phase 3 registrational trial in adult patients with IH in April, known as the INTUNE study, we are seeing very good momentum in patient enrolment, with over 70% of our planned clinical trial sites being active. If this Phase 3 trial is successful, it could represent the next new indication for WAKIX in adult patients with IH. Moving on to our development program in myotonic dystrophy, or DM.\n\nEnrollment continues in our Phase 2 proof-of-concept study in adult patients with type 1 myotonic dystrophy, or DM1. We have activated sites in Canada in areas where there is a large population of patients with DM1. We anticipate top-line data from the Phase 2 proof-of-concept study in 2023, and we'll provide an update on the timing of this data readout early next year. Finally, with regard to pediatric narcolepsy and a pediatric indication for WAKIX, our partner, Bioprojet completed a Phase 3 trial in pediatric narcolepsy patients.\n\nBioprojet submitted the data to the EMA second quarter this year, seeking approval for a pediatric narcolepsy indication. EMA's decision on Bioprojet's pediatric narcolepsy submission is anticipated early next year, which could help inform our strategy related to submission of this data to FDA. In the meantime, we are committed to obtaining pediatric exclusivity for WAKIX and submitted a request for a pediatric written request or PWR, during the third quarter. We will provide an update on our interactions with FDA related to this request once we hear back from them.\n\nTo conclude, we have made significant progress in advancing our clinical development programs at Harmony. We are encouraged by the initial top-line data from the PWS Phase 2 proof-of-concept study and the positive signal that was generated for EDS. We look forward to learning more when the full data set is available later this year, after which we will request an end of Phase 2 meeting with FDA. Our plan is to present the findings at a future medical meeting and submit the full results for publication to a scientific journal.\n\nFor IH, we are very excited about the interest and momentum we are seeing in our INTUNE study, a Phase 3 registrational trial in adult patients with IH. We continue to appreciate all the effort to the clinical investigators and their teams who are partnering with us in the conduct of this trial and the interest from the IH patient community. If this Phase 3 trial is successful, it could represent the next new indication for WAKIX in adult patients with IH. I will now turn the call over to our CFO, Sandip Kapadia, for an update on our financial performance.\n\nSandip?\n\nSandip Kapadia -- Chief Financial Officer\n\nThank you, Jeff, and good morning, everyone. This morning, we issued our third quarter 2022 press release and filed our 10-Q, where you'll find the details of our financial and operating results. Our third quarter performance is also shown on Slide 11, 12 and 13. We experienced yet another strong quarter of performance, with year-over-year growth across several of our key metrics.\n\nWe're pleased with our year-to-date performance and the momentum we're seeing for the remainder of the year. For the third quarter of 2022, we reported net revenues of $117.2 million compared to $80.7 million in the prior year quarter. This represents a growth of 45% and reflects the strong underlying demand for WAKIX. In the third quarter of 2022, operating expenses were $82.3 million compared to $45.1 million in the prior year quarter.\n\nThe higher operating expenses were primarily driven by the $30 million initial licensing fee part of the new agreement with Bioprojet, as well as our ongoing commercialization of WAKIX and patient enrollment in our clinical trials. Operating income for the third quarter was $11.9 million compared to $21.1 million, a 43% decrease versus the prior year quarter. However, excluding the onetime $30 million initial licensing fee, operating income almost doubled versus the prior year quarter. In the third quarter of 2022, we released the valuation allowance on our deferred tax assets, resulting in a onetime $74.5 million income tax benefit for the quarter.\n\nThe release was driven by our history of profitability, which is a positive indicator of our ability to realize the value of the deferred tax assets in future periods. Non-GAAP adjusted net income for the third quarter was $58.1 million or $0.95 per diluted share compared to $23.4 million or $0.41 per diluted share in the prior year quarter. We believe non-GAAP adjusted net income better reflects the underlying business performance. Please see our press release for a reconciliation of this measure.\n\nDuring the third quarter of 2022, we generated approximately $55 million in cash from operations and ended the third quarter with $316 million of cash, cash equivalents and investment securities. As a reminder, the $30 million initial licensing fee to Bioprojet was incurred in the third quarter, but will be paid in the fourth quarter. Looking ahead, we expect quarter-over-quarter net revenue growth for Q4. We also expect to see increase in ongoing investments in R&D, SG&A as we continue enrollment in our Phase 3 IH registrational trial and continued commercialization of WAKIX.\n\nIn conclusion, our strong performance with WAKIX and the resulting cash generation is enabling Harmony to make important investments in our business while maintaining profitability and adding to our strong cash balance to execute on our three-pillar growth strategy. And with that, I'd like to turn the call back to John for his closing remarks. John?\n\nJohn Jacobs -- President and Chief Executive Officer\n\nThank you, Sandip. So in summary, our strong performance positions us well to execute on our three-pillar growth strategy. Based on the year-to-date results and demand trends we're seeing for WAKIX, we're confident that 2022 can be our best year yet in company history. Our intent is to continue growing WAKIX sales in narcolepsy via good commercial execution and strong organic demand for this unique and meaningfully differentiated product.\n\nTo continue to advance our clinical programs with the goal of expanding the utility of WAKIX beyond narcolepsy to help bring this innovative therapy to new patient populations and to continue to acquire new assets beyond WAKIX to develop a broad portfolio of rare orphan neurology assets and/or assets in other neurological diseases where we can leverage our existing expertise and infrastructure. We look forward to updating you on our progress. This concludes our planned remarks today. Thank you for joining our call, and I will now turn things back over to the operator to facilitate the Q&A session.\n\nOperator, can we please open the call to questions?\n\nOperator\n\nThank you. [Operator instructions] We'll take our first question from Francois Brisebois from Oppenheimer.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nHi, thanks for taking the question, congrats ona strong quarter here. So just in terms to both the quarter and the data, so maybe just on PWS or just to be clear, EDS or PWS to start, the placebo response in the adolescent, is that something that you guys have thoughts about why that might have been so strong? I know it's dangerous to cross compare and this was not powered for stats sake, but just looking at your previous trials, is there maybe an expectation with this patient population, placebo response might be higher than the narcolepsy patient population? Thanks.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nJeff Dayno, do you want to take that?\n\nJeff Dayno -- Chief Medical Officer\n\nSure. Yeah. Good morning, Frank. Thanks for the question.\n\nWith regards to the placebo response in the adolescent group, first of all, it's a bit too early to tell what's happening there without having seen all the data yet. The first thing in terms of, we know that group, if you look at the numbers, it's small and in that group, there were nine patients, so there's potential for greater variability. We also saw just in the top-line data that there was one outlier in that group. So given the outlier and the small end driving some of that variability.\n\nWith regards to placebo response in the other age groups, in the children and in the adults, they were consistent with what we saw in the narcolepsy trials. So we will obviously be looking into that further. The one other thing, too, is that when we have the PK data, we'll be able to look at PK/PD correlation exposure response. But overall, we're very encouraged by the overall data in terms of movement on the ESS in all of the age groups and in both dosage groups of more than 2 points showing a clinically meaningful change in the ESS as well as the separation, a clinically meaningful difference, in the children and the adults.\n\nAnd we'll look at that placebo outlier in the adolescent group when we have the full data set.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nOK. That's very helpful. And maybe -- go ahead.\n\nJeff Dayno -- Chief Medical Officer\n\nOn the data, Frank, we're very excited about it. And this is a tough patient community to treat. As you know, there's been many struggles to try to get therapies for patients in the group. So the patient community is encouraged so far with what we've seen and so are we.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nOK. Great. And I'll take the -- operator, a follow-up question. So just any issues, I'm just wondering, as the sales keep picking up steadily, have you seen any issues with reimbursement in terms of patients that might also be on an oxybate or has that not been an issue? And do you have a breakdown what percentage do you think of patients are actually on both pitolisant and oxybate and whether or not that percentage is growing?\n\nJohn Jacobs -- President and Chief Executive Officer\n\nThanks, Frank, after, Jeff Dierks, do you want to take that one?\n\nJeff Dierks -- Chief Commercial Officer\n\nSure. Thanks for the question, Frank. So what we've seen is really strong favorable market access really since very early in our launch, Frank, but we haven't seen any challenges with respect to reimbursement and getting coverage for WAKIX patients across commercial, Medicare or Medicaid. When you're looking at patients that may be concomitantly on both pitolisant and sodium oxybate, it's a relatively low percentage.\n\nWhat we've shared publicly, it's low double digits, Frank. Given that this is a rare orphan patient community and you've got a small percentage of these patients and they spread out over about 125 different managed care accounts, we have not seen any challenges in these small cohorts of patients on both oxybate and WAKIX continuing to get reimbursement for treatment.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nOK, thank you very much. That's it for me.\n\nOperator\n\nOur next question comes from David Amsellem from Piper Sandler.\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nHi. Thanks. So just a couple. First, can you comment and I apologize if I missed this on patient persistence.\n\nI'm wondering, in particular, how that has changed, if at all, as you're seeing more and more patients regularly see doctors in person. So talk about that and particularly persistence in the context of other wakefulness promoting agents, such as oxybate and modafinil. So that's number one. And then secondly, you've talked a lot about business development and M&A, I know you got a lot of questions about it, but I wanted to ask something a little more targeted, which is, your appetite for adding a late-stage asset or even a commercial stage asset where you can, in some way, leverage the commercial infrastructure you have in place.\n\nTo the extent you do something that's sort of a larger size, how large can you go in terms of capital allocation? Thank you.\n\nJeff Dayno -- Chief Medical Officer\n\nAll right, Jeff Dierks, why don't you take the first question and I'll take the second one.\n\nJeff Dierks -- Chief Commercial Officer\n\nSure. So David, with respect to patient persistency, what we've disclosed publicly is that you continue to see discontinuation rates of drugs in this entire category range between 30% and 50% at 12 months. Consistent with other chronic medications, there usually is an additional discontinuation rate after the first year. It's at a much lower rate but it does continue over time.\n\nBut what we've actually seen recently, and it probably doesn't come to any surprise and certainly doesn't come as a surprise, and certainly doesn't come as a surprise to some of the healthcare professionals, is as we're coming out of the COVID time period and as we're getting greater engagement between patients and their healthcare professionals, we have seen a slight increase in improvement in the discontinuation rates among all of these products. Now healthcare professionals tell us that WAKIX DC rate is consistent with other products in this category. Their perception is it's a little bit better than what they're seeing with some of their other traditional medicines. We're seeing great persistency for those patients that stay on the drug, about 90-plus percent of patients are compliantly taking the drug every day as prescribed by their doctors.\n\nSo extremely pleased by what we're seeing in the marketplace, the receptivity of the product and patient feedback.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nYup. And then David, your second question, absolutely, we're open to later-stage assets and assets that may already even be revenue generating. As we said all along, we started this journey in business development very early in our company history, so we could be very prudent and choiceful in what we acquire with a distinct focus on what we know how to do well at Harmony, rare orphan neuro and or neurology, where we can leverage our strong and proven successful infrastructure and experience base in this arena. And so that absolutely includes later-stage assets.\n\nIn fact, our desire is to build a portfolio of both early stage and later-stage assets that has the potential for product launch both during and post WAKIX life cycle. And finally, we're in a very good position on capacity, Sandip, did you want to address our capacity for doing deals?\n\nSandip Kapadia -- Chief Financial Officer\n\nSure. As you mentioned, John, we're in a very strong position. As of the end of the last quarter, we had $316 million on the balance sheet. As you also saw, we had a really strong cash generation, $55 million this past quarter we generated from operations.\n\nOf course, we continue to have access to capital, whether it be the additional debt capital. We have still $100 million shelf at Blackstone that we can certainly pull on. And then, of course, we can also access the public market. So I think we have a lot of optionality in terms of capital allocation.\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nThank you, Sandip. Thank you, David.\n\nThank you.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nDo we still have connectivity in the line?\n\nLuis Sanay -- Head of Investor Relations\n\nWe do. Hey, Gretchen?\n\nOperator\n\nOur next question comes from Charles Duncan from Cantor Fitzgerald.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nSuper. Hopefully, you can hear me. John and team, congrats on a great quarter. So I had two questions, one commercial, one pipeline.\n\nWith regard to the commercial question, I guess I'm wondering if Jeff or John could speak to the current field sales force? I guess I'm wondering if you feel like with the incremental growth in it, do you feel like it's optimized? Would you consider, I think you mentioned that you are, I guess, fully understanding the rhythm in your business, so does that point to a possible guidance for next year?\n\nJohn Jacobs -- President and Chief Executive Officer\n\nYeah. Jeff, why don't you address the sales force component and then Sandip can address our thoughts around guidance. Go ahead.\n\nJeff Dierks -- Chief Commercial Officer\n\nSure. No, great question, Charles. Thanks very much for asking. So our field sales team, we have 77 individuals in the field.\n\nAnd Charles, we do believe and feel that it is optimized for the current adult narcolepsy opportunity. We're calling on about 9,000 healthcare professionals. And given what we saw earlier in this year about the broadening of the prescriber opportunity outside of those oxybate REMS enrolled doctors for physicians that traditionally did not prescribe scheduled medicines. We added 10% more to our field sales team.\n\nWhat we saw in the third quarter is with greater openness and engagement, we were able to increase the reach and frequency of our healthcare professionals, which really helped to drive new patient starts in both new and existing prescribers. One of the other things, Charles, that we've also done to help augment our current in-person field sales team is what we learned for COVID is that there is always going to be an element of telemedicine and virtual detailing that's going to exist in healthcare professionals practices. We have engaged an inside sales rep or a remote healthcare professional outreach team. So we've increased that group to six individuals that are starting in the fourth quarter of this year.\n\nThat helps us reach some of the white space areas where there may not be a representative aligned to a healthcare professional. It helps us provide greater reach and frequency to some of the urban areas in our territories and it also allows for us to continue to engage with healthcare professionals should we see a vacancy in a territory, which really helps to make sure that the patient and the healthcare professional community continue to get supported from Harmony during those times. So hopefully, that helps.\n\nSandip Kapadia -- Chief Financial Officer\n\nThank you, Jeff. With respect to guidance, as you mentioned, I mean, next year would be the natural point where we would certainly consider. I can't really provide guidance on guidance at this stage but generally, that would be the point that we would consider. I think, look, we've got a good history of proven success over our launch.\n\nWe have a good saves there. We're pleased with the overall performance and see continued growth opportunity as John mentioned, continue to see within there's $1 billion-plus franchise in the coming year with narcolepsy and other indications. So more to come, we'll update you as we go into next year. \n\nJohn Jacobs -- President and Chief Executive Officer\n\nThank you, guys. Thank you, Charles.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nCan I ask a question on the pipeline?\n\nJohn Jacobs -- President and Chief Executive Officer\n\nSure.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nOK. Super. So just quickly, with regard to the PWS results, nice to see, now that you're waiting for some additional details. I guess I'm wondering if you could speak to what you would like to do.\n\nCould you anticipate moving into next stage of development next year? And could that be pivotal? Then is there any way to provide information on how many of the patients or percentage roughly decided to continue in the open-label extension?\n\nJeff Dayno -- Chief Medical Officer\n\nYes. Sure, Charles. So in terms of our plan, I think that we are encouraged by the positive signals that we've seen from the top-line data. Obviously, the next step is to look at the full data set, which will further inform our understanding around the data.\n\nThen it's our intent to request an end of Phase 2 meeting with FDA as we do plan on advancing our clinical development program for petolisin and Prader-Willi syndrome. So obviously, next steps, look at the full data set inform the strategy of approaching FDA and a Phase 2 meeting and then plan to go into a pivotal Phase 3 trial. With regards to the last part of your question, we saw that 65 patients were enrolled in the trial, 91% completed the treatment and all but one patient opted to go into the open-label extension. So the majority of the patients that completed went into the open-label extension and that's what we saw from the initial top-line data.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nWe're excited about this data, especially on behalf of the patients and the caregivers and all the KOLs and folks who work with us to do this. This is a community who really needs therapeutic options, Dr. Dayno and his team really did a great job leading us through the COVID pandemic. all the challenges to complete a clinical time, Jeff, like you and your team did, you should be really proud of this accomplishment on behalf of patients.\n\nIt is our intention to work into a Phase 3. But as Dr. Dayno says next step is the post phase with FDA and we look forward to continuing both.\n\nJeff Dayno -- Chief Medical Officer\n\nYeah. And Charles, those numbers -- yes, 65 enrolled 59 completed the treatment and then 58 of the 59 went into open-label extension, and that is ongoing.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nExcellent, thanks for the update.\n\nOperator\n\nOur next question comes from Corinne Jenkins from Goldman Sachs.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nHey, Corinne.\n\nCorinne Jenkins -- Goldman Sachs -- Analyst\n\nHey, good morning. So I think it looks like gross to net has improved pretty considerably year over year. I think list price is up 5%. It looks like net revenue per patient is up about 10%.\n\nSo could you talk about what you're seeing with respect to gross to net and how we should expect that to continue moving forward? Also just if there's any impact of stocking on what that looks like in this quarter?\n\nSandip Kapadia -- Chief Financial Officer\n\nYeah. Hi, Corinne. It's Sandip here. In terms of gross to net, I mean, as you know, a gross to net increase is typically in the first quarter and then relatively stable for the balance of the year.\n\nWhat we've seen is a similar evolution this year as well. Versus last year, we did have a price increase earlier this year, a net price increase over last year but generally, gross has been relatively stable for quarter 2 and quarter 3. \n\nJohn Jacobs -- President and Chief Executive Officer\n\nJeff Dierks, any additional color you want to add to that?\n\nJeff Dierks -- Chief Commercial Officer\n\nSure. Corinne, one other thing when you're kind of looking at the average cost per patient, just as a reminder, our patient assistance program demand has been relatively flat. So as we continue to add the average number of patients, we're starting to see a higher percentage of revenue-generating patients, which is likely reflective in the average cost per patient that you're seeing. So I thought that might be helpful as well as you're looking at your data.\n\nCorinne Jenkins -- Goldman Sachs -- Analyst\n\nYes, that's really helpful, thank you. Then maybe could you just contextualize the data that we saw in Prader-Willi syndrome versus other weak promoting agents that might be off label in that population?\n\nJohn Jacobs -- President and Chief Executive Officer\n\nDr. Dayno, you want to take that?\n\nJeff Dayno -- Chief Medical Officer\n\nSo Corinne, I think that in terms of contextualize, probably the reference with regards to what we saw with pitolisant in the narcolepsy studies, we see similar trends with regards to clinically meaningful change in across all the age groups and both dosage groups, a greater than two point difference on the ESS. In terms of, there's not a lot of data in terms of other wakefulness agents used off label and Prader-Willi. So it's hard for me to comment on that in terms of the other agents used off label. There's no randomized controlled trials to give a frame of reference.\n\nJeff Dierks -- Chief Commercial Officer\n\nYeah. Well said, Jeff, there are a few very small studies, Corinne, maybe ISS has other things out there that have a result. I think that just the general takeaway from that is that it's a very unsatisfied marketplace. There's a tremendous need for new therapeutic options.\n\nAnd as you know, a lot of companies have made valiant efforts to try to help these patients to no avail. That's disappointing for everyone, our industry and the patient population. We're very excited about and encouraged about these initial top-line results on this POC study right now.\n\nCorinne Jenkins -- Goldman Sachs -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Chris Howerton from Jefferies.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nChris.\n\nChris Howerton -- Jefferies -- Analyst\n\nHey, good morning. Thanks so much for taking the question. I guess two, probably both for the Jeff's. On the commercial side, I guess I just wanted to better understand how you anticipated seasonality impacting the quarter? I think you signaled ahead of time that you would have anticipated some headwinds to new patients due to the end of the summer.\n\nSo I guess I just wanted to see like did you actually see that and what were your learnings with respect to this seasonality? Then on the pipeline question, I guess what I'm curious is, is excessive daytime sleepiness and approvable endpoint for Prader-Willi syndrome and what might be some other important clinical features in the eventual package to get a label in that indication? Thank you.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nThanks, Chris. Jeff Dierks, do you want to take the first part of that?\n\nJeff Dierks -- Chief Commercial Officer\n\nSure. Good morning, Chris. Thanks for the question. So certainly, we're extremely pleased with our performance in the third quarter of $117.2 million.\n\nAnd to put that into context, it was about a 10% increase from the second quarter and as a reminder, our growth from Q1 to Q2 was 25%. So if you're looking at the relative rate of growth between those quarters, you could see it's reflective of the impact of that summer seasonality. As I shared in my prepared remarks, we did see a couple of strong drivers that help to overcome and offset some of that summer seasonality. Obviously, we saw an increase in in-person engagement, which we know is very meaningful.\n\nWe saw the impact of our expanded field sales team, and we also saw the continued growth in the depth and breadth of our prescriber base. So we believe, obviously, our strong performance is really highlighting the large remaining opportunity in adult narcolepsy and we are starting to begin to see that anticipated rhythm, right? You get typical seasonal dynamics in the first and the third quarter where rates of growth tend to be a little bit lower, followed by stronger traditional second and fourth quarters. We're excited, obviously, about the growth opportunity for WAKIX and moving forward, and we remain confident that this has an opportunity to continue to grow for years to come.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nThe second part of the question, Jeff Dayno?\n\nJeff Dayno -- Chief Medical Officer\n\nYes. Chris, good morning. So in terms of EDS as an approval indication in patients with Prader-Willi, so EDS is a common symptom in that patient population seen in over 50% of the patients. Based on our dialogue with FDA and this first single detection study, we believe it's an approvable indication with clinically meaningful data.\n\nSo we're encouraged by the initial top-line results, and obviously, we'll engage further with the agency toward designing a pivotal Phase 3 trial. In terms of the other symptoms, obviously, the Phase 2 proof-of-concept study, we're looking at other outcomes at z-ware, the behavioral symptoms, cognition and hyperphagia. So we look forward to seeing those data and if the data support clinically meaningful changes on those scales, then we would include that in terms of the design of the Phase 3 trial with regards to other symptomatic indications in a label. So I think that we will wait to see the full data set, and that will inform an approach with FDA and then design a Phase 3 trial.\n\nChris Howerton -- Jefferies -- Analyst\n\nOK. All right. Well, very good. I appreciate you taking the questions and congrats on the quarter again.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nThank you, Chris.\n\nOperator\n\nOur next question comes from Graig Suvannavejh from Mizuho Securities.\n\nGraig Suvannavejh -- Mizuho Securities -- Analyst\n\nHey. Good morning, team. How are you? Congrats on a great quarter. One of my questions is about the trends that you might be seeing for WAKIX as you exit or as you've exited out of September and into October.\n\nAny color you can just provide for us? I just wanted to get, I think Jeff Dierks, you had mentioned this, but just get a confirmation on how you are viewing the fourth quarter in terms of the, I guess, the seasonality of the fourth quarter being a stronger quarter. I just want to make sure that those comments still hold up and then I've got a follow-up question. Thanks.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nYeah, Greg. Obviously, we're not providing forward-looking guidance, but we have said that we expect continued growth for the rest of this year. I don't know, Jeff Dierks, if you want to add a little bit more color to that?\n\nJeff Dierks -- Chief Commercial Officer\n\nYeah, I appreciate the question, Graig. And consistent with John, even though we can't speculate moving forward, we continue to see strong momentum in our business and top-line demand in new patient starts and refill behavior and we do anticipate growth in all of our underlying business fundamentals moving forward quarter over quarter. That's probably about as much context as I can kind of give you. We're very confident in our ability to continue to grow this brand moving forward.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nYeah. And I think, Graig, overall context is important for the audience to understand, right, that there's 72,000 to 80,000 diagnosed narcolepsy patients in the U.S. with tremendous unmet need. That remains.\n\nSo we see a lot of long-term opportunity for WAKIX to continue to penetrate this marketplace to help patients who are in need to polypharmacy market, WAKIX is often combined with other therapies to add synergistic benefit and help these patients. So we see potential growth for WAKIX for years to come, and that's why we're confident in saying we see WAKIX as a $1 billion-plus franchise in narcolepsy and other indications in the years to come.\n\nGraig Suvannavejh -- Mizuho Securities -- Analyst\n\nOK, thank you very much. Then my follow-up question just had to do with the data that you just shared with us in terms of the proof-of-concept Phase 2 in Prader-Willi syndrome. I know that you're expecting to see the full data set and particularly data on some of the secondary endpoints. Is there anything in particular that you're trying to get an assessment of that really will help to inform how you're thinking about the next steps or what the pivotal Phase 3 or what the clinical trial design might be in terms of what's next for that program?\n\nJohn Jacobs -- President and Chief Executive Officer\n\nDr. Dayno, do you want to take that one?\n\nJeff Dayno -- Chief Medical Officer\n\nSure. Yeah. Thanks for the question, Graig. In terms of the data set, obviously, the primary focus is around excessive daytime sleepiness.\n\nPitolisant mechanism of action, the mechanism-based approach to our life cycle management. So that's the primary focus where we had the most confidence. So the initial top-line data readout and those signals that we're encouraged about. As a single detection study and looking at other key symptoms, as I like to just before, other symptomatology.\n\nSo we'll look for signals on the behavioral aspect of this patient population, cognitive function and then obviously, hypophagia as the cardinal symptom of PWS. So that full data readout will inform the overall aspect of the single detection study. Then based on those findings, we'll inform our approach to the design of a Phase 3 trial. But really, primary focus around excessive daytime sleepiness, and we're encouraged by the positive signals that we've seen in terms of movement on the ESS scale across all the age groups and both dosage groups of pitolisant.\n\nGraig Suvannavejh -- Mizuho Securities -- Analyst\n\nIf I could have just one last follow-up question just on that. I think you mentioned that you would expect to share the full results at a medical conference. Is it fair to assume that this would be sometime in 2023, maybe first half of 2023?\n\nJohn Jacobs -- President and Chief Executive Officer\n\nWe haven't provided timing Graig yet on a particular conference, but what we have said is that we expect to have the full data set prior to the end of the year.\n\nGraig Suvannavejh -- Mizuho Securities -- Analyst\n\nOK. Thank you so much for the clarification.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nThank you, Graig.\n\nOperator\n\nThe next question comes from Ani Fadadi from Needham and Company.\n\nUnknown speaker\n\nHello, this is Anim on for Ani. Thank you for taking the question. I have a question on the clinical trial results. So on the PWS patients, they are usually on polypharmacy.\n\nI wanted to know if you can add some color on whether there were any drug infections that you needed to change the prescriptions that patients on the trial needed to take? Is there a new rate on any changes on that on their medication because of doorinactions? Also, you reported around 12% adverse anxiety, is there anything that makes the confidence that the level of anxiety would decrease as in the open-label extension as you're not pleasing to dose during this period?\n\nJeff Dayno -- Chief Medical Officer\n\nSo I mean, with regards to drug-drug interaction, the only FDA-approved drug for patients with Prader-Willi is growth hormone. We know that they're on other medications for behavioral symptoms, etc. So there were no specifics in terms of drug-drug interactions. It's basically guided by the label for WAKIX with regards to the known drug-drug interaction of what was allowed and not allowed but other therapies that that they're on that don't have a known drug-drug interaction with pitolisant were allowed in the trial.\n\nIn terms of the level of anxiety, in terms of the safety tolerability profile that we saw in the study, is very consistent with the known safety tolerability of pitolisant in what we saw in narcolepsy as well as other clinical trials. I think that's the initial data that we have. When we see the open-label extension and longer-term exposure, we'd be able to comment further on that.\n\nJeff Dierks -- Chief Commercial Officer\n\nJust a comment, I mean, good question actually, when it comes down to the practicality of using a drug to help patients who may be on polypharmacy and in the narcolepsy space, as you all know, WAKIX can be safely added on to standard of care therapies. We have the drug-drug interaction data right in our label for the wake-promoting agents as well as sodium oxybate product. So that's one of the benefits of WAKIX is that it has a very clean profile, and it's able to be added on to many meds. As you heard Dr.\n\nDayno, there wasn't a tremendous need to change therapies on these patients. So there may be some need for a select group of patients down the road, but WAKIX generally is well tolerated and can generally be added on to many of the known therapies in the neuro space.\n\nUnknown speaker\n\nThank you.\n\nOperator\n\nOur last question comes from Danielle Brill from Raymond James.\n\nUnknown speaker\n\nHey, this is Alex on for Danielle. Sorry, she couldn't make it.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nHey, Alex. Good morning.  \n\nUnknown speaker\n\nHow is it going? So yeah -- I mean, as expected, 3Q, we expect to be a bit softer but you still got the normal 300 net patient adds. Should we expect a ramp up from this 300 benchmark in 4Q looking forward? And if I could just tackle one more follow-up, sorry if I missed it, just appreciate any more color on how new patient starts compared to the last two quarters?\n\nJohn Jacobs -- President and Chief Executive Officer\n\nThanks, Alex. Jeff Dierks, any comments on Alex's question?\n\nJeff Dierks -- Chief Commercial Officer\n\nYeah. Alex, thanks very much for the question this morning. So with respect to how to think about new patient adds moving forward, I mean, certainly, we're extremely pleased with our continued momentum, adding about 300 patients quarter over quarter. And although, again, we're not providing any forward-looking guidance on our business, we can kind of point you back to what we've accomplished in that normal seasonality that we've seen over the last couple of years.\n\nWe have very strong top-line prescription demand. New patient starts has been relatively consistent, building on the momentum coming out of the second quarter. As John shared earlier, we believe that there is still a large untapped remaining opportunity in narcolepsy. And we're very excited about our ability to continue to grow the brand and the underlying fundamentals moving forward.\n\nSo hopefully, those two pieces of information help with respect to how to think about our business moving forward as well as thinking about new patient adds from the third quarter and the second quarter.\n\nUnknown speaker\n\nThanks, Jeff.\n\nAre you seeing any patterns in 4Q inventory stocking ahead of any expected new year price increases? If so, could you walk us through what, if any, inventory impact you expect for the upcoming quarter?\n\nJohn Jacobs -- President and Chief Executive Officer\n\nJeff, do you want to take that? \n\nJeff Dayno -- Chief Medical Officer\n\nYeah. I mean, generally, you do see some increases in inventory, driven mostly due to just the holiday season. You'll see a couple of days that typically in the fourth quarter and then that obviously reverses in Q1 as perhaps some of those impacts. But that there's not much I guess sat really will be variable depending on the time when the holidays fall and those are other impacts as well.\n\nI would say nothing unusual and yeah, nothing different from the sale of the years.\n\nUnknown speaker\n\nThanks so much.\n\nJohn Jacobs -- President and Chief Executive Officer\n\nThanks, Alex.\n\nOperator\n\nI'm showing no further questions. [Operator signoff]\n\nDuration: 0 minutes\n\nLuis Sanay -- Head of Investor Relations\n\nJohn Jacobs -- President and Chief Executive Officer\n\nJeff Dierks -- Chief Commercial Officer\n\nJeff Dayno -- Chief Medical Officer\n\nSandip Kapadia -- Chief Financial Officer\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nCorinne Jenkins -- Goldman Sachs -- Analyst\n\nChris Howerton -- Jefferies -- Analyst\n\nGraig Suvannavejh -- Mizuho Securities -- Analyst\n\nUnknown speaker\n\nMore HRMY analysis\n\nAll earnings call transcripts"
}