{
  "companyName": "Anavex Life Sciences",
  "companyTicker": "AVXL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/anavex-life-sciences-avxl-q3-2022-earnings-call-tr/",
  "content": "Anavex Life Sciences (AVXL 1.42%)\nQ3 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nClint Tomlinson\n\nGood afternoon. Welcome to the Anavex Life Sciences fiscal 2022 third quarter conference call. My name is Clint Tomlinson, and I'll be your host for today's call. [Operator instructions] Please note that this conference is being recorded.\n\nThe call will also be available for replay on Anavex's website at www.anavex.com. With us today is Dr. Christopher Missling, president and chief executive officer; and Sandra Boenisch, principal financial officer. Before we begin, please note that during this conference call, the company will make some projections and forward-looking statements.\n\nThese statements will -- are only predictions based on current information and expectations and involve a number of risks and uncertainties. We encourage you to review the company's filings with the SEC. This includes, without limitation, the company's Forms 10-K and 10-Q, which identify the specific factors that may cause actual results or events to differ materially from those described in these forward-looking statements. These factors may include, without limitation, risks inherent in the development and/or commercialization of potential products, uncertainty and results of clinical trials or regulatory approvals, need and ability to obtain future capital and maintenance of intellectual property rights.\n\nAnd with that, I'd like to turn the call over to Dr. Missling.\n\nChristopher Missling -- President and Chief Executive Officer\n\nThank you, Clint. We appreciate everyone joining us on today's conference call to review our most recently reported financial results and to provide a business update. We are pleased with the continued advancement regarding our lead product candidate, ANAVEX 2-73, in Alzheimer's disease and Rett syndrome as we maintain our attention on the execution across each of our clinical programs and overall business operations. We achieved a very important milestone at the end of June with the last patient last visit in the randomized placebo-controlled Phase 2b/3 study of ANAVEX 2-73 for the treatment of early Alzheimer disease.\n\nWe are now focused on completion of associated end-of-trial activities in order to provide top-line results of the placebo-controlled Phase 2b/3 study of ANAVEX 2-73 in early Alzheimer's disease, which are expected this coming fall. This is an indication, which is a condition of significant unmet need and economic burden, for which there are only limited approved pharmacological treatment options. As a reminder, Alzheimer's disease is the most common cause of dementia and the fifth leading cause of death in adults older than 65 years. The estimated total healthcare costs for the treatment of Alzheimer's disease in 2020 is estimated at $305 billion, with the cost expected to increase to more than $1 trillion as the population ages.\n\nMost of the direct costs of care for Alzheimer's disease are attributed to skilled nursing care, home healthcare and hospice care. Indirect costs of care, including quality of life and informal caregiving, are likely underestimated and are associated with significant negative societal and personal burden. We also recorded the last patient last visit in the 48-week open-label extension of the Parkinson's Disease Dementia Phase 2 study occurred this quarter. Data from this study is expected by year-end 2022.\n\nIn our Rett syndrome program, completion of the randomized placebo-controlled EXCELLENCE Phase 2/3 study for the treatment of pediatric patients with Rett syndrome is expected by the end of 2022. In June, Anavex announced a peer-reviewed publication in American Journal of Medical Genetics identifying a blood biomarker for assessing treatment effect of ANAVEX 2-73 in Fragile X syndrome, which provided strong scientific support for the planned clinical trial of ANAVEX 2-73 in Fragile X syndrome. End of July, Anavex presented very important data. The first entire clinical human Alzheimer's and Parkinson's disease gene pathway data from the ANAVEX 2-73-PDD-001 Parkinson's Disease Dementia study at the Alzheimer's Association International Conference, AAIC, in San Diego, California.\n\nAlso, at AAIC in early August, Anavex presented long-lasting effect of ANAVEX 3-71 preventing cognitive decline in a transgenic rat model of Alzheimer's disease. This new data strengthens the importance and applicability of Anavex precision medicine SIGMAR1 platform and is consistent with previously reported therapeutic significant and dose-dependent preclinical prevention of Abeta-induced biomarker-correlated cognitive impairment with ANAVEX 2-73. Further pipeline expansion of the Anavex platform using gene biomarkers of response applying precision medicine for neurological disorders with unmet medical need is expected in 2022, including meeting with the FDA to discuss the ANAVEX 2-73 Parkinson's disease program, including a pivotal Phase 3 study; planned initiation of a ANAVEX 2-73 imaging-focused Parkinson's disease clinical study sponsored by the Michael J. Fox Foundation; and planned initiation of a potential pivotal Phase 2/3 study in Fragile X syndrome, the most frequent genetic cause of autism spectrum disorder; and planned initiation of a Phase 2/3 clinical trial for the treatment of a new rare disease indication; and last but not the least, planned initiation of ANAVEX 3-71 Phase 2 clinical trials for schizophrenia, frontotemporal dementia and Alzheimer's disease indications.\n\nAnd now, I would like to direct the call to Sandra Boenisch, principal financial officer of Anavex, for a brief financial summary of the recently reported quarter.\n\nSandra Boenisch -- Principal Financial Officer and Treasurer\n\nThank you, Christopher, and good afternoon to everyone. During our third fiscal quarter, we maintained fiscal year responsible cash utilization as we continue to execute on our clinical programs. Our cash position on June 30, 2022 was $153.2 million. To put this in context, at our current cash utilization rate and range, we believe we have sufficient cash runway to fund operations and clinical programs beyond the next four years.\n\nOur research and development expenses for the third quarter of fiscal 2022 were $9.3 million as compared to $9 million for the comparable quarter of fiscal 2021. General and administrative expenses were $3.2 million, compared to $2.4 million for the comparable quarter of fiscal 2021. Overall, we reported a net loss of $12.4 million for the quarter or $0.16 per share. The overall increased expenses over the comparable period is primarily related to an increase in noncash compensation charges period over period, which is driven by the continued addition of staff to manage and support our clinical studies and development.\n\nThank you. And now, I will turn the call back over to you, Christopher.\n\nChristopher Missling -- President and Chief Executive Officer\n\nThank you, Sandra. We are looking forward to delivering data readouts as we -- as well as initiating biomarker-driven precision medicine clinical studies as planned. I would like now to turn the call back to Clint for Q&A.\n\nClint Tomlinson\n\nThank you, Christopher. [Operator instructions] The first question today will be coming from Soumit Roy at JonesResearch.\n\nSoumit Roy -- JonesResearch -- Analyst\n\nHi, everyone. Congratulations on all the progress. One question on the EXCELLENCE pediatric Rett trial. Could you clarify, when you're mentioning its completion of the trial is expected year-end '22, so is the data getting pushed back into 2023? Or we expect data still at the end of 2022?\n\nChristopher Missling -- President and Chief Executive Officer\n\nRight. We updated a while ago, the clinicaltrial.gov, that the completion of the study will be in December. So we will hopefully try our best to release the data once we have completed the study. But it looks like that we can definitely, at this point in time, confirm that the study completion will be by year-end and soon after the data readout, the top-line data of the study.\n\nAlso, I want to point out, at this point in time, that we have also provided sufficient manufacturing products for a potential rollout or market entry for Rett syndrome. If so, the study -- the EXCELLENCE study is positive.\n\nSoumit Roy -- JonesResearch -- Analyst\n\nGot it. So is there -- do you see any headwind in the enrollment in the pediatric Rett syndrome trial? Or just trying to understand why the -- it seems like it's taking longer for the enrollment to complete.\n\nChristopher Missling -- President and Chief Executive Officer\n\nWe reminded last quarter that we had the situation that the vaccines were approved for pediatric population. And since the trial requires a -- three months of constant or consistent medication, a vaccine is a trigger for this three-month duration. So when a patient or participant in the study or a willing participant to join the study has a vaccine taken, the last dose will be -- or that vaccine will be trailing a three-month period before somebody can join the trial. And we noticed that would lead to some slower enrollment.\n\nAnd we just are made aware of that, and that's part of this process. So there's really not anything else, but that we want to make sure that we follow the guidance of the protocol, which requires this three-month period.\n\nSoumit Roy -- JonesResearch -- Analyst\n\nI see. Totally understandable. And last question. So you are still -- curious where you are currently on whether to file the adult BLA separately from pediatric BLA.\n\nOr do you want to wait until the entire pediatric data is available and then file it together? Any thoughts on that?\n\nChristopher Missling -- President and Chief Executive Officer\n\nAt this point, we are so close to readout of the EXCELLENCE study. And we should remind everyone that Rett syndrome is a pediatric indication predominantly. It is a study in -- it's an indication which affects girls from an early age onwards, and many patients die when they get older. The life expectancy at 40 years is only 50%.\n\nAnd so that makes it clear that is a pediatric indication predominantly. That's why also we focused on the study size, and the study focused on the pediatric study. And the adult study is important to get approval for the entire age group. And at this point in time, we also want to make sure that since we have the voucher eligibility, we want to make sure that we are able to submit a successful pediatric study first in order to receive this voucher, which is quite valuable, as you know.\n\nSo again -- but the key thing is that we are so far into this EXCELLENCE study that it is just more preferred and prudent in addition to the fact that it's predominantly a pediatric indication, to finish the EXCELLENCE study and then file the entire program, which consists of three placebo-controlled study, the Phase 2, the Phase 3 AVATAR and the Phase 3 EXCELLENCE study.\n\nSoumit Roy -- JonesResearch -- Analyst\n\nThank you for clarifying all the issues, and congratulations again on all the development.\n\nChristopher Missling -- President and Chief Executive Officer\n\nThank you.\n\nClint Tomlinson\n\nThe next question will come from Yun Zhong at BTIG. Go ahead.\n\nYun Zhong -- BTIG -- Analyst\n\nGreat. Thank you very much for taking the question. So the first question is on your discussion with the FDA on the pathway for Parkinson's disease. What's the possibility of -- the FDA might ask you for additional information or clinical data from Parkinson's disease patients given that your Phase 2 study was done in PDD, not really the raw population of the PD patient.\n\nAnd if that's the case, do you think the imaging study will provide you with sufficient information? And I have a follow-up question.\n\nChristopher Missling -- President and Chief Executive Officer\n\nYeah, so that's a good question. So as a reminder, we're initiating soon the imaging study in Parkinson's patients funded. And I want to thank, again, Michael Fox Foundation for their support for this, which is the second grant which we received for Michael Fox after the first one, which covered the Parkinson's disease proof-of-concept indication in animals in a disease-modifying animal model. And this PET study would be a good support for a study in Parkinson disease only.\n\nWe have to say though that the Parkinson's Disease Dementia study, we believe, is very robust and demonstrate parkinsonism because we noticed, and we measured in this Parkinson's Dementia study, a very strong dose-dependent improvement in the MDS-UPDRS score, which is the standard -- gold standard of measuring parkinsonism for Parkinson patients features, and that was very robust in its outcome. So we believe that we have enough evidence of moving forward in a study in Parkinson's disease, in a pivotal study, because of the data from our Parkinson's Disease Dementia Phase 2 study in 132 patients' placebo-controlled study.\n\nYun Zhong -- BTIG -- Analyst\n\nOK. My second question is that you have reported quite a lot of interest in biomarker data. So I wondered, have you incorporated that biomarker information in, for example, patient enrollment in the Alzheimer's study? And also, do you plan to incorporate that information to allow you to maybe identify a specific patient population in future studies so that you will be able to show maybe better clinical data?\n\nChristopher Missling -- President and Chief Executive Officer\n\nSo right, the most important takeaway from the genetic analysis of the whole genome of patients getting ANAVEX 2-73 compared to placebo in the Parkinson's Dementia Study was really that the drug shows the ability to resuscitate or to counter down-regulated gene pathways, and not only gene pathways but also clusters of gene pathways, which are down-regulated in respective pathology of Alzheimer's disease, as well as in the respective pathology of Parkinson's disease. And the fact that clusters of gene pathways are down-regulated in these diseases, which is published compared to healthy volunteers in various papers, and we were able to demonstrate that those down-regulated genes were up-regulated again in the ANAVEX 2-73 arm, shows really the broad ability to counter these complex pathologies. And I want to remind again, this is evidence that we are talking about extremely complex indications with different features and not one unilateral pathway in Alzheimer's disease or/and Parkinson's disease, but the ability to really address pathways and counter them on a broader range, which includes degeneration in various features like mitochondria, autophagy restoration, tau reduction and Abeta reduction and calcium imbalance, homeostasis restoration. All these pathways have been addressed and confirmed in this whole genome analysis.\n\nAnd we've noticed that and learned that in preclinical animal studies already that ANAVEX 2-73 is capable of doing that. And what is really important is that that is on top of the very clear biomarker data of SIGMAR1 correlation with the outcome of patients' benefit. So again, patients benefit the most who also had the highest sigma-1 activation. Since we activate sigma-1, that makes perfect sense and does not come as a surprise, but should give us confidence in the readout of future studies.\n\nAnd that's why I'm very excited that the whole genome analysis also shows this fundamental strong biomarker correlation with the outcome and not only on one gene, but also on broader pathways, which are again impaired in these indications.\n\nYun Zhong -- BTIG -- Analyst\n\nThank you very much.\n\nChristopher Missling -- President and Chief Executive Officer\n\nThank you.\n\nClint Tomlinson\n\nNext question is from Ram Selvaraju from H.C. Wainwright. Go ahead, Ram.\n\nRam Selvaraju -- H.C. Wainwright -- Analyst\n\nThank you so much for taking my questions, and congrats on all the progress once again. I just wanted to ask if you could comment on two strategic aspects. One is with respect to the imaging use of 2-73 versus its therapeutic use and how you envision that evolving at a commercial level. Should the molecule ultimately demonstrate its utility on both of those fronts, regardless really of the neurodegenerative disease context? And the other is how you are thinking about optimizing the value of blarcamesine in ex U.S.\n\nterritories. And in particular, to what extent you expect to be exploring this through partnerships and what the timing of those might be? I also was wondering if, in that context, you could provide some commentary regarding the IP protection of blarcamesine, in particular, in potentially significant commercial territories like China.\n\nChristopher Missling -- President and Chief Executive Officer\n\nVery good question. May I ask for a clarification on the first question, please, what were you referring to imaging effects of the drug?\n\nRam Selvaraju -- H.C. Wainwright -- Analyst\n\nThat is correct, yes.\n\nChristopher Missling -- President and Chief Executive Officer\n\nNo, may I ask you what do you mean by that?\n\nRam Selvaraju -- H.C. Wainwright -- Analyst\n\nSo if, for example, there were some, let's call it, diagnostic utility of the drug above and beyond sort of imaging for the purpose of optimizing treatment. Is there a way to optimize the value of the compound in both the diagnostic and therapeutic contexts?\n\nChristopher Missling -- President and Chief Executive Officer\n\nNo, I understand. Thank you. So let me pick that first. So as you might remember, and I want to point that out, so we did notice that in all three studies, so far, clinical studies, Alzheimer's, Parkinson's Disease Dementia and Rett syndrome.\n\nWe noticed that the sigma-1 shows up in two different genetic forms. One is more prevalent than the other, we call it wild-type, WT. It's the most predominant. We talk about 80% to 90% of all participants in studies or in the world have this sigma-1 wild-type gene.\n\nAnd we noticed that with relatively everything being equal, those patients had a slightly better response that those patients, which then are the minority of 10% to 20% with a sigma-1 variant and one amino acid, which seems to change the confirmation and hence might be not as expedited in its activity in the body, but still doing its job. Because we noticed that when we dose high enough, then there is no real difference between those two genetic forms in a patient. But having said that, if things would become needed, that we would need to focus on patients with the wild-type gene, we are in parallel developing a test, diagnostic test, which would then allow to use this as co-diagnostic, committed companion diagnostic, for the therapeutic for ANAVEX 2-73. So we then would be able to go into the market with a companion diagnostic to identify patients only with this wild-type sigma-1 gene, which, again, is over 80% of the population.\n\nAnd then, having -- making sure that these patients benefit most from ANAVEX 2-73. But so far, we will see if the Alzheimer's study and the pediatric Rett study don't even need that kind of like additional cohort selection. And we might just find out that all patients, irrespective of the genetic background, will benefit from ANAVEX 2-73. But again, if it does not be the case, we will have that ability to move into that precision medicine, companion diagnostic therapeutic approach.\n\nSecondly, regarding planning for commercialization outside of the U.S. We stated in Rett syndrome, we would be happy and able to and are planning to move forward ourselves in marketing ANAVEX 2-73 in Rett syndrome and possibly also Fragile X. And in Rest of the World, we are actively in discussions, and we're planning to expand the dialogue with European, Asian and including Chinese companies for marketing the drug outside of the U.S. There's also the potential of partnerships globally, ex U.S.\n\nor in regional partnerships, for example, Asia or a separate Japan and rest of Asia and then Europe and South America. So we are in discussions on that already in order to maximize also the rollout of the drug worldwide. Did I miss any additional question?\n\nRam Selvaraju -- H.C. Wainwright -- Analyst\n\nJust as an adjunct to that, I was asking about the IP protection for blarcamesine currently in China.\n\nChristopher Missling -- President and Chief Executive Officer\n\nThank you for reminding. So we did make sure that when we started the company's portfolio strategy to include China very aggressively in IP protection. So with all the patents we have filed so far, that is going back to the last seven years, seven to nine years, we included always the patent application in China, specifically, as well. So we always make sure that we not only have protection in the largest market, but specifically also added China into this group of IP protection.\n\nRam Selvaraju -- H.C. Wainwright -- Analyst\n\nOK. And then, just one last question was with respect to when you expect to disclose the identity of the new ultra-rare indication for blarcamesine for which you expect to initiate Phase 2/3 clinical development as per the guidance from the press release still this year. When do you disclose the identity of that indication?\n\nChristopher Missling -- President and Chief Executive Officer\n\nRight. I want to give a bit of background about this. We would be happy to disclose it. It's not that we don't want to disclose it.\n\nWe just don't want to convey the message as if we would not be focused and convinced about the existing indications. That's the only reason. We don't want to distract the market. The reason why we have this, in this form or shape, mentioned is that we have several indications where we have very robust preclinical data with ANAVEX 2-73 in rare diseases and ultra-rare diseases.\n\nAnd we like to just make sure that we are progressing first with the FDA to discuss those indications, to make sure we pick the one which has the highest chance of succeeding in our clinical trial and progressing in the clinical trial success, and then we will make the disclosure. But really, the predominant reason is that we like to make sure that we don't get the impression that we are not focusing on the existing indications, which we are very excited about as we speak.\n\nRam Selvaraju -- H.C. Wainwright -- Analyst\n\nJust one very minor financial clarification, if I may. Based on your guidance with respect to the length of the cash runway, can you confirm whether or not that effectively includes whatever budget assumptions you may have to make regarding actual commercialization of blarcamesine? One might say, for example, the highest likelihood is commercial-related expenses associated with the deployment of the drug in Rett syndrome, but possibly also another indication. And I just wanted to clarify whether your financial runway guidance actually includes those commercial expenses, along with the other operating expenses as well?\n\nChristopher Missling -- President and Chief Executive Officer\n\nThis is an excellent question. So let me break it down this way. So for the commercialization, we already have, as I mentioned just briefly before, sufficient drug products for the entire commercial rollout of ANAVEX 2-73 in Rett syndrome. The marketing rollout cost, as you know, when you have an approved drug, your ability to access capital and resources for that is broader than the equity capital market.\n\nYou have access to debt financing and other financial vehicles which are basically not dilutive. And we certainly will make use of that. So the cash is available. It's not limited to equity, which is right now the focus in a stage where the company does not yet have revenue.\n\nBut this can change very quickly and hopefully, very soon that we're able to expand on the ability to use financial vehicles and resources, which are basically non-dilutive to shareholders.\n\nRam Selvaraju -- H.C. Wainwright -- Analyst\n\nThank you.\n\nChristopher Missling -- President and Chief Executive Officer\n\nThank you.\n\nClint Tomlinson\n\nOK. Thank you. Our next question is going to come from Charles Duncan at Cantor. Go ahead.\n\nAvi Novick -- Cantor Fitzgerald -- Analyst\n\nHi, it's Avi on the line for Charles. Thank you for taking our questions, and congratulations on the progress. So I guess, a quick question regarding the Alzheimer's program. I was wondering if you could speak to enrollment rates into the open-label extension?\n\nChristopher Missling -- President and Chief Executive Officer\n\nSay it again? What's the question, please?\n\nAvi Novick -- Cantor Fitzgerald -- Analyst\n\nCould you please discuss enrollment rates in the open-label extension from the Phase 2/3 Alzheimer's study?\n\nChristopher Missling -- President and Chief Executive Officer\n\nYes. So we have a very high enrollment of the extension, which you, as you know, is two years after the placebo-controlled study, which just finished last June. And so, I think, the last number I received was in the range of 94% -- 93%, 94%.\n\nAvi Novick -- Cantor Fitzgerald -- Analyst\n\nOK. Great. Yeah, awesome. Sounds good.\n\nAnd then, I have a couple of questions regarding the Rett syndrome program. So I guess, first, could we expect a potential press release or an update when last patient last visit is reached?\n\nChristopher Missling -- President and Chief Executive Officer\n\nFrom the EXCELLENCE study?\n\nAvi Novick -- Cantor Fitzgerald -- Analyst\n\nYes, exactly.\n\nChristopher Missling -- President and Chief Executive Officer\n\nRight. We will provide that.\n\nAvi Novick -- Cantor Fitzgerald -- Analyst\n\nOK. Wonderful. Thank you. And then, my last question is, you had mentioned earlier in the call that should the results be positive, you would try to move forward with an NDA submission.\n\nBut I guess, I was sort of wondering, how are you distinguishing between positive or positive enough to move forward with an NDA versus positive that, hey, there's a signal we should continue to explore further. And now, I was wondering if you could -- how are you thinking about that distinction? And yes, what sort of feedback the FDA has relayed to you regarding what it would take to get an approval? Thank you.\n\nChristopher Missling -- President and Chief Executive Officer\n\nRight. So we have -- and then we stated the last time, we have now very strong two clinical studies, placebo-controlled studies, the Phase 2 study and the AVATAR study. And we have now submitted these studies to the FDA and also the existing design of the ongoing EXCELLENCE study in order to make sure that the agency is comfortable with our design, with our data to also make sure that we get a clear feedback from these -- our submission, potentially, in order to maximize the chance of getting the -- moving forward with the NDA approval. So we expect this feedback, and that will be also communicated accordingly.\n\nSo this is basically the best way to make sure we're not running into a roadblock or whatever when the data is out. So we want to make sure before the study finishes, the EXCELLENCE study, that we have a clear path to approval.\n\nAvi Novick -- Cantor Fitzgerald -- Analyst\n\nOK. Wonderful. Thank you for taking our questions, and congrats on the quarter.\n\nChristopher Missling -- President and Chief Executive Officer\n\nThank you.\n\nClint Tomlinson\n\nThank you. The next question comes from Caroline Palomeque from Berenberg. Go ahead, Caroline.\n\nCaroline Palomeque -- Berenberg Capital Markets -- Analyst\n\nHi. Thanks for taking the question. I just have a follow-up on the mechanism work. Do you plan on doing any genomic analysis, gene expression work on 3-71 such as in FTD or some indication like that as well?\n\nChristopher Missling -- President and Chief Executive Officer\n\nThat's correct. So we have done now since our first study and ultimately this -- the Phase IIa, where we, for the first time, used genome analysis. We will now include that, as well as in the ANAVEX 3-71 program because of the broad applicability and the way we believe we can learn more about the effect of the drug. So we will clearly also include that in the ANAVEX 3-71 program.\n\nCaroline Palomeque -- Berenberg Capital Markets -- Analyst\n\nRight. Thank you.\n\nChristopher Missling -- President and Chief Executive Officer\n\nThank you.\n\nClint Tomlinson\n\nI believe that was the last question, Dr. Missling.\n\nChristopher Missling -- President and Chief Executive Officer\n\nThank you. Again, we are very much looking forward, and we're very excited about the company's potential as we build on biomarker-driven precision medicine studies with significant unmet medical needs and economic burden. And we are looking forward to clinical trial readouts in Alzheimer's disease and pediatric Rett syndrome. Thank you very much.\n\nClint Tomlinson\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nClint Tomlinson\n\nChristopher Missling -- President and Chief Executive Officer\n\nSandra Boenisch -- Principal Financial Officer and Treasurer\n\nSoumit Roy -- JonesResearch -- Analyst\n\nYun Zhong -- BTIG -- Analyst\n\nRam Selvaraju -- H.C. Wainwright -- Analyst\n\nAvi Novick -- Cantor Fitzgerald -- Analyst\n\nCaroline Palomeque -- Berenberg Capital Markets -- Analyst\n\nMore AVXL analysis\n\nAll earnings call transcripts"
}