{
  "companyName": "Biogen",
  "companyTicker": "BIIB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/biogen-biib-q3-2022-earnings-call-transcript/",
  "content": "Biogen (BIIB 0.33%)\nQ3 2022 Earnings Call\nOct 25, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. My name is Jennifer, and I will be your conference operator today. At this time, I'd like to welcome everyone to the Biogen third quarter 2022 earnings call and business update.  [Operator instructions] I would now like to turn the conference over to Mr. Michael Hencke, head of investor relations.\n\nMr. Hencke, you may begin your conference. \n\nMichael Hencke -- Head of Investor Relations\n\nGood morning, and welcome to Biogen's third quarter 2022 earnings call. Before we begin, I encourage everyone to go to the Investors section of biogen.com to find the earnings release and related financial tables, including our GAAP financial measures and the reconciliation of the GAAP to non-GAAP financial measures that we will discuss today. Our GAAP financials are provided in Tables 1 and 2, and Table 4 includes a reconciliation of our GAAP to non-GAAP financial results. We believe non-GAAP financial results better represent the ongoing economics of our business and reflect how we manage the business internally. We have also posted slides on our website that follow the discussions related to this call.\n\nI would like to point out that we will be making forward-looking statements, which are based on our current expectations and beliefs. These statements are subject to certain risks and uncertainties, and our actual results may differ materially. I encourage you to consult the risk factors discussed in our SEC filings for additional detail. On today's call, I am joined by our chief executive officer, Michel Vounatsos; Dr. Priya Singhal, interim head of research and development; and our CFO, Mike McDonnell.\n\nAs a reminder, during the Q&A portion of the call, we kindly ask that you limit yourself to one question. I will now turn the call over to Michel.\n\nMichel Vounatsos -- Chief Executive Officer\n\nGood morning, everyone, and thank you for joining us. This is an exciting time for Biogen. In addition to key developments across our pipeline, which includes 12 programs in Phase III are filed, we continue to execute progress, and we are pleased to be raising our full year financial guidance. I would like to begin by reviewing the important advances we made this quarter and what we believe they mean for Biogen. Priya will then review our recent progress in R&D, and Mike will discuss our third quarter performance.\n\nFirst, together with Eisai, we were excited to announce the positive results from Clarity AD, the Phase III study of lecanemab in early Alzheimer's disease. For over 15 years, Biogen has been working relentlessly to bring forward new therapeutics in Alzheimer's disease, incorporating both new insights in disease biology and clinical trial design. And today, we celebrate the positive Clarity AD readout as a significant achievement in the treatment of Alzheimer's disease. The results from Clarity AD illustrated several key aspects of lecanemab's clinical profile, which we believe could provide a meaningful benefit for patients. First, lecanemab administration showed a highly statistically significant reduction in clinical decline as early as 6 months, which expanded over the 18-month study period on an absolute basis, consistent with the disease-modifying effect. Second, the study was positive on all key secondary endpoints.\n\nThis includes merger of cognition as well as activities of daily living such as conducting personal finances, performing household tasks and independently traveling out of home. Third, the rate of area in Clarity AD was within expectations. With an FDA decision on accelerated approval expected by January 6 of next year and Eisai's plan to file for traditional approval in the U.S., EU and Japan by the end of Q1 2023, lecanemab has the potential to be the first globally approved treatment to slow the progression of Alzheimer's disease. We look forward to working with Eisai as they continue to engage both regulators and CMS with a goal of ensuring that people with Alzheimer's disease have access to important new treatments. We believe that Clarity AD results underscore the progress we are making in the fight against Alzheimer's, but Biogen will not stop here.\n\nWe plan to build upon our current learnings as we continue to advance a diversified pipeline of potential Alzheimer's treatment. This includes 2 clinical-stage assets targeting tau pathology, BIIB080, our Phase II-ready antisense oligonucleotide; and BIB113, a Phase I small molecule. Beyond Alzheimer's, Biogen has important opportunities in other therapeutic areas, where the unmet medical need remains significant. This includes depression where, together with Sage, we are continuing to advance the regulatory filing for zuranolone in both major depressive disorders and postpartum depression. With a novel mechanism of action, efficacy observed as early as 3 days, and a consistent safety and tolerability profile across 8 clinical studies, we believe that zuranolone, if approved, could be a meaningful new therapy for depression. Second, the FDA has accepted our filing for tofersen in SOD1-ALS under the accelerated approval pathway and granted priority review.\n\nWhile the study did not meet the primary endpoint at 6 months, longer follow-up has shown that patients who remain on tofersen experienced a slow rate of decline in key clinical measures, including lung functions, muscle strength and quality of life. We are truly encouraged by these results in such a debilitating and fatal disease and look forward to an FDA decision expected by April of next year. We believe these near-term opportunities, along with new launches of biosimilars, have the potential to drive renewed growth and position us to have 5 key franchises by 2025. Furthermore, we see the potential for additional growth drivers in the mid to late 2020s in areas such as Parkinson's disease, lupus, and stroke, all with programs currently in Phase III. Overall, we believe that we had an inflection point in CNS drug discovery and development, and these recent developments embody key advancements that are being made in neuroscience. For years, Biogen has been expanding our expertise and capabilities in this area, and we believe that we are well positioned to remain a leader in neuroscience as we work to usher in the new next wave of CNS therapeutics while also advancing our portfolio in specialized immunology where we have 4 late-stage studies in lupus. I will now turn the call over to Priya for a more detailed update on our recent progress in R&D.\n\nPriya Singhal -- Interim Head of Research and Development\n\nThank you, Michel. And good morning, everyone. As Michel mentioned, we had several exciting R&D achievements this past quarter that meaningfully advance the potential of our pipeline, which includes 30 programs, 12 of which are in Phase III of filed in order to deliver new impactful therapies for patients and drive renewed growth for the company. Starting with Alzheimer's disease. Together with Eisai, we were very excited to announce the positive results of the Clarity AD study, evaluating lecanemab in early Alzheimer's disease.\n\nThe primary endpoint of the study was a change from baseline on CDR-Sum of Boxes, a well-established measure of cognition and function in Alzheimer's disease. The study met the primary endpoint. And lecanemab reduced clinical decline on the CDR-Sum of Boxes compared with placebo at 18 months by 0.45, representing a treatment difference of 27%. We also observed a highly statistically significant reduction in CDR-Sum of Boxes versus placebo as early as 6 months. We believe this demonstrates a rapid onset of efficacy and a significant change in CDR-Sum of Boxes versus placebo.\n\nFurthermore, the effect on CDR-Sum of Boxes expanded over the 18-month study period on an absolute basis, suggesting that lecanemab was exerting a disease-modifying effect. The study also met all key secondary endpoints, reinforcing lecanemab's impact on cognition and function. This includes a statistically significant reduction in amyloid blocks in the brain as well as additional clinical assessments such as the ADCS-MCI-ADL, a caregiver-rated assessment of activities of daily living relative to placebo. We believe that these efficacy results, when combined with an observed overall incidence of ARIA of approximately 21%, highlights the potential for lecanemab to be a leading disease-modifying treatment for Alzheimer's disease. Eisai will present the Clarity AD study results at CTAD in November and intends to publish the findings in a peer-reviewed medical journal. The lecanemab filing under the accelerated approval pathway is currently under review with a PDUFA date of January 6, 2023.\n\nThe FDA has also agreed that the Clarity AD could serve as a confirmatory study to verify the clinical benefit of lecanemab. Accordingly, we expect Eisai will file for traditional approval of lecanemab in the U.S. as soon as possible, following a positive FDA decision on accelerated approval. This filing is expected by the end of Q1 2023, along with marketing authorization applications in the EU and Japan expected by the end of Q1 2023 as well. Eisai has also been engaging with the centers of Medicare and Medicaid services as they work to maximize access for patients.\n\nBeyond these regulatory and access engagements, together with Eisai, we are also advancing a comprehensive development program for lecanemab, which includes: first, the ongoing AHEAD 3-45 preclinical study to evaluate lecanemab when administered earlier in disease, when amyloid pathology is present but before the onset of cognitive impairment; second, investigating a potential maintenance dosing regimen with the goal of reducing the lecanemab dosing frequency over time; and the development of a subcutaneous formulation of lecanemab. At AAIC earlier this year, Eisai presented bioavailability data from a Phase I study comparing IV versus subcutaneous dosing as well as modeling and simulation data, illustrating that a fixed subcutaneous dose of 720 milligrams administered weekly may potentially result in comparable exposure and efficacy to the current IV formulation while potentially lowering the incidence of ARIA. With these results in hand, we are focused now on maintaining our leadership position in Alzheimer's disease over the long term. We have an industry-leading portfolio addressing both amyloid and tau pathologies, as well as a multi-target, multi-modality preclinical portfolio targeting a broad range of Alzheimer's disease biology. Now I will turn to neuropsychiatry, where this quarter, Biogen and Sage presented new data that supports zuranolone's potential, if approved, as a novel treatment for both major depressive disorder and postpartum depression. This includes an updated analysis of the open-label ongoing longitudinal SHORELINE study in MDD, which showed that the median time to onset first -- I'm sorry, the median time to first repeat treatment for patients who responded to the original 14-day treatment was 135 days for the 30-milligram cohort and 249 days for the 50-milligram cohort. We believe these data further support zuranolone as a potential meaningful new treatment for people suffering from depression, and we are continuing to work with Sage to advance a single U.S.\n\nregulatory filing for zuranolone in MDD and PPD expected to be completed by the end of this year. Moving on to our neuromuscular portfolio. The New England Journal of Medicine recently published 12-month data from the Phase III VALOR study and its open-label extension evaluating tofersen in SOD1-ALS, a progressive and rare genetic form of ALS, which currently has no targeted therapy. The published data showed that patients who initiated tofersen in VALOR experienced slower rates of decline across critical measures of function, muscle strength, and quality of life versus those who transitioned from placebo to tofersen at the start of the open label extension 6 months later. Furthermore, tofersen led to a robust and sustained reduction in neurofilament, a marker of neuronal injury and neurodegeneration. In July, the tofersen filing was accepted by the FDA under the accelerated approval pathway with priority review.\n\nSubsequently, we submitted responses to information request by the FDA, which the FDA considered a major amendment to the application that will require additional time for review. As a result, the review period has been extended by 3 months with an FDA decision now expected by April 25, 2023. In movement disorders, together with Denali, we initiated our second late-stage clinical trial for BIB122, a small molecule LRRK2 inhibitor. The Phase III LIGHTHOUSE study will evaluate BIB122 in individuals with a confirmed pathogenic LRRK2 mutation. Given that LRRK2 activity is believed to regulate lysosomal function and underlying biological pathway implicated in Parkinson's disease, we are also advancing the Phase IIb LUMA study in idiopathic Parkinson's disease, which we initiated earlier this year. Moving on to specialized immunology.\n\nWe were excited to announce the initiation of the Phase II/III study of litifilumab or BIB059 in cutaneous lupus erythematosus, or CLE. The prior Phase II LILAC study of litifilumab met the primary endpoints in both parts of the study, evaluating safety and efficacy in individuals with CLE and systemic lupus erythematosus or SLE. The detailed Phase II results were recently published as 2 separate manuscripts in the New England Journal of Medicine. The Phase II/III study in CLE builds upon our mid- to late-stage pipeline in specialized immunology, which also includes three Phase III studies in SLE, two for litifilumab and one for dapirolizumab pegol, which we are developing in collaboration with UCB.\n\nLooking ahead, we also have a number of exciting opportunities on the horizon. This includes the potential to deliver new therapies in Alzheimer's, depression, and SOD1-ALS; initiation of mid- to late-stage programs in Alzheimer's disease and stroke; and a proof-of-concept study readout in broad ALS. In conclusion, we believe that our recent progress exemplifies important elements of our broader approach to R&D at Biogen. This includes a focus on genetically validated targets and biology, the use of novel biomarkers to better characterize disease biology and target engagement, as well as our ability to employ the right therapeutic modality for the specific disease area or target.\n\nTogether, we believe these principles, combined with our ongoing prioritization effort, has the potential to increase the probability of success in disease areas with significant unmet need. I will now pass the call over to Mike.\n\nMike McDonnell -- Chief Financial Officer\n\nThank you, Priya. And good morning, everyone. I will provide some highlights of our financial performance for the third quarter and an update to our full year 2022 guidance. Please note that all financial comparisons are versus the third quarter of 2021.\n\nTotal revenue for the third quarter was $2.5 billion, a decrease of 10% at actual currency and 8% at constant currency.  Non-GAAP diluted EPS in the third quarter was $4.77, which was flat versus the third quarter of 2021. Total MMS revenue, inclusive of OCREVUS royalties, was $1.6 billion, which was a decrease of 11% at actual currency and 9% at constant currency. Global TECFIDERA revenue of $339 million decreased 32% at actual currency and 30% at constant currency. We saw continued erosion of TECFIDERA in the U.S.\n\ndue to generics and an impact from generics outside of the U.S., primarily in Germany. We continue to see new generic launches in the EU. Earlier this month, the advocate general of the European Court of Justice issued a nonbinding advisory opinion. We would expect TECFIDERA to have statutory market protection until at least February of 2024 if the court adopts the advisory opinion.\n\nThere is no deadline for the court to issue its final decision, but we understand that approximately 3 to 5 months after issuance of the advocate general's opinion is typical. Separately, we are filing actions to enforce our recently granted European TECFIDERA dosing patent, which expires in 2028. We have been successful in obtaining preliminary injunctions in some countries and unsuccessful in others, including Germany and France. Until we either affirm TECFIDERA's entitlement to statutory market protection in the EU or successfully asserted our patent, generics can continue to sell in the countries where we do not have preliminary injunctions in place.\n\nGlobal VUMERITY revenue of $138 million increased 14% at actual currency and 15% at constant currency. U.S. VUMERITY revenue increased 6% with higher volumes, partially offset by increased discounts and allowances. VUMERITY is being impacted by both payer pressure and the contraction of the oral segment of the market in the United States.\n\nWe continue to work with our contract manufacturing supplier to address potential supply constraints for VUMERITY. We have identified the root cause, implemented manufacturing changes required to resolve the issue, and are now working to secure necessary related regulatory approvals. We do not anticipate a supply shortage in 2022 and are currently focused on rebuilding adequate inventory with the goal of ensuring supply and reinitiating new country launches in 2023. Global TYSABRI revenue of $505 million decreased 3% at actual currency and 1% at constant currency.\n\nU.S. TYSABRI revenue was negatively impacted by higher discounts, and allowances, and lower volume. Outside the U.S., we were pleased to see continued patient growth as well as good uptake of the subcutaneous formulation in the EU, which has now been launched in over 25 markets with an average conversion rate of approximately 40%. Although the composition of matter patents for TYSABRI have expired, we have other patents related to the making and using of TYSABRI, including those listed in our 10-K.\n\nWe'll continue to enforce this IP, including filing suit against Sandoz in the United States. Global interferon revenue of $336 million decreased 13% at actual currency and 12% at constant currency and was impacted by the continued shift from the injectable platforms to oral or high efficacy therapies. Moving to SMA. Global SPINRAZA revenue of $431 million declined 3% at actual currency and increased 2% at constant currency.\n\nIn the United States, SPINRAZA revenue was flat versus the prior year, and we believe we may be seeing signs of stabilization in the U.S. Outside the U.S., excluding negative currency impacts, revenue increased due to volume growth in certain Asian markets as well as some positive pricing dynamics, partially offset by competition and the timing of shipments. Overall, we continue to believe that SPINRAZA has the potential to grow over time. Moving to our biosimilars business.\n\nRevenue of $188 million declined 7% at actual currency and 4% at constant currency. We saw an increase in sales volumes, which was offset by unfavorable pricing as well as negative currency impacts. We continue to expect a gradual launch of BYOOVIZ with more meaningful revenue contribution expected to begin in 2023. Total anti-CD20 revenue of $417 million was flat versus the prior year.\n\nRevenue from OCREVUS royalties increased 6%, which was offset by continued RITUXAN declines due to biosimilar competition. Now moving on to expenses on the balance sheet. Third quarter non-GAAP cost of sales was $470 million, which includes $12 million of idle capacity charges. Going forward, we expect further pressure on gross margins due to shifts in product mix and potential idle capacity charges, largely resulting from the suspension of drug product manufacturing for Aduhelm.\n\nThird quarter non-GAAP R&D expense was $549 million. This is compared to $702 million in the third quarter of 2021, which included approximately $165 million in upfront payments related to business development transactions as well as clinical trial closeout costs. Non-GAAP SG&A was $562 million. This is compared to $651 million in the third quarter of 2021.\n\nThe decrease in SG&A expense was driven primarily by cost savings initiatives. Third quarter collaboration profit sharing was a net expense of $45 million, primarily driven by our collaboration with Samsung Bioepis. Non-GAAP other expense was $55 million, primarily driven by interest expense. In the third quarter, we generated $661 million in cash flow from operations.\n\nCapital expenditures were $59 million, and free cash flow was $602 million. We repurchased 1.2 million shares of the company's common stock during the quarter for $250 million at an average price of $214 per share. We ended the quarter with $5.8 billion in cash and marketable securities, $6.3 billion in debt, and approximately $500 million in net debt. Of note, in the third quarter, we received net proceeds of $583 million from the sale of one of our buildings in Cambridge as part of our office footprint optimization initiative.\n\nAdditionally, in October, we paid $900 million plus fees and expenses to resolve the previously disclosed Ketan litigation. As a reminder, we expect to receive an additional $1.25 billion over the next 1.5 years from the sale of our equity stake in Samsung Bioepis, including approximately $813 million due in April of next year. Overall, we remain in a very strong financial position with significant cash and financial capacity, including a $1 billion undrawn revolving credit facility to invest in growing the business over the long term. Before I turn to our updated guidance, let me say a few words about lecanemab. We are excited to be collaborating with Eisai on this important opportunity under a global 50-50 profit sharing agreement.\n\nAs a reminder, Biogen has the right to co-commercialize and co-promote lecanemab with Eisai, who has final decision-making authority. After approval, our share of profits or losses will be booked as a component of other revenue. The lecanemab component of other revenue may be negative in the initial quarters of the launch. Please see Slide 26 in our earnings presentation for other accounting considerations.\n\nLet me now discuss our updated full year 2022 guidance. We are increasing our full year revenue guidance from our previous range of $9.9 billion to $10.1 billion to a new range of $10 billion to $10.115 billion and increasing our full year non-GAAP diluted EPS guidance from our previous range of $15.25 to $16.75 to a new range of $16.50 to $17.15. This guidance increase is primarily a result of better-than-expected top line performance and continued cost management. Our guidance ranges for non-GAAP R&D expense, non-GAAP SG&A expense, and our non-GAAP tax rate are all unchanged from prior guidance.\n\nAs a reminder, we typically see a seasonally higher SG&A spend in the fourth quarter. This guidance assumes that foreign exchange rates as of September 30 will remain in effect for the remainder of the year, net of hedging activities. This financial guidance also assumes continued declines in Rituxan revenue due to biosimilar competition, as well as continued erosion of TECFIDERA revenue due to generic entry. Please see our press release for other important guidance assumptions.\n\nIn summary, we continue to execute well across our core business and are pleased to be raising our financial guidance for the year. We are excited about the recent lecanemab readout and believe our diversified pipeline across neuroscience, specialized immunology, and biosimilars has the potential to return Biogen to growth over time as we continue to build a multi-franchise portfolio. As always, we remain focused on creating long-term value for our shareholders. And with that, we will now open the call for questions. \n\nOperator\n\n[Operator instructions] Your first question comes from the line of Umer Raffat with Evercore.\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nMorning, guys. I had a question on the status of your relationship with Eisai. There's a lot of investor questions on it, and I was just really curious if you could speak to sort of the status of the relationship, if you expect Eisai to allow you to commercialize and that there's not been any sort of contractual disputes or anything like that. Thank you very much. \n\nMichel Vounatsos -- Chief Executive Officer\n\nThanks for the question, Umer. I can tell you that the relationship is very solid since many years. I have the opportunity to meet and to align with our -- my counterpart on a very regular basis, and I will do that once more in the coming days. The team are working together very closely.\n\nThe co-commercialization, co-marketing is being discussed when we speak and is not yet determined. And -- but overall, the relationship is sound and solid. Mike, do you want to add something?\n\nMike McDonnell -- Chief Financial Officer\n\nNo, I think that covers it. I would say that as we work together on the commercialization strategy, obviously, Eisai has final decision-making rights, but it is a 50-50 profit share. And together, we're excited for the upcoming CTAD presentation, where more detailed study results will be shared. \n\nOperator\n\nWe'll go to our next question from Brian Abrahams with RBC Capital Markets.\n\nBrian Abrahams -- RBC Capital Markets -- Analyst\n\nHey, good morning. Thanks for taking my question, and congrats on the quarter and on the lecanemab data. I'm curious how you envision reimbursement access for lecanemab with an accelerated versus a full approval. And I guess I'm wondering based on you and your partner's ongoing CMS discussions, what your latest views are on whether top line results from Clarity AD would satisfy CMS' high-level evidence requirements to support NCD reconsideration in the case of an accelerated approval.\n\nThanks.\n\nMichel Vounatsos -- Chief Executive Officer\n\nThanks for this important question. I think it all depends to the strength of the evidence. We are very pleased with the topline results on the primary and secondaries. We are all looking forward for CTAD and for a coming publication in order to assess the level of evidence that will be considered by CMS, and that will imply the path forward.\n\nPriya?\n\nPriya Singhal -- Interim Head of Research and Development\n\nThank you, Michel. That's exactly right. And I'll just add that there is a -- there are a couple of scenarios that are outlined in the NCD. So for the accelerated approval scenario, it's essentially coverage only in the situation of a randomized-controlled trial, which is essentially noncoverage.\n\nBut for traditional approval, there is a range of options, I think, that the NCD indicates, which is that it could be covered in a CMS-approved prospective comparative study, including registries. The strength and rigor of that kind of study will depend on the strength and rigor of the randomized-controlled trial that affords the final traditional approval. So in that sense, we feel very confident about the strength of evidence. As you know, we met the primary endpoint with a treatment difference of 0.45, which translated to 27% versus placebo with lecanemab.\n\nAnd also, all secondary endpoints were met in a highly statistical significant manner. And in addition, I would add that we had about 25% of an underrepresented population. So we believe that it's very well-designed, and the results are very encouraging. The rest will remain to be seen, and Eisai is already engaging with CMS to discuss this.\n\nYou specifically asked about reconsideration, so I'll just add a note there that in the final scenario that NCD -- the final NCD did put out was that CMS would act with urgency. And potentially, a reconsideration could be considered. That could take 9 to 12 months from a historic precedent perspective. But I think in this sense, they have said that they would act with urgency, and that would be a full coverage without the need for prospective comparative studies.\n\nSo I think we need to wait for the CTAD data and continue the engagement. \n\nOperator\n\nYour next question comes from the line of Salveen Richter with Goldman Sachs.\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nGood morning. Thanks for taking my question. On the back of the lecanemab data, can you just walk us through how you're thinking about business development and portfolio prioritization?\n\nMichel Vounatsos -- Chief Executive Officer\n\nI can tell you that we do remain very active on BDs -- in evaluating BD. Obviously, the portfolio is strong. And as we said during the prepared remarks, we have 12 Phase IIIs of filed products and we are getting prepared for AD, ALS, MDD, and PPD. So we are all very busy.\n\nNevertheless, BD is on the table because the portfolio can always be improved. And we are evaluating every week prospects, and we are making progress. We've made more than 30 deals in the past few years, but we continue to be very active. Priya and Mike?\n\nPriya Singhal -- Interim Head of Research and Development\n\nSo I think that's a great question. And just stepping back, as Michel mentioned during the remarks, we see ourselves as leaders in the Alzheimer's space. We believe that we've done a lot of evaluation of the scientific hypotheses, the biology. And we have set up our portfolio to be able to address both what in terms of the biology and also the when.\n\nSo I think in terms of the biology, we've now had success with lecanemab. Previously, we've seen the results also with aducanumab, and that's the Abeta hypothesis. In addition, we had our own study with the monoclonal antibody against tau, which did not work. So we did test our hypothesis with the extracellular tau, and now we are positioned to initiate our Phase II with BIIB080, which is an antisense oligonucleotide that will address all post-translational forms of tau.\n\nSo we believe that [Inaudible] we believe we have a leading antisense oligonucleotide Also, we have BIIB113 in Phase I, which addresses tau aggregation and addresses an enzymatic inhibition of tau aggregation. So we are really trying to tackle this from all the -- from the amyloid and the tau pathology basis. Behind that, in the preclinical space, we have also several other biologies that we are looking at very carefully in terms of targets and also modalities. So I think we have a very comprehensive approach.\n\nAnd with regards to when, I'm very pleased that we have lecanemab already being tested in preclinical Alzheimer's disease. So that's a study that's already ongoing, which will address what happens when you intervene with an anti-amyloid therapy prior -- when you do have the amyloid aggregation but you don't have symptoms. So I think it's a very comprehensive approach. We are not going to stop here.\n\nWe continue to look at very attractive targets, and I think BD and internal development will continue to be important. And finally, with lecanemab, we are testing two very important aspects in our development plan. Eisai is obviously the lead on this. In the Phase II open-label extension, we're looking at maintenance dosing, so what's the right frequency to continue to preserve the clinical decline progression stop.\n\nAnd we are looking at subcutaneous development in the Phase III open-label extension. So I think overall, it's very, very comprehensive, and I think this will be a space that we will continue to invest to win. Thank you.\n\nMichel Vounatsos -- Chief Executive Officer\n\nMike, do you want to add anything to BD?\n\nMike McDonnell -- Chief Financial Officer\n\nNo, the only thing I would just quickly add is that -- I think you covered it, but I would just quickly add. You did not see BD activity during the quarter in the way of new collaborations or M&A. You should not read anything into that. We continue to have a very robust pipeline, and we continue to look at a variety of deals.\n\nIt does tend to be lumpy, and you should fully expect that there will be more transactions in the future. Thanks.\n\nMichel Vounatsos -- Chief Executive Officer\n\nSo as Priya said very eloquently, neurodegeneration takes more prominence in our privatization process, and we are in a position to lead in AD, and we are looking at actively at all the targets and assets we could acquire, but also beyond. \n\nOperator\n\nWe'll take our next question from Tim Anderson with Wolfe Research.\n\nTim Anderson -- Wells Fargo Securities -- Analyst\n\nI have a question actually on ADUHELM, and it kind of relates to earlier comments about your role with lecanemab still being under contemplation. I think a lot of folks are under the impression you've all but washed your hands and aren't really doing anything with ADUHELM. But from what I hear, that may not be the case. You're still pursuing a subcu version of the product.\n\nIt sounds like you still may be trying to figure out a path forward to get CMS reimbursement for APOE4 carriers. And I'm wondering if that is true and if that could be a source of tension with Eisai. It's just not intuitive to me why you wouldn't be all-in on lecanemab instead and why you still may be active with ADUHELM. Thank you.\n\nMichel Vounatsos -- Chief Executive Officer\n\nSo we'll be all in on leca together with the great partners that we have, and we will do everything we can to secure access of the product to the patients after regulatory process. Nevertheless, the Clarity AD reinforces the finding that removing aggregated form of [Inaudible] in the brain can be associated with the slowing down of the cognitive decline. And this is very important, and this is what we have shown with ADU, and we have patients currently being dosed on the EMBARK study, and Priya will say more with that.\n\nPriya Singhal -- Interim Head of Research and Development\n\nYes. I'll actually -- I don't have a lot to add. What I'll say is that we are continuing to look at aducanumab, and we haven't made any decisions. For now, we believe that the EMBARK dataset is going to be very valuable to the scientific community.\n\nThese are patients who've been on aducanumab and an anti-amyloid therapy for many years. In addition, we have a post-marketing requirement given that aducanumab was the first product to get accelerated approval, and this is called the ENVISION study. So for now, both ENVISION and EMBARK continue. \n\nOperator\n\nYour next question comes from Chris Raymond with Piper Sandler.\n\nChris Raymond -- Piper Sandler -- Analyst\n\nHey, thanks. Just maybe a related question to the last one. So with your commercial infrastructure for ADUHELM largely sort of wound down here, how should we think about the ramp maybe in spend on lecanemab infrastructure come January? And maybe talk about the lessons learned from ADUHELM and walk us through how you resource this launch here as you move from a potential accelerated approval to full approval. Thanks.\n\nMichel Vounatsos -- Chief Executive Officer\n\nThanks for the question. I will start, and Mike will add on. It was not reasonable based on the timeline and the gap between the ADU NCD decision, and the lecanemab readout, and then regulatory process to keep a large force on board. This will not have been reasonable.\n\nSo we had no choice than to take the actions that we took. Now there is a new page. And together with the partners, we are assessing, considering the benefits, the strength, the relative strength of each company in each continent since we intend to file for full approval at the same time approximately in the U.S., in Europe, and Japan should we have the accelerated approval early in the year. We are planning the investment, but we are not yet completely there.\n\nSo we'll do that in a very paced and controlled manner, and we'll take it from here. Mike?\n\nMike McDonnell -- Chief Financial Officer\n\nYes. I would just add to that, that as we continue discussions with Eisai on the commercialization strategy, it's a 50-50 profit share. They have the final decision rights, as we've said. There are learnings from the ADUHELM situation that obviously we all share openly, and I would say that I do feel very highly confident that we will -- you'll see a commercial ramp in spend that will have much better proximity to revenue than you saw on ADUHELM.\n\nAnd obviously, there were a number of things on ADUHELM that didn't go the direction that we had anticipated. But I do feel confident that we'll be able to gauge it in a way that -- and Eisai will be able  to gauge it in a way that the ramp in spend will have better proximity to revenue than what you saw on ADUHELM.\n\nMichel Vounatsos -- Chief Executive Officer\n\nAnd I will say -- and if I may, I will say that we have a new process ahead of us. What we thought a couple of years ago is that an accelerated will mean product launch, and this was not the case. So here now, we have a new process that was outlined, and then we'll be very much controlled in the way we spend the company's resource to scale up.\n\nOperator\n\nYour next question comes from Matthew Harrison with Morgan Stanley.\n\nMatthew Harrison -- Morgan Stanley -- Analyst\n\nGreat. Good morning. Thanks for taking the question. I wanted to address another question that I think we get a lot from investors, which is about the potential for certain subgroups or populations to outperform and drive a significant part of the lecanemab topline results.\n\nSo can you just maybe confirm, if that was the case, if for example a certain subgroup was a major driver of the response, that you would have called that out in the top line? Or how should we think about that going into CTAD? Thanks.\n\nPriya Singhal -- Interim Head of Research and Development\n\nI can take that question. Thanks for the question, Matthew. So overall, I'll just say that the Clarity AD met its primary endpoint, which was CDR-Sum of Boxes, and this was with a p-value of 0.00005. So it was very, very highly significant.\n\nAnd this was a large trial. So it was about 1,800 participants with -- including the underrepresented population. And it met all its secondary endpoints, which were independent domains of cognition and function. So overall, we feel that the results are very, very positive and that they're very encouraging.\n\nNow details of subgroup analyses have not been shared by Eisai, and I think we need to wait for the CTAD to see more details about both the primary and the secondary endpoints. But at this point, I would say that overall, we believe that we just have to wait, and we feel very encouraged by what we've seen on the topline. I won't be able to comment on exactly what you may or may not see. I think we have to wait for CTAD for that. \n\nOperator\n\nYour next question comes from Brian Skorney with Baird.\n\nBrian Skorney -- Robert W. Baird and Company -- Analyst\n\nHey, good morning, everyone. Thanks for taking my question. I was wondering if you could outline any broad timeline that you have for subcu lecanemab. Just wondering what the pathway looks like and maybe you're seeking to get initial and chronic dosing approved.\n\nOr would this be more like initially a label where you could have patients switching, who have initiated IV over a period of time? And just any learnings from your interactions with FDA on subcu TYSABRI that you think might be applied as we think about this pathway going forward?\n\nPriya Singhal -- Interim Head of Research and Development\n\nThank you, Brian. So overall, what I can tell you is that this is a very important part of the long-term comprehensive clinical development plan for lecanemab. And the subcutaneous formulation development has -- is already being pursued in the Phase III open-label extension. We're also -- Eisai is also engaging with FDA.\n\nSo there are lots of discussions ongoing. I would just say that the Phase I bioavailability data has already been shared publicly, so I already shared that. And as I mentioned in my remarks, they are currently looking at the 720-milligram weekly fixed dosing, and this is being evaluated. But the timelines and the details of what else the package might need, that has not been shared.\n\nAnd so I would say just let's wait for that to be shared, and we will share that when it's appropriate. But it is a very important endeavor, and it is ongoing. \n\nOperator\n\nYour next question comes from Michael Yee with Jefferies.\n\nMichael Yee -- Jefferies -- Analyst\n\nHey, thanks. Good morning. Going back to the comments about CMS reimbursement and having to wait for CTAD data, I guess maybe you could talk about what pathways or what types of interactions, if any, or what approach you can have with CMS to push urgency, whether that would be patient advocacy groups, whether you guys are working hard to do that or whether they just see that there's clearly a change from ADUHELM situation a year ago and they will act fast. Thank you.\n\nMichel Vounatsos -- Chief Executive Officer\n\nSo Eisai has the lead in engaging regulators and payers. And from what we know is that Eisai has already initiated engagement with CMS. So they're responsible for this activity. And at this stage, I will not provide more details.\n\nBut the engagement is there, which is the most important. \n\nOperator\n\nWe'll go next to Robyn Karnauskas with Truist Securities.\n\nRobyn Karnauskas -- Truist Securities -- Analyst\n\nThank you. My question is 2 fronts. So we're hearing a lot that Lilly has a very big presence right now and mind share of doctors in this space. And you mentioned, Mike, that you tend to be -- that you think that we'll have more -- I'm trying to interpret what you said, is that you're going to ramp up spend in line with revenue. Can you just elaborate a little bit there? Because you will have competitors in the space.\n\nAnd a small question for Priya. We also hear that tau pathology that you may not want to do trials in patients that already have a beta plaque with tau. A couple of questions there. Thanks.\n\nMike McDonnell -- Chief Financial Officer\n\nYes. I'll just clarify the point that I made before. As Eisai develops the commercialization strategy along with us, the goal there, obviously, the first and primary goal will be to get the launch right and put an infrastructure in place that supports the best launch possible, and we'll be in position. And obviously, in the situation that we had with ADUHELM when we received approval in June of 2021, we had a large infrastructure that was built up and ready to go.\n\nAnd then obviously, we encountered significant delays. And the point that I was making is that we would hope that that wouldn't be a repeat and that we would have the appropriate infrastructure to support a successful launch. That's priority one. And then hopefully, we wouldn't experience delays like that.\n\nAnd so that you would see a spend that would ramp in front of revenue, but it wouldn't have the gap that it did on ADUHELM.\n\nPriya Singhal -- Interim Head of Research and Development\n\nAnd I can add to that, Robyn. Thanks, Mike. I can add to that. In terms of doctors and mind share, I think that, obviously, this is a very highly rapidly evolving space from a scientific perspective.\n\nAnd I think lecanemab has demonstrated that removal of the plaques can result in a clinical impact, and this is really going to be important. I'd also like to add that the safety profile is going to be really, really important here. For example, with lecanemab, we've got rates of ARIA that are about 21%. We've seen this to be within expectations.\n\nAnd I think that this, together with the efficacy results, are going to be important for doctors to consider. So overall, while I think the question was a little bit more maybe about the launch, I would say that the mind share will depend on the data, and I think the data needs to be seen from the other anti-amyloid therapies before we decide what is going to be meaningful. The other piece I think here is we see ourselves as pioneers. We've got this very encouraging data.\n\nWe think that this is a very broad and complex patient population, and the need and unmet need is very, very high. So we think it's a very important place where we can make difference to patients. And then Robyn, on the second question, can you please clarify that? I didn't quite catch it. You broke up toward the end.\n\nRobyn Karnauskas -- Truist Securities -- Analyst\n\nYes, sorry. So for tau pathology, some scientists believe that you want to clear plaque before you give the tau. So in other words, tau may not work alone. You may need to actually combine it with lecanemab now that we understand the biology.\n\nThe thought on all these trials that are ongoing, including 080, like how -- do you think that there is a chance that they may not work because you actually need to actually clear plaque with an Abeta drug like lecanemab?\n\nPriya Singhal -- Interim Head of Research and Development\n\nGot it. So I think I'll just step back to say that obviously, amyloid pathology is very key. We also believe that it's potentially upstream of tau pathology. And with aducanumab with -- our data with aducanumab, we did show the impact on phospho-related tau and such.\n\nSo we think that this cascade overall is going to be very important. Having said that, I think that you're right, that maybe the future of Alzheimer's disease is going to be about the timing of intervention, which I already spoke to, and that's a very different matter. But it could also be that one type of approach may not be adequate. The question here is that we're trying to be very systematic and methodical in how we approach it.\n\nSo we've now demonstrated with lecanemab that really there is the removal of aggregated plaque, which results in clinical impact. And I think Eisai has also shared earlier this year that this could result with -- based on data from Phase IIb and modeling, that this could result in a preservation of about 2 to 3 years before patients progress to significantly more severe stages of Alzheimer's. This is based on modeling and data from Phase II, and I know that they have said publicly that they will also do this type of analysis with the Phase III data. So I think that we are making significant progress.\n\nAnd then separately, we are tackling the BIIB080, which we had very encouraging results from our Phase Ib trial, where we showed a dose and time-dependent reduction of tau, and we believe it addresses all forms of tau. So now, we're in the process of initiating a Phase II. But you're absolutely right, we will be looking at many different approaches in how we can benefit patients in the best way that we can. So yes, all biologies need to be considered, but we need to go step wise, and we need to be systematic about this.\n\nMichel Vounatsos -- Chief Executive Officer\n\nAnd if I may add on the mind share, the epidemiology is so large. There is so much to be built in terms of infrastructure that I -- we all welcome the efforts of other companies. Specifically about lecanemab, and I know that you have engaged with scientific leaders, some of you. We have engaged with [Inaudible] and clinicians.\n\nI think the feedback is very positive from what we hear. And at the end of the day, it will be the efficacy at 6 months and expanded over a period of 18-month study and the safety that will make the difference between the compounds. But at this stage, we welcome every effort to prepare the market for the patients in need. \n\nOperator\n\nYour next question comes from Jay Olson with Oppenheimer.\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nOh, hey, thanks for taking the question, and congrats on the Clarity AD results. I'm curious about the potential for your collaboration with Denali and how you plan to leverage their TV platform for Abeta antibodies, including lecanemab and ADUHELM. Now that we have positive clear DAD results, do you think better brain penetration could improve the therapeutic profile of Abeta antibodies? And what is the timeline to nominate a candidate from the TV program? Thank you.\n\nPriya Singhal -- Interim Head of Research and Development\n\nThank you, Jay. It's a very good question. What I can share with you is that we are looking across our portfolio, and we're looking at several of our existing partnerships to see how we can actually move and build on the strength of these data and the strength of the biological hypothesis that we've seen. I can't comment more specifically on the Denali TV platform.\n\nBut yes, everything is on the table. We'll be looking at everything very carefully, and we'll make announcements as they become relevant and as it's appropriate. Thank you. \n\nOperator\n\nWe'll go next to Bill Nadeau with Cowen and Company.\n\nBill Nadea -- Cowen and Company -- Analyst\n\nGood morning. Thanks for taking our questions. A follow-up question on the learnings from the aducanumab launch. What are Biogen's recent thoughts on lecanemab's price? Would you expect to price at a premium to ADUHELM because of better data, a discount because of the pushback? And appreciating that Eisai has final say on all commercialization decisions, what role will Biogen play in setting the price of lecanemab? Thank you.\n\nMichel Vounatsos -- Chief Executive Officer\n\nAs you can anticipate, we cannot comment. It's Eisai's decision, and we will not interfere with this process. \n\nOperator\n\nWe'll go next to Marc Goodman with SVB Securities.\n\nMarc Goodman -- SVB Securities -- Analyst\n\nYeah. Could you give us a little more color on OUS SPINRAZA, just what the dynamics were? Something about price increases or positive pricing dynamics there? And then just, Priya, can you just confirm, is the subcu dose 720 weekly? Is that the one that we're gonna be using? Or we're still working on the dosing regimen?\n\nMichel Vounatsos -- Chief Executive Officer\n\nI think your question was about ex U.S. SPINRAZA.\n\nMarc Goodman -- SVB Securities -- Analyst\n\nYeah.\n\nMichel Vounatsos -- Chief Executive Officer\n\nYes, so we see two types of dynamic. We see a European momentum that is being slowed down by the launch of risdiplam. But we are sharing data on the switch from patients, patients from the U.S. from risdiplam back to SPINRAZA for efficacy reasons.\n\nSo I think -- and we are learning from the U.S. So it's a matter of time. We are learning from the U.S. We're delighted by the U.S.\n\nresults, and we believe that this becomes a model for what other continents should learn from. And ex core Europe, we see a very rapid growth in terms of volume, but the price is not the same. So this is the momentum ex U.S. Overall, we are delighted by the U.S.\n\nresults, where we can see SPINRAZA coming back, and we believe the product will resume its momentum to grow gradually. Mike, do you want to add?\n\nMike McDonnell -- Chief Financial Officer\n\nYeah. I would just add, and in the spirit of your question, Marc, was directed more at OUS. We mentioned the U.S. was flat.\n\nAnd OUS overall, there was a modest decline, but if you strip out FX on a constant currency basis, there was actually growth. And that growth to the points that we made in our prepared remarks, there was a modest volume decline, primarily due to competition in places like Germany, and Canada, and Japan, and we had some timing items, Russia, Brazil, a few others, which was partially offset by volume growth in China. But we did have price increases in a few of our markets throughout Europe that more than offset the volume. So to kind of unpack it, you had modest volume declines slightly more than offset by price increases, and then you had the FX going against you OUS.\n\nPriya Singhal -- Interim Head of Research and Development\n\nAnd I'll just wrap up really quickly on the second point. I think that your -- second question you had. Eisai has communicated that the 720-milligram weekly fixed dose is the dose that show the equivalents to intravenous dosing, 10-milligram per kg biweekly. And it's also actually now listed for the auto-injector study that was recently announced.\n\nI think that was the question. Please correct me if [Inaudible]. Thank you. \n\nMarc Goodman -- SVB Securities -- Analyst\n\nThank you.\n\nOperator\n\nWell, then next to Chris Schott with J.P. Morgan.\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks so much for the questions. Can you just talk a little bit more around the dynamics about the 2-week IV therapy for lecanemab as we wait for the subcu and maintenance programs? I guess, reimbursement aside, how challenging do you think this is going to be from a commercial and infrastructure standpoint? And I know you're not talking about timing, but is this a relatively short window that you envision that will be using this current dosing paradigm or could be dealing with this for an extended period of time? Thank you.\n\nPriya Singhal -- Interim Head of Research and Development\n\nOkay. So I think overall, we've seen very good data with the 10-milligram per kg biweekly dose. I think the important point that is very, very, I think, relevant here is that the separation is seen at 6 months, as early as 6 months, there's no titration, and that expands on an absolute basis until the 18-month primary endpoint readout in Clarity AD. So this is very encouraging data.\n\nI would say that as the infrastructure around Alzheimer's disease and all of this has been built out, it will actually be quite important for patients to be seen by physicians. So we don't see it necessarily as a disadvantage if that was the question. We don't see it as a disadvantage. But having said that, we are doing everything.\n\nEisai is leading this effort, and we're trying to make sure that we are keeping patient convenience in mind, which is the premise of the subcutaneous development. So I can't comment beyond that on how long it will be intravenous and when would it transition to subcutaneous. But we're looking at all these aspects very carefully at a high level and also at a granular level as we build out the clinical development program with all these topics in mind. So overall, we believe in the early stages, it will actually be really important for patients to be seen in the clinic every 2 weeks. \n\nOperator\n\nYour next question comes from Paul Matteis with Stifel.\n\nPaul Matteis -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks so much. I was wondering, based on your experience in the field with ADUHELM, how would you characterize infusion capacity today in neurology clinics ahead of the lecanemab launch? Where is it today? And how much ramp-up do you think needs to happen for there to be materially broader access over time?\n\nMichel Vounatsos -- Chief Executive Officer\n\nSo what we saw for ADUHELM is that the system has shown some adaptability by shifting some of the existing infusion center to potentially ADUHELM at that time should there be reimbursement. We never got reimbursement, so this never happened. And overall, I believe there is a need to upscale, and the capacity has to be much larger. But from my -- from our learning, we could see that the system was flexible and adaptable based on the current capacity. \n\nOperator\n\nYour next question comes from Geoff Meacham with Bank of America.\n\nGeoff Meacham -- Bank of America Merrill Lynch -- Analyst\n\nMorning, guys. Thanks so much for the questions. Just a follow-up on lecanemab launch spending. Post the restructuring that you guys had earlier this year, can you talk a little bit about the manufacturing assets that you can redeploy or maybe some of the commercial investments that you made for ADUHELM that can be reallocated for the lecanemab launch? I'm just trying to get a sense for kind of the magnitude of of the spend versus the adoption over the course of next year.\n\nMichel Vounatsos -- Chief Executive Officer\n\nMike? \n\nMike McDonnell -- Chief Financial Officer\n\nYeah. So a couple of comments, Geoff. Thanks for the question. I would say first on manufacturing, we have a significant facility in Raleigh, North Carolina and then we have a relatively new facility in Solothurn Switzerland. And the Solothurn Switzerland facility will be largely dedicated to our Alzheimer's disease products, which for now involves a ramp-up of getting inventory ready for launch for lecanemab.\n\nI think we had a little over $100 million of inventory on hand as of the end of the quarter. And the -- that facility, its efficiency, so to speak, is heavily tied to the lecanemab launch. And then to the extent that ADUHELM becomes more marketable, we could utilize that facility as well. So that's the state of play there.\n\nThere will be some idle capacity. You saw about $12 million this quarter. There'll be some idle capacity charges that we'll have to incur over time as that product ramps. I would say on the commercial infrastructure, there's not a lot that can or will be repurposed from ADUHELM.\n\nWe did make the decision, as we've said before, to take that infrastructure down. It was just too long of a time gap from the time that we received the NCD in April of 2022 to when lecanemab would become fully commercialized to maintain that infrastructure. So most of that's been eliminated as part of our $1 billion cost savings that we've committed. And so for the most part, the lecanemab, commercialization will be a new ramp and a new infrastructure that will be built.\n\nMichael Hencke -- Head of Investor Relations\n\nThat concludes our call for this morning. Thank you, everyone, for joining us.[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Hencke -- Head of Investor Relations\n\nMichel Vounatsos -- Chief Executive Officer\n\nPriya Singhal -- Interim Head of Research and Development\n\nMike McDonnell -- Chief Financial Officer\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nBrian Abrahams -- RBC Capital Markets -- Analyst\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nTim Anderson -- Wells Fargo Securities -- Analyst\n\nChris Raymond -- Piper Sandler -- Analyst\n\nMatthew Harrison -- Morgan Stanley -- Analyst\n\nBrian Skorney -- Robert W. Baird and Company -- Analyst\n\nMichael Yee -- Jefferies -- Analyst\n\nRobyn Karnauskas -- Truist Securities -- Analyst\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nBill Nadea -- Cowen and Company -- Analyst\n\nMarc Goodman -- SVB Securities -- Analyst\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nPaul Matteis -- Stifel Financial Corp. -- Analyst\n\nGeoff Meacham -- Bank of America Merrill Lynch -- Analyst\n\nMore BIIB analysis\n\nAll earnings call transcripts"
}