{
  "companyName": "Gambling.com Group Limited",
  "companyTicker": "GAMB",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/29/gamblingcom-group-limited-gamb-q2-2022-earnings-ca/",
  "content": "Gambling.com Group Limited (GAMB 1.78%)\nQ2 2022 Earnings Call\nAug 29, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings and welcome to Gambling.com Group second quarter 2022 earnings results call. At this time, all participants are in a listen-only mode. A brief question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, Peter McGough, investor relations for Gambling.com. Thank you, Peter. You may begin.\n\nPeter McGough -- Investor Relations\n\nThank you. Hello, everyone. And welcome to Gambling.com Group's second quarter 2022 earnings results call. I'm Peter McGough, vice president of investor relations at Gambling.com Group.\n\nI'm joined by our chief executive officer and co-founder, Charles Gillespie, and our chief financial officer, Elias Mark. The call is being webcast live within the investor relations section of our website at gambling.com/corporate/investors and a downloadable version of the presentation is available there as well. A webcast replay will be available on the website after the conclusion of this call. You may also contact investor relations support by emailing investors@gdcgroup.com.\n\nI'd like to remind you that the information contained in this conference call, including any financial and related guidance to be provided, consists of forward-looking statements as defined by securities laws. These statements are based on information currently available to us and involve risks and uncertainties that could cause actual future results, performance and business prospects and opportunities to differ materially from those expressed in or implied by these statements. Some important factors that could cause such differences are discussed in the risk factors section of Gambling.com Group's filings with the Securities and Exchange Commission. Forward-looking statements speak only as of the date the statements are made and the Company assumes no obligation to update forward-looking statements to reflect actual future results, changes in assumptions, or changes in other factors affecting forward-looking information, except to the extent required by applicable securities laws.\n\nDuring the call, there will also be a discussion of non-IFRS financial measures. A description of these non-IFRS financial measures is included in the press release issued promptly after market close today. Reconciliations of these non-IFRS financial measures to their most directly comparable IFRS measures are included in the appendix to the presentation and press release, both of which are available in the Investors tab of our website. I'll now turn the call over to Charles.\n\nCharles Gillespie -- Co-Founder and Chief Executive Officer\n\nThank you, Peter, and welcome, everyone. This afternoon we reported record second quarter revenues that showed continued strong performance in both our core business and from our acquisitions from Q1. For those following on the slide deck, I'm now on slide four. Revenue grew 53% to $15.9 million.\n\nNorth American revenue grew more than 300%, despite the seasonally slower nature of the second quarter. We delivered $3.6 million of adjusted EBITDA and $2.9 million of free cash flow. Our strong profitability continues to differentiate us among many online sports betting and iGaming names, while we continue to invest in the organization to support our organic growth initiatives. We delivered over 57,000 new depositing customers, an increase of 119% compared to Q2 2021, while we delivered 26,000.\n\nThe increase in NDCs continues to be driven by our expanded portfolio of websites, as well as growth in existing websites. Slide five. We continue to deliver on our strategic objective to grow our North American presence. After growing more than 500% year over year last quarter, North American revenue grew over 300% year over year to $6.2 million in the second quarter.\n\nThe increase was supported by our successful launch in Ontario in April, as well as continued solid performance elsewhere in North America. Given the low season in the world of sports, growth was primarily driven by online casino. We expect the return of NFL along with the regular fall and winter sporting calendar in North America to drive growth in the second half of the year. And we believe additional new market launches in the US will continue to be a key driver of revenue growth over the coming years.\n\nBusiness in the UK and Ireland was also strong in the quarter and increased 24% compared to last year, despite material currency headwinds. Our media partnership with McClatchy announced in January, saw another encouraging quarter. The recently acquired BonusFinder.com performed ahead of plan in the quarter and delivered very strong NDC numbers, providing a great platform to continue to expand in the Canadian market and beyond. Work on applying our performance marketing platform to RotoWire.com is also progressing well with encouraging early signs ahead of the NFL regular season, such as the RotoWire Fantasy Football Draft Kit occupying the No.\n\n1 spot in the Apple App Store for paid apps over this past weekend. Now, on slide six. Our growth in North America, along with strong revenue in our more mature markets during the first half of the year, is demonstrating the breadth and quality of our portfolio of websites and technology platform. We have made substantial investments over the past few quarters to diversify and strengthen our portfolio to ensure we are well positioned to serve a growing and diverse audience of players around the world.\n\nIn addition to our established cash generating websites, we own and operate a number of additional websites, which are ready to be monetized as soon as additional states launch, such as BetMaryland.com and BetMassachusetts.com. These sites on these premium domains have been developed in-house on our technology platform, which will maximize the ROI for these capital investments over time. On the slide seven, as announced last week, the launch date of online sports betting in Kansas is on Thursday and we are well positioned with BetKansas.com, as well as major in-market media outlets, thanks to our partnership with McClatchy. We are ready with BetOhio.com when Ohio launches on January 1, 2023.\n\nMaryland and Massachusetts have already legislated sports betting but have not yet launched their regulated markets. We expect these states to launch during 2023. Now, I'd like to turn the call over to our CFO, Elias Mark, to discuss our second quarter and first half financial performance in greater detail.\n\nElias Mark -- Chief Financial Officer\n\nThank you, Charles, and welcome, everyone. We're on slide eight now. As Charles mentioned, we saw another strong quarter of financial results during the seasonally slower Q2. Revenue of $15.9 million increased 53% compared to the prior year or 74% on a constant currency basis.\n\nThis currency headwind negatively affected revenue by $1.2 million in the quarter. The increase in revenue was driven by strong growth in NDCs, primarily in North America. We also saw solid growth in the UK and Ireland that was partly offset by the weakening pound and euro against the US dollar. As a reminder, we began recognizing cost of sales during the past quarter as a result of our new media partnership and the subscription business of RotoWire.com, in the second quarter of being cut of $0.5 million.Total operating expenses were $17.7 million, an increase of $10.4 million.\n\nThe total operating expenses were affected by fair value movements in contingent consideration of $2.8 million related to the BonusFinder.com acquisition. Adjusted for fair value movements, adjusted operating expenses were $14.8 million, an increase of $7.6 million. On a constant currency basis, adjusted operating expenses increased by $8.4 million, a difference of $1.2 million. The increase was driven primarily by additional headcounts across marketing, product, sales and technology functions, as well as increased amortization related to our Q1 acquisitions.\n\nDuring 2022 we expect to incur amortization of approximately $4.5 million related to the Q1 acquisitions. We have also increased administrative expenses associated with operating as a public company. We have continued to invest organically by scaling our organization as we seek to solidify our portfolio of brands, websites and technologies for future state launches in the US We will continue to hire to drive future growth but we are slowing the pace of hiring in the second half of the year to consolidate our enlarged organization. We are in a privileged position as a highly profitable company to be able to invest heavily while maintaining high margin and generating positive free cash flow.\n\nWhile we continue to see some inflationary pressures, we're working to mitigate those headwinds by increasing the proportion of our operating expenses for more cost-efficient jurisdictions as we expand. Net income totaled $0.05 million, which is an immaterial amount per diluted share, compared to net income of $2.4 million or $0.08 per diluted share in the prior year. Adjusted for fair value movements in contingent and preferred consideration, adjusted net income in the quarter was $3.1 million and adjusted earnings per share of $0.09 per diluted share. Net income and adjusted net income were positively affected by net forex gains of $2.8 million.\n\nWe will continue to adjust operating profit and net income in this manner until the end of the earn-out period for BonusFinder.com in the first quarter of 2024. We generated adjusted EBITDA of $3.6 million, compared to $5.5 million in the prior year. This represents an adjust EBITDA margin of 23% compared to 53% in 2021. The lower margin was driven by increased operating expenses from our investments in the organization to drive organic growth and the lower margin profile of the acquired core business of RotoWire.com.\n\nTotal cash generated from operations of $3.5 million decreased from $4.7 million in 2021 as a result of the lower adjusted EBITDA. We generated free cash flow of $2.9 million as capital expenses were scaled back as planned after having invested in our portfolio of US focused domain over the last quarters. We remain able to entirely fund our organic growth initiatives from operating cash flow and remain free cash flow positive. New depositing customers in the quarter grew 119% to more than 57,000, compared to 26,000 in Q2, the prior year.\n\nGrowth was driven primarily by online casino, given the low season for sports. Cash as of June 30, 2022, totaled $31.1 million. The quarter-on-quarter decrease of $1.9 million is primarily a result of the settlement of acquired working capital related to the Q1 acquisition of BonusFinder.com and payment for domain acquisitions acquired in previous quarters, which was partly offset by our operating cash flow. Onto slide nine.\n\nTurning to our first half results. Revenue grew 62% to$35.5 million. On a constant currency basis, revenue increased 79%. The currency headwinds negatively affected revenue by $2.1 million in the first six months.\n\nOur cost of sales in the first half year totaled $1.7 million. Operating expenses increased by $18.2 million to $31.8 million. Adjusted operating expenses were $28.9 million, an increase of $15.4 million. On a constant currency basis, adjusted operating expenses increased by $16.7 million, a difference of $1.3 million.\n\nWe recorded net income of $4.5 million or $0.13 per diluted share, compared to $6.9 million or $0.22 per diluted share in 2021; adjusted net income of $7.6 million and adjusted earnings per diluted share of $0.21. Net income and adjusted net income were positively affected by net ForEx gains of $3.6 million. Adjusted EBITDA declined by 15% to $10.7 million, reflecting an adjusted EBITDA margin of 30%. The lower adjusted EBITDA is again the result of our higher operating expenses associated with growing our team, investing in products, marketing and technology, public company overhead and the lower margin profile of the acquired core business of RotoWire.com.\n\nOur free cash flow in the first six months was $4.2 million, compared to $9.5 million in 2021. The decrease was primarily a result of investments in our portfolio of domains and for the US market. Lastly, we delivered our 124,000 new depositing customers representing growth of a 100% compared to the first half of 2021. Our first half financial results were in line with our strategic objectives and expectations.\n\nThese first half results set us up for another year of record financial performance for the group driven by strong performance in both, our core business and our acquisition. Moving on to slide 10. Turning to our outlook. Given our growing exposure to the North American sports calendar, we are subject to deeper natural seasonality patterns than we have experienced historically.\n\nThe third quarter started slowing as it's initially affected by the same seasonality patterns of Q2. This is followed by a seasonally stronger period, starting with the launch of the NFL season and continuing through the end of the year. Our growth expectations are also affected by the timing and quality of new market launches. The Ohio market launch, which we had anticipated for September, in our initial guidance, is now confirmed to launch on January 1, 2023.\n\nAs Charles discussed, Kansas is confirmed to launch this Thursday and is included in our guidance. The weakening of the pound and euro against US dollar negatively affected reported revenue by $2.1 million and positively affected operating expenses by $1.3 million in constant currency terms in the first six months. Compared to a euro to USD rate of 1.15 implied in our initial guidance, revenue was negatively affected by $1.8 million and adjusted operating expenses were positively impacted by $1.5 million in the first six months. Our guidance assumes a euro to USD parity for the second half of the year.\n\nGiven the macroeconomic headlines from Europe and North America, we feel it's prudent to mention that we have seen no deterioration of consumer demand for online gambling year-to-date. We are monitoring and we will continue to monitor consumer behavior closely in Europe and North America as the fall and winter sports seasons develop. From our perspective, demand for performance marketing services for the online gambling industry remains strong. As US operators try their businesses toward profitability, performance marketing becomes even more important.\n\nAlong with our increase in scale, our pricing power in respect of our US NDCs improves. With all that being said and in spite of the adverse currency movements, we are reiterating our guidance for 2022 of revenue in the range of $71 million to $76 million, representing growth of 68% to 80%, and adjusted EBITDA between $22 million and $27 million, representing growth of 20% to 47%. With that I'll turn the call back to Charles.\n\nCharles Gillespie -- Co-Founder and Chief Executive Officer\n\nThanks Elias. Before we wrap up for questions, I would like to provide some additional perspective on the market today and going forward. The team is well positioned and fully prepared to monetize the fall sports season in the state of Kansas, when the market launches Thursday. Likewise, we are positioning ourselves for a successful launch in Ohio in January.\n\nThe launch dates in Maryland and Massachusetts remain unsaved at this time, but we expect both to launch during 2023, adding considerably to our market opportunity in North America. We will continue to focus on potential market developments elsewhere such as the California ballot initiative to legalize sports betting. And we continue to expect a broad-based expansion of online gambling in the United States with the remaining states without sports betting embracing regulation, states which have regulated retail sports betting considering online, and states that have online sports betting considering iGaming. Our strength in performance marketing offers online gaming operators high ROI and a path to long-term profitability.\n\nGoing forward, we expect online gaming operators to continue to invest in the performance marketing channel as they have always done, given the transparent return and low risk the channel provides. I will end by once again thanking the brilliant Gambling.com team for their exemplary efforts in delivering yet another strong quarter. With that, we'd be very happy to take a few questions.\n\nOperator\n\n[Operator instructions] Our first question is from David Katz with Jefferies. Please proceed with your question.\n\nDavid Katz -- Jefferies -- Analyst\n\nHi. Good afternoon, everyone, or good day, everyone, depending on where we're sitting. The question we wanted to pose is, we had made a note around the portion of 2Q revenue relative to the full year likely being about 18% to 20%, which implies kind of a higher full year revenue based on what you just reported. And we're wondering the degree to which you might be going at this a little bit conservatively.\n\nElias, I know you made a couple of comments about what the guidance assumes and candidly, I didn't catch all of them, so could you just revisit that matter about the rest of the year and the revenue and the revenue guide and help us unpack all that?\n\nElias Mark -- Chief Financial Officer\n\nYeah. I guess, it's a mix of headwinds and tailwinds, all of which leads us to reiterate our guidance. So we definitely have headwinds in terms of currency. And we've seen continued weakness in the euro in July and August.\n\nBut, we are well positioned for the second half of the year with our sports products. We look forward to the Kansas market opening. I think in Q2, we saw strong trading in our casino business, both in North America and in UK and Ireland, which would be why results came in slightly above your expectations. I think looking forward, we're positive about the second half of the year, but we're cautious about having to make up the loss revenue from the currency headwinds.\n\nOn balance, we're reiterating our guidance.\n\nDavid Katz -- Jefferies -- Analyst\n\nWould you consider that to be the largest kind of impact or headwind is the currency?\n\nElias Mark -- Chief Financial Officer\n\nYeah, I would say so. As you know and as I touched upon as well, we had initially expected Ohio to launch in September, it's now confirmed for January. But that's no new news at this stage. That was communicated, when we presented last quarter.\n\nDavid Katz -- Jefferies -- Analyst\n\nRight. One more, if I may quickly. We hear so many different perspectives and/or guesses about California. I'd love to hear, I'm sure everyone would benefit from hearing yours, and whether it passes and what form?\n\nCharles Gillespie -- Co-Founder and Chief Executive Officer\n\nWell, we are digital marketers, not pollsters or campaigners for ballot initiatives. But clearly, it's the most expensive ballot initiative ever. I think what we have going against us is the fact that there's two competing proposals, statistically speaking, that makes it harder to get either one of them through. But I'm definitely hopeful that logic and sense will prevail here.\n\nThe appeal of online sports betting is pretty clear. It's not a bad thing for the consumer. A lot of people in California like sports, so we're doing our little bit to get the word out with BetCalifornia.com and we'll be watching very, very closely in November. But I don't have, unfortunately, any inside track on it, David.\n\nDavid Katz -- Jefferies -- Analyst\n\nYeah. No, your guess is everybody -- as good as anybody's else's I would assume. Thanks very much.\n\nOperator\n\nOur next question is from Barry Jonas with Truist Securities. Please proceed with your question.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nHey, guys. Just had a couple. I noticed you recently filed a shelf. Wondering if there's any color you could provide on your intent there.\n\nCharles Gillespie -- Co-Founder and Chief Executive Officer\n\nYeah. No problem. We did. The reason we filed it when we did was purely a function of the one year anniversary of the IPO.\n\nWe couldn't do it until then. And the rationale behind doing it was simply to give ourselves maximum optionality, in the event that we need to raise some additional resources for M&A. We continue to evaluate constantly all of the opportunities that we find interesting and also prioritize those opportunities to make sure we're spending time on the ones that are most interesting. And having this shelf in place will potentially be very useful, if one of the larger transactions were to actually get serious.\n\nBut at this stage, there's nothing immediate, there's no specific plans. It's truly there forward optionality in the future.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nGot it. And I think we're all excited about the potential in the US, but I was curious to get maybe some more thoughts on Europe. Some competitors have noted challenges across Europe and some are even exploring strategic opportunities there. So with that, can you maybe talk about A, your overall view, broadly speaking across Europe, and if you're evaluating any M&A there?\n\nCharles Gillespie -- Co-Founder and Chief Executive Officer\n\nWe still have a preference for US M&A, but we wouldn't be doing our job if we didn't also consider the attractive European M&A targets that are out there. If you look at us and some of our peers and you compare those businesses in Europe, we're not -- Europe's a big place. We're not all in the same markets. We have a pretty healthy business, a big business in the UK and Ireland, and a lot of our peers have -- their European businesses are frankly elsewhere, so what drives our results is really -- in Europe is really UK and Ireland, and we wanted to put into script today that from our perspective, everything's great.\n\nYou see these headlines and you definitely start to wonder is the consumer going to come under pressure in Europe with energy prices and cost of living and everything else. But we haven't seen it yet. But, of course, we're eyes wide open, like everyone else.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nAnd if I could sneak in one more, I think it's clear, many operators feeling pressure to hit profitability. I think you guys make a strong case how the affiliate model is more helpful than hurtful there, but I'm curious if you're seeing any pressure on CAC economics or really anything where the operators are sort of trying to impact your economics?\n\nCharles Gillespie -- Co-Founder and Chief Executive Officer\n\nHonestly, Barry, it's the opposite. Now, that we've got a thriving business in the United States with real momentum, we can have pushier conversations with our clients about what we want to charge them per NDC. That scale is very important from a pricing perspective. If you're an operator and you can go to affiliate A and buy a 100 players, you go to affiliate B and buy 10,000 players, it's the same amount of work, and you're going to get affiliate C and buy more players.\n\nNaturally, they themselves prioritize affiliates that have the traffic, and increasingly that -- we are part of that conversation.\n\nElias Mark -- Chief Financial Officer\n\nAnd the affiliate channel itself tends to increase because we provide more or less guaranteed ROI. So if you go to spend on customer acquisition -- the most efficient way of doing so, and it's guaranteed to make money.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nThat's extremely helpful. All right. Thanks so much, guys. Appreciate it.\n\nOperator\n\nOur next question is from Jeff Stantial with Stifel. Please proceed with your question.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nHey, afternoon, guys. Thanks for taking the questions and congrats on a nice quarter here. I wanted to start and follow up on one of Barry's questions and some of your prepared remarks at the end, Charles, specifically on M&A. Just curious, like, are you seeing interesting assets being marketed out there for sale right now? And as a follow-up, are you starting to see the sell-off in public equities and in the online gambling sector begin to impact private market valuations and asking prices? Just curious your thoughts there.\n\nThanks.\n\nCharles Gillespie -- Co-Founder and Chief Executive Officer\n\nIn terms of the smaller targets out there, which are obviously private and completely disconnected from the public markets, there is a bit of education involved to explain to them that these companies that might have bought them were now trading on very different valuations than they were six months ago. And I think that process is well underway in terms of the kind of private companies come to terms with the new climate. In terms of other opportunities, it's complicated. People have listings in different countries and that drives different -- what influences share prices in one place may not have the same effect in different places.\n\nAnd there is a lot of affiliate assets out there and I think there is a lot of people willing to have discussions. But we are going to be very, very cautious and make absolutely sure that the next deal is good at the last two that we've done, which we think were fantastic.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nGreat. That's helpful. Thank you. And then, for my follow-up, I appreciate the comments earlier.\n\nI wanted to kind of drill in and take your pulse further on the sentiment around iGaming legislation. At the moment, there are a handful of states entertaining the notion of adding iGaming, but just curious to hear your perspective on potential expansion in the near to longer-term future. And if it feels like overall that there is appetite from policymakers for iGaming kind of the way we've seen with sports betting? Thanks.\n\nCharles Gillespie -- Co-Founder and Chief Executive Officer\n\nYeah. I mean, it is a bigger app, but Illinois and Indiana are going to have a serious think about it next year. There is chatter coming out of New York that they might consider it as well. Of course, that would be a total game changer if New York came online for only casino.\n\nThe comments today on the call were not meant to be directed at any specific state. But with a potential recession, with states under pressure on their budgets, it's just such a logical and straightforward way to boost state tax revenue. And if state's already gotten comfortable with online sports betting, it's not that big of a leap to add on iGaming. So we having watched this industry grow from nothing 20 years ago to being regulated in virtually every single European country, that path of regulation is hardwired into our brands.\n\nAnd that's how we look at the world and we don't think the US will be any different. Clearly, it's a little slower, but we'll get there. There will be more states with iGaming and it will be at scale a very important, huge part of the overall market.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nGreat. That's helpful. Thank you, both.\n\nOperator\n\nThank you. There are no further questions at this time. I'd like to hand the floor back over to Charles for any closing comments.\n\nCharles Gillespie -- Co-Founder and Chief Executive Officer\n\nThank you again to everyone for joining us today. We appreciate your support and interest in Gambling.com Group. We've had the strongest first six months through year in the group's history, and we expect more of the same solid performance in the second half of the year. We look forward to updating everyone again, when we report Q3 results in November.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPeter McGough -- Investor Relations\n\nCharles Gillespie -- Co-Founder and Chief Executive Officer\n\nElias Mark -- Chief Financial Officer\n\nDavid Katz -- Jefferies -- Analyst\n\nBarry Jonas -- Truist Securities -- Analyst\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nMore GAMB analysis\n\nAll earnings call transcripts"
}