{
  "companyName": "LifeStance Health Group, Inc.",
  "companyTicker": "LFST",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/lifestance-health-group-inc-lfst-q2-2022-earnings/",
  "content": "LifeStance Health Group, Inc. (LFST 5.56%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Lauren, and I will be your operator for today. At this time, I would like to welcome everyone to the LifeStance Health second quarter 2022 earnings call. [Operator instructions] I would now like to turn the call over to Monica Prokocki, vice president of investor relations.\n\nYou may begin your conference.\n\nMonica Prokocki -- Vice President, Investor Relations\n\nThank you. Good afternoon, everyone, and welcome to LifeStance Health's second quarter 2022 earnings conference call. I'm Monica Prokocki, vice president of investor relations. Joining me today are Mike Lester, chief executive officer; Danish Qureshi, chief operating officer; and Mike Bruff, chief financial officer.\n\nWe issued the earnings release and presentation after the market closed today. Both are available on the investor relations section of our website, investor.lifestance.com. In addition, a replay of this conference call will be available following the call. Before turning the call over to management for their prepared remarks, please direct your attention to the disclaimers about forward-looking statements included in the earnings press release and SEC filings.\n\nToday's remarks contain forward-looking statements, including statements about our financial performance outlook. Those statements involve risks, uncertainties and other factors, including the possible future impact of the COVID-19 pandemic on our business that could cause actual results to differ materially. In addition, please note that we report results using non-GAAP financial measures, which we believe provide additional information for investors to help facilitate comparison of prior and past performance. A reconciliation to the most directly comparable GAAP measures is included in the earnings press release tables and presentation appendix.\n\nUnless otherwise noted, all results are compared to the prior-year comparative period. At this time, I'll turn the call over to Mike Lester, CEO of LifeStance. Mike?\n\nMike Lester -- Chief Executive Officer\n\nThank you, Monica, and thanks to all of you for joining us today. To begin, I would like to emphasize the importance of our mission of improving access to trusted, affordable, and personalized mental healthcare. We are playing an integral role in the expansion of access to and delivery of personalized metal healthcare. In the rapidly changing U.S.\n\nhealthcare environment, we have demonstrated that we can provide solutions at scale to meet individual needs in person or via telehealth. Fundamentally, we serve patients where they are and when they need us. That is a key driver of our success and the continued expansion of demand we are seeing. LifeStance is committed to helping people lead healthier, more fulfilling lives as one of the country's largest outpatient providers of in-person and virtual mental healthcare.\n\nIn recent weeks, we've seen strong market validation of our hybrid business model through the acquisition of one of our primary care counterparts in the tech-enabled multisite provider space. This event highlighted the value and importance of innovative, patient-focused healthcare businesses to enhance the speed and efficacy of healthcare delivery relative to traditional providers while delivering a differentiated value proposition to payers, clinicians, and patients. The hybrid tech-enabled patient-focused model is at the heart of what we do at LifeStance in the behavioral health space and continues to resonate with the market. We often refer to LifeStance as primary care for your mind.\n\nWe are focused on building the company for the long term to deliver on our mission of providing access to affordable high-quality care through our hybrid delivery model. We are laser-focused on delivering the best care for our patients through a network of over 5,000 W-2 employed clinicians and the technology platform focused on providing clinicians and patients with a seamless experience. Innovative industry leaders and disruptors have recognized the fundamental value of our mission, our model, and our team. We are continuously engaged in discussions with potential business partners to expand access to high-quality mental health services, which is so critical now as our country faces a growing mental health crisis.\n\nThe need for access to mental healthcare has reached unprecedented levels as depression and anxiety have increased by fourfold in the last two years. In every 11 minutes, an American dies by suicide. We focus on our mission every day to meet the patient demand in the marketplace and to provide desperately needed mental healthcare services to patients across the country. Turning to results.\n\nThis was a solid quarter for LifeStance. We continue to see strong demand for our services and consistent execution by the team, which was reflected in our results. Revenues for the second quarter was $210 million, representing growth of 31%. As we've noted previously, revenue growth is primarily driven by our total clinician growth.\n\nIn the second quarter, we grew our net clinician base to 5,226, representing growth of 31% compared with prior year and in line with our expectations. We continue to focus on balancing growth, profitability, and liquidity considerations. We aim to consistently generate the profitability necessary to fund our growth for the long term. In the second quarter, we grew center margin to $60 million or 28.5% of revenue, and adjusted EBITDA to $15 million or 7% of revenue, reflective of our focus on long-term margin expansion.\n\nOur remaining disciplined in scaling our cost, we will improve leverage and our operating expenses while continuing to make key investments in scalable infrastructure. Turning to the full year. We now expect 2022 revenue and center margin toward the bottom end of our previously guided range of $865 million to $885 million and $240 million to $255 million, respectively, due to removing slightly more than one business day from each June, July, and August as a result of the incremental clinician time off with no other changes to our guidance assumptions. Given pent-up demand for travel as pandemic restrictions relaxed, we found that clinicians took more time off in June relative to our planning expectations.\n\nWe believe this impacted revenue by approximately $4 million in the second quarter. As a result, we've decided to carry that seasonality assumption forward into July and August to account for additional summer vacations. We believe the impact of this adjustment represents approximately $8 million in the back half of the year. For 2022 adjusted EBITDA, we are reaffirming our original guidance range of $63 million to $67 million.\n\nWe continue to focus our planned investments to grow and optimize our clinician base while continuing to drive leverage in our operating costs. Turning to the recent COO transition. We announced in the second quarter that Gwen Booth retired from her role as chief operating officer here at LifeStance, and that Danish Qureshi, our chief growth officer, would succeed her in that role. First, I would like to thank Gwen who cofounded the company in 2017 with Danish and me and who served as our COO since then.\n\nGwen played an integral role in building our organization to what it is today. When Gwen retired from her position as the COO, I was delighted that she agreed to become the inaugural executive director of the LifeStance Health Foundation, which is focused on awarding grants and scholarships to nonprofit partners that improve mental health access for underrepresented groups. Danish was appointed as our next COO, effective July 1 and has already begun a nationwide review of our operations. Many of you know Danish, a founding member of LifeStance leadership team, who is highly qualified as we transition beyond the entrepreneurial growth stage to scale the company and optimize our overall operational and financial performance.\n\nDanish has an exceptional track record of translating differentiated strategy into strong operating results, and I'm confident in his leadership abilities to execute on our mission. We will be sharing some of his initial observations about the areas of opportunity in a few minutes. Danish is also playing a key role in updating our long-range strategic plan over the coming months. Turning to the foundation.\n\nThe LifeStance Health Foundation was established in 2021 to award grants and scholarships to our organizations that share LifeStance's vision to improve mental health access. In the second quarter, we granted an award to the Trevor project as part of our celebration of Pride Month in June as a matching donation for local team fundraising for the organization. The Trevor project is the world's largest suicide prevention and crisis intervention organization for LGBTQIA+ use. Also, through the foundation, we are working with the American Foundation for Suicide prevention to increase support for the new 988 crisis response line.\n\nIn closing, we have positive momentum in the marketplace, driven by a compelling patient value proposition, a steadily expanding clinician population, and solid execution of our business. I am confident in the long-term trajectory of the business, given our sustainable competitive advantages and the team that we have in place. Danish?\n\nDanish Qureshi -- Chief Operating Officer\n\nThank you, Mike. In my new role as COO, I've spend my first few weeks doing three things. First, meeting with our clinicians to learn how we can improve the support we provide to them. Second, meeting with our operations teams to identify areas of opportunity as we continue to grow in scale.\n\nAnd third, diving deeper into our operational data to understand key trends and use that information to better drive our business going forward. These activities have energized me around the immense opportunity we have in front of us, as well as reminding me of the critical role LifeStance plays as a leader in bringing mental health solutions to our patients nationwide. Let me first start by providing a quick update on our second quarter operating results, as well as our core planning assumptions for the back half of 2022. In the second quarter, we continued our intentional focus on deepening our presence in our existing 32 states.\n\nSo we will continue to selectively evaluate entry into new states in the back half of 2022 and currently anticipate one to two new state entries. We plan to focus the majority of our attention on building density in our existing markets to further enjoy the benefits of scale and begin driving operational leverage. As we've stated previously, clinicians remain our primary growth driver. In the second quarter, we grew our clinician base nationwide to 5,226, an increase of 237 net clinicians.\n\nImportantly, we achieved these results while continuing to shift our focus toward more organic growth. Year to date, over 70% of our gross clinician adds have been brought on board via our industry-leading recruiting engine, and we expect that mix to continue to shift more organic in the back half of the year. In terms of de novo, we opened 27 de novo centers in the second quarter to bolster our physical presence, bringing our total year to date to 68 and allowing us to pass a new milestone, over 600 centers operating nationwide. While we remain committed to opening additional de novo centers as part of our differentiated hybrid model, as previously communicated, we plan to moderate the pace of openings in the back half of 2022, with approximately 20 plans.\n\nImportantly, this has no impact on our ability to grow clinician counts and revenue. This operating flexibility is one of the key areas we will continue to look at as we balance growth, profitability, and liquidity going forward. In terms of M&A, we completed four new acquisitions in the second quarter, bringing the total since inception to 83. We remain on pace to deploy $50 million to $70 million of capital for the full year against our M&A activities, and we continue to have a robust pipeline of acquisition opportunities.\n\nAs for tech-enabled services, our digital team is working to enhance our platform on multiple fronts to develop the best end-to-end experience for patients, clinicians, and team members. We've now rolled out OBIE, our online booking and intake experience platform to nine states through the end of the second quarter and have seen a substantial improvement in cancellation rates of online bookings in those markets, driven in part by better patient and clinician matching. We remain on track to roll OBIE out across the country throughout 2022 and into early 2023 with five additional states already completed in July. Now let me take a moment to discuss the key areas of learnings I've had in my new role as COO over the past few weeks and how that's going to shape our go-forward action plans, as well as unlock future areas of opportunity.\n\nAs I met with our clinicians and operations team members, what's clear to me is that our teams have been focused on too many priorities, each competing for their attention. To address this, we are aligning our teams on a focused set of narrow priorities that can drive the highest impact on the business. First, net clinician growth, and second, clinician productivity. Both of these areas represent significant areas of additional upside opportunity as we look forward to 2023.\n\nIn terms of net clinicians, to accelerate the pace of growth, we are continuing to invest in our recruiting teams in the second half of 2022, which will give us organic hiring momentum going into 2023. This includes enhancing our teams with additional outbound focused resources to increase our pipeline of candidates, further enhancements to our inbound funnel, and more focus from our operations teams on time allocated to interviewing. Additionally, though retention has remained stabilized across the past year, we are investing in key areas of clinician satisfaction that we believe will drive incremental improvements to our retention numbers going into 2023. For example, our clinicians have made it clear that we have two acute areas they want us to address immediately.\n\nFirst, patient billing customer service, and second, frontline team staffing. We've already begun addressing both by building out a call center dedicated to patient billing customer care and redeploying our planned practice operations investments to the front lines, our front office coordinators and medical services teams. We believe that investing in the further acceleration of our organic recruiting and incremental improvements to our clinician retention both represent upside to our current pace of net clinician adds as we go into 2023. Turning to our second area of focus, clinician productivity.\n\nAs we all know, there is no lack of patient demand in the market for mental health services. However, we believe there's still further opportunity to incrementally improve the conversion rate through every part of LifeStance's patient funnel via greater operational discipline. To deliver on this, we're taking the following actions. First, at the top of the funnel, we are adding to our boots on the ground primary care referral team through a redeployment of planned investments toward this initiative, as well as focusing on enhancing our internal referrals between our clinicians to ensure patients have access to the full suite of specialist at LifeStance.\n\nSecond, at the middle of the funnel, we're leveraging the capabilities of our digital team to improve patient patient matching via OBIE, enhance our overall provider profile systems to create a better user experience, and reduce the complexity of our scheduling system to open up in capacity. Additionally, our operations teams are focused on enhancing our own intake customer care teams and reducing our credentialing time lines to drive better conversions and faster ramps. Finally, at the bottom of the funnel, we have seen that our patient cancellation and no-show rates are running at approximately 15%. So this number has been consistent for the past two years.\n\nWe believe there is an opportunity to improve these rates further via digital enhancements to appointment reminders and the patient rebooking experience and improved customer service and operational performance by our front office teams, with early signs of cancellation and no show rate improvements in states where we're piloting action plans. All of these top, middle, and bottom funnel areas represent further upside to clinician productivity as we look to the future, and we believe will give us strong momentum going into 2023. With an enhanced focus on operational excellence, targeted at key areas of incremental opportunity, I am now more than ever excited about the future of our business. We will remain disciplined on our approach to driving improvements to our existing processes, as well as accelerating growth in net clinician adds and productivity.\n\nI'm looking forward to providing updates in future quarters about the progress we make against these initiatives. With that, I'll turn it over to Mike Bruff. Mike?\n\nMike Bruff -- Chief Financial Officer\n\nThanks, Danish. As usual, I will frame my comments in the context of our long-term strategy, which includes balancing growth, profitability, and liquidity considerations. In terms of growth, the company delivered solid growth in the second quarter with revenue of $210 million, up 31% year over year, driven by growth in our clinician base. Turning to profitability.\n\nIn the second quarter, center margin of $60 million increased 17% over the same period last year, driven by revenue growth. Sequentially, center margin as a percentage of revenue expanded 187 basis points, primarily driven by timing of payroll taxes in the first quarter and expected operational expansion in the second quarter. Adjusted EBITDA grew slightly year over year at $15 million or 7% of revenue. Sequentially, adjusted EBITDA as a percentage of revenue improved 84 basis points, driven by the improvement in center margin and continued operating expense discipline.\n\nTurning to liquidity. LifeStance continues to be supported by a solid balance sheet. We exited the quarter with cash of $97 million and net long-term debt of $203 million. In the second quarter, we generated positive $8 million of cash from operations compared with $3 million in the first quarter.\n\nOur free cash flow of negative $18 million improved by approximately $7 million quarter over quarter. We expect to continue to improve free cash flow in the back half of the year. Operationally, we are continuing with planned investments to improve our days sales outstanding, which slightly increased by one day quarter over quarter. After transitioning the revenue cycle management team to report to me at the end of the first quarter, we hired a seasoned chief revenue officer with a track record of delivering results in a scaling company.\n\nOur priorities include improving our billing and collections performance through scaling the team appropriately and driving productivity enhancements through process efficiency, technology, and automation. With cash on the balance sheet, access to our new credit facility, our focus on capital efficiency and the underlying unit economics of the hybrid model, we feel that we are in a strong position to drive the long-term growth and value creation of the company. Turning to guidance. Mike has already covered the full year.\n\nAs for the third quarter, we expect revenue of $216 million to $221 million, center margin of $61 million to $65 million, and adjusted EBITDA of $16 million to $19 million. With that, I'll turn it back to Mike Lester for a few words before going to Q&A.\n\nMike Lester -- Chief Executive Officer\n\nThanks, Mike. I would like to recognize the continued efforts of our approximately 7,000 colleagues who remain focused on delivering high-quality, affordable, and accessible mental healthcare to our patients across the country. Their unwavering dedication and support inspire all of us. On behalf of the team, I would like to extend my gratitude for all they do as well.\n\nI'm proud of what we have achieved as a company to date, but there is so much more opportunity in front of us. Mike, Danish and I will now take your questions. Lauren?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Craig Hettenbach with Morgan Stanley.\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nCan you provide an update on clinician retention and any changes you're seeing on the wage inflation front?\n\nDanish Qureshi -- Chief Operating Officer\n\nSo on the retention front, we continue to maintain our prior planning assumptions for retention through year-end, which is 80% quarterly -- excuse me, 80% annualized within the quarter. And that's been consistent in the first half of the year as well.\n\nMike Lester -- Chief Executive Officer\n\nAnd wage inflation, Danish?\n\nDanish Qureshi -- Chief Operating Officer\n\nSorry. On the wage inflation front, we're not seeing anything unusual on the wage inflation side. Our clinicians have always remained in high demand, and we've always planned to appropriately compensate them in line with the competitiveness of the market and all the wage inflation that we've witnessed stays within our existing guidance assumptions.\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nAnd if I could follow up, Danish. When I think about the long-range planning that you're embarking on, certainly, there's been a lot of cross currents in the market in the backdrop for the last couple of years. So at a high level, anything you're thinking about in terms of how that might change the mid- to longer-term trajectory of the business or margin profile?\n\nDanish Qureshi -- Chief Operating Officer\n\nRight now, I'm heads down on making sure that we put in place the action plans that we need to start to position us for the long-term growth that we see in front of us. What I know is that we are right now putting our attention against all the right action plans. So again, as you think back to my remarks here a minute ago, we are very focused on net clinician adds, impacting that through our organic recruiting team, continuing to shift that more organic, as well as getting under retention and controlling what we can control outside of any market dynamics, and then further driving clinician productivity. At this point, I think it's all a question of timing and the ultimate effectiveness of those actions, but we've got our focus on the right areas.\n\nOperator\n\nWe'll take our next question from Lisa Gill with J.P. Morgan.\n\nLisa Gill -- J.P. Morgan -- Analyst\n\nReally, I just want to go back to your comments around removing one business day for June, July, and August. And just really understand how you're thinking about the fourth quarter. I remember when we talked last January, things were a little bit slower in December because the people taking vacation around the holidays, etc. So one, I just want to confirm that you've accounted for that in the full year and have something there in the fourth quarter? And then, secondly, as we think about the clinicians, I think one of the other issues we've talked about historically is the fact that they like working virtually.\n\nSo I was wondering if you could maybe talk about some of the new clinicians you're bringing on? Are they center focused? And then, if you could just give us an update on virtual versus in person.\n\nDanish Qureshi -- Chief Operating Officer\n\nSo in terms of Q4 seasonality, yes, we witnessed that last year. We've carried forward those assumptions in Q4 for this year. And we believe that we have appropriately accounted for any winter or holiday time off in Q4. So again, feeling pretty good and confident about where we're at with those assumptions in terms of our new clinician adds, as well as where our existing clinicians are looking to focus their time.\n\nIf you look at our actual visits, meaning online versus in person are taking place right now, the visits still remain at about 80% online. However, when you look at our clinicians, they are shifting more of their time back into the office. And so, a clinician may be working out of an office. But throughout the day, some of those visits are going to be in person, some of them are going to be online even if the clinician is based out of the office.\n\nSo we are starting to see that trend back. But overall, the total mix of where the actual appointments are delivered or where the actual care is being delivered, it still remains heavily online. And I think that is why we continue to moderate the number of de novo openings to make sure that we drive that additional operational flexibility.\n\nLisa Gill -- J.P. Morgan -- Analyst\n\nAnd if I could just understand one other thing, like does that have any impact on the margin? So I know you talked about patient billing and frontline office. So if people are doing more things online, does that mean that you have less people at the front of your facility and therefore, you have less costs? Or is that more of an opportunity as you bring more people into the office to leverage some of those costs? Like how do I think about that going forward?\n\nDanish Qureshi -- Chief Operating Officer\n\nSo on a go-forward basis, the right way to think about it is that we will continue to have kind of a positive effect on our capital deployment because we do not have the need to open up as many de novos as we used to, where we may have -- historically, we built de novos to make sure there is one exam room for every clinician. Now we can expand the four walls of our physical sites by sharing office space and, again, getting more leverage out of that. So you'll see some positive effects over the long term around capital deployment against de novos. The other piece will be, again, over the long term, you should see some improvements in center margin related to better leveraging, both rent and some of the frontline support that would otherwise -- is only required for in-person visits.\n\nOperator\n\nWe'll take our next question from Stephanie Schiller Wissink with Jefferies.\n\nStephanie Schiller Wissink -- Jefferies -- Analyst\n\nWanted to follow up on your comments on productivity per clinician. If you could talk a little bit about some of the strategies you're putting in place, whether it's using technology or eliminating some of the administrative burden, accelerating some of the processing and billing? Anything you can share with us on productivity would be great.\n\nDanish Qureshi -- Chief Operating Officer\n\nSo really, the way that we think about clinician productivity is around how can we ensure that the capacity they're giving us, meaning the time that they are providing to us to see patients, is fully utilized. We are not right now going to our clinicians and asking them to give us more time, but focus very narrowly on ensuring the time they've already given us is filled to the fix capacity, which ensures that they are happy with their workload, they continue to maintain flexibility, and we're able to drive both their incomes to the levels that they're hoping to achieve, as well as drive revenue for the company. As we look to how to impact that above and beyond what we have historically done, we're really taking actions across what I characterize as the top, middle, and bottom of the funnel. And so, at the top of the funnel, it's all around additional boots on the ground marketing efforts to ensure that we shore up and continue to grow our primary referral source, which are primary care physicians, as well as local hospital systems and other community referrals.\n\nAt the middle of the funnel, we are continuing to invest on the digital side to make sure that we take advantage of all the tech-enabled services that we have at our fingertips, primarily through our online booking experience, which we term internally as OBIE, further investments in our clinician profiles to improve the overall experience for both patients and ultimate matching for the clinicians, and improvements on our credentialing and phone intake systems. And then, the bottom of the funnel, that's all about cancellation and no show rates and ensuring that when you have an appointment booked on the calendar that is taking up time that those patients actually come through and eventually convert into a visit. And so, we believe that there is significant opportunity in unlocking that and taking that number from the 15% it is today to kind of more of a best-in-class number, and we've already seen some improvements in the pilot states where we're taking action.\n\nOperator\n\nOur next question comes from Ryan Daniels with William Blair.\n\nJack Senft -- William Blair -- Analyst\n\nThis is Jack Senft on for Ryan Daniels. Just to start off. So you added 237 clinicians during the quarter, which is up modestly compared to the number of clinician adds in the first quarter of this year. But it doesn't seem to be quite the 400 clinicians you added -- or it doesn't seem to be quite the 400 clinician adds you saw at the end of last year in the third and fourth quarter.\n\nSo just curious here how we should kind of think about the cadence of clinician adds for the second half of the year, if you can comment? And then, for the second part here, are you finding that you have to change your recruiting and retention strategy as a result of the increased competition seen in the market? Or maybe are you finding that you're a safe haven for clinicians. Just kind of curious how that may impact recruitment for clinicians.\n\nDanish Qureshi -- Chief Operating Officer\n\nSo in terms of the first part of your question, we don't guide on specific clinician count, but we do expect to continue our strong growth of the clinician base. We have made investments in the first half of the year around our organic recruiting team that we believe will allow for continued incremental improvement in the number of net clinician adds sequentially as you look through the remainder of the year. And as I mentioned in the prepared remarks, net clinician adds is the top priority that all of our teams are focused on, whether that is the actual organic recruiting side of it or looking at areas where we can incrementally improve retention. So feeling really good about where we're at and the trajectory here for the back half of the year going into 2023.\n\nIn terms of the second part of your question around are we seeing any changes in either retention or the ability to recruit based on competitiveness of the market, we're really not. The market from the very beginning has been competitive. There -- our clinician type has always been in short supply as compared with the patient demand that exists in the marketplace. And so, this isn't a new dynamic for us.\n\nAnd we have built both a best-in-class recruiting engine, as well as a best-in-class M&A team that's able to bring on board new clinicians at the pace that we planned for, and we see no risk there. Same with the retention. Our retention rates have remained stabilized for the past year. And we haven't seen any impact as it relates specifically to competition.\n\nAnd again, if you think back to my prepared remarks, this is one of the key areas that we'll be focused on to see are there ways to incrementally improve retention beyond what we've seen here for the last year.\n\nJack Senft -- William Blair -- Analyst\n\nJust as a quick follow-up then, when it comes to the one to two new states in the second half of the year, will OBIE be rolled out automatically in these new states? Or is this something that will be implemented over time in these states? And then, two, if this is rolled out in the new states, do you see an immediate reduction in cancellations? Or does it take some time for the clinicians, patients, new users to get used to the new implementation?\n\nDanish Qureshi -- Chief Operating Officer\n\nSo when we enter a new state, we enter through an acquisition. Though any acquisition regardless of whether it's a new state or an existing state goes through an integration period of typically 120 days, during which we move them over to our systems. And that then includes our electronic medical record or HRIS, etc. So there's not an immediate change over to our systems or does -- there is that period of approximately four months where you see that.\n\nThe question specifically around OBIE and whether we would flip new state entries directly on to OBIE or not, I don't think we've decided that. We are, right now, have our work plan around rolling that out to all of our existing states and our existing groups through the end of 2022 into 2023. But we'll need to make a decision depending on the timing of any additional states where we prioritize that in the overall plan to move people. If you fast forward beyond 2023 once all of our existing states are already on to OBIE, then yes, the answer would be everyone within those four months would flip to utilizing OBIE.\n\nMike Lester -- Chief Executive Officer\n\nDo we see an immediate impact?\n\nDanish Qureshi -- Chief Operating Officer\n\nYes. When we -- I mean, in general, when we move over to our systems, we do see an impact to productivity. We also see an impact on synergies related to rates that kind of flow through at the end of that integration, again kind of that four-month time period.\n\nOperator\n\nWe'll take our next question from Kevin Caliendo with UBS.\n\nKevin Caliendo -- UBS -- Analyst\n\nI have two. The second half guidance does imply a little bit better EBITDA margin just given the revenue guidance and the sustained EBITDA guidance. Is that something we should expect going forward? Was there any flex spending there that you had that maybe prompted this? Is this the impact of Danish already in the role and finding savings? That's my first question as to how to think about that. And then, the second one is, it doesn't sound like it, but have you seen any impact yet on demand for behavioral from the economy? I know most of your customers are fully insured, and so the out-of-pocket might not be that meaningful.\n\nJust wondering if you're seeing anything at all, whether it's in certain geographies or demographics or even in your cash pay, if you're seeing any demand impact from inflation in the broader macro economy.\n\nDanish Qureshi -- Chief Operating Officer\n\nCan you take the first one, I'll take the second?\n\nMike Bruff -- Chief Financial Officer\n\nFrom an adjusted EBITDA perspective, it has been part of our guidance assumptions for this year to improve adjusted EBITDA through the year. Our strategy around that has been to moderate de novos and their openings in the back half of the year, which we're doing. And then, from a G&A perspective, just be very disciplined around our deployment of G&A around the critical few priorities that Danish spoke about in his prepared remarks. I will say that we're starting to find some efficiency in the G&A that we were deploying last year.\n\nSo that's playing out in the P&L as well. But there's nothing that we're doing unnaturally in G&A to drive adjusted EBITDA. This is really around operational discipline and investing in the right areas.\n\nDanish Qureshi -- Chief Operating Officer\n\nThe one comment I'll add there is, from a head space perspective, that is exactly how we're looking at driving the business going forward, meaning that continuous incremental EBITDA margin expansion over time is an underlying principle that will continue to be part of kind of the LifeStance story here going forward.\n\nMike Lester -- Chief Executive Officer\n\nAs far as patient demand, we haven't seen any decrease whatsoever in patient demand. I mean, it continues -- the demand continues to far outstrip the supply. As you know, we're essentially a commercial insured network model. So we don't really see cash pay.\n\nSo that really hasn't affected us at all. But the demand, the mental health crisis continues to be exacerbated, and we just see a continued strong patient demand.\n\nOperator\n\nAnd we'll take our final question from Jamie Perse with Goldman Sachs.\n\nJamie Perse -- Goldman Sachs -- Analyst\n\nJust I wanted to go back to the comments on focusing on productivity. We've seen that go from $44,000 to $45,000 range to $41,000 per quarter per clinician over the last year. As you annualize some of the retention headwinds and implement this new focus on productivity, is that a level you think you can get back to and when?\n\nDanish Qureshi -- Chief Operating Officer\n\nSo we're not going to guide on productivity because there's a lot of different variables that can drive revenue per average clinician, for example, the timing of M&A or geo mix, the number of business days in any given period. As an example, the second half of 2022 has several fewer business days than in the first half, driven by summer vacations in the Q4 holiday season. So what I can tell you is that we are focused on the right areas, head down on driving and improving clinician productivity and making sure that we are filling out their open time where they want to see patients. So right now, it's purely a question of how much of an impact those action plans have and the timing that they take effect.\n\nBut again, we're right now heads down focused on the right things.\n\nJamie Perse -- Goldman Sachs -- Analyst\n\nOK. And then, just on center-level costs, they were sequentially pretty flat in the quarter. [Inaudible] seems to be modeling a big step-up in 3Q and 4Q there. Maybe just some perspectives on what that trend might look like, particularly as you slow the de novo ramp in the second half.\n\nMike Lester -- Chief Executive Officer\n\nYes. I think, from a center cost perspective, we do expect those costs -- the rate of increase in those costs to decline as we moderate the de novo centers openings in the third and fourth quarter. The overall cost will continue to increase as we bring on clinicians, but that will be offset by the revenue that they bring in as well. So all told here, we expect to drive improvement in center margin in the back half of the year as we expected to early in the year, our plan remains intact and in motion.\n\nThe only mild effect will be the impact of the $8 million in the second half on revenue. But from a cost perspective, Jamie, yes, we would expect to slow the rate of increase.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMonica Prokocki -- Vice President, Investor Relations\n\nMike Lester -- Chief Executive Officer\n\nDanish Qureshi -- Chief Operating Officer\n\nMike Bruff -- Chief Financial Officer\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nLisa Gill -- J.P. Morgan -- Analyst\n\nStephanie Schiller Wissink -- Jefferies -- Analyst\n\nJack Senft -- William Blair -- Analyst\n\nKevin Caliendo -- UBS -- Analyst\n\nJamie Perse -- Goldman Sachs -- Analyst\n\nMore LFST analysis\n\nAll earnings call transcripts"
}