{
  "companyName": "Dollar General",
  "companyTicker": "DG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/dollar-general-dg-q3-2022-earnings-call-transcript/",
  "content": "Dollar General (DG -0.49%)\nQ3 2022 Earnings Call\nDec 01, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning. My name is Robert, and I'll be your conference operator today. At this time, I'd like to welcome everyone to the Dollar General third quarter 2023 earnings call. Today is Thursday, December 1, 2022, [Operator instructions] This call is being recorded.\n\nInstructions for listening to the replay of the call are available in the company's earnings press release issued this morning. Now, I'd like to turn the conference over to Mr. Kevin Walker, vice president of investor relations. Kevin, you may now start your conference.\n\nKevin Walker -- Vice President, Investor Relations\n\nThank you, and good morning, everyone. On the call with me today are Jeff Owen, our CEO; and John Garratt, our CFO. Our earnings release issued today can be found on our website at investor.dollargeneral.com, under news and events. Let me caution you that today's comments include forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, such as statements about our financial guidance, strategy, initiatives, plans, goals, priorities, opportunities, investments, expectations, or beliefs about future matters and other statements that are not limited to historical fact.\n\nThese statements are subject to risks and uncertainties that could cause actual results to differ materially from our expectations and projections. These factors include, but are not limited to, those identified in our earnings release issued this morning, under Risk Factors in our 2021 Form 10-K filed on March 18, 2022, and any later filed periodic report, and in the comments that are made on this call. You should not unduly rely on forward-looking statements, which speak only as of today's date. Dollar General disclaims any obligation to update or revise any information discussed in this call unless required by law.\n\nAt the end of our prepared remarks, we will open the call up for your questions. Please limit your questions to one and one follow-up question if necessary. Now, it is my pleasure to turn the call over to Jeff.\n\nJeff Owen -- Chief Executive Officer\n\nThank you, Kevin, and welcome to everyone joining our call. I want to begin by thanking our entire team for their ongoing commitment to serving our customers, communities, and each other. The quarter was highlighted by strong performance on the top line, led by comp sales growth of 6.8% and included increases in traffic and in market share of both consumable and nonconsumable product sales. During the quarter, we experienced significantly higher-than-anticipated cost pressures, including challenges within our internal supply chain, sales mix pressures, and higher inventory damages and shrink, all of which impacted gross margin.\n\nWe will elaborate more on these cost pressures in a bit. But despite these challenges, we delivered a double-digit increase in diluted earnings per share, along with strong same-store sales growth. As the economic environment continued to evolve during the quarter, we remain focused on serving the needs of our core customer. We continue to see customer behaviors in Q3 that we believe indicate they are feeling increased financial pressure, including reductions in the number of items purchased per basket and in discretionary spending, which was softer than anticipated during the quarter.\n\nCustomers also continued to shift spending to more affordable options, such as items that are dollar price point and private brands, while also shopping closer to payday at the first of the month. Importantly, we are growing more productive with our core customer, as well as seeing an increase in customers with annual household incomes up to $100,000. This growth underscores our belief that our value and convenience proposition resonates with a broad spectrum of customers and will continue to be important to all customers in this challenging economic environment. In turn, we remain focused on delivering value and convenience and continue to feel good about our pricing position relative to competitors and other classes of trade.\n\nFurther, we remain committed to offering products at the $1 price point, and we're pleased with the strong comp sales performance of these products during Q3, as they collectively outperformed the chain average. With nearly 19,000 stores, located within five miles of about 75% of the U.S. population, we believe we are well-positioned to support our customers even in a challenging economic environment. We're building on this foundation, I'm excited to share our real estate growth plans for next year.\n\nIn fiscal 2023, we plan to execute approximately 3,170 projects in the United States including 1,050 new store openings as we continue to lay and strengthen the foundation for future growth. I'll share more details on these plans in just a few minutes, along with an update on our plans for our supply chain as we continue to support our significant growth. But first, let me recap some additional financial results for the third quarter. Our strong comp sales performance helped drive a net sales increase of 11.1% to $9.5 billion.\n\nFrom a monthly cadence perspective, the comp sales momentum we saw building in Q2 continued into all three months of Q3, with September being our strongest month of performance. And I'm pleased to note that Q4 sales are off to a strong start as well. Our Q3 comp sales were primarily driven by an increase in average transaction amount, largely driven by inflation. And as we would expect during a more challenging economic environment, average units per basket were down.\n\nAs I mentioned earlier, we were excited to see a second consecutive quarter of increasing customer traffic contribute to the growth. With regards to the supply chain cost pressures I mentioned earlier, I want to touch on what happened and the actions we have taken to address these challenges. As a reminder, since the early days of the pandemic over two years ago, we have seen demand and sales grow at a robust pace. In addition, the overall mix of products we are shipping has evolved significantly with the growth of our nonconsumable initiative in pOpshelf.\n\nAs our distribution needs grew and evolved, we strategically designed permanent warehouse capacity solutions to support our growth. We plan for them to be operational starting in the back half of this year while making greater use of temporary storage facilities in the near term. However, as we move through Q3, we experienced unexpected delays in opening additional temporary storage facilities, primarily due to external challenges such as permitting. At the same time, seasonal goods came in earlier than anticipated.\n\nThe resulting constraints from these factors led to more than $40 million and additional supply chain costs in Q3 compared to what we had previously expected. These costs included retention fees incurred for delays in returning shipping containers. Costs associated with inefficiencies in moving freight within our distribution centers and higher transportation costs as a result of servicing stores from less-than-optimal distribution center alignments. While these issues have resulted in a gross margin headwind in the back half of this year, the team has worked hard to move past these delays with the opening of additional storage and warehouse facilities, which have already begun to relieve some of the capacity pressures.\n\nIn fact, within the past few weeks, we increased capacity by more than 2 million square feet with the opening of two new permanent regional distribution hubs in Georgia and Texas, which will serve as intermediary facilities between import points and the rest of our distribution centers. With the opening of both the temporary and permanent facilities, we believe we are well-positioned to drive continued improvement as we move ahead, as we better optimize store alignment with distribution centers, lower capacity utilization within our existing footprint, and improve the overall flow of goods. Of note, these regional hubs will be followed by the opening of our new combination distribution center in Nebraska, which is scheduled to begin shipping by the end of this fiscal year. In addition, our previously announced facilities in Arkansas, Colorado, and Oregon are expected to come online over the next 18 months.\n\nCollectively, all of these new distribution centers will ultimately result in a more than 20% increase in total capacity and position us well to support continued growth in the years to come. Overall, while internal supply chain challenges have impacted our EPS outlook for 2022, we believe the significant growth in demand that contributed to these challenges is a testament to the growing relevance of Dollar General. And we are confident in our plans to support this growth going forward. Looking ahead, we remain focused on advancing our operating priorities and strategic initiatives from a position of strength, as we continue to distance and differentiate Dollar General from the rest of the retail landscape.\n\nWe continue to operate in one of the most attractive sectors in retail. And as a mature retailer in growth mode, our transformational strategic actions have positioned us well for continued success, while supporting long-term shareholder value creation. With that, I will turn the call over to John.\n\nJohn Garratt -- Chief Financial Officer\n\nThank you, Jeff, and good morning, everyone. Now that Jeff has taken you through a few highlights of the quarter, let me take you through some of its important financial details, beginning with gross profit. Unless we specifically note otherwise, all comparisons are year over year, all references to EPS refer to diluted earnings per share and all years noted refer to the corresponding fiscal year. For Q3, gross profit as a percentage of sales was 30.5%, a decrease of 27 basis points.\n\nThis decrease was primarily attributable to a higher LIFO provision, a greater proportion of sales coming from the consumable category, as well as increases in distribution costs, markdowns, inventory shrink, and damages partially offset by higher inventory markups. Of note, product cost inflation was greater than anticipated, resulting in a LIFO provision of approximately $148 million during the quarter. And while we believe cost increases are beginning to moderate, we anticipate LIFO will continue to pressure Q4 as well. SG&A as a percentage of sales was 22.7%, a decrease of 23 basis points.\n\nThis decrease was driven by expenses that were lower as a percentage of sales, the most significant of which were retail labor, incentive compensation, hurricane-related disaster expenses, and occupancy costs. These were partially offset by expenses that were greater as a percentage of sales, including utilities, repairs and maintenance, and travel and training costs. Moving down the income statement. Operating profit for the third quarter increased 10.5% to $736 million.\n\nAs a percentage of sales, operating profit was 7.8%, a decrease of 4 basis points. Our effective tax rate for the quarter was 22.8% and compares to 22.2% in the third quarter last year. Finally, EPS for the third quarter increased 12% to $2.33. Turning now to our balance sheet and cash flow, which remains strong and provide us the financial flexibility to continue investing for the long-term, while delivering significant returns to shareholders.\n\nMerchandise inventories were $7.1 billion at the end of the third quarter, an increase of 34.8% overall and 28.4% on a per store basis. Similar to the first half of the year, this increase primarily reflects the impact of product cost inflation, a greater mix of higher-value products, particularly in the home and seasonal categories, primarily due to the continued rollout of our nonconsumables' initiative, and the early receipt of seasonal goods. Importantly, we continue to believe the quality of our inventory is in good shape, and we anticipate that we will begin to see lower levels of inventory growth beginning in Q4. Moving down the balance sheet.\n\nWe issued $2.3 billion of senior notes during Q3, and we now expect to incur total interest expense of approximately $210 million for the full year, an increase of approximately $53 million over the prior year. Turning to cash flow. Year to date through Q3, the business generated cash flows from operations totaling $1.2 billion, a decrease of 44%, primarily due to higher inventory purchases. Total capital expenditures through Q3 were $1.1 billion and included our planned investments in new stores, remodels and relocations, distribution and transportation projects, and spending related to the strategic initiatives.\n\nDuring the quarter, we repurchased 2.3 million shares of our common stock for $546 million and paid a quarterly cash dividend of $0.55 per common share outstanding for a total payout of $123 million. At the end of Q3, the remaining share repurchase authorization was $2.5 billion. Our capital allocation priorities continue to serve us well and remain unchanged. Our first priority is investing in high-return growth opportunities, including new store expansion and our strategic initiatives.\n\nWe also remain committed to returning significant cash to shareholders, to anticipated share repurchases and quarterly dividend payments, all while maintaining our current investment-grade credit rating and managing to a leverage ratio of approximately three times adjusted debt to EBITDAR. Moving to an update on our financial outlook for fiscal 2022. On year-to-date sales performance and our expectations for the remainder of Q4, we are reiterating our fiscal 2022 full year expectations for net sales growth of approximately 11%, including an estimated benefit of approximately 2 percentage points from the 53rd week, and we are updating our expectation for same-store sales growth for Q4, which we expect same-store sales growth in the range of 6% to 7%, which would result in growth toward the upper end of our previous range of approximately 4% to 4.5%. Turning to gross margin.\n\nWe've experienced many challenges over the course of this year, including those related to product cost inflation, supply chain dynamics and the evolution of consumer spending. Since our last update and like many retailers, we have seen an increased headwind from lower-margin consumables, sales mix as customers face growing financial pressure. We expect this headwind to grow in Q4 as our guidance assumes customers continue to feel financial pressures and shift more of their spending to consumable items. And while we are making good progress toward resolving our storage capacity constraints, we expect some of the cost pressures we have experienced as a result of the delays will carry over into Q4, but will be largely resolved by Q1 of next year.\n\nFinally, we are seeing a greater headwind from inventory shrink and damages than we anticipated for the back half of this year. Overall, while we are confident in the actions, we are taking to address our supply chain challenges, we anticipate the total headwind to gross margin in Q4 from all of these factors will be higher than what we previously contemplated within our financial guidance. With all this in mind, we are updating our EPS guidance. For the fourth quarter, we now expect to deliver EPS in the range of $3.15 to $3.30, which would result in a growth for the full year of approximately 7% to 8%.\n\nThis is compared to our previous expectation of 12% to 14% EPS for the full year. Both the current and previous ranges include an estimated benefit of approximately 4 percentage points from the 53rd week. And our EPS outlook now assumes an effective tax rate toward the upper end of the previously provided range of 22% to 22.5%. We now expect capital spending for 2022 to be approximately $1.5 billion, which is at the top end of our previously stated range.\n\nFinally, our expectations for share repurchases remain unchanged from what we stated in our Q2 earnings release on August 25, 2022. Overall, despite the near-term challenges, we are confident in the business and our outlook for the remainder of the year. While we plan to share 2023 guidance on the Q4 call, we feel good about the sales momentum going into next year, coupled with moderating cost pressures. Let me provide some additional context as it relates to our Q4 outlook.\n\nAs a reminder, we expect to continue realizing benefits from our initiatives, including DG Fresh and NCI through the remainder of the year. In addition, we expect the significant expansion of our private fleet, will drive additional benefits going forward despite anticipated continued internal supply chain pressures in the near term. With regards to SG&A, we expect continued investments in our strategic initiatives as we further the rollouts. However, in aggregate, we continue to expect these initiatives will positively contribute to operating profit margin in 2022, as we expect our benefits to gross margin will more than offset the associated SG&A expense.\n\nConsistent with Q2 and Q3, our outlook includes continued investments to further enhance the customer experience, primarily toward incremental labor hours to drive continued improvement in overall in-stock levels and customer experience. Finally, we also continue to pursue efficiencies and savings through our Save to Serve program, including Fast Track, and are seeing savings in 2022, offsetting a portion of wage inflation. As always, we continue to be disciplined in how we manage expenses and capital with the goal of delivering consistent, strong financial performance, while strategically investing for the long term. We're working hard to address the near-term challenges, most of which we believe will be behind us as we enter 2023.\n\nImportantly, we remain confident in our business model and our ongoing financial priorities to drive profitable same-store sales growth, healthy new store returns, strong free cash flow, and long-term shareholder value. With that, I will turn the call back over to Jeff.\n\nJeff Owen -- Chief Executive Officer\n\nThank you, John. Let me take the next few minutes to update you on our operating priorities and strategic initiatives. Our first operating priority is driving profitable sales growth. We are continuing to make significant progress executing against our robust portfolio of initiatives.\n\nLet me take you through some of the recent highlights. Starting with our nonconsumable initiative, or NCI, which was available in more than 16,000 stores at the end of the third quarter. With over 75% of the assortment at $5 or less, this treasure hunt offering continues to resonate with customers who are seeking value. We continue to be pleased with the sales and margin performance we are seeing from our NCI offering, including market share growth in nonconsumable product categories.\n\nLooking ahead, we expect to realize ongoing benefits from this initiative throughout the remainder of the year and remain on track to complete the rollout across nearly the entire chain by year-end. Moving to our pOpshelf store concept, which further builds on our success and learnings with NCI. As a reminder, pOpshelf aims to engage customers by offering a fun, affordable, and differentiated treasure hunt experience delivered through continually refreshed merchandise, a differentiated in-store experience, and exceptional value with the vast majority of our items priced at $5 or less. We recently celebrated the two-year anniversary of the first pOpshelf store, along with our 100th store opening.\n\nAnd we are pleased to see the concept continuing to resonate with customers. During the quarter, we opened 23 new pOpshelf locations, bringing the total number of stores to 103 located within nine states. Additionally, we opened 15 new store-within-a-store concepts during Q3, bringing the total number of Dollar General market stores with a smaller footprint pOpshelf store included to a total of 40. We remain on track to nearly triple the stand-alone pOpshelf store count this year, which would bring us to a total of nearly 150 stand-alone pOpshelf locations by year-end.\n\nLooking ahead, we plan to nearly double the pOpshelf store count next year, as our real estate plans for 2023 include opening approximately 150 additional locations, bringing the total number of pOpshelf stores to about 300 by the end of 2023. Overall, we remain excited about the pOpshelf concept and our goal of approximately 1,000 locations by year-end 2025. Turning now to DG Fresh, which is a strategic, multiphase shift to self-distribution of frozen and refrigerated goods along with a focus on driving continued sales growth in these areas. As a reminder, we completed the initial rollout of DG Fresh across the entire chain in 2021 and are now delivering to nearly 19,000 stores from 12 facilities.\n\nThe initial objective of DG Fresh was to reduce product cost on our frozen and refrigerated items, and we continue to be very pleased with the savings we are seeing. Another important goal of DG Fresh is to increase sales in frozen and refrigerated categories. We are pleased with the performance on this front including enhanced product offerings in stores and strong performance from our perishable department. Going forward, we expect to realize additional benefits from DG Fresh, as we continue to optimize our network further leverage our scale, deliver an even wider product selection and build on our multiyear track record of growth in cooler doors and associated sales.\n\nAnd while produce is not included in our initial rollout, we continue to believe that DG Fresh provides a potential path forward to expanding our produce offering to more than 10,000 stores over time. To that end, we offered Fresh produce in more than 3,000 stores at the end of Q3. And looking ahead, plan to add produce in approximately 2,000 stores in 2023, for a total of approximately 5,000 stores by the end of next year. Finally, DG Fresh has also extended the reach of our cooler expansion program.\n\nDuring Q3, we added more than 17,000 cooler doors across our store base, and we are on track to install more than 65,000 cooler doors in 2022. Importantly, despite the meaningful improvements we have made to date as a result of DG Fresh, we believe we still have a significant incremental opportunity to drive additional returns with this initiative in the years ahead. Turning now to an update on our health initiative, branded as DG Wellbeing. The initial focus of this project is an expanded health offering, which consists of approximately 30% more feet of selling space and up to 400 additional items as compared to our standard offering.\n\nThis offering was available in more than 3,200 stores at the end of Q3, and we plan to expand to a total of more than 4,000 stores by the end of 2022. As we seek to further connect customers with our expanded health offering, we have recently launched a partnership with a third-party payment platform to allow customers to use health plan supplemental benefits to purchase various health and wellness-related items in their local Dollar General stores. And most recently, I'm excited to announce that we launched a pilot of a mobile health clinic provided by DocGo On-Demand to provide basic preventative and urgent care services at a small number of stores in Q3. We plan to test this offering in select stores over the next few months as we continue to work with customers on how to help bring affordable health and wellness closer to home, while further establishing Dollar General as a trusted health partner in the local community.\n\nIn addition to the gross margin benefits associated with the initiatives I just discussed, we continue to pursue other opportunities to enhance gross margin, including improvements in private brand sales, global sourcing, supply chain efficiencies, and shrink and damage reduction. Our second priority is capturing growth opportunities. Our proven high-return, low-risk real estate model has served us well for many years and continues to be a core strength of our business. In the third quarter, we completed a total of 798 real estate projects, including 268 new stores, 485 remodels, and 45 relocations.\n\nFor 2022, we now plan to execute approximately 2,945 real estate projects in total, including 1,025 new stores, 1,795 remodels, and approximately 125 store relocations. Looking ahead, as I mentioned earlier, we plan to execute approximately 3,170 projects in the United States in 2023 across our Dollar General and pOpshelf banners, including 1,050 new stores, 2,000 remodels, and 120 relocations. Our ability to innovate our store formats continues to be an important strength of the business, and I want to take a moment to provide some additional color on our 2023 real estate strategy. Approximately 80% of our new stores and nearly all of our relocations will be in one of our larger store formats, which continue to drive increased sales productivity per square foot as compared to our traditional box.\n\nWith regards to remodels, approximately 80% will be in our DGTP format, which will provide the opportunity for a significant increase in cooler count, as well as the ability to add Fresh produce in many stores. In addition to our planned Dollar General and pOpshelf growth, we are very excited about our plans to expand internationally, and our goal is to open our first store in Mexico by the end of this fiscal year. As a reminder, these stores, which will be branded under the name MeSuper Dollar General will be located in underserved communities in Northern Mexico. Looking ahead, we plan to have up to 35 stores open in Mexico by the end of 2023, as we look to extend our value and convenience proposition to a customer base that is similar to our core customer in the United States.\n\nThese stores will be incremental to our planned 1,050 new store openings. As we head into 2023, our real estate pipeline remains robust. We see more than 16,000 total opportunities for small box retail stores in the United States, including more than 12,000 for Dollar General stores, approximately 3,000 for pOpshelf, and approximately 1,000 for DGX. With these opportunities and our existing footprint of more U.S.\n\nbrick-and-mortar stores than any other retailer, we are excited about our ability to capture significant growth opportunities in the years ahead. Next, our digital initiative, which is an important complement to our physical footprint, as we continue to deploy and leverage technology to further enhance convenience and access for customers. Our efforts remain centered around creating a digital front porch for our customers, as we look to continue building engagement across our digital properties, including our mobile app. We ended Q3 with over 4.5 million monthly active users on the app, and expect this number to grow as we look to further enhance our digital offerings.\n\nOur partnership with DoorDash continues to resonate with both new and existing customers as we look to extend the value offering of Dollar General, combined with the convenience of same-day delivery in an hour or less. This offering was available in more than 13,000 stores at the end of Q3, and we are very pleased with the year-to-date sales results. In addition, we are excited about the continued growth of our DG Media Network. We are seeing significant interest and participation from CPG companies and brands, who are seeking to connect with our more than 90 million unique profiles, especially our rural customers, who represent about 30% of the U.S.\n\nAfter establishing the foundation over the last few years, we are beginning to meaningfully grow this business. As we expand the program and enhance the value proposition for both customers and brand partners, while increasing the overall net financial benefit for the business. Overall, our strategy consists of building a digital ecosystem specifically tailored to provide our customers with an even more convenient, frictionless and personalized shopping experience. And we are pleased with the growing engagement we are seeing across our digital properties.\n\nOur third operating priority is to leverage and reinforce our position as a low-cost operator. We have a clear and defined process to control spending, which continues to govern our disciplined approach to spending decisions. This approach, internally branded as Save to Serve, keeps the customer at the center of all we do, while reinforcing our cost control mindset. Our Fast Track initiative is a great example of this approach, where our current goals include increasing labor productivity in our stores and enhancing customer convenience.\n\nThe current focus of Fast Track is self-checkout, which provides customers with another flexible and convenient checkout solution, while also driving greater efficiencies for our store associates. Self-checkout was available in more than 10,500 stores at the end of Q3, and we continue to be pleased with our results, including strong customer adoption rates. We are also excited about our pilot in select stores, which provides customers the option to utilize self-checkout in all lanes, but also choose a staff register, if preferred. We believe this full self-checkout option could further enhance our convenience proposition, while enabling store teams to dedicate even more time to serving customers.\n\nWe are currently testing this layout in approximately 250 stores and are pleased with the early customer and associate response. Looking ahead, we are on track to expand our self-checkout offering to a total of up to 11,000 stores by the end of 2022, as we look to further extend our position as an innovative leader in small-box discount retail. Moving forward, the next phase of Fast Track consists of increasing our utilization of emerging technology and data strategies, which includes putting new digital tools in the hands of our field leaders. When combined with our data-driven inventory management, we believe these efforts will reduce store workload and drive greater efficiencies for our retail leaders and their teams.\n\nWe also continue to reduce costs through the expansion of our private fleet, which consisted of more than 1,300 tractors at the end of Q3. As a reminder, we have been focused on significantly expanding our private fleet in 2022, as we plan to more than double the number of tractors from 2021, which we expect will account for approximately 40% of our outbound transportation fleet by the end of the year. Our underlying principles are to keep the business simple, but move quickly to capture growth opportunities, while controlling expenses and always seeking to be a low-cost operator. Our fourth operating priority is investing in our diverse teams through development, empowerment, and inclusion.\n\nAs a growing retailer, we continue to create new jobs and opportunities for personal and professional development and ultimately, career advancement. Our internal promotion pipeline remains robust as evidenced by the more than 70% of our store employees at or above the lead sales associate position who were placed from within. In addition, approximately 15% of our growing private fleet team began their careers with us in either a store or distribution center. We are pleased with our turnover trends and staffing levels.\n\nAnd applicant flow continues to be strong, further validating our confidence that we are taking the right actions to attract and retain talent. Ultimately, we believe the opportunity to develop a career with a growing and purpose-driven company is a unique, competitive advantage and remains our greatest currency in attracting and retaining talent. We also recently completed our annual Community Giving Campaign, where our employees came together to raise funds for a variety of important causes. And I was once again inspired by the generosity and compassion of our people.\n\nWe continue to add incredible talent across the organization in our stores, distribution centers, private fleet, and at our store support center. As this new talent joins our tremendous team, I am continually reminded that the people of Dollar General are our greatest strength. In closing, I am excited about the future as we continue to make great progress against our operating priorities and strategic initiatives, with the number of initiatives we have in place and a unique and strong strategic planning process, we are confident in our plans to drive long-term sustainable growth, while creating meaningful shareholder value. Finally, as we are in the midst of our busy holiday season, I want to thank our approximately 173,000 employees for their commitment every day to serve our customers.\n\nI am excited about our work together as we head into the final weeks of our year. With that, operator, we would now like to open the lines for questions.\n\nOperator\n\nThank you. At this time, we'll be conducting a question-and-answer session. [Operator instructions] As a reminder, we ask you to limit to one question and one follow-up if necessary. [Operator instructions] One moment, please, while we poll for questions.\n\nOur first question comes from Matthew Boss with J.P. Morgan. Please proceed with your question.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks. So, Jeff, maybe first, could you elaborate on what you think is driving the sequential acceleration in same-store sales? I think traffic has now sequentially improved for the second straight quarter. What are you seeing across the income cohort? And then maybe just looking back at past periods of consumer pressure, how sustainable do you see the market share opportunity in front of us?\n\nJeff Owen -- Chief Executive Officer\n\nHey. Thanks, Matt. We are very pleased with our 6.8% comp sales increase. And as you mentioned, seeing traffic accelerate again for the second consecutive quarter was very nice to see, and also continuing to grow market share.\n\nWe grew market share in our consumables and our nonconsumable business. And so, when you think about that, our outperformance on sales really was driven in the consumables business, and it really is a testament to our going where the customer wants us to go. And that is something we've always done here at Dollar General. And I think it's a testament to the relevance of our box.\n\nWhen you think about our box and how we've continued to make it a fuller fill-in shop, it really speaks to our ability to serve a broad spectrum of customers. And as you mentioned, with customers -- our core customer, one thing that is encouraging to see is she's still gainfully employed. And we've long said that is the single greatest factor in her economic health. So, it's encouraging to see that, and it's encouraging to see us grow productivity and share with her.\n\nAnd also, the encouraging thing we saw this quarter is we grew share in all income levels. And so that's particularly good to see when you think about the higher income levels. One of the things we've been very pleased at is our ability to retain that COVID customer higher than we expected to over the course of several quarters, and we continue to see that here. And we also saw us grow share and customers in the $100,000 income level.\n\nSo, when you step back and think about it, it again just points to our ability to serve multiple income cohorts. And that will set us up extremely well as we look to the future and our ability to not only make our core customer more productive, but also the ability to retain these new customers. So, we feel real good about that. And as I mentioned around the consumable business, we're pleased with the performance there.\n\nAnd I think the thing to keep in mind, as you step back and you think about where Dollar General is today, our consumable business is a much different business from a profitability standpoint due to our strategic initiatives. When you think about NCI, our health offering, DG Fresh, it really has made that business a different business from a profitability standpoint. In fact, in the third quarter, our gross margin is 100 basis points higher than it was in 2019, just to give you a little bit of color there. So again, we feel good about the top line.\n\nAnd as we look forward, we feel we're really well-positioned to serve a multiple cohorts of customers in this economic environment. And I'd also say that we're excited to deliver more real estate projects in 2023 than we've ever done at Dollar General. And I think it's a testament to the robust pipeline and then also the strategic initiatives. So, I feel real good about where we are from a sales standpoint and our position to be able to serve our broad customer base as we look forward.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nThat's great. And then maybe, John, on gross margin and just to break down some of the components. So, do you see these warehouse costs and supply chain efficiency is more transitory and contained to the fourth quarter? Help us to think about LIFO going forward relative to the material gross margin headwind this year, should we anticipate should transportation as a tailwind now from here? And just what inning do you see the drivers of inventory markup in today?\n\nJohn Garratt -- Chief Financial Officer\n\nSure, Matt. I'll start with the question around the supply chain costs. And as we called out versus previous expectations, the supply chain costs were a significant headwind more than $40 million above our previous expectations for Q3. And we do see this as near term.\n\nAnd we're making very good progress toward resolving our storage capacity constraints as more capacity comes online. And we do believe some of these cost pressures, nonetheless, will carry over into Q4. However, we do expect this will largely be resolved in Q1 of next year. So, as we look ahead, we anticipate supply chain costs, both internal and external in 2023 to be down quite a bit.\n\nWe're obviously seeing it improving as others market for carrier costs as well. And so that as a potential tailwind going forward. And then LIFO as well. We're seeing the pace that while it will continue to pressure, Q4, we are seeing the pace of cost increases continue to moderate.\n\nAnd as we look at next year, we'd expect less pressure from LIFO. So certainly, some near-term pressures between LIFO between the supply chain cost. We also mentioned the sales mix shift and shrink and damages. But as we look to 2023 and beyond, we feel good about, as Jeff mentioned, one, the sales momentum in the business; but also moderating product cost and inflation, particularly around supply chain and LIFO.\n\nAnd as you look at the initiatives, we have that continue to contribute the other levers we have, not to mention our scale and where we're at in price, we don't see a need to invest. We feel that we're very well-positioned as we look ahead to the future to continue expanding gross margin over the long term.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nThat's a great color. Best of luck.\n\nJohn Garratt -- Chief Financial Officer\n\nYou asked about markdowns as well. I didn't want to miss that question. As you look at markdown risk, while up from the unusually low levels last year, markdowns are still well below pre-pandemic levels. If you look at the majority of the inventory growth, it's really driven by inflation.\n\nThe team has done a good job anticipating the mix shift in consumer demand and has proactively been adjusting orders. And as a result, we feel very good about the quality of the inventory, ability to mitigate the markdown risk. As always, we've set aside, what we believe is an appropriate markdown level for the upcoming Christmas season. And of course, this is all reflected in our guidance.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks, John.\n\nOperator\n\nOur next question comes from Simeon Gutman with Morgan Stanley. Please proceed with your question.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood morning, everyone. I think a follow-up, John, for you. So, this year, you were going to grow earnings sort of in line with Algo excluding the 53rd week, and now it's going to be below and yet you're doing more sales. So, there's clearly something coiled up here in the model.\n\nI know you're not going to guide next year, but the theoretical framework is there should be some recapture. If there is recapture, are you inclined to let that flow? Or do you manage -- do you think the business just manages toward Algo and I don't know if it's to reinvest or maybe we don't see all the recapture that I'm hinting at?\n\nJohn Garratt -- Chief Financial Officer\n\nSure. So, as you mentioned, we won't be giving specific guidance on this call. We'll certainly share that on the March call. But I'll just start by reiterating that we feel great about the fundamentals of the business, the sales momentum, coupled with the moderating cost pressures that I just articulated.\n\nAnd as you called out, it is a one less week next year, that's important to bear in mind. But again, as you look at the fundamentals of the business, they're very strong. We continue to see ourselves as 10% EPS growers over the long term. Now, we will always balance that with investing back in the business for the long term, but feel we're very well-positioned.\n\nAnd more to come for next year, but feel great about the momentum of the business fundamentals.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. And maybe my follow-up, maybe sticking with you on fourth quarter gross margin. I guess, we're trying to build to the pieces, supply chain, mix, shrink. And we're having trouble getting to the entire magnitude.\n\nAre you willing to share a little more magnitude by item, by driver? Because it doesn't feel like the consumables mix goes up enough to justify the mix. So there seems like there's something like markdown in there as well.\n\nJohn Garratt -- Chief Financial Officer\n\nSo, as you look at the drivers of the additional pressure on Q4, it's the same drivers as Q3, the order is a little bit different. As you look at what we anticipate as the key pressures on Q4 margins is still healthy flow-through, but less than previously expected. The big difference is, first the mix shift. We did see a mix shift in the consumables as customers face financial pressures.\n\nWe want to go where the customer goes, and like the sales we're seeing, but it does pressure your margin a little bit with the mix of the sales. The other piece -- we did see -- we mentioned as we progressed through Q3 is a greater headwind from inventory shrink and damages. And that shrink can have a tail to that. Rest assured, the team knows how to deal with this and is taking actions to address it.\n\nBut it does have a tail to it. And then while we are making good progress resolving our storage capacity constraints with the capacity online, we do believe, as we mentioned, that some of this will carry over into Q4, but be largely resolved by Q1. So that's the big versus our previous expectations. Obviously, the other big one is LIFO.\n\nAs you look at LIFO, we called out $148 million in Q3, while we believe the product cost headwind is beginning to moderate. The prior cost increases will continue to pressure Q4 LIFO, and you could do the math as you do -- as you spread that across the year. So that's really the key drivers. But again, I'll just reiterate, many of these are transitory in nature.\n\nAnd as we look ahead to the future, we feel we're well-positioned to resume growing our gross margin over the long term with the initiatives, the levers, our scale, and the pricing position we're in.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThank you. Happy holidays.\n\nJohn Garratt -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Corey Tarlowe with Jefferies. Please proceed with your question.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nHi. Good morning and congrats on the continued top-line momentum and share gains that you've witnessed. So, with that in mind, maybe could you parse out a little bit what you're seeing in terms of how the customer is behaving because it's clear that traffic is up. The customer is visiting the store more and should -- maybe shifting a little bit into private label.\n\nCould you talk a little bit about what you're seeing in that regard and how you're investing to continue to support the growth in that segment? And then secondarily, as you see that mix shift happen more to the consumable side, how do you marry that with the continued growth that you're likely to see in NCI, which should actually help to underpin, I would say, better profitability as we look ahead?\n\nJeff Owen -- Chief Executive Officer\n\nHey, Corey, this is Jeff. Thank you for your question. And I'll start with the customer. I'll reiterate the fact that her gainfully being employed is, again, a very important factor to economic health.\n\nAnd so, when we talk to our customers, and I feel like our teams do that better than just about anybody. What we hear is she's feeling the pressure of energy prices and fuel and just the everyday needs are -- it's hard to -- for her to make ends meet. And so, she's behaving pretty much exactly the way we would expect her to in times like this. So, what we're seeing from her is, as you alluded to, she's coming to us more often.\n\nShe's buying fewer items on each occasion. And one of the things that we're very pleased is we're being able to help serve her needs through affordability. And our leaning into the dollar price point, our customer is responding incredibly well to that. And I just -- a testament to our team and to our ability to go where the customer wants us to around our $1 price point and affordability.\n\nBut when you think about the consumable business, as you mentioned before, you got again, really step back and think about the strategic initiatives and how that has allowed us to really have a more profitable business there. And we've long used consumables to drive traffic and nonconsumables to build the basket. And so, as we think about our -- excuse me, the nonconsumable, as you mentioned, certainly, we continue to be pleased with what we're seeing on NCI, and its ability to really provide that value. When you think about NCI, 80% of the items are $5 or less.\n\nAnd so, when you think about our ability to drive traffic through consumables, and then also see a little bit of our ability to rotate the product, the treasure hunt, our breadth strategy. We feel real good about our ability to help that customer continue to get the things they need and the things that they want. One last thing I'll say around private brand. I mean, we continue to be very pleased with what we're seeing on penetration.\n\nBut the other thing you got to keep in mind is our customer, again, she's very brand-focused as well. And it's very important to her. And that's where it's important to really lean into our scale. As John mentioned earlier, the ability of Dollar General and a limited SKU retailer to be able to trade out brands, if necessary for our customer is a really, really powerful way for us to serve for better.\n\nAnd we've said this before, but our customer treats a brand as a brand. And so, it gives us the ability to make sure that we're providing her with the value she needs. And our merchant team does that probably better than anybody in retail, in my view. So, as you step back and think about it, we feel we're well-positioned and really excited about our ability to continue to listen to our customer go where she wants us to go.\n\nAnd you combine that with the more profitable consumable business and our strategic initiatives and really set up nicely for us to continue to serve her, as we've done for many, many years in all economic cycles.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nThat's great. And then thanks for laying out the new store plans for next year. I think that helps to really provide a little bit more color as to the predictability and stability that we should expect ahead. Could you talk a little bit more about the strong returns that you're continuing to see on those new stores? And what we should expect more so from a continued ROIC standpoint as it relates to some of these new stores as we look ahead?\n\nJeff Owen -- Chief Executive Officer\n\nYeah, Corey, I'll start and then I'll let John fill in on some of your questions around returns. But our real estate model continues to be a huge strength of this business. I mean the low-risk and high-return model is incredibly powerful. And when you think about the retail landscape today, when you think about some of the challenges other retailers have talked about on the real estate front, I'm just very, very excited and proud of the fact that we're going to deliver more projects than we ever have at Dollar General in 2023.\n\nAnd with 1,050 new stores, it continues to just highlight our ability to serve the customer and our ability through format innovation, our real estate model, our technology, we're able to go where the customer needs us to go. And so, feel great about that. And really pleased at the fact, through format innovation, this larger store we're opening, our new store performance has been incredibly positive. And I'm very, very pleased at our ability to exceed our pro formas, and we continue to see that.\n\nSo that larger store format is continuing to deliver higher sales per square foot, which is excited. And as you know, the large majority of our openings are in that larger footprint. But as you think about the next year in the future, I think the other thing that excites us here is the pipeline that we have. And on the U.S.\n\nalone, we have 16,000 additional opportunities, and we feel great about our ability to capture those. And certainly, our fair share, which we've certainly demonstrated, but 12,000 additional for DG, 3,000 for pOpshelf and then 1,000 for DGX. So, stepping back, you can probably hear in my excitement about the real estate and our ability to continue to grow here. And we feel like we're being very prudent in this environment, I'm very, very pleased with the team's performance here.\n\nSo, I'll kick it over to John for your return question.\n\nJohn Garratt -- Chief Financial Officer\n\nYeah. And just -- echoing Jeff's comments, we're very pleased with the results we're seeing. As he mentioned, we're above pro forma in sales, which puts us ahead of schedule in terms of the IRRs. Again, we target a 20% to 22% after-tax IRR based on the sales.\n\nAnd as we outperform in sales, that puts us a little ahead on the returns as well. And feel not only great about the -- and again, it's always important to bear in mind that it includes the impact of cannibalization, which is very minimal, has been very consistent, just given the localized nature of the shop. We continue to see paybacks less than two years. So, it continues to be a fantastic investment that we continue to hit the gas on.\n\nAnd we're also really pleased with returns we get on our remodels as well, and we're doing not only a record number of overall projects this year, but a record number of remodels, which really helps drive the comp.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGreat. Thanks so much for all the helpful color and best of luck.\n\nJohn Garratt -- Chief Financial Officer\n\nThank you.\n\nJeff Owen -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question is from Michael Lasser with UBS. Please proceed with your question.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. John, I want to hopefully get some frame of reference on two factors that are impacting the gross margin. So, a, you mentioned $40 million of supply chain costs that are above and beyond what you expected, does that go to $30 million in the fourth quarter? And if that's in the right ballpark, you used the term of beat, which you can interpret a lot of different ways.\n\nI think what most of the market wants to know is, does abate mean you're going to incur $70 million this year that will go away because those are extraordinary costs next year? And as part of that, the other piece of it is the LIFO, which the LIFO headwind because that needs to be $450 million or so if we just add $100 million for the fourth quarter. If there's a linear path of this inflation, meaning it goes from nine, eight, seven, six, and so forth, would that LIFO headwind that's going to be, call it, $450 million this year, be like $300 million next year, so you get a $150 million benefit? Sorry for so many numbers and so much confusion.\n\nJohn Garratt -- Chief Financial Officer\n\nNo. No. Thank you, Michael. I'll try and tackle each of these.\n\nIn terms of the carryover impact of the supply chain costs. We didn't give a specific number on that. It will be less, but still a meaningful impact to us. In terms of LIFO, the way to think about that is even though we don't anticipate -- we anticipate a slowdown in the number of price increases.\n\nThe way you do that number is at a point in time, we project the full year impact of all the price increases we're aware of, and we spread that across the year. So that gets you in the game of what Q4 looks like. And as we look ahead to next year, it remains to be seen but would anticipate a considerable reduction to that LIFO number. So, as you look at -- as I mentioned, as you look ahead to next year, we think the supply chain costs will be down considerably because we won't have these near-term one-time costs, we don't anticipate because we think that will be resolved in Q1.\n\nAnd then the market is favorable in terms of just overall transportation costs, both foreign and domestic. And of course, we continue to stand up our private fleet, which we're going to -- every time we convert, we take 20% out and we're going to double that in size this year. So that's certainly a significant savings driver for us as well. And so, as you look ahead to next year, I think it's safe to assume that there's a number of tailwinds.\n\nThere's certainly some headwinds we mentioned. We'll have to wait and see what the mix does. We want to be there for the customer, and we'll go where she goes. So, we have to see where that goes.\n\nAs we said, shrink has a tail to it. And we're all over it. We know how to attack that, but it does have a bit of a tail. So, as you look ahead to next year, there's some puts and takes.\n\nBut again, we feel like there's a lot of tailwinds when you think of LIFO, when you think of the supply chain costs and all the other levers that we've talked about, not to mention the initiatives.\n\nMichael Lasser -- UBS -- Analyst\n\nOK. My follow-up question will be less a bit picky. I'm sorry. The -- we've seen now some cost pressure at Dollar General.\n\nThis follows a significant decline in profitability your largest competitor. Should we take these as one-time event? Or is there anything to say that just the overall profitability of the small box value convenience sector is permanently under pressure or long-lasting under pressure because of some of the competitive dynamics? Because of the shift to consumables and other factors? Or would you expect that this is not a trend that's going to be long lasting?\n\nJohn Garratt -- Chief Financial Officer\n\nYeah. I'll just reiterate, we see most of the pressures as transitory. When you look at the LIFO, when you look at the supply chain, we see that as transitory. We still feel very good about our nonconsumable products, and see this more as a transitory macro pressure.\n\nAgain, we're growing share. We're just kind of following the market trend, which people are just shopping more toward consumables versus discretionary items. But we're taking share and feel that will certainly do very well there as the economy improves. And just structurally, we feel we're well-positioned in terms of -- as we look at wages, we feel we're well-positioned in terms of applicant flow and staffing levels.\n\nWe feel we're investing appropriately in the business. We feel that our pricing is very appropriate. And again, I think it's important to mention that as you look at Q3, yes, we were down 27 basis points in gross margin, but we're still about 1 point above pre-pandemic levels despite all these transitory pressures I mentioned. We're still a point above where we were back in 2019 and Q3.\n\nMichael Lasser -- UBS -- Analyst\n\nGot it. Thank you so much and have a good holiday.\n\nJeff Owen -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question is from Paul Lejuez with Citi. Please proceed with your question.\n\nPaul Lejuez -- Citi -- Analyst\n\nThanks, guys. Curious on the storage capacity and supply chain inefficiencies. If there was a sales impact during the quarter, as well as the cost impact that you talked about. Maybe if you could frame that, also, same question, if you expect there to be a sales impact in 4Q? And related to that, was the pressure any region in particular where you saw the cost and/or sales impact? And how much of a differential was there in terms of the performance of that region versus your others?\n\nJeff Owen -- Chief Executive Officer\n\nYeah. Thanks. I'll tell you, as we said before, the delays of our temporary storage facilities, certainly, that unexpected delay did impact the quarter from a profitability standpoint. But again, I reiterate how pleased we were with the strong sales performance we saw.\n\nAnd the nice thing is like it normally is at DG, it's pretty broad-based. And so, I think, again, that goes to the consistency of our ability to serve a customer across, not only a broad swath of the United States, but also around the income levels I mentioned earlier. And we're very pleased and excited that our temporary storage facilities are now online. We're also excited that our two new permanent regional hubs that are going to serve us extremely well.\n\nAs we look to the future, they're also online. And of course, those things will take some time to get fully productive and to allow us to catch up. So, again, I would also mention we're pleased that we had in stock improvement year over year in Q3. So again, when you kind of bundle it all together, I think the team did a nice job of overcoming some of these challenges, to deliver for the customer, go where she wants us to go.\n\nI think that translated into our strong comp, our strong market share gains in both consumables and nonconsumables, and a second consecutive quarter of sequential traffic increases. So, again, feel pleased about the top line and feel pleased about where we have opened up our capacity. And finally, I'll just mention, as you look forward over the next 18 months, bringing on four permanent facilities, that will increase our capacity by 20%. And is something we factored into our strategic plan and feel great about how that's going to serve us well and allow us to continue to grow this business in the years ahead.\n\nPaul Lejuez -- Citi -- Analyst\n\nThanks.\n\nOperator\n\nOur last question will be from Rupesh Parikh with Oppenheimer. Please proceed with your question.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood morning. Thanks for taking my question. So just going back to your commentary on shrink. I was curious if you can provide more color in terms of what's driving the higher shrink lately opportunities you guys see to reduce that going forward? If there's any way to quantify how you think about the headwind for Q4 or even what you saw in Q3?\n\nJohn Garratt -- Chief Financial Officer\n\nYeah. So, as we mentioned, we saw increased shrink later in Q3. We believe this is largely -- Rupesh, largely attributable to the inflationary environment, coupled with higher inventory levels. Overall, as you know, retail is seeing higher shrink in this environment.\n\nNow, this can have a tail. So, we did say we expect this to carry over into Q4. I think it's instructive as we listed out the gross margin drivers, I think that was the last on the list of drivers for Q3. But bear in mind, that was later in Q3.\n\nSo, we anticipate a larger -- probably a larger impact if you have a full quarter of that in Q4. But in Q3, it was the smallest of the items we called out. But again, we've done this drill many times. If you look at our shrink levels, they're still very low from a historical perspective, just not quite as low as we were at record levels recently.\n\nBut the team knows how to execute against this, and I think we're putting the right tactics in place to address it. We're increasing the amount of tagging with -- for our EAS units. We're leveraging technology like exception-based reporting, and we have very good process rigor and focus on this to tame it. But we'll have a little bit of tail until these actions take hold.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you. And then maybe just one quick follow-up question. So just on trade-in, I know your team expects to trade in to continue into Q3, and I believe Q4 as well.\n\nAt this point, the trade-in that you're seeing, is that consistent with what you'd see in a recession? Or is it -- would you say it's still below what you typically see in downturn?\n\nJeff Owen -- Chief Executive Officer\n\nYeah. Rupesh, as I said earlier, we're very pleased to be able to see that we're growing share in customers across all income levels. So that's encouraging. And really, again, I go back to the relevance of our brand of our box and our tremendous ability to listen and respond to what our customers are looking for.\n\nAnd certainly, I would tell you, the core customer is certainly behaving the way we expected her to. And also, as you think about it, one of the things that we continue to be pleased with is the fact that when we were introduced to that new customer during COVID, we continue to retain her at higher-than-expected levels. So, I would say that as we sit here today, we feel real good about what we're seeing across all the income brackets. We feel real good about seeing the growth there.\n\nAnd I think we're very well-positioned to continue to serve them. And I think if you step back and think about Dollar General, we're an all-weather brand, and we've been doing this for many, many years, and we continue to do that. And so -- and we will continue to do that. We'll go where the customer wants us to go, which we did this quarter.\n\nAnd we're also positioned to continue to do that as we move forward and continue to deliver on our strategic initiatives that really make a more well-rounded shop and a greater appeal for a broad swath of customers.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe have reached the end of the question-and-answer session. I'd now like to turn the call back over to Jeff Owen for closing comments.\n\nJeff Owen -- Chief Executive Officer\n\nWell, thank you for all the questions and your continued interest in Dollar General. I just wanted to wrap up with three points. First, while we had some unanticipated challenges within our supply chain during the quarter, we're confident in the actions we've taken to address these near-term issues and expect continued improvement as we move through Q4 and into next year; second, we believe we are well-positioned to keep growing market share, especially in an environment where customers are even more focused on value; and third, we believe our strong value and convenience proposition combined with our robust portfolio of strategic initiatives sets us up for a very long runway of growth. And we couldn't be more excited about where the future is headed.\n\nI want to thank you again for listening, and I hope you have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKevin Walker -- Vice President, Investor Relations\n\nJeff Owen -- Chief Executive Officer\n\nJohn Garratt -- Chief Financial Officer\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nPaul Lejuez -- Citi -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nMore DG analysis\n\nAll earnings call transcripts"
}