{
  "companyName": "Express",
  "companyTicker": "EXPR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/31/express-expr-q2-2022-earnings-call-transcript/",
  "content": "Express (EXPR 9.09%)\nQ2 2022 Earnings Call\nAug 31, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning. My name is Chris, and I'll be your conference operator today. At this time, I'd like to welcome everyone to the Express second quarter 2022 earnings conference call. [Operator instructions] I would now like to hand the call over to Greg Johnson, vice president of investor relations.\n\nPlease go ahead.\n\nGreg Johnson -- Vice President, Investor Relations\n\nThank you, Chris. Good morning, and welcome to our call. I'd like to open by reminding you of the company's safe harbor provisions. Any statements made during this conference call, except those containing historical facts, may be deemed to constitute forward-looking statements within the meaning of the federal securities laws.\n\nActual future results may differ materially from those suggested in forward-looking statements due to a number of risks and uncertainties, all of which are described in the company's filings with the SEC, including today's press release. Express assumes no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. Our comments today will supplement the detailed information provided in both the press release and the investor presentation available on our investor relations website. In addition, you can locate a reconciliation of any adjusted results discussed in our comments to amounts reported under GAAP on our website or in our earnings release.\n\nWe will also be providing financial comparisons to prior fiscal periods, and our prepared remarks today refer to 2021, unless otherwise noted. With me today are Tim Baxter, chief executive officer; Matt Moellering, president and chief operating officer; and Jason Judd, chief financial officer. I will now turn the call over to Tim.\n\nTim Baxter -- Chief Executive Officer\n\nThank you, Greg, and good morning, everyone. In Q2, we delivered our fifth consecutive quarter of positive comparable sales compared to pre-pandemic levels and generated positive operating income and operating cash flow. We drove comparable sales of plus 1% compared to 2021 and plus 4% versus 2019. We delivered gross margin expansion of 50 basis points compared to 2021 and 630 basis points versus 2019.\n\nWe generated EBITDA of $26 million. We delivered these results despite difficult macroeconomic conditions that worsened as the quarter progressed. And this dynamic caused us to miss our revenue outlook. Even so, our results in the first six months of the year were solid.\n\nComparable sales were plus 14%. Gross margin expanded 270 basis points. Average unit retail increased 13%. And we delivered EBITDA of $31 million, an increase of 350%.\n\nI expect the environment to remain uncertain, but we will continue to focus on the fundamentals, control the controllables and deliver on our long-term commitment of a mid-single-digit operating margin. Even in this challenging environment, we continue to experience momentum across much of our business. We had very strong results in men's and posted growth in every major category. Modern tailoring in men's and women's continued its resurgence.\n\nOur average unit retail increased 7%. Comps in our retail channel were flat, and our outlet channel was up 2%. As I mentioned, macroeconomic conditions worsened as the quarter progressed and caused us to experience a slowdown beginning in mid-June that continued into early August. However, we have seen some improvement in each of the past few weeks.\n\nWe saw a bifurcation in customer behavior that affected our men's and women's businesses differently with the women's customer becoming much more value conscious. This also negatively impacted our e-commerce business as women's accounts for a high percentage of our digital sales. We continue to advance each one of the four foundational pillars of our EXPRESSway Forward strategy: product, brand, customer, and execution. Let me take you through some of the results we've achieved to date and what is still to come.\n\nI'll start with product. We offer modern, versatile, high-quality fashion at incredible value, and we continue to gain market share in some of the significant volume-driving categories. We are winning in men's. We saw strength in comp growth in men's across all categories, generated higher and more profitable sales, drove a 12% increase in average unit retails and grew our customer file.\n\nThe customer continued to respond to the fashion, quality and value in our assortments, and as I referenced earlier, was less price sensitive than what we saw in women's. Modern Tailoring continued its resurgence, and men's suits were up double digits. Men's chinos were one of our best categories. And thanks to a combination of comfort and versatility, were up significantly.\n\nOur women's business was more challenged as the customer's mindset became much more value-oriented. We were not as promotional as many of our competitors, which likely impacted our results. Within women's, our momentum in modern tailoring continued with both jackets and skirts up double digits. We have several compelling women's product launches coming in September, including the redesign and reintroduction of two of our most iconic styles, the Editor Pants and the Portofino shirt, as we continue to advance our product pillar.\n\nOur second pillar is brand. We create confidence, we inspire self-expression, and we do it by editing the best of now for real-life versatility. Building, activating and amplifying the Express styling community is one of our key priorities this year because it is one of the most unique and dynamic ways our brand's purpose comes to life. Many members of our community engage with us and with each other online.\n\nNearly 50% of the product pages on our website have content created and posted by members of our styling community, driving conversion at least twice as high as other pages. We had 1,000 Style Editors in our community commerce program this quarter, hosting events, sharing content, and appearing in our marketing campaigns. Our lead style editor, Rachel Zoe, hosted a live event that generated an estimated 16 million impressions across social media, paid media, and PR. Our second quarter brand campaign, Destination Express, generated 350 million impressions across all digital platforms, including nearly 50 million organic video views, a 23% increase over last quarter, and Google organic brand demand was up for the fifth consecutive quarter.\n\nOur third pillar is customer. Loyalty program members are our best customers, making over two more visits and spending over twice as much per year as non-loyalty customers. Since its relaunch in Q1 of last year, our loyalty program has brought in four million new customers and reactivated 3.2 million lapsed customers. We continue to operate with the highest number of active loyalty program members in our company's history.\n\nOur fourth pillar is execution. You've heard me describe execution as the through line across all our product, brand and customer strategies, and the ultimate test of the effectiveness of our operating model, systems, and processes. We have successfully rebuilt the foundation of Express, successfully reimagined our product and successfully reinvigorated our brand, all of which contributed to our solid results over the past five quarters. We refined and optimized our go-to-market process, advanced our multichannel capabilities, identified a number of operational efficiencies and applied strong financial discipline to our expenses and investments.\n\nOur team has been agile and disciplined, and continue to respond to the volatility and unpredictability of the macroeconomic and retail environments with smart, thoughtful solutions. We carefully and efficiently navigated numerous ongoing supply chain challenges. And while our inventory remains elevated, which is a recurring theme across the industry this quarter, ours actually stepped down in line with our expectations, and we expect it will move even closer to parity with our sales as the year progresses while remaining well positioned on newness. Now let me provide an update on our performance in each channel, starting with e-commerce.\n\nAs many in our industry have reported, our e-commerce business also slowed as the quarter progressed. However, we remain committed to achieving our long-term goal of $1 billion in e-commerce demand. To enable that, we continue to introduce new features and enhancements to our e-commerce experience that will drive higher conversion and average order value. We improved buy online pick up in store functionality, so customers could more easily shop our full inventory.\n\nAnd in the coming months, we will enhance personalization and checkout. We will offer even more content across all of our digital platforms and keep advancing our multichannel execution. Our mobile app continues to be the fastest-growing component of our digital business. We now have 2.7 million mobile app users, an increase of 31%.\n\nThese highly engaged customers make five more visits and spend over $300 more each year than customers who only shop through our website or in one of our stores. Our retail stores achieved solid results, posting a 6% comp in the quarter, the highest comp among our channels, and drove a 7% increase in average unit retail. We completed our fleet rationalization work and closed nearly 100 stores over the past several years, and our fleet optimization strategy to advance and diversify our store portfolio through renovations and new formats is in motion. The majority of our traffic and revenue still comes through our stores, and there is tremendous value to the in-real-life experience.\n\nSo we continue to make investments here. We have an important pilot program running in approximately 25 stores, where we are testing and learning our way into a reimagined customer experience. These stores are outperforming the rest of our fleet with higher sales, higher loyalty program sign-ups, increased customer engagement and overall improvements to the customer experience. They are also strengthening the attraction, development and retention of talent.\n\nIn September, we will expand this program to a total of 70 retail stores, which will create an elevated customer experience in some of the most important stores in our fleet. For the remainder of our retail stores, we will continue to improve the customer experience by taking what we've learned from the pilot and quickly applying the most effective parts of the program. Our stores are where our styling community comes together, and where our brand's purpose comes to life. We held 260 events in stores in the second quarter, and many were live streamed to bring our Style Editors, store associates and customers together in a real-time virtual format.\n\nThese events garnered one million views across our social platforms. The combined effect of our growing community, our events and the changes we have made to upgrade the store environment and reimagine the customer experience is creating differentiation for Express and contributed to our stores comp growth in the quarter. We will continue to renovate our stores to align both environment and experience with our brand purpose and create a consistent visual identity across our fleet. We have already updated 35, and we'll update a total of 70 before the end of this year.\n\nWe will also continue to diversify our store portfolio through format and location. Our Express Edit stores have proven to be a powerful way to reach new customers and advance our brand. They acquire new customers, reactivate lapsed customers and sign-up Express Insiders at higher rates than the balance of our fleet, and boost digital sales and surrounding ZIP codes. We plan to open six more of these stores in the next 90 days in Soho and Flatiron in Manhattan, on Newbury Street in Boston, in Brickell, and South Beach in Miami, and near Rittenhouse Square in Philadelphia.\n\nThese are all high-visibility locations in the most appealing shopping areas, and these stores will reflect the best of what we are learning in our pilot stores. Our outlet channel delivered record revenue in the second quarter, and a positive 2% comp. In this inflationary environment, where even more customers are price-sensitive, our product continues to resonate on fashion, versatility, quality and value. Our UpWest brand delivered another strong quarter with sales growth of 46%.\n\nUpWest launched as a digital brand with a clear purpose around comfort for people and planet that is meaningful and compelling for today's conscious consumer. While our digital sales continue to accelerate, we are also expanding our brick-and-mortar footprint. We opened four stores in the quarter, bringing the total to 14. UpWest has leveraged wholesale partnerships to build awareness and exposure.\n\nWe will expand this strategy with the holiday launch of a large national retailer and introduced a collection of blankets co-designed with their team that will be available for sale on their website, and in all of their stores. Turning to our philanthropic activities. We continue to deepen the partnership between our Dream Big Project and Big Brothers Big Sisters of America. We surpassed our $1 million donation goal by $200,000 and awarded our first Castle Cris fellowship.\n\nEach of our initiatives with Big Brothers Big Sisters is aligned with our brand purpose to create confidence and inspire self-expression. And we are especially proud to help do this for young people. Now let me turn the call over to Jason, who will take you through the detail of our second quarter results, and our outlook for the back half of the year.\n\nJason Judd -- Chief Financial Officer\n\nThank you, Tim, and good morning, everyone. As you just heard from Tim, we delivered our fifth consecutive quarter of positive comparable sales compared to pre-pandemic levels and generated positive operating income and operating cash flow. Despite difficult macroeconomic conditions that became even more challenging as the quarter progressed, we achieved these results, thanks to a great strategy and compelling brand. Let me review our results compared to our second quarter outlook.\n\nWe expected a comparable sales increase of mid-single digits. We delivered a positive 1% comp. We expect our gross margin rate to increase approximately 100 basis points. We drove expansion of 50 basis points.\n\nWe expected SG&A expenses as a percent of sales to delever approximately 100 basis points. We actualized at 140 basis points. We expected our inventory to remain elevated in the second quarter. Our inventory was up 30%, which was a meaningful improvement from the 40% increase in Q1.\n\nI'll walk through each item in more detail. Net sales were $465 million, an increase of 2%, and consolidated comparable sales were up 1% compared to 2021. Total retail channel comps were flat, and outlet comps were up 2%. Consolidated comparable sales increased 4% compared to 2019.\n\nAs Tim previously mentioned, we experienced a slowdown in mid-June that continued throughout the second quarter, primarily affecting our women's and e-commerce businesses. We generated gross profit of $154 million, with a gross margin rate of 33.1% and an expansion of 50 basis points. Our merchandise margin contracted by 70 basis points, but was beneficially offset by buying and occupancy expenses, which leveraged 120 basis points, driven by overall sales growth, the lower compensation and occupancy-related expenses. Gross margin expanded 630 basis points compared to 2019.\n\nSG&A expenses were $143 million, and delevered by 140 basis points. While this was 40 basis points more deleveraged than our outlook due to the lower cost, SG&A expenses in total were well controlled and came in $5 million below our outlook. Our results in the first six months of the year were solid. Comparable sales were positive 14%, gross margin expanded 270 basis points.\n\nAverage unit retail increased 13%, and we delivered EBITDA of $31 million. Our inventory was up 30% compared to last year, reflecting a 15% increase in unit investment and a significant improvement versus the 40% increase in Q1. We discussed the drivers of the increase last quarter. Let me summarize them again here.\n\nFirst, we have taken strategic actions to mitigate supply chain challenges and ensure that our inventory arises on time. Second, there were underlying cost increases due to our investments in improved product quality, a distortion to higher-priced categories, and of course, the impact of inflation. We have maintained our margins through our realized average unit retail. Third, we made the strategic decision to hold late-arriving holiday 2021 product, and we expect it to sell through at appropriate prices in our outlet channel this fall.\n\nWe will keep taking action to ensure that we are well positioned on both the newness and composition of our inventory. And I expect our inventory levels will continue to move closer to parity with sales growth in the back half of the year. Turning to our other results. Our operating income was $10 million and our diluted earnings per share were $0.10.\n\nWe drove operating cash flow of $15 million. Our balance sheet at the end of the second quarter reflects the $52 million CARES Act receivable we have mentioned before and expect to receive in 2023. Our borrowings at the end of the quarter were $204 million, of which $110 million was drawn against our existing asset-backed loan facility, and the remaining $94 million was drawn on our term loans. To determine our outlook, we considered our year-to-date performance as well as the numerous advancements we've made in each of our four foundational pillars: product, brand, customer and execution, and balance those factors against the increasingly challenging macroeconomic and retail apparel environment, the ongoing uncertainty of the global supply chain and geopolitical events, and the possibility of other unforeseen headwinds that could impact our business.\n\nOur revised outlook includes expectations for the third quarter and the full year. Let me start with Q3. Compared to the third quarter of 2021, we expect the following. comparable sales to decrease mid-single digits, gross margin rate to decrease approximately 350 basis points, and SG&A expenses as a percent of sales to delever approximately 350 basis points, including incremental investments in technology and higher store labor expenses.\n\nCompared to the full year of 2021, we expect the following. Comparable sales to increase mid-single digits, gross margin rate to increase approximately 100 basis points, SG&A expenses as a percent of sales to delever approximately 100 basis points. On positive operating income, diluted loss per share of $0.16 to $0.22. Capital expenditures of approximately $50 million, and inventory to move closer to parity with sales growth in the back half of the year.\n\nEven in the midst of all of the aforementioned market uncertainties and in light of our revised guidance, it is important to highlight the long-term value-creation opportunity of this company. The EXPRESSway Forward strategy is grounded in retail fundamentals. This strategy is working. And because of this strategy, the current market dislocation will not deter us from our goals.\n\nWe have transformed over the past three years and continue to successfully navigate through challenging and unpredictable times. For example, we are controlling our inventory in an efficient and comparatively cost-effective manner to ensure we are well positioned on both the newness and composition of product that resonates with our customers. Over the coming quarters, as we set our sights on a mid-single-digit operating margin by 2024, we will continue to improve our women's business while building upon the strength we're seeing in men, to manage our expenses with both diligence and agility while investing where we see opportunities for growth. We will refine our capital allocation discipline to optimally balance our net cash and debt positions, allowing agility for investment while also providing expanded comfort with our debt exposure levels.\n\nI expect the combination of all of this to unlock greater shareholder value, and I look forward to updating you on our progress. Now back to Tim.\n\nTim Baxter -- Chief Executive Officer\n\nThank you, Jason. Despite a challenging macroeconomic environment and retail apparel backdrop, the work we've done across the four foundational pillars of our corporate strategy is evident, and we've made meaningful progress and increased our market share in some of the most significant volume-driving categories. Our product is resonating. Our brand is relevant.\n\nOur brand purpose is compelling. The connections we have forged with our customers are meaningful, and it all comes together in our stores and online through the power of our styling community. Our organization has successfully navigated a large-scale transformation over the last three years in unprecedented and highly uncertain times. Despite considerable headwinds, we have delivered five consecutive quarters of growth and made meaningful advancements by operating with focus, discipline and agility.\n\nThe EXPRESSway Forward strategy is working, and we remain committed to achieving our stated objective of a mid-single-digit operating margin by 2024 and long-term profitable growth. Thank you for your interest in our company. And we'll now take your questions.\n\nOperator\n\n[Operator instructions] Our first question is from Eric Beder with SCC Research. Your line is open.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nGood morning. Thank you for all the information there. So I've got a few questions here. So let's talk about the promotional activity.\n\nYou mentioned that you were not as aggressively discounting in women's as a lot of your competitors did. When you look going forward, how do you feel is going to be the promotional environment? And how do you plan on countering that or responding to it?\n\nJason Judd -- Chief Financial Officer\n\nThank you, Eric. This is Jason. I hope you're doing well. When we look at the promotional cadence, we really think -- as you know, we start with our customer and where she is at, what she is looking for.\n\nAnd she is exceedingly excited about our product. As we've discussed in the past, product-first, they were very excited about what she's been seeing over the past couple of months and even more enthusiastic about what's coming. At the same time, there's a value mindset that has shifted, really unveiled in late June, accelerated in July and August. We're still seeing a bit of that value mindset now.\n\nAnd so weaving in more promotional excitement around our new product with the opportunity to weave in a little bit of the redline product that we have as well, so that she has a well-balanced assortment that she can choose from. It seems to be gaining a lot of traction, and there's a lot of enthusiasm there. So that's what we see in the coming weeks.\n\nTim Baxter -- Chief Executive Officer\n\nI think we will continue, Eric, to closely monitor the competitive environment, which, as Jason just noted and I noted, got much more aggressive in the back half of the second quarter. But we have made so much progress on eliminating deep sitewide and storewide promotions, and we are not going back there. We will continue to be very targeted in our promotions, particularly on our new product and very strategic in our promotions on our new product while using our clearance to really drive a value message. And so I think that's what you'll be seeing from us in the third quarter.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nGreat. And if you look at -- so some of the London product. You have kind of gone back to the future here with the Editor Pants, the Portofino shirt, what are kind of the strategies we're going to see in fall and holiday in terms of product here?\n\nTim Baxter -- Chief Executive Officer\n\nWell, I think we have great product launches coming in women's, as I mentioned. The reintroduction of the Editor Pants, which actually happened this week, has been wildly successful. The reintroduction of the Portofino shirt is coming next week, and we anticipate that, that will also be wildly successful. And so from a product perspective, we will continue to build core categories and core businesses that can drive significant volume at higher profit levels.\n\nWe have many of those categories well positioned in men's, as you know. And we are rebuilding those categories and franchises in women's in addition to continuing to deliver on our fashion promise. We are a trend in fashion retailer. And so we'll balance those key core programs with the right fashion at the right time.\n\nSo I'm very optimistic about where we are heading over the next few months from a product perspective and believe we will continue to gain market share in categories that we've long been known for tailoring in particular, but also continue to gain market share in really important categories like denim.\n\nMatt Moellering -- President and Chief Operating Officer\n\nOn the women's side, we're also up double digits, as Tim mentioned, on jackets and skirts. We frankly could have used more inventory there, and we have a lot more coming in for the fall season, which should give us a tailwind as well in those pieces.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nAnd I noticed that with Body Contour or you continue to expand the product and it continues to have very significant positives. What should we be thinking about Body Contour going forward for the back half of the year?\n\nTim Baxter -- Chief Executive Officer\n\nYes. Body Contour continues to be a great new franchise for us that was introduced last year and continues to be a customer favorite. We have exciting new launches coming in Body Contour, perhaps the most exciting is Faux Leather Body Contour, which also launches in September, which we're really excited about, and I believe the customers, the Body Contour customer is going to respond extraordinarily well to that. So that is a new franchise that has been very powerful for the past year that we will continue to drive with newness in addition to the core product.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nWhen you mentioned that August started to see in the back half the last few weeks, a bit of a bounce back. What should we be thinking about that going forward? I know it's kind of the end of the season, the start of fall -- how should we be thinking about that going forward?\n\nTim Baxter -- Chief Executive Officer\n\nLook, I think, as I said, we have seen improvements in each of the last few weeks, but our outlook is where I would direct you. We are approaching this macroeconomic environment appropriately from my perspective and our outlook takes all of that into consideration.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nOK. Just one or two quickies here. Gross margin, it went up comps where you aspire a little bit less than you were expected, but the comps were actually materially less than you expected. Where -- is that a function of pricing? Is that -- how should we be thinking about that?\n\nJason Judd -- Chief Financial Officer\n\nSure. So with regard to gross margin, it is a two-pronged story. As you referenced, there is the underlying product margin on our pricing versus cost where we did see about 70 basis points of contraction versus last year, and then there is the buying and occupancy expenses where we saw 120 basis points of leverage. The buy occupancy really driven by the 2% sales growth over LY, and the work done in real estate optimization over the past number of years where we're able to leverage on low single digits, even to flat sales.\n\nOn the product margin, we're still getting great traction on our AUR. The underlying cost of the product has grown, which leads to the margin contraction. But overall, margins were able to expand by 50 basis points. The 400 basis points of sales softness versus the outlook, if that had just been a little moderated, we would have seen even more gross margin expansion on our strong control of the expenses and on the traction with the AUR.\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nInventories. Could you remind us once again what level is the -- ones you packed away for the holiday? And what are you seeing in terms of cost of shipping and other pieces of inventories as we're going forward here?\n\nJason Judd -- Chief Financial Officer\n\nSure. So the pack and hold that we've been discussing was from holiday 2021 for use in this coming fall in our outlook -- in our outlet stores. The total there was about $10 million to $15 million of inventory at cost and are very excited about what it can do this fall within our outlook channel. The underlying supply chain cost that we've been seeing, we have about $5 million of incremental supply chain cost over last year that we're seeing in the back half of this year.\n\nWe've had that though, mostly planned for -- moderately planned for within our numbers in all the guidance that we've shared over the past couple of quarters. So the inflation or the challenges that are being experienced, we've had baked in and we've been planning for a number of quarters now.\n\nOperator\n\n[Operator instructions] The next question is from Marni Shapiro with Retail Tracker. Your line is open.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nHey, guys. Thanks for all the detail on everything. Morning. I wanted to just touch base on a couple of things here.\n\nThe first is, I think you said that August had improved a little bit. And I'm curious if you thought this was macro as people were thinking about heading back to the office or if this was something that you were at your own stores to drive the sales.\n\nTim Baxter -- Chief Executive Officer\n\nI think it's actually a combination of both, Marni. If I -- it's difficult to decouple a lot of these things. But I would say it's a combination of both things. We have seen, as I said, improvement in each of the last few weeks.\n\nAnd I do think that we are certainly seeing as women, in particular, have gotten kids back to school. They are now shifting into that mindset of going back to work. We also are seeing and hearing about many companies who are actually going back to work, at least part time, some full time in the office following Labor Day. So I think we're beginning to see that.\n\nI also think that, as Matt mentioned earlier, while modern tailoring was great for us in women's in the second quarter, we didn't actually have enough of it. So as we've moved it into August, and certainly as we move into September, our inventory in those key categories also grows. And so I think that's also been a part of that improvement that we've seen. And like I said, the relaunch of the Editor, which we're excited about and the Portofino coming.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nActually, I just wanted to stick on that trend. A couple of things stuck out to me. I think you -- the outlet business seems pretty good. You talked about a trade-down on value.\n\nI'm assuming that goes hand-in-hand, and she was going to the outlet. But I'm curious, even in the full-line stores in the outlet, was she more value-conscious about the fashion and less so about the tailoring and where to work. Was there a difference between the trends within those segments?\n\nTim Baxter -- Chief Executive Officer\n\nYes. Yes, actually. We continue to drive much higher average unit retails in modern tailoring. And in those categories that we're really well known for.\n\nAnd fashion seems to be where she became much more value-conscious. I think we obviously saw strength in our outlet channel, which points to that more value-conscious consumer. And obviously, as the competitive environment around us got much more aggressive from a pricing perspective, I do think that impacted our sales in the fashion product.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nAnd then, I guess, also along those lines, you had -- I mean just and insanely stellar first quarter and even this sets into the early second quarter. as you came through the second quarter, which is typically in the mall and for you guys a sale period end of summer, are you finding that with new product coming in, just coming back to the fashion, I feel a little bit like your customers always craves what's newest and second quarter is never the period of time that has the most new product.\n\nTim Baxter -- Chief Executive Officer\n\nAbsolutely. Absolutely. And when you pair that with the fact that we were not as aggressive on sale as many of our competitors, I think that you nailed it, Marni. She is responding, She and he are both responding to the newness in August, which, as I said, I believe, has contributed to that improvement that we've seen over the past few weeks.\n\nAnd certainly, as we move into fall and into September, which, as you know, becomes a much more fashion-driven month, I expect that we will see continued improvement.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nThat's fantastic. And then just one last on the Portofino and on the Editor at with the relaunch. Are we -- please tell me we're not going back to you like the piles and racks of the Portofino -- so much...\n\nTim Baxter -- Chief Executive Officer\n\nYes. We are absolutely -- you are not going to see walls of Portofino. Absolutely not. But what you will see is different iterations, much more modern iterations of the Portofino.\n\nAnd we are in a short cycle, which means the Portofino is more relevant than ever. But you are not going to see walls and walls and walls full of the same exact Portofino in 14 colors and 14 prints. That is not happening. I could -- but I think you'll be excited about the much, much more modern approach that we're taking to that iconic style.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nFantastic. And then last question. Are you anticipating AUR growth in the back half of the year?\n\nJason Judd -- Chief Financial Officer\n\nWe are. We are anticipating AUR growth in the back half of the year. While we are anticipating to Tim's point, more targeted promotions than maybe we had in Q2, we definitely still expect AUR to expand in the back half of this year. especially on the new and highly relevant product that Tim just referenced.\n\nTim Baxter -- Chief Executive Officer\n\nWe will use our clearance. As I said, we will use our clearance to drive a value message. The composition of our clearance is far better than it's been in the past as we've made so much improvement to the product. So we will use clearance to drive the value message and just be much more targeted in our approach on promotions and regular priced product.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nWas the AUC -- remind me, was AUC up in the back half? Or will it be up in the back half of the year as well and you'll still drive the margin?\n\nJason Judd -- Chief Financial Officer\n\nYes. Yes.\n\nOperator\n\nThere are no further questions at this time. Mr. Baxter, I'll turn the call over to you for any closing remarks.\n\nTim Baxter -- Chief Executive Officer\n\nThank you for joining us this morning. Have a good day, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGreg Johnson -- Vice President, Investor Relations\n\nTim Baxter -- Chief Executive Officer\n\nJason Judd -- Chief Financial Officer\n\nEric Beder -- Small Cap Consumer Research -- Analyst\n\nMatt Moellering -- President and Chief Operating Officer\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nMore EXPR analysis\n\nAll earnings call transcripts"
}