{
  "companyName": "Ambarella",
  "companyTicker": "AMBA",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/ambarella-amba-q2-2023-earnings-call-transcript/",
  "content": "Ambarella (AMBA 1.51%)\nQ2 2023 Earnings Call\nAug 30, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to Ambarella's third quarter 2023 earnings conference call. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question-and-answer session.\n\n[Operator instructions]. I would now like to hand the conference over to your speaker for today. Louis Gerhardy, you may begin.\n\nLouis Gerhardy -- Corporate Development and Investor Relations\n\nThank you, Towanda, and good afternoon. Thank you for joining our second quarter fiscal year 2023 financial results conference call. On the call with me today is Dr. Fermi Wang, president and CEO; and Brian White, CFO.\n\nThe primary purpose of today's call is to provide you with information regarding the results for our second quarter of fiscal year 2023. The discussion today and the responses to your questions will contain forward-looking statements regarding our projected financial results, financial prospects, market growth, and demand for our solutions, among other things. These statements are subject to risks, uncertainties and assumptions. Should any of these risks or uncertainties materialize or should our assumptions prove to be incorrect, our actual results could differ materially from these forward-looking statements, and we're under no obligation to update these statements.\n\nThese risks, uncertainties, and assumptions as well as other information on potential risk factors that could affect our financial results are more fully described in the documents we filed with the SEC, including the annual report on Form 10-K that we filed on April 1, 2022, for fiscal year 2022 ending January 31, 2022, and the Form 10-Q filed on June 8, 2022, for the first quarter of fiscal year 2023. Access to our second quarter fiscal 2023 results press release, transcripts, historical results, SEC filings, and a replay of today's call can be found on the investor relations portion of our website. Fermi will provide a business update for the quarter. Brian will review the financial results, then we'll all be available for your questions.\n\nWith that, I'll turn it over to Fermi.\n\nFermi Wang -- President and Chief Executive Officer\n\nThank you, Louis, and good afternoon. Thank you for joining our call today. Q2 results were mostly as expected. Revenue was down 10% sequentially, and up 2% versus the year-ago quarter.\n\nCV revenue increased significantly on a year-over-year basis, driving our blended average selling price above $10. We have cumulatively shipped more than 10 million CV SoCs, including more than 20% into the automotive market. And we remain on track to achieve our prior estimate that CV will represent about 45% of our total revenue for the year. In Q2, we absorbed the worst from both the China lockdown and the 14-nanometer shortage, and the incomplete kits remain a bottleneck for many of our customers.\n\nCollectively, we should see some improvements from these factors in the second half, but our recovery outlook is tempered as some customers are now reducing their inventory levels, in particular, a lead time contract. In July, we commenced a global roadshow to leading automotive Tier 1s and OEMs with a live demonstration of our CV3 SoC. As a reminder, CV3 is our first central domain controller integrating in a single monolithic die all of Ambarella's core competencies, including perception processing from cameras, radars, sensor fusion, and path planning as well as our functional safety and application software. Just 1 month after the SoC came out of the fab, we demonstrated full functionality across multiple live cameras to many global automotive OEMs and Tier 1s.\n\nThe superior performance and efficiency as well as the scalability of our SoC roadmap were clearly recognized and well received, leading to many follow-on development discussions. Now we expect to be able to share more about some of these customers' engagements by the end of the year. We are also proud to announce that CV5, our first five-nanometer SoC, entered production in Q2, at least a quarter ahead of expectations. We have three IoT customers that each purchased production volume in Q2, and we are engaging with many other companies developing their first CV5 products.\n\nI will now provide some examples of our market development activity where production has already or is expected to commence this year. Toyota introduced its 16th generation 2023 Toyota Crown model, featuring a two-channel digital video recorder based on Ambarella's CV25AX AI processor, capable of recording from both the ADAS system and the electronic mirrors, the car recorder is supplied by Japanese Tier 1 Denso-Ten. BMW began shipping two dash cameras models, the Advanced Car Eye 3.0 and 3.0 Pro, providing both front and rearview recording. Based on Ambarella's H22 video SoCs, the dash cams will be sold in over 80 markets with the Chinese version also including electronic toll charging features.\n\nIn June, China-based FAW Hongqi introduced its latest generation of B-class cars. The H5 sedan includes an L2 ADAS system based on our CV22AQ automotive SoC and supplied by Tier 1 neusoft. Also in Gen China-based Dongfeng introduced its Haoji SUV. The SUV includes an occupant monitoring system based on our CV28AQ and supplied by Tier 1 BCS.\n\nAnd in August, Israel-based Cipia announced Chery's SUV will integrate Cipia's Driver Sense DMS running on Ambarella's CV28 AI processor. The integration of CV28 and driver sense software utilized neural networks to offer robust driver monitoring capabilities. I will now talk about some of the new IoT product announcements. Johnson Controls introduced its 4th generation Illustra Flex camera series, including mini-dome, PTZ, and bullet models based on our CV28S AI SoCs.\n\nAlso during the quarter, Ubiquiti announced its AI bullet camera, based on our CV25S AI SoC, the four megapixel camera includes smart detection of people and vehicles. Korean IP-camera maker, IDIS, launched four-view eight mega pixel and six mega pixel PTZ cameras based on our CV28 and the CV22 SoCs. The cameras are designed for wide area surveillance operations with the capability to identify objects and recognize face at distance of up to 300 meters. Japan-based iPro introduced a new two-megapixel machine vision camera aimed at manufacturing sites and based on our CV22 AI SoC.\n\nThe camera performs automatic visual inspections and supports up to 100 different object types, for example, detecting the presence of cables and the connectors, different colors or the presence or polarity of electrical components. Also in Japan, JVC introduced its new PZ2510 videoconferencing camera focusing on live broadcast and recording applications such as concerts and lectures. Based on Ambarella's CV22 AI SoC, the camera supports full 4KP60 video streaming face detection, automatic tracking and wide viewing angle.  In other IoT markets, Insta360 introduced two new products based on our H22 video SoCs. The Insta360's Sphere is an accessory for drone and works by placing one camera above the drone and one below to create a seamless spherical image.\n\nIn the smart home IoT market, Insta360's Link is an AI-powered 4K video conference device using a three-axis gimbal design and powerful AI tracking, automatic zooming and framing to ensure that the presenter is always center stage. This representative engagement, a majority of which are based on our higher-value CV SoCs, provide insight into the early and the continued success of our strategy. We have successfully leveraged our human-viewing perception processing expertise into the larger machine sensing market, addressing megatrends such as security, safety and automation. This machine-sensing unit opportunities are incremental and much larger than the human viewing market we have and will continue to serve.\n\nFurthermore, we are demonstrating we can capture more value in the sensing applications from incremental processing functions such as radar and other sensor perception, sensor fusion and planning, functional safety, and application software. CV3 ties all this functionality together. So we are confident that we are implementing the right strategy and demonstrating early signs of success. Despite the current market turmoil, we will continue to drive our organic R&D investments to fully realize these market opportunities, leveraging our leadership position in the AI endpoint market.\n\nWith that, Brian will now provide our prepared financial comments.\n\nBrian White -- Chief Financial Officer\n\nThanks, Fermi. I'll review the financial highlights for our fiscal second quarter and provide a financial outlook for our third quarter ending on October 31, 2022. I'll be discussing non-GAAP results and ask that you refer to today's press release for a detailed reconciliation of GAAP to non-GAAP results. For non-GAAP reporting, we have eliminated stock-based compensation expense and acquisition-related costs adjusted for the impact of taxes.  Revenue for fiscal Q2 was $80.9 million, slightly above the midpoint of our prior guidance range, down 10% sequentially and up 2% year-over-year.\n\nAs expected, supply chain-related disruptions were the primary factor in the sub-seasonal performance, and both IoT and auto revenue declined sequentially. Non-GAAP gross margin for fiscal Q2 was 64.5%, above the high end of our guidance range of 63% to 64%. Our gross margin outperformance was driven by a higher mix of NRE revenue than originally expected.  Non-GAAP operating expense for the second quarter was $44.2 million, compared to $39.8 million in Q1. This was $700,000 above the midpoint of our prior guidance range of $42 million to $45 million driven primarily by engineering materials for new products.\n\nOur non-GAAP tax provision was $361,000 or 4.5% of pre-tax income, and we reported non-GAAP net income of $7.6 million or $0.20 per diluted share. Now I'll turn to our balance sheet and cash flow. Cash and marketable securities decreased by approximately $3 million as unusual working capital benefits in the prior quarter reversed and metrics normalized. You'll remember that in the prior quarter, accounts receivable benefited from a front-end revenue skew and inventory declined.\n\nFor fiscal Q2, DSO increased to 43 days from 28 days, and days of inventory increased from 117 to 125. We had two logistics and ODM companies represent 10% or more of our revenue in Q2. WT Microelectronics, a fulfillment partner in Taiwan that ships to multiple customers in Asia, came in at 59% of revenue. Chicony and ODM who manufactures for multiple IoT customers was 13%.\n\nI'll now discuss the outlook for the third quarter of fiscal year 2023. While we expect some improvement in the second half from the broad supply chain disruptions, we have started to see some customers reduce the amount of inventory they're willing to carry into year-end, in particular, as component lead times contract. Our guidance to the best of our knowledge at the current time contemplates these challenges. We estimate our Q3 revenue to be in the range of $81 million to $85 million, or approximately flat to up 5% sequentially.\n\nWe estimate Q3 non-GAAP gross margin to be between 63% and 64%. We expect non-GAAP opex in the third quarter to be in the range of $44 million to $46 million, with the increase compared to Q2 coming primarily from increased head count and sales activities taking place during the quarter. We estimate net interest income to be approximately $400,000, our non-GAAP tax rate to be in the range of 4% to 6% and our diluted share count to be approximately 39 million. Ambarella will be participating in Deutsche Bank's technology conference on September 1, Credit Suites' Virtual Asia technology conference on September 6, Citi's technology conference on September 8, and UBS' virtual future of mobility conference, October 3.\n\nPlease contact us for more details. Thank you for joining our call today. And with that, I'll turn the call over to the operator for questions.\n\nOperator\n\nThank you. [Operator instructions]. Our first question comes from the line of Matt Ramsay with Cowen. The line is open.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nThank you very much. Good afternoon, guys. Congratulations from me on sampling CV3. I wanted to ask if you could give us a few updates and anecdotes as to how the sampling is going with customers? Maybe how many customers have formally sampled, what those engagements have been like and sort of the early performance feedback on the part relative to what you guys had modeled and just how the software portals to CV3 are going with the customer samples.\n\nThanks.\n\nFermi Wang -- President and Chief Executive Officer\n\nRight. So first of all, we demoed to maybe roughly two dozens of customers, including Tier 1s OEMs. I think there are three important takeaways from the demos. First of all, all of the customers are very impressed that we give a very thorough demo four weeks after the chip come back from the fab.\n\nThe demo we gave was a live board with CV3 sitting in middle, and we're taking multiple camera live video. And those live video goes into CV3, and we do our standard image processing for all of the cameras and the process of video went to both our compression engine as well as the CV flow engine. And the CV flow engine running multiple different neural networks that's important for the autonomous driving. And we -- all the video went through that neural network processing.\n\nAnd the end result, both in the process of video plus the neural network results are displayed on a TV monitor. So you can imagine that this is a very thorough demo, which pretty much touch over all of the important data path of this big die. And we can do that in four weeks after the chip came back. It shows you that not only we have a stable chip, but also our fundamental software side is good enough and solid enough to give life demo.\n\nAnd I think all our customers are surprised, and I'm glad to see that. The second thing is the most important is the performance like you said. In fact, before we had demoed CV3, we told all our customers the performance expectation they have. And in fact, we hit those expecting right on, and we did surprise with our real chip.\n\nAnd in fact, that's a big surprise to them because they are used to see people given the higher projection on the data -- on the people presentation and on the real chip show up, the performance a little lower. But in our case, we definitely deliver as we advertised for CV3. That's a second takeaway.  The third takeaway is power consumption. We also give our customer projections, the potential power number and we hit the power number we talk about.\n\nSo in summary, basically, we show people that we have a chip that can run multiple times CV performance than our competitors, had a small portion of power consumption and -- which is like demo, which is not a PowerPoint presentation anymore. So I think that's really hit our customers, giving them a very good impression about our CV3. And the next important milestone is to provide our hardware and SDK -- software SDK for our customer to do software development and also -- and reporting the neural network. So I think that's something in progress, and we are engaging customers as we're speaking.\n\nSo hopefully, that we'll continue to be able to report more. And as I said in my script, we believe that we will be able to give you more updates on our customer engagement by the end of the year.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nThank you for all that. That's really helpful. And congratulations on the progress. As my follow-up, Brian, I wanted to ask about some of the customer kitting issues and your commentary about the potential for customers to want to hold less inventory into year-end.\n\nAny way to quantify what that impact is to maybe the second half of the fiscal year? And if you have any color on which geographies, which specific end markets you're seeing that inventory coming down or folks being willing to take less inventory. Any anecdotes there would be really helpful.\n\nBrian White -- Chief Financial Officer\n\nSure. Well, we gave you our outlook for revenue for fiscal Q3. We're not going to venture out into Q4 at this point. But in terms of where we're seeing this type of feedback, it's with customers in various areas.\n\nSo it's not specifically targeted to a single exposure. I think we're in a situation where customers have been experiencing supply disruptions for quite some time, right? And those disruptions are beginning to abate to some extent. Things are getting a little bit better. But they're also looking ahead to some of the economic risks that could be on the horizon, and the uncertainties associated with that.\n\nAnd so there's, I think, a return to a focus on inventory management that maybe didn't exist for a period of time, particularly as we head into the end of the calendar year. So we are getting some requests for pushouts from various customers, and we're reflecting that in the guidance we provided.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Joseph Moore with Morgan Stanley. Your line is open.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. Following up on that last question, on the customer inventory stuff. When you talk about lead time contraction, is that your lead time? Or is that lead time for other components? And then I had a follow-up.\n\nFermi Wang -- President and Chief Executive Officer\n\nI think we're talking about both, but I can talk about our only lead time changes. At a peak, our lead time was at roughly 40 weeks. Now we are talking about roughly at 30 weeks. And before COVID, our normal lead time was 24 weeks.\n\nSo I think we are gradually going back to normal, and that's basically talking about our lead time, but I think we also noticed some of the components -- all our components of our partners also are showing a lead time contractions.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nOK. That's helpful. And then in terms of thinking about October, I know you normally get kind of a seasonal ramp in the consumer-centric businesses, both in surveillance and other consumer. And you're coming off of a quarter where your revenues were depressed by the foundry issue.\n\nSo are you still seeing that kind of seasonal impact, and it's being offset by these other issues that you're talking about? Or is the impact that's hitting you kind of more on the -- more seasonal products? Can you just kind of describe -- it seems like there's a pretty big fall-off in something if you're getting that normal seasonal ramp. I just want to make sure I understand.\n\nFermi Wang -- President and Chief Executive Officer\n\nRight. So, Joe, I think, first of all, those three supply chain issue we have been talking about, although it's kind of a reduced, but didn't go away, even for second half we believe will persist, but in a lesser degree. On top of that, we just talked about the inventory reduction at the customers. I think those two things are probably the major factors.\n\nAnd also, I think this is a really unique here. With other supply chain situation that we're monitoring, geopolitical situation, I have to say, I don't think that our normal seasonality applied this year.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGot it. OK. Thank you.\n\nOperator\n\nThank you. Please standby for our next question. [Operator instructions]. Our next question comes from the line of Vivek Arya with Bank of America.\n\nYour line is open.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my questions. Actually, I have a clarification, and two quick questions. Brian, you mentioned there were some NRE revenues that helped to improve gross margins. I was hoping you could quantify how much in incremental NRE, in Q2? And what's embedded in your Q3 outlook?\n\nBrian White -- Chief Financial Officer\n\nYes. Vivek, so we don't break that out specifically, but just to give you an idea, NRE for the company typically runs in the 1% to 2% of total range. And in the second quarter, total NRE was kind of low to mid-single digits in terms of millions of dollars of revenue. And it's going to be lumpy as we go forward.\n\nBut as we look at the near term, Q3 -- fiscal Q3, for example, we see that normalizing and returning back to kind of a typical run rate. But I think as we go out further in time and we have more activities associated with CV3 and so on, it's possible that, that starts to become a slightly larger portion of the overall revenue mix. We're not quite there on a sustained level yet.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And on the inventory reduction by your customers, is that more on the automotive side? Is that more on the IoT side? Because on the automotive side, when I look at the results and outlook for most of the other automotive-exposed semiconductor suppliers, they seem to have been pretty strong, at least in the near term. Obviously, I understand that every company is supplying different kinds of component, so it might not be exactly apples-to-apples. But I'm curious, where are you seeing the somewhat softer demand signals? Is that more automotive or more IoT?\n\nFermi Wang -- President and Chief Executive Officer\n\nNo, I think you are right. We see a little inventory reduction on the automotive customer. In fact, they are 25% of total revenue. But the balance of the business on the security -- IoT side, particularly security camera side, we do see our customers trying to reduce the inventory.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And then finally, your overall inventory kind of stands out, right, because it has now reduced for the fourth straight quarter, which is kind of an anomaly in the sector where inventories are up for most of the semiconductor suppliers. What is the right way to view the lower level of inventory on your balance sheet? Is it a signal of your demand outlook for the next two to three quarters? Is it something -- what is the right way to look at -- you're being able to manage with lower levels of absolute dollars of inventory?\n\nBrian White -- Chief Financial Officer\n\nYes, Vivek. Inventory has declined in the last couple of quarters in dollar terms. But if you look at the second quarter, it actually was up in terms of days because COGS was down in the quarter. So we went from -- I think we're about 170 days of -- 117 days of inventory in Q1, and we were about 125 in Q2.\n\nSo that's a relatively elevated level in terms of days of inventory for the company. But we've been running at a higher relative inventory level because of all the supply disruptions to try to buffer ourselves from some of those gyrations. So if you think about it longer term, if we can get all these supply issues behind us and get to something of more of a normalized state. I would expect we should be running under 100 days of inventory in the future.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThanks very much.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Gary Mobley with Wells Fargo. Your line is open.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nHey, guys. Thanks for taking my question. I appreciate the disclosure about how your blended ASP is now trended above $10, but maybe if you can give us some baseline in terms of thinking about it on a quarter-over-quarter basis, year-over-year basis and how that compares to your unit growth.\n\nFermi Wang -- President and Chief Executive Officer\n\nSo I think what we can say is that since we introduced our CV product line, our ASP continue to grow, and we expect the growth will probably continue at the whole year. When we get CV3 -- or CV3 family of products into production, the ASP continue to expand. I think the unit number-wise, I think this is a two separate issue. In fact, where we lose the majority of our unit number is with high vision [Inaudible] the ASP is very low, which is probably the lowest ASP business in the last several years.\n\nAnd we basically lost that business. And so that also helps to improve our ASP -- companywide ASP. But I will say that overall, our ASP growth will continue based because of our CV flow product line.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nOK. Thanks for that color, Fermi. And I wanted to confirm that the Samsung 14-nanometer supply issue, the lingering impact in the July quarter was as you approximated $5 million, and I wanted to be clear that, that's no longer a headwind looking into the October quarter. Is that right?\n\nFermi Wang -- President and Chief Executive Officer\n\nWell, I think first of all, the $5 million in July quarter is true. And in October, I think it's much less, but we will consider when we give that guidance.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nOK. All right. Thank you, guys.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Blair Bossa with [Inaudible]. Your line is open.\n\nUnknown speaker\n\nYes. Great. I just had a question on CV5. I can see it's now entered into mass production ahead of schedule.\n\nBut just on this, could you talk us through how you see the adoption of CV5 over the next six to 12 months just so we could think about so the revenue curve over the next year? Do you see -- expect a sharp adoption, and could it be an important growth driver for the business? Any color on how to think about it as the hot side the revenue stream would be helpful.\n\nFermi Wang -- President and Chief Executive Officer\n\nRight. I think you should consider CV5 as our next-generation high-end CV4 engine. And the target application is a high-end enterprise class security cameras, the enterprise videoconferencing system as well as some home application -- high-end home location. So -- and almost all of our security cameras, if they do high-end products, they are looking at CV5.\n\nAnd some of them, like I said, while they will take that into production this quarter and multiple will taking that into production in the second half of this year. So I think CV5 revenue will start second half of this year and ramp up next year. It definitely helps us on the ASP expansion as well as helping us to maintain our gross margin.\n\nUnknown speaker\n\nOK. Great. That's helpful. And then I guess just as a follow-up.\n\nIn terms of the two segments, IoT, and automotive, I know you mentioned the decline sequentially in the quarter. Could you give us any color about how to size them in the quarter as they did as a percentage of sales? And then I suppose just to add to that, looking at the Q3 guidance, could we expect something similar for the October quarter?\n\nFermi Wang -- President and Chief Executive Officer\n\nCan you repeat the question?\n\nUnknown speaker\n\nYes. So I guess just in terms of the two segments, if you look at IoT and automotive. I was just hoping for any more color about the size of them in the quarter, what they did as a percentage of sales? And then just to add to that, for the Q3 guidance, could we expect something similar in the October quarter?\n\nLouis Gerhardy -- Corporate Development and Investor Relations\n\nYes. This is Louis speaking. So auto and IoT, roughly the same when you consider everything included, including the NRE. And the outlook for Q3 is to have both of these areas growing sequentially.\n\nUnknown speaker\n\nThank you.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Ross Seymore with Deutsche Bank. Your line is open.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nHi, guys. Thanks for taking my question here. On the automotive side, it seems like it's been at about that 25% of revenue range. Now given the answer to the prior question, it seems like for three quarters in a row.\n\nWhen do you expect that to really accelerate? I know it takes longer in the CV stuff, the majority of that's been impacting to the benefit of the IoT side. But how do you think about the growth rates of the two segments? And specifically automotive, when should we expect either a steer step-up or a bigger ramp given all the design wins that you've highlighted in the preamble, Fermi?\n\nFermi Wang -- President and Chief Executive Officer\n\nI really think that the next important milestone for us in terms of automotive revenue growth is that one major OEM take ADAS Level 2+ car into production, right? So that's really the key for us to provide long-term growth. I think although automotive revenue will continue to grow, but I think the step function I'm looking for is really the -- like I said, major OEM take ADAS into the market.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nAny sort of rough color of when that may occur? Is that something that you think you have the design wins? Or is that going to be more CV3 dependent, so it's a couple of years out, given the design cycles? Any sort of rough color on that?\n\nFermi Wang -- President and Chief Executive Officer\n\nI think CV2 will give us some boost, and -- but like we said in the past, right, and the CV3 because of the ASP will really provide the biggest jump for us. But I think between now and the CV3 in production, you should continue to see our automotive revenue growth.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Tore Svanberg with Stifel. Your line is open.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nThank you. I know you're not going to comment beyond Q3. But just thinking about the lead times and the sort of inventory adjustment, do you think that you'll be down to sort of the mid-20s lead times during the October quarter? Or when you talked about sort of going from 40 to 30, that process started a little bit later.\n\nFermi Wang -- President and Chief Executive Officer\n\nWell, I think 30 is now. And whether we'll move to 20, 24, like before, it would really depend on our supply chain, right? So I think it will take a while because there's still -- I think, on the high-end process node, probably 30 will be stable for a while. So I wouldn't expect that to happen -- go back to 20, 24 immediately. However, I think the trend is there, and I think our customer is really reacting to the trend, expecting that the lead time will go back to normal soon.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nVery good. And as my follow-up, can you confirm that you're going to be updating us on your sort of vehicle revenue funnel 3.0 next quarter? And since you're obviously not going to share data now right now, could you at least talk qualitatively about how that funnel continues to improve?\n\nFermi Wang -- President and Chief Executive Officer\n\nWe definitely will give you update on the 3.0 in November.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nOK. Any comment qualitatively or jumping the gut here?\n\nFermi Wang -- President and Chief Executive Officer\n\nI think we are a little -- three months too early to talk about.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nAll right. Very good. So since you're not going to answer that question, I'll have one last one. So could you just elaborate a little bit on the supply chain dynamics? I know you talked about the 14-nanometer but I also know there's been maybe some potential yield issues at 10-nanometer.\n\nNow that you are in production in five-nanometer, how do you feel the yield improvements are going on with your current supplier? Thank you.\n\nFermi Wang -- President and Chief Executive Officer\n\nRight. So there are a lot of news article of Samsung's five-nanometer. But I think it's -- based on our experience, when we start working with Samsung five-nanometer yield, it was a problem. But now we are ready to production.\n\nAnd in fact, we are in production for -- in Q2. And I can say that the yield is not a problem. It can be -- continue to be improved. But I don't think that's a problem for us anymore because we have been working with our foundry supplier for many years.\n\nAnd for any advanced node, it's a similar experience at beginning that the yield is low, and we work together with our foundry partner to improve it. And I think at this point, I won't -- I think this five-nanometer yield is definitely in a normal range and can be further improved in the near future.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nThanks. Great. Respect it. Thank you.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Suji Desilva with ROTH Capital. Your line is open.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nHi, Fermi. Hi, Brian. You talked about the CV3 and some of the implementations there, you talked about some NRE perhaps. Can you just talk about how the design -- how long design cycle there as relative to prior products? I know it sounds more software intensive.\n\nAnd whether tier 1s, I know tier 1s would be part of getting that established through the industry? Thanks.\n\nFermi Wang -- President and Chief Executive Officer\n\nI think, first of all, the desire -- for any Level 2+ design win, I think it's going to take probably three to four years into production in -- outside China. Inside China, maybe a little faster than that. But I think the from a design win momentum, I think we're talking to both OEM and Tier 1s. We think that both are very equally important.\n\nOEM want to make a decision and try to control software, but still they need a Tier 1 to deliver the final product. We need to work closely with our Tier 1 partner to deliver those final products. So I think we -- that's why when we went out to demo CV3, we went out to both -- all the major Tier 1s as well as the major OEM to make sure they see the capability and the potential of CV3. And so when they talk each other to make a decision on the design wins that they will consider CV3.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nOK. That is very helpful. And then on the Oculii acquisition radar, can you just update us on what expectations are for incremental fundamental contribution, revenue contribution or how we should think about that over the next few quarters as you integrate that in.\n\nFermi Wang -- President and Chief Executive Officer\n\nRight. So first of all, we didn't break up with Oculii radar revenue per quarter, but we gave a guidance of probably $3 million to $4 million this year. I think we are close to that. And we're going to continue to monitor the current -- the progress that we made with our current customer.\n\nAnd we did talk about there are a few design wins that we're working on. Hopefully, we'll see results in the next year, and for the ramp up revenue. I think there's another very important milestone, I think you should track is when we can demo Oculii so far running or CV3 silicon, which will probably -- the first silicon platform that can do sensor fusion with video data and the radar data at the same time. And like I said before, that's really important for us to provide not only just better perception and sensor fusion to our customer, but it provides huge savings to our customers, too.\n\nSo I think that also is an important milestone that we're trying to hit.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nAll right. Thanks, guys.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Kevin Cassidy with Rosenblatt. Your line is open.\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nYes. Thank you for taking my question. Just as you're looking at the opportunities for CV3, is there a difference between consumer vehicles and, say, robo-taxis and shuttles? Is there a shorter time to market or anyone that might be better suited for the CV3?\n\nFermi Wang -- President and Chief Executive Officer\n\nWell, I think for both consumer and the commercial vehicle outside China, design cycle is probably similar because even for commercial vehicle, people also want to have a auto-grade silicon hardware -- silicon and software. Inside China is a little different, and people are more willing to introduce product and test on in the market. So I think that's a different to different timing. And definitely, we will try to take advantage of the shorter design cycle in China, I see where we can quickly introduce some product there.\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nOK. Thanks. And going back to the NRE question, is Oculii part of that NRE revenue?\n\nFermi Wang -- President and Chief Executive Officer\n\nYes, it is.\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nOK. That's expected to go forward, also?\n\nFermi Wang -- President and Chief Executive Officer\n\nI think now we are engaging with a new customer after we acquired them, yes, we expect that we're going to see new revenue opportunities with radar, also.\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Andrew Buscaglia with Berenberg. Your line is open.\n\nAndrew Buscaglia -- Berenberg -- Analyst\n\nHey, guys. Into the quarter, I think there was some optimism growing around some decision-making, moving forward with some automotive OE, just given -- we saw other announcements or some adjacent technologies, specifically VW. So what -- I understand the inventory commentary, but what about your conversations with just generally in the automotive space around decision-making moving forward. Because as you said, these cycles, you would think we should start to see some movement near term despite what we're seeing around the latest on the inventory side.\n\nFermi Wang -- President and Chief Executive Officer\n\nSo you are talking about CV3 engagement?\n\nAndrew Buscaglia -- Berenberg -- Analyst\n\nYes. Yes, CV3, more so your latest technology, your latest shift that you're -- yes, specifically, CV3.\n\nFermi Wang -- President and Chief Executive Officer\n\nSo first of all, the CV3 engagement, like I said, we have done well with the first phase of demos, and we need to follow up with a lot of engagement on the engineering side to help customers to put software, to put neural network and demo the system. So I think that's definitely an important one. At the same time, for future -- I should not say -- we are developing derivative chips in the CV2 family so that we can address different applications. So for example, we are working on another silicon -- five-nanometer silicon for auto grade chip, which is going to be enabling our customer to go into production in 2025 -- '24, '25.\n\nAnd that's definitely the chip that we are working on, and we're going to continue to work on different derivative of CV chips. And that is definitely an important investment strategy for us moving forward. I hope that answers your question.\n\nAndrew Buscaglia -- Berenberg -- Analyst\n\nWell, I guess that was more so in terms of being able to announce the design wins, just that we're seeing some movement and we are seeing some decision-making move forward with some adjacent technologies. I guess where does CV fit in there? I would think that you would start to see some movement even despite these inventory pressures.\n\nFermi Wang -- President and Chief Executive Officer\n\nSo I think like in our script, we talk about -- we believe we can give you more update in -- before year of the year. There are two things we're going to give you indication. One is we're going in November, we want to give a final update, which will probably give you indication how we're doing with the OEM in terms design wins as well as we're going to talk about CVG engagement, we said probably by the end of the end of the year, we will talk about that. So hopefully, that will continue to provide you input.\n\nAndrew Buscaglia -- Berenberg -- Analyst\n\nOK. OK. And then maybe when you're talking about customers around specifically the sampling CV3, is there regionally any sort of bias you're seeing more interest in one region versus the other, whether it be U.S., Europe or Asia, or too early to tell?\n\nFermi Wang -- President and Chief Executive Officer\n\nIn fact, we -- among the 2,000 customers, over -- I think it's global, and we talk to almost every place, including China, Japan, Korea, Europe, and the U.S. So I think we probably talk to the target customer that we want to talk to in the last few weeks.\n\nLouis Gerhardy -- Corporate Development and Investor Relations\n\nYes. Andrew, just to give you some more perspective on what's at play here. This is our first central domain controller -- and so you go through a sequential process where we had introduced the product idea to customers in the last couple of years. And as Fermi described, we've gone through the demonstration process, almost several dozen customers on a global basis of now seeing the board and operating live.\n\nAnd then the next step that we described is providing the SDKs and EVKs where they can begin to port their own software onto the chip. And as you move through this progression of steps, a series of steps, customers will feel more comfortable to make that decision, and we're still saying we expect to provide an update on where we're at by the end of this year.\n\nAndrew Buscaglia -- Berenberg -- Analyst\n\nOK. All right. Thanks, Louis. Thanks, Fermi.\n\nFermi Wang -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Richard Shannon with Craig-Hallum. Your line is open.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nHi, guys. Thanks for taking my question. I think just one question for me and following up on the topic of CV3 here. Well, I know the discussions in demos are very early stage here.\n\nFor wondering what you see in terms of future discussions and competitive sourcing dynamics with large automotive customers. Do you expect them to be choosing one domain controller across the entire portfolio? Or do you expect them to possibly use two or more? In other words, is this an all or none situation? Or is there kind of a split situation over time?\n\nFermi Wang -- President and Chief Executive Officer\n\nIt's interesting because a lot of the companies that we talk to always start with -- they want to choose one because of software. But at the end, I think they all understand the risk of taking only one. So I think it's -- there's a chance that some people will take two and also the chance that someone will take one between these two possibilities.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nOK. Great. Look forward to, again, update on that, but thanks for that perspective. That is all for me, Fermi.\n\nThank you.\n\nFermi Wang -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Tristan Gerra with Baird. Your line is open.\n\nTristan Gerra -- Baird -- Analyst\n\nHi. Good afternoon. You've mentioned that the CV5 will start ramping the second half and into next year. Should we assume that CV5 is going to be material to your revenue the second half? And is it material to your Q3 guidance? Or is it just initial shipments and then it becomes more meaningful next year?\n\nFermi Wang -- President and Chief Executive Officer\n\nI will say that the meaningful revenue come from next year. This Q3 and Q4 will be a ramp-up time for several customers, but I think meaningful revenue probably will probably move toward to Q1, Q2 next year.\n\nTristan Gerra -- Baird -- Analyst\n\nOK. And then you've mentioned as my second question. The -- some inventory deleveraging across customers, both on the automotive and the IoT side. And I just wanted to get any color that you could provide specific to the China automotive market? How high are inventory levels right now? And have you seen pushouts or delays either in terms of deliveries or new projects? How is the situation there? And how do you expect it to evolve over the next several quarters?\n\nFermi Wang -- President and Chief Executive Officer\n\nYou're talking about China market, right?\n\nTristan Gerra -- Baird -- Analyst\n\nYes. Automotive.\n\nFermi Wang -- President and Chief Executive Officer\n\nYes, China automotive. So I think if you talk about China Automotive, I will say that you need a separate consumer versus commercial vehicles. I think China commercial vehicles are facing severe problems in terms of demand, which is a smaller market. On the consumer vehicle, I think inventory, we haven't seen -- we're still -- that market is still facing show supplies.\n\nAnd so that's why we haven't seen any revenue reduction -- sorry, the inventory reduction in the Chinese consumer automotive at this point.\n\nTristan Gerra -- Baird -- Analyst\n\nAnd when would you expect then this supply to get back in balance? And will that create more of a slowdown on your existing revenue base to the automotive end market in China by then?\n\nFermi Wang -- President and Chief Executive Officer\n\nI'm not sure because I don't know exactly what the inventory level of our current customers. For our chip, right, I can imagine that some that probably build a little bit of inventory some people will be conservative. So it's really going to be customer-by-customer discussion. For example, even for IoT, not all of our customer has inventory problems.\n\nSome people are more conservative in terms of building up inventory. So the inventory reduction is more minor for them. But there are some customers that have been aggressive building our inventories throughout the last 24 months. And definitely, there is a long time for them to digest inventory.\n\nSo it's really customer-to-customer discussion. We can say, it's very hard to normalize it.\n\nTristan Gerra -- Baird -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nThank you. Please standby for our next question. I'm showing Kevin Cassidy in the queue. Sir, did you have a follow-up?\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nNo, I didn't. Thanks.\n\nOperator\n\nOK. Thank you. I'm showing no further questions in the queue. I would now like to turn the call back over to Dr.\n\nWang for closing remarks.\n\nFermi Wang -- President and Chief Executive Officer\n\nAnd I would like to thank you all for your time and your consideration today, and I'm looking forward to see you in the coming -- upcoming events. Thank you, guys.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLouis Gerhardy -- Corporate Development and Investor Relations\n\nFermi Wang -- President and Chief Executive Officer\n\nBrian White -- Chief Financial Officer\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nUnknown speaker\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nAndrew Buscaglia -- Berenberg -- Analyst\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nTristan Gerra -- Baird -- Analyst\n\nMore AMBA analysis\n\nAll earnings call transcripts"
}