{
  "companyName": "Krispy Kreme, Inc.",
  "companyTicker": "DNUT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/krispy-kreme-inc-dnut-q2-2022-earnings-call-transc/",
  "content": "Krispy Kreme, Inc. (DNUT -0.67%)\nQ2 2022 Earnings Call\nAug 17, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the Krispy Kreme second quarter 2022 earnings call. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question-and-answer session.\n\n[Operator instructions]  Please be advised that today's conference is being recorded. I would now like to turn the conference over to your speaker today, Rob Ballew, vice president, investor relations. Please go ahead, sir.\n\nRob Ballew -- Vice President, Investor Relations and Corporate Communications\n\nThank you. Good morning, everyone, and welcome to Krispy Kreme's second quarter 2022 earnings call. Thank you for joining us today. Our second quarter earnings release and accompanying earnings presentation deck are available on the investor relations portion of our website at investors.krispykreme.com.\n\nJoining me on the call this morning is Mike Tattersfield, president and chief executive officer; Josh Charlesworth, global president, chief operating, and financial officer; and Joey Pruitt, chief accounting officer. After the prepared remarks by Mike and Josh, there will be a question-and-answer session. Before we begin, I would like to remind you that this call contains forward-looking statements made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995, including statements of expectations, future events or future financial performance. Forward-looking statements involve a number of inherent risks and uncertainties, and we caution investors that these risks could cause the actual results to differ materially from those contained in any forward-looking statements.\n\nThese factors and other risks and uncertainties are described in detail in the company's 10-K. Forward-looking statements made today speak only as of today. The company assumes no obligation to publicly update or revise any forward-looking statements except as may be required by law. Additionally, today's call contains certain non-GAAP financial measures.\n\nReconciliation between non-GAAP financial measures and their closes GAAP measures can be found in the company's second quarter 2022 earnings release and our Form 10-Q, which will be furnished to the SEC and available at investors.krispykreme.com. With that, I'll turn the call over to Mike.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nGood morning and thank you, everyone for joining us today. We are pleased to share our second quarter 2022 results as we continue to put up strong organic growth due to the strength of our omnichannel strategy. I want to start today's call by thanking our amazing group of Krispy Kremers, our team members, for their continued hard work to create moments of joy for our customers, especially while navigating significant uncertainty across the world. Our people continue to be at the forefront of delivering on our mission of becoming the world's most loved sweet treat brand.\n\nThe purpose of our company is to touch and enhance the lives of others through the joy that is Krispy Kreme. The power of our brand allows us to do that in a special way. The second quarter included Mother's Day campaigns around the globe, Platinum Jubilee celebrations in the U.K., and the Beat the Pump gas promotion of a dozen donuts for a price of a gallon of gas in the U.S. These campaigns perfectly highlight our key brand values of joy, generosity, and connection with consumers, which we know drive strong brand flow, especially in periods of weaker consumer sentiment.\n\nWe are proud to be a global company operating in more than 30 countries. And campaigns like these highlight the good we can do and how we really drive genuine consumer connections with our brand in an impactful way. Turning to our performance, the continued progress of our long-term strategy to drive our omnichannel model was well apparent in the second quarter with an additional 382 fresh points of access during the quarter. The overwhelming majority of those were low-capital Delivered Fresh Daily, or DFD doors.\n\nThis included strong points of access growth in Australia, South Africa, Japan, and Latin America, as well as new customers like H-E-B in Mexico. This led to global organic revenue growth of roughly 9% despite a challenging consumer environment. The increase in price point of access led to sales per hub growth of more than 20% in both the U.S. and our international markets.\n\nThis highlights how we can leverage the economy of scale of our 413 production hubs to deliver fresh donuts every day. In fact, total donuts sold during the quarter was up 7% globally from a year ago. We saw strong performance in the U.S. in our hubs and spokes, in Insomnia, Cookies, as well as in Mexico, Australia and New Zealand, and market development, including a robust performance in equity-owned Japan.\n\nAdditionally, branded sweet treats achieved breakeven adjusted EBITDA in the second quarter for the first time as we continue to improve and refine. On the other hand, the U.K. is seeing a challenge consumer environment in the recent months from soaring energy costs and other inflation, which led to significant declines in general retail and supermarket traffic in the U.K. Additionally, hubs without spokes underperformed in the U.S., growing 5% slower than our hubs with spokes, which highlights the importance of continuing the transformation of the U.S.\n\nto hub-and-spoke. Despite robust organic revenue growth, adjusted EBITDA in the quarter declined modestly to $47.4 million due to significant foreign exchange headwinds of $2.7 million, cycling a very tough margin comp in the U.K. as they were reemerging from COVID in the second quarter of 2021 and in the U.S. from our vaccine promotion and investments in the consumer through through brand-building promotions.\n\nIt's worth pointing out, however, that this level of EBITDA is still nearly 50% compared to pre-pandemic and 60% up from 2020. Pricing actions offset most of our inflation in the quarter and we continue to look at pricing and promotional activity strategically. We took pricing actions early in the third quarter in the U.S. and U.K., and we'll continue to review pricing.\n\nAdditionally, we expect lower promotional activity after August. In the U.S. and Canada segment, our performance is driven by the strength of our hubs and spokes, highlighted by the 22% increase in sales per hub and Insomnia Cookies. Organic revenue grew 6% in the second quarter while total revenue grew 8.5%.\n\nOur DFD business continue to gain momentum as we added over 100 points of access during the quarter, bringing us to more than 6,000 locations in the U.S. and Canada. Well on our way to more than 10,000 points of access. We also saw our most successful ever National Donut Day in early June.\n\nAdjusted EBITDA in the second quarter declined modestly in the U.S. and Canada due to weaker performance in our hubs without spokes, cycling a banner quarter from our vaccine promotion a year ago and modestly higher promotional activity to help consumers with acts of joy and delayed price increase to the beginning of the third quarter. However, we see a very bright path forward through innovation, continued DFD expansion, and already beginning to see inflation moderating significantly looking ahead into 2023. Insomnia Cookies had another strong quarter, growing double-digit organic revenue and adjusted EBITDA.\n\nThis was driven by same-store sales growth in 22 open cooking shops in the last 12 months. Insomnia has a strong pipeline that we believe will deliver unit growth in the mid-teens percentage each year moving forward. In June, we expanded our delivery zone and are now working with third-parties to expand the reach of our Insomnia Cookies by up to an additional eight miles. Both of these will drive increased e-commerce sales, which have a higher ATV.\n\nWe see tremendous long-term potential for Insomnia as it increases its global TAM that continues to grow with recent success beyond college campuses and urban markets, and upcoming entry into select suburban locations with continued product innovation. Our start-up branded sweet treats business, quality packaged, shelf-stable donut bites and mini crullers broke even on adjusted EBITDA for the first time. We continue to see great opportunity for branded sweet treats in the coming years. Our international segment had another quarter of strong organic revenue of 13%, led by 28% organic growth in Mexico.\n\nWe added more than 200 points of access in the quarter to bring us to more than 3,400, bringing our year-to-date total to more than 500 additional points of access. This led to sales per hub growth of 23% compared to a year ago on a trailing 12-month basis. While U.S. dollar strength and inflation are headwinds in the short term international, we remain extremely optimistic about our ability to grow rRevenue and margin through our omnichannel strategy, increase our price points of access in a capital efficient manner and continue to innovate and take pricing when appropriate.\n\nIndeed, international, including countries in market development had an outstanding organic growth across the board. Even the U.K. had positive organic growth cycling a tremendous quarter a year ago and with the worst consumer sentiment there in decades. In fact, our market development segment performance accelerated in Q2 with organic growth of 19% and adjusted EBITDA growing 6.5% despite significant FX headwinds and franchise acquisitions.\n\nThis was led by a robust performance in both our franchise business as well as our equity-owned Japan market, where we are implementing our omnichannel model with the expansion of e-commerce and the launch of DFD. Krispy Kreme is truly a loved global brand. Roughly half of our systemwide sales and adjusted EBITDA are outside the U.S. As you know, our goal is to open up at least three new countries per year going forward.\n\nEarlier this year, we announced signed agreements in Switzerland, Jordan, Costa Rica, and Chile. Today, I'm pleased to announce the signing of a new strong partner in Turkey with a great new agreement to bring the hub and spoke model to Turkey from a proven restaurant operator, one of our largest development deals ever. International interest from our high quality partners remains very high. With a proven model, we are building a very strong pipeline for new market entries with both existing and new franchise partners, as well as looking at equity stakes in strategic markets.\n\nWe expect to be able to announce further market entries later this year as we continue our journey to become the most loved sweet treat brand in the world. Turning to a few other drivers of our growth, e-commerce remains a pillar of our omnichannel strategy. In the second quarter, 17.5% of our retail sales came from our e-commerce, up from less than 10% pre-pandemic and 17.2% for the full year 2021, with a goal to achieve e-commerce penetration of over 25% globally long term. We continue to strengthen our capabilities with our mobile app in order to improve the user experience and enhancing our customer targeting to more than 13 million loyalty members, a 22% increase from a year ago and continue to expand accessibility with additional third-party partners.\n\nInnovation remains a significant driver of frequency as we create and introduce premium, fresh, and buzzworthy offerings to customers across our points of access. We had successful seasonal activations across the globe during the quarter, including Mother's Day and National Donut Day, as well as Patriotic July 4th donuts that had successful DFD campaign for the first time in the U.S. We're also launching a fantastic new fritter that will be available only on Fridays this year and are even testing ice cream and shakes as we think about unique ways to drive additional frequency. Additionally, we expect to launch a fourth price tier later this year for our most premium donuts.\n\nLike the hand-cut cinnamon rolls and these new fritters, they will command a higher price. We also invested in our consumers in the second quarter with strong promotions and connections in a time of need. Our customers expect this from our brand and it can truly drive strong brand love. We always believe in a balanced approach to pricing and promotions.\n\nWhile our costs and pricing changes may not match up every quarter, we continue to see significant room to improve margin of 15% and beyond in the coming years. While short-term macro challenges remain, as we look ahead we see a strong path for success over the coming years, including a robust pipeline of low-capital points of access, new cookie shops, a significant number of new market entries, and we will continue to bring consumers along while managing margin. Additionally, in the second quarter, we began the steps for the next evolution of the hub-and-spoke model in the U.S., including our hubs without spokes, reviewing our overall G&A structure, and how we can better leverage our scale with the acquired domestic and international franchisees, as well as other considerations. It's no secret that some of our legacy hubs without spokes in the U.S.\n\nare underperforming, both on the top and bottom line. We knew this when we acquired the system over the last few years in order to control the brand and begin implementing our hub-and-spoke model and not every shop would remain as it was then. In particular, hubs without spokes today. Some of this optimization may include converting shop types and exiting underperformers that are not set up well to support DFD.\n\nEarlier this morning, we announced that we will be hosting Investor Day on December 15 here at our headquarters in Charlotte, North Carolina, which will also be webcasted, where we will lay out our strategic vision and financial model through 2025. We will have a number of exciting updates to share with you, including the work I just referenced, automation efforts in 2023 and beyond, how we see a path forward for Insomnia Cookies and branded sweet treats, as well as a number of other strategies underway that give us a very high degree of confidence that we will deliver our long-term growth algorithm with a very high return on investment. We are very excited on our path in the coming years and are looking forward to sharing that full, compelling vision with investors in just a few short months. I'll now turn it over to Josh to walk you through the Q2 financials and our 2022 outlook.\n\nJosh?\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nThanks, Mike, and good morning, everyone. In the second quarter, Krispy Kremers have once again shown that our beloved brand and our omnichannel approach thrives even in a challenging consumer environment, with net revenue growing 7.5% year over year to $375 million. That's despite a mere 3% negative impact to revenue growth from the stronger U.S. dollar.\n\nOrganic revenue growth was 9% while 31% on a two-year stacked basis. During the quarter, we added 382 fresh points of access across the world, mostly in the form of capital-light DFD doors. We now have more than 11,400 points of access globally, an increase of nearly 1,800 from a year ago. Along with our successful brand activation initiatives, this has resulted in more than 20% increase in trailing 12-month sales per hub compared to the prior year in both the domestic and international business segments.\n\nAdjusted EBITDA was $47.4 million in the second quarter, down 10% from a year ago. This is despite the strong momentum in points of access growth and sales per hub, which we see as leading indicators of higher margins in the future with the efficiency benefits of adding off-premise sales to the hotline theaters. Three factors explain the lower EBITDA this quarter. In the U.K., we lapped the post-pandemic resurgence in 2021 with a much more challenging consumer environment this year.\n\nInflationary pressures continued in Q2 with pricing actions taken in the U.S. and U.K. after the quarter ended. And most significant was the stronger dollar, which alone impacted adjusted EBITDA by $2.7 million in the quarter.\n\nIn the second quarter, GAAP net loss was $2.4 million or negative $0.02 diluted EPS, compared to a net loss of $15 million or negative $0.13 diluted EPS in the same period a year ago. Impact on GAAP income this quarter were impairment charges of $1.9 million, as well as a legal settlement of $3.3 million. Without these, GAAP net income would have been positive. Adjusted net income for the quarter was $14.6 million and adjusted diluted EPS in the second quarter was $0.08, a decline of $0.05.\n\nThe decrease was due to the increased share count from the IPO, FX headwinds, softness in the U.K., and an approximate 20% increase in global input costs. Free cash flow was positive in the quarter, bringing in $3.5 million. In the U.S. and Canada business segment, total revenue increased 8.5% in the second quarter to $251 million and organic growth was 6%.\n\nRevenue growth was driven by a 9% year-over-year increase in sales per DFD door, as well as a 9% increase in fresh points of access. We added 112 points of access in the second quarter, taking the total to 6,053. We continue to expect to have at least 550 DFD doors in the U.S. and Canada for the full year of 2022.\n\neCommerce revenue in the U.S. and Canada represented 19.3% of retail sales, mostly flat from a year ago. This is a 250 basis point increase from the back half of 2021, driven by additional loyalty members, which now total 9.5 million in the U.S. and an expanded delivery ratings through partnerships with third-party aggregators and the addition of our shops.\n\nAll these factors combined to increase sales per hub in the U.S. and Canada to $4.4 million on a trailing 12-month basis in the second quarter as opposed to $4 million in 2021 and $3.6 million a year ago. Hubs with folks in the U.S. and Canada increased by two to 127 as two hubs in California began adding spokes in the quarter.\n\nHubs without spokes in the U.S. underperformed in the second quarter with revenue growth in the quarter 5% slower year over year than the hubs with spokes. Thus, highlighting the importance of the omnichannel model. Adjusted EBITDA for the U.S.\n\nand Canada in the second quarter decreased 8% to $26 million, with margins declining 180 basis points to 10.4% as we cycled a strong quarter from the vaccine promotion a year ago. Also impacting margins this quarter was the underperformance of hubs without spokes. We saw a 400 basis point margin decline year over year driven by inflation and increased promotional activity. In contrast, hubs with spokes saw an increase in their margin delta from hubs without spokes due to the benefit of additional off-premise sales through the increase in DFD revenues.\n\nIn the third quarter, we've already increased pricing in our shops by mid-single digits and continue to review pricing opportunities selectively for the balance of the year. Promotional discounts are expected to also slow as we concentrate on premium seasonal offerings in a stronger fourth quarter. Our digital-first Insomnia Cookies had a strong quarter with double-digit revenue and adjusted EBITDA growth. We had some four new cookie shops in the second quarter and four since the end of the quarter, reaching 225 in total across the U.S.\n\nat the end of July. Our start-up branded sweet treats product line saw a 15% increase in scanned sales in the quarter compared to a year ago. Hopefully a 98% service level. The continuous improvement in our manufacturing and distribution capabilities helped lower conversion costs, which combined with a double-digit pricing increase earlier in the year, helped us achieve breakeven on profitability for branded sweet treats for the first time in this quarter.\n\nMoving to our international segment, net revenue grew 5.2% in the second quarter to $94 million, with FX headwinds a 7.9% drag during the quarter. Organic revenue increased 13% with excellent performances from Mexico, Australia, and New Zealand. Strong premium product innovations and successful price increases proved particularly successful. In the U.K., we also saw organic growth but at a much lower rate in the face of a very challenging consumer environment.\n\nThe general supermarket and retail traffic both down in recent months compared to a year ago. International points of access expanded by more than 200 in the second quarter by 500 year to date. This 29% increase in international points of access from a year ago allowed us to leverage all 37 international hubs to grow international sales per hub to $9.8 million in a trailing 12-month basis, up from $9.1 million at the end of 2021 and $8 million in 2020, even with the FX headwinds. International adjusted EBITDA for the quarter declined 17.5% to $20 million with gains in Mexico, Australia and New Zealand, but not enough to offset a decline in the U.K.\n\nU.K. decline was driven by cost increases in labor and commodities but also remember that we were cycling a surge in spending across the U.K. economy this time last year following the British reemergence from COVID-19 restrictions. We expect international margins to continue to see some softness in the third quarter due to U.K.\n\nconsumer trends, which have been exasperated by a recent heat wave. However, recent price increases as well as local expense reductions are underway and we expect to see improvement in Q4. Now to our third business segment, market development, which is made up of our franchise business around the world and the equity-owned Japan market. Revenues in the second quarter increased 6.5% to $30.9 million, even with a 7% impact from FX headwinds and franchise acquisitions.\n\nIn fact, organic growth in the quarter was a very strong 19.2%. The great performance is in particular in our international franchise markets and in Japan, both of which saw organic growth in excess of 25%. In Japan, we continue to make progress on implementing the hub-and-spoke model with more than 100 new fresh points of access added in the last year. This allowed Japan to enjoy adjusted EBITDA margin improvement of over 400 basis points in the quarter compared to a year ago.\n\nAdjusted EBITDA in the second quarter for market development increased 6.5% to $10.5 million despite a negative $600,000 impact from headwinds, FX headwinds. Adjusted EBITDA margins were approximately flat in the course at 33.9%. We are updating our 2022 outlook, mostly to reflect FX headwinds, but also the softer U.K. trading environment and the relative underperformance by U.S.\n\nhubs without spokes. We still believe we will generate 10% to 12% organic growth in 2022 But we're reducing our net revenue expectations to a range of $1.49 billion to $1.52 billion. Still means 8% to 10% net revenue growth for the year. Inclusive of an estimated $10 million to $12 million impact from FX due to the strength of the U.S.\n\ndollar, we now see full year adjusted EBITDA at $189 million to $195 million with adjusted EPS of $0.29 to $0.32. In general, each 1% move in the U.S. index is approximately $1.3 million in adjusted EBITDA on an annualized basis. After investing $22 million in capital during the second quarter, which represents below 6% of revenue, we do expect annual capex to be approximately $10 million lower this year due to a shift to lower capital points of access and benefits from a decrease in spend internationally due to the dollar strength.\n\nThis will bring our capex spend to 7% of revenue, down from 8.6% in 2021 and 2020. We also announced this morning that we are acquiring a midwest U.S. franchise later this month for $18.5 million at a below six times EBITDA multiple. This will add seven profitable shops to the network and the ability to add more than 100 low cost DFD doors in the market.\n\nIn the near term, this will moderately increase our leverage while we cycle EBITDA in the U.S. results, which should help bring leverage down over time. Additionally, we are reviewing full performing hubs without spokes in the U.S. and expect to close approximately 10 shops in the coming weeks and months.\n\nThese are margin dilutive hubs, which cannot be converted to supply off-premise DFD sales. While we don't provide quarterly guidance, after softer organic revenue growth in the U.K. and the U.S. in May and June, we have seen a strong start to the third quarter with 10% organic growth quarter to date, helped by recent price increases and strong LTOs such as ice cream truck donuts in the U.S., which so far been enough to offset another summer heatwave in the U.K.\n\nE3 organic growth continues to also be high in Insomnia Cookies, Australia, Mexico, Japan, and international franchise. Just recently, we've seen large decreases in key input costs in the commodities market, in particular on wheat and edible oils, which we've begun to lock in for the first half of 2023. This would lead to a large deceleration of expense growth next year from recent levels, with some pricing even lower than our 2022 average if trends continue. At this point, we've locked in approximately 80% of our commodities for the first half of 2023 at mid to high single digit inflation.\n\nThat's down material from the proximately 20% plus we've seen in the last quarter. Fundamentally, nothing has changed in our ability to continue to thrive. We remain very confident in our ability to deliver strong organic sales and bottom-line growth through expanding our hub-and-spoke model, increasing our points of access, and growing our e-commerce platform. All this while managing margins through pricing and inflation.\n\nWe also remain very confident in our long-term growth algorithm of 9% to 11% annual organic revenue growth, 12% to 14% annual adjusted EBITDA growth, and 18% to 22% annual adjusted diluted net income growth despite the near-term FX and inflation challenges. Operator, we can open the call up for Q&A now, please.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of John Glass with Morgan Stanley. Your line is now open.\n\nUnknown speaker\n\nHi. Good morning, guys. It's Bryan on for John. Maybe just the first question about the U.S.\n\nhubs without spokes, what kind of defines the ones that you'll be closing? Is there a location issue? What would you observe about those locations as they've kind of evolved out of COVID over the last year and a half?\n\nMike Tattersfield -- President and Chief Executive Officer\n\nGood morning. This is Mike. We've talked about the transformation in the U.S., which really, really started to close in on last year. We just even finalized with the Midwest acquisition.\n\nWhen we acquired it, it was to get control of the system and including the largest markets. So we knew even then that some of the hubs were underperforming and the whole plan was how do we evolve the system much more to this omnichannel model and the hub and spokes. So that's always the lens that's there. So the shops that aren't there, are other shops that can't convert.\n\nThey can't change over and do that. And that's really the inflationary times sometimes will actually highlight the gap that exists because you can see even across the world, the hub-and-spoke model really allows us to drive our revenue per hub, which you can start to see happen. That gives you one insight.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nHi. It's Josh. The only thing I'll add, of course, is there actually many of the hubs without spokes are strong and profitable and much loved local community stores. There's 118 in the U.S.\n\nhubs without spokes. So a significant are still performing well but there's also a significant minority and hence our decision to close approximately 10 that really are not sustainable in the long run. Now with this context, in this environment, the opportunity to accelerate what would have been inevitable anyway.\n\nUnknown speaker\n\nOK. Great. Thank you. And then just on the improvement in organic growth as you went into July.\n\nWas that primarily, do you think, due to pricing? Maybe if you could comment just on some of the underlying trends in the On-premise business, maybe in the delivery channel as well. What are the other drivers of that besides kind of the pricing impact?\n\nMike Tattersfield -- President and Chief Executive Officer\n\nSo you count again promotional activity or merchandizing mix at works, points of access continue to grow. There's pricing. We look at pricing in a very different way, right? You can either be reactive or proactive. We're in this business for a long, long term, right? So we really look at pricing strategically.\n\nWe didn't take pricing the U.S. or even the U.K. in the first half of the year. So we then really started to learn what's the merchandizing mix, even as consumers are challenged because we serve a broad spectrum of consumers.\n\nSo then finding that mix right and tweaking not just the promotional mix and -- but we actually were able to open up a new tier, which we do our customized handmade donuts, which is -- their more expensive. It's a premium price. And you can see the customers gravitate to it. They're always going to look at pricing and we're very strategic about it.\n\nAnd our customers are always telling us, is it worth it? Right? And we can see, even as we brought fresh donuts to the DFD channel, when they can get access to that even across the band, they want the fresh donut experience. So clearly we haven't seen the impact from pricing that we take.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nMaybe just to complement. It's nice to see the U.S. perform well already in the third quarter. Remember, traditionally, the third quarter is a seasonally is a weaker quarter for us.\n\nBut the pricing that Mike mentioned, our ice cream truck, donut, LTO, clearly doing well. U.S. still challenged. Obviously, the economic -- U.K.\n\nis still challenged. Obviously, the economic environment there, they got a heat wave there, which certainly isn't ideal for selling donuts. But we -- with the pricing, with the momentum we saw in July, the 10% to 12% organic growth for the full year and 7% to 10% constant currency EBITDA growth for the full year is very much how we see the year.\n\nUnknown speaker\n\nThank you.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nThanks, Bryan.\n\nOperator\n\nThank you. Our next question comes from the line of John Ivankoe with HSBC -- I'm sorry, with JPMorgan. Your line is open.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. I wanted to talk about new DFD in the U.S. If you can make some comments around kind of DFD sales per door, profit per door, kind of how the system is evolving from a profitability perspective.\n\nAnd if you have some opportunities, the more experience you have, the more data you have, and what have you, maybe to do some portfolio management on the DFD side as you really kind of sharpen the pencil in terms of looking at profitability per account, especially as it's even more important now, given your margins and profits, just making sure that you're doing business in all the right profitable places.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nJohn, this is Mike again. I'll give you at least the strategic part, which we really learn from our international businesses, right, which is really how do you drive this omnichannel approach to the DFD. It actually have the same dominant mix that you have in the shop translate over to the DFD doors so that the cake -- the Krispy Kreme experience is absolutely the same. And the points of access can be a real big driver of margin and opportunity.\n\nThat really started last year when we had the DFD start. And then you can see now we even tried it for the first time, even in the U.S. market, where we were able to activate on a promotion such as July 4th activity, and push that into the DFD door. So you can see the take there and really rise sales.\n\nPassing on to Josh. He'll get into a little bit more of the margin.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nSure, Mike. Yeah, so I mean, in the U.S., we're obviously continuously adding DFD doors. And as we explained before, we -- the way we think about the profitability is the contribution of adding those off-premise sales to our on-premise facilities, out hot-like theaters, and the benefit of the operating leverage of adding those profitable sales to fixed costs that they're not likely to show, still typically around 40% margin flow through from adding those doors. And Q1 to Q3 in the U.S., it's definitely a time where we're seeing customers keen to take on our Delivered Fresh Daily cabinets and merchandizing units.\n\nIn terms of optimizing and making sure we're always at the best doors, we're saying sales per door continues to grow. Q4 will be a time to optimize, as we saw last year, and then we'll continue to add across the country with new customers, new cities, again in the new year. I mean, one thing to pick up on in terms of global learning is we are selling fresh donut, same quality daily in the grocery store that you get in the retail theater. So it's really important that we bring news and excitement to it, as Mike said.\n\nAnd I think moving forward in the U.S., we're going to be doing more integrated marketing, making sure that there's plenty of excitement in the grocery store, just like there is in the retail theater. Even if it's not a hot donut, that doesn't mean we can't bring more LTOs and special donuts to the grocery channel, and that's definitely an upside for the longer term and what we've seen in U.K., Australia and elsewhere in the world.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nHave you gone through the exercise of looking at and making sure every DFD door is profitable, each of the seven days a week or even each route is profitable seven days a week? I mean, it would seem to me just through my observations in South Florida, for example, in some cases, the donuts are sold out at the end of the day. In other cases, there's actually quite a lot at the end of day. I mean, that people don't necessarily eat the same number of donuts on Monday morning as they might Saturday or Sunday morning, for example. I mean, that's normal.\n\nI mean, does it make sense -- I mean, are you, I guess, kind of applying that I guess more in a granular type of approach to managing those accounts or is it kind of your belief that it's important to have availability to consumers know that it's there and I guess the good days will more than more than offset some of the slower ones?\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nYeah, actually, we definitely see the opportunity to continuously refine our capabilities on managing this fast-expanding DFD door network. We recently just sent our U.S. team over to the U.K. to really look at some of the best practices they've developed over the years.\n\nI mean, the first highlight is, of course, that it's the routes where the profitability is most important. You're adding a driver running a truck. So immediately want to make sure you're covering that incremental cost. So route profitability is a focus of the teams.\n\nWhen it comes to the doors themselves, we've learned that you need a door size. Make sure it's a minimum scale, and the team have certainly learned and we use the sales per for week as a guide. That's something we really want to drive up and we've still got some -- plenty of upside there compared to our international markets. So when you look at what we're doing in the U.S., [Audio gap] donuts to make sure that they're always available for that evening sale.\n\nThat on the way home, can you -- somebody wants to bring home donuts, it would be very disappointing if they're not there. So we definitely want to always be available at all times of day. We know that we will have always naturally have returns to bring back. And it's a constant balancing act through the week and across the doors with our customers to make sure we get that -- to that optimum level.\n\nBut the growth is strong and that's certainly a great place to start as we continue to learn and optimize our capability around delivering to the bottom line.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nYeah, one area I just would add on is just the ability when you start thinking about points of access and how you're talking to our customer base, right? Before when they were only getting access to Krispy Kreme in the 300 shops, you're now able to talk to them. When you get the omnichannel approach and get the right donut mix into the 6,000 doors in the United States with the potential getting up beyond 11,000, you can see then the brand will also start to resonate and the frequency starts to become much clearer and you can communicate about the product and it's accessible there. So that's not just the journey, what Josh described, which is how do get to the profitability and store and sizing, but how do you make sure the consumer that has access to it and can get to those access?\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nThanks, Jones.\n\nOperator\n\nOur next question comes from the line of Carlos Laboy with HSBC. Your line is now open.\n\nCarlos Laboy -- HSBC -- Analyst\n\nYes. Good morning, everyone. What is the biggest point of resistance that you face for getting pricing in the U.S. to keep revenue pace with or ahead of inflation for real organic growth? And maybe related to that, can you comment on a brand power? Do you have the brand power in new markets where you're expanding into to get the pricing that you need with inflation? And what's your pricing experience in established markets versus new markets?\n\nMike Tattersfield -- President and Chief Executive Officer\n\nSo again, we always look at our brand and the opportunity and how we can price strategically across everything we do. It's really about always finding the price where customers think it's worth it. How do you continue to innovate, the points of access, which gives you more access and frequency? We can take price. We took price in DFD last year and we continue to take price but we're very strategic about how we do it.\n\nAnd you have to think about even if the innovation that we start to launch in cheering and pricing. So that's a huge opportunity where you have value and cheering across your customers that there is no barrier today to what you can price right away. We actually just try to really manage that continuously across all of our customer base and then all of our customer base are always looking for value. They will also look for premium innovation and gifting.\n\nThe thing that's pretty interesting, we're a low frequency item, right? So you got to make sure when people want gifting in those aspects, that's when they engage with our brand. You brought up other countries and said the awareness of Krispy Kreme is worldwide, right? There's not a lot of opportunities to go in where you opened up a Krispy Kreme that they're not aware. Recent openings, for example, that we had in Cairo, they're still at -- we can't even manage the capacity that comes out of the shops. Our partner there, really looking to figuring out how to get the hub-and-spoke model.\n\nSo the uniqueness of the model is how do you drive the business from a traditional donut shop, which is what it was in the past, to a hub-and-spoke system. And when we do that well and get the access point, we can really drive the business.\n\nCarlos Laboy -- HSBC -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Bill Chappell with Truist. Your line is now open.\n\nBill Chappell -- Truist Securities -- Analyst\n\nGood morning.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nHi, Bill.\n\nBill Chappell -- Truist Securities -- Analyst\n\nCan you hear me?\n\nMike Tattersfield -- President and Chief Executive Officer\n\nYeah, we can.\n\nBill Chappell -- Truist Securities -- Analyst\n\nI guess two questions. One, I'm just trying to understand maybe the change in tone or change in strategy. I mean, three, six months ago, it seemed like the model was in place and things were moving pretty -- were being implemented well and you felt very good about even maybe some upside to the numbers. And then we've had what seems to be weather and economic slowdown and maybe the model's been stress tests.\n\nAnd you seem to be talking more about strategic tweaks to the model and changes. And so I'm trying to understand if this is something that was always in the works and you were just explaining it a little bit more, or if you felt like you had to take a little more corrective action after the model has been stress tested a little bit.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nSo nothing has fundamentally changed from the model, right? The strategic model building an omnichannel business model with a hub-and-spoke is exactly what we've been doing in the U.S. when we're still going through the transformation phase as we just talked about in front, which is how do you get to the majority of your business being hub-and-spoke from a system that didn't have that before. And all you're seeing is just us moving in a bit faster now on the few hubs that actually don't fit into the system. There was a plan always with them to actually move on some of those hubs, and I'm just talking about in the U.S.\n\nFrom the U.K. model, the UK business is a fantastic business because I think you're alluding to that business as well. Even under duress, which the U.K. is experiencing as a consumer base today, we still get 20% margins.\n\nThe reason we can do large 20% margins is because we have a great hub-and-spoke and very efficient model. Whey'll continue to tweak it. The macro environment is challenging customers everywhere in the world. It just shows you the resilience of our brand.\n\nIt's actually growing in every single one of our countries where we operate today and regions. And so when you get the benefit of the hub-and-spoke, you get more access in a very capital efficient way. We are very bullish on exactly what we're doing.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nThe only thing I'll add is we're a global omnichannel business. Great thing about that, with half our system sales and half our EBITDA being international, we're able to weather any storm or change in the external environment. But of course, this year and since we -- since our last call, the FX environment has changed a little bit, the stronger dollar. So that's a very specific one-off item that doesn't really -- isn't really about strategy or execution.\n\nIn fact, when you see the difference between the hubs with spokes and how they are able not just weather inflation, but continue to strengthen compared to the hubs without spokes, it just gets you to really hone in on those hubs without spokes a little faster. When you look at the EBITDA drop in the U.S. in the second quarter, more than half of that comes from those hubs without spokes, yet they represent less than a third of the revenue. So it's more a case of the next phase of the strategy being an opportunity to go after that even faster.\n\nAnd then when you look forward to the future, we've got this strong top-line momentum around the world that Mike referenced, we've got reduced commodity inflation already for 2023, we see the profitability in the U.S., hub and spokes, we have this premium innovation, which means that you've got a whole bunch of drivers that we feel good about for the longer term. Hence, why there's no change to our long term algorithm to double-digit high growth company with even faster flow through to the bottom line.\n\nBill Chappell -- Truist Securities -- Analyst\n\nOK. Well and just to follow up on that, I mean, I guess was it not considered on the long-term algorithm? I mean, I understand this is an unusual year, but it's also unusual in terms of price increases, which are driving some of the sales. And there will be other years with macroeconomic changes and heat waves and other things. Does 10% to 12% long-term top line make sense? Or it -- and you really haven't seen any change to to that that outlook?\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nNo, we haven't. And hence why we share already what we've seen in July because the way we see momentum across the whole world with the additional points of access opportunity, gives us a long runway of expansion. We talked about 50,000 points of access that we've already identified around the world as an immediate goal. And we're just over 11,000 now.\n\nJust hitting 6,000 in the U.S. with an immediate goal of 10,000. So you quickly get to double digit growth with that mindset. And you're right, pricing and premiumization just come on top of that, but there's a fundamental driver in volume.\n\nI mean, just in the second quarter, we grew volumes of donuts sold in the -- around the world, 7%, 9% in the U.S. alone. So we're selling little donuts. Growth algorithm remains intact and strong.\n\nBill Chappell -- Truist Securities -- Analyst\n\nOK. I'll leave it there. Thanks.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from the line of Jared Garber with Goldman Sachs. Your line is now open.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nGood morning. Thank you for the question. I just wanted to dig in to the U.S. organic growth number certainly it has decelerated a bit sort of no matter what stock you look at.\n\nAnd I just wanted to get an understanding, so 6%. I think that's supported. I think you told us last quarter you were running about 10% price in the U.S. Correct me if I'm wrong there, but I think that's what I picked up last quarter.\n\nPlus, you've got I think sort of high single digit points of access growth, which if I'm not mistaken, this also kind of feeds into that organic growth numbers there. Just want to understand sort of the driver of the deceleration in the U.S. organic growth number. And if you're seeing any sort of any pushback or softness or weakening in consumer demand trends as the consumer continues to be sort of pressured by the broader macro.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nWell, the first thing to say is that stat I just referenced to Bill in terms of 9% volume growth in the U.S. shows that fundamentally we're selling more donuts every quarter than the quarter before in the prior year because we're making it more available. And people, No. 1 given why consumers may not like Krispy Kreme, is they can't get it.\n\nSo that that remains, whether it's this quarter or any quarter, with us. When you look at the breakdown of the organic growth, to your question, the biggest driver is Delivered Fresh Daily. It's adding more points of access to the donuts and growth within the DFD cabinets themselves. We have, for example, July 4th was a real boost in the quarter with a special offering LTO there.\n\nYou mentioned pricing. We haven't yet taken pricing this year on DFD. We have taken it in Q3 on retail. But you said the a double digit as what we see well, referencing just retail that would have dipped during the course of the first half of the year into mid to high single digits, because we have taken pricing until the third quarter and retail, as I said, even faster dip on DFD as we haven't taken pricing there.\n\nSo pricing does play a role in the growth, but that volume is the biggest contributor, largely driven by DFD, growth across e-comm and Insomnia as well was pleased to see in the U.S.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nYou asked, Jared, you asked question about the consumer and I think one of the big learnings we had was that we can even go to a higher tier of pricing, right? So what we did is we really learned how to grab our cinnamon roll product in the U.S., particularly doing that just on one day part amount, which is on Sunday and then really getting to what we call our fourth tier pricing. And it actually unlocks a lot of big opportunity that eventually, even one day it might scale even into the full omnichannel model. If there's no resistance that we've seen from customers in, we still try to be very affordable on this, but there's clearly an opportunity to continue to put premium into our brand while we still try to maintain that kind of base price per dozen and try to drive that across the world.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nOK. Great. Thanks for that clarity.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nThanks, Jared.\n\nOperator\n\nThank you. Our next question comes from Jaafar Mestari with BNP Paribas Exane. Your line is now open.\n\nJaafar Mestari -- Exane BNP Paribas -- Analyst\n\nHi. Good morning. I just had a couple of questions. Just going back on some of the details of the update in full year guidance.\n\nAnd so if I take the midpoint of EBITDA and revenue, it looks like your updated guidance is something like a 100 basis points below what it was before. And obviously, international can have high margins. So are you able to assess how much of the change in margins is purely translation from high margin international profits? And how much would you say is your other fundamental changes, including inflation? And then a similar question on the $10 million to $12 million impact that you're singling out, if I understand correctly, it is the impact of translation and FX impact on costs. Just wanted to clarify if that's the case or whether it's FX translation and total cost increases regardless of whether they're currency related.\n\nSo if I take $10 million to $12 million and adjust for that, am I adjusting for FX in a clean way?\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nSure. Why don't we start with the detail? Joey, you can -- sitting next to me. Joey, do you want to answer on the FX and then I'll talk a little bit more about the -- how we see margin overall.\n\nJoey Pruitt -- Chief Accounting Officer\n\nSure. Sure. Thanks, Jaafar. Yeah, if you think about the $10 million, $10 million to $12 million of FX impacts, certainly there's a few different factors there.\n\nWe know that the dollar has been strong. The primary impacts for us are in the U.K., in Australia, and in Japan, as well as in our international franchise business. And that -- the $10 million or so assumes that the current rates that are out there will continue. And it does include both some translation or primarily translation, but then some transactional impacts as well.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nAnd so just to add to your broader question, you're referencing the full year shift in margin from our prior guidance. I mean, when you when you step back, we expect U.S. and Canada EBITDA to grow this year overall and we expect international to zip a bit, reflecting the FX that we just discussed, reflecting the challenges in broader economic environment in the U.K. So the biggest contributor to that change in the guidance on margins is around that FX and that international shift.\n\nThere is a smaller impact in the U.S. associated with timing and pricing and inflation through the year and those hubs without spokes, which have not responded as well as our hubs with spokes. But definitely the way you should think about it is a lot about FX, a lot about the U.K. versus any change to our fundamental view of the progression and the transformation of the U.S.\n\nto this hub-and-spoke omnichannel model.\n\nJaafar Mestari -- Exane BNP Paribas -- Analyst\n\nThank you. That's very clear. So it sounds like it's all FX related and the only cost, in fact, that's in the $10 million to $12 million is your operations purchasing elsewhere. And then when you talk about the hub and spokes -- yeah, sorry.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nYeah. Some of our commodity is, obviously, impacted by the strength of the dollar. They're globally traded and so there is a transaction element to it. But the majority is the translation and about half of it is the pound.\n\nYeah. So we'll have to watch how that plays out.\n\nJaafar Mestari -- Exane BNP Paribas -- Analyst\n\nGreat. And then just to close on that, I don't know, there's no change to the organic growth guidance range. Is it because effectively we may have ended up at the top end and actually in the end of things at the low end now? Or is it, as you just suggested, that organic growth remains very similar? The difference is what sort of promotion you need to deliver to get there and how fast you can get some of those costs covered?\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nYeah, we're happy with the range. Obviously, we've got different countries doing different things through the year, but overall 10% to 12% organic growth ahead of some algorithm in 9% to 11%. It'll be a good year for growth for Krispy Kreme in 2022.\n\nJaafar Mestari -- Exane BNP Paribas -- Analyst\n\nAll right. Thank you very much.\n\nOperator\n\nThank you. And I'm currently showing no further questions at this time. I'd like to turn the call back over to Mike Tattersfield for closing remarks.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nSo thank you, everybody, for spending a little time and learning about our business. I'm always appreciative to all the Krispy Kremers. I actually visited them in the shop today to say hello. I'm really looking forward to continuing our journey of building the most loved sweet treat brand in the world and deliver upon that every day.\n\nSo thank you for your participation.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRob Ballew -- Vice President, Investor Relations and Corporate Communications\n\nMike Tattersfield -- President and Chief Executive Officer\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nUnknown speaker\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nCarlos Laboy -- HSBC -- Analyst\n\nBill Chappell -- Truist Securities -- Analyst\n\nJared Garber -- Goldman Sachs -- Analyst\n\nJaafar Mestari -- Exane BNP Paribas -- Analyst\n\nJoey Pruitt -- Chief Accounting Officer\n\nMore DNUT analysis\n\nAll earnings call transcripts"
}