{
  "companyName": "Zoom Video Communications",
  "companyTicker": "ZM",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/21/zoom-video-communications-zm-q3-2023-earnings-call/",
  "content": "Zoom Video Communications (ZM -0.38%)\nQ3 2023 Earnings Call\nNov 21, 2022, 5:00 p.m. ET\n\nKelcey McKinley\n\nWell, hello, everyone, and welcome to Zoom's Q3 FY '23 earnings release webinar. As a reminder, today's webinar is being recorded. And now, I will hand things over to Tom McCallum, head of investor relations. Tom, over to you.\n\nTom McCallum -- Head of Investor Relations\n\nHello, everyone, and welcome to Zoom's earnings video webinar for the third quarter of FY '23. I'm joined today by Zoom's founder and CEO, Eric Yuan; and Zoom's CFO, Kelly Steckelberg. Our earnings press release was issued today after the market closed and may be downloaded from the investor relations page at investors.zoom.us. Also on this page, you'll be able to find a copy of today's prepared remarks, a slide deck with financial highlights that, along with our earnings press release, include a reconciliation of GAAP to non-GAAP financial results.\n\nDuring this call, we will make forward-looking statements, including statements regarding our financial outlook for the fourth quarter and full fiscal year 2023; our expectations regarding financial and business trends; impacts from macroeconomic developments and the Russia-Ukraine war; our market position, opportunities, growth strategy, and business aspirations; and product initiatives and the expected benefits of such initiatives. These statements are only predictions that are based on what we believe today, and actual results may differ materially. These forward-looking statements are subject to the risks and other factors that could affect our performance and financial results, which we discuss in detail in our filings with the SEC, including our annual report on Form 10-K and quarterly reports on Form 10-Q. Zoom assumes no obligation to update any forward-looking statements that we may make on today's webinar.\n\nAnd with that, let me turn the discussion over to Eric.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you, Tom. And thank you, everyone, for joining us today. So, last week, we hosted our first fully hybrid Zoomtopia using Zoom Events, and it was great. We unveiled new innovations like Zoom Mail and Calendar, which enable users to frictionlessly navigate across their email, calendar, and other Zoom products, all within the same client.\n\nAt Zoomtopia, many of our customers highlighted how they use our expanding platform to do more in the world of flexible work. At our first Partner Connect event, we hosted hundreds of channel partners, who are excited about working with us to drive adoption of the Zoom platform globally. And our developer partners showcased add-on apps that connect interrelated workflows to the Zoom client. As global organizations adapt to how, when, and where work happens, human connection remains paramount.\n\nZoom is purpose-built to make all kinds of connections possible, effective, and meaningful. We have developed and launched more than 1,500 features and enhancements on the Zoom platform this year, advancing how people connect with each other, their organization, and their customers, ultimately, opening the doors wide for creativity and collaboration. Of course, even as we celebrate our innovations and customers, we still face the backdrop of a challenging macroeconomic environment. We continue to see FX pressure and heightened deal scrutiny for new business but remain focused on delivering happiness to our customers by innovating our platform and expanding our go-to-market capabilities.\n\nZoom provides a full suite of communications solutions at an attractive total cost of ownership that enables teams to do more with less. And our new products like Zoom Contact Center and Zoom IQ for Sales enable revenue-generation and drive productivity. The continued strength of our enterprise growth is a testament to how the value proposition of our platform resonates with customers even in tougher economic environments. As we enable customers to drive greater efficiency, we also are focusing on our own efficiency.\n\nWe have always been judicious with investments, prudent about spending, and we have commanded robust margins since our IPO. So, this is not a major shift for us. We will continue to drive innovation, customer value, and platform expansion, balanced with an increasing emphasis on efficiency and profitability. We continued to see strong traction with customers spending greater than $100,000 in trailing 12 months revenue, which was up 31% year over year.\n\nWhat's more, these customers are increasingly seeing value in buying the whole platform, with thousands of customers already buying Zoom One packages. From an industry perspective, the largest deals came from tech, media, and financial services. And we also had notable wins in retail, transportation, and pharma. On the tech front, let me first thank Qualtrics, the leader and creator of the experience management category, for expanding their partnership with us.\n\nQualtrics recently upgraded to Zoom One enterprise, which provides the full power of the Zoom platform to their users and allows them to make meaningful connections with meetings, team chat, whiteboard, phone, and more in one offering. We are delighted to offer Qualtrics a broad set of communications products integrated into one secure and easy-to-use platform. Our enterprise segment comprises not only large publicly traded corporations but also many private companies of all sizes, who see great value in enhancing their Zoom implementations by moving toward our full UC platform. Let me give you a few examples.\n\nFirst of all, I'd like to thank Vensure Employer Services, a privately owned professional employer organization, for placing their trust in Zoom. In Q3, they added 5,500 Zoom Phone seats and 650 Zoom Contact Center seats, demonstrating the promise they saw in adopting a modern, integrated solution for their teams to interact. Let me also thank Chime Solutions for establishing and already expanding their partnership with Zoom, which includes Zoom One and Zoom Contact Center. Founded with an unwavering focus on bringing jobs and opportunities to underrepresented communities, Chime Solutions delivers high-touch contact center solutions for mid-sized companies and Fortune 500 corporations.\n\nAfter seeing how well Zoom Contact Center addressed many of their customer's needs and gaining confidence in Zoom's ability to deliver innovation at a rapid pace, they decided to replace their legacy solution with Zoom Contact Center. Executing our innovation roadmap for Contact Center will give us the opportunity to further enhance our partnership with Chime Solutions in the quarters and years to come. I also want to thank G-P, the number one SaaS-based global employment platform, for choosing Zoom Phone to transform their communication systems and support employees across their organization. G-P understood the value of our integrated platform of communication products from their experience using Zoom Meetings, Zoom Webinars, Team Chat, and Zoom Rooms.\n\nG-P ultimately opted for Zoom Phone, as the missing piece in their UC stack, in order to improve their customers' experience, while also enjoying the savings benefits of a cloud-based PBX solution integrated into a full communications platform. Also, I'd like to add that G-P is Zoom's global expansion employment partner and has played a critical role in our growth strategy, giving us the agility and speed to enter new markets quickly. Again, thank you Qualtrics, Vensure, Chime Solutions, and G-P, and all of our customers worldwide. And with that I'll pass it over to Kelly.\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThank you, Eric. Let me now turn to the quarter's results and guidance. In Q3, total revenue came in at $1.102 billion, up 5% year over year and 7% in constant currency. This result was approximately $2 million above the high end of our quarterly guidance.\n\nThe growth in revenue was primarily driven by strength in our enterprise business, which grew 20% year over year and represented 56% of total revenue, up from 49% a year ago. We expect enterprise customers to comprise an increasingly higher percentage of total revenue over time. From a product perspective, we had strong growth in Zoom Phone, coupled with contributions from Zoom Rooms and other products. At investor day earlier this month, we introduced a new metric, online average monthly churn.\n\nIn Q3, this metric continued to improve to 3.1%, from 3.7% in Q3 of FY '22 and 3.6% last quarter. We are pleased that this metric has now returned to pre-pandemic levels. The number of enterprise customers grew 14% year over year to approximately 209,300. Our trailing 12-month net dollar expansion rate for enterprise customers in Q3 came in at a healthy 117%.\n\nWe saw 31% year-over-year growth in the upmarket as we ended the quarter with 3,286 customers contributing more than $100,000 in trailing 12 months revenue. These customers represented 27% of revenue, up from 22% in Q3 of FY '22. Our Americas revenue grew 11% year over year. EMEA continues to be impacted by the stronger dollar, the Russia-Ukraine war, and online performance, which combined led to a decline of 9% year over year.\n\nAPAC, which also impacted by the stronger dollar, declined 3% year over year. Now, turning to profitability. I will focus on our non-GAAP results, which exclude stock-based compensation expense and associated payroll taxes, acquisition-related expenses, net litigation settlements, net gains or losses on strategic investments, undistributed earnings attributable to participating securities, and all associated tax effects. Non-GAAP gross margin in Q3 was 79.5%, an improvement from 76% in Q3 of last year and 78.9% last quarter.\n\nThe sequential improvement was mainly due to optimizing usage across the public cloud and our increasing number of co-located data centers. Given this, we expect our full year gross margin to be approximately 79%. Research and development expense grew by 59% year over year to approximately $108 million. As a percentage of total revenue, R&D expense increased to 9.8% from 6.4% in Q3 of last year.\n\nThis reflects our ongoing investments in expanding Zoom's product portfolio and delivering on our customers' evolving needs. We expect to exit the year in the range of 10% to 12% of total revenue, consistent with our long-term target. Sales and marketing expense grew by 27% year over year to $301 million. This represented approximately 27.3% of total revenue, up from 22.6% in Q3 of last year.\n\nWe continue to invest judiciously in sales capacity and channel partner expansion. G&A expense grew by 6% to $87 million or approximately 7.9% of total revenue, in line with 7.8% in Q3 of last year. Non-GAAP operating income was $381 million, exceeding the high end of our guidance of $330 million, as we continue to thoughtfully prioritize investments. This translates to a 34.6% non-GAAP operating margin for Q3, as compared to 39.1% in Q3 of last year.\n\nNon-GAAP diluted earnings per share in Q3 was $1.07, $0.24 above the high end of our guidance. Due to our share repurchase program, our Q3 weighted average share count has decreased year over year by approximately 4 million shares to 302 million. Turning to the balance sheet. Deferred revenue at the end of the period was $1.4 billion, up 14% year over year from $1.2 billion.\n\nLooking at both our billed and unbilled contracts, our RPO totaled approximately $3.2 billion, up 32% year over year from $2.5 billion. We expect to recognize approximately 59% of the total RPO as revenue over the next 12 months, as compared to 67% in Q3 of last year, reflecting a shift toward longer-term contracts. As a reminder, our annual seasonality of renewals is front-end loaded and moderate over the rest of the year, reflecting the sequentially smaller renewal base. As such, we expect Q4 deferred revenue to grow at approximately 2% to 3% year over year.\n\nWe ended the quarter with approximately $5.2 billion in cash, cash equivalents, and marketable securities, excluding restricted cash. Year to date, we have repurchased $991 million of our own stock, representing approximately 11 million shares. We had operating cash flow in the quarter of $295 million, as compared to $395 million in Q3 of last year. Free cash flow was $273 million, as compared to $375 million in Q3 of last year.\n\nOur margins for operating cash flow and free cash flow were 26.8% and 24.7%, respectively. As previously discussed, this year we have seen larger cash outflows from an increase in cash taxes starting in Q2, which relate to the depletion of our NOLs and the lower tax deductions for stock-based compensation caused by the stock price decline. We now expect free cash flow to be at the high end of our range of $1 billion to $1.15 billion. As a reminder, our range assumes that the Section 174 tax legislation requiring capitalization of R&D expenses will be repealed or deferred by Congress by the end of this fiscal year.\n\nNow, turning to guidance. This outlook is consistent with what we are observing in the market today. Specifically, it assumes that our enterprise business will grow in the low- to mid-20s while our online business will decline approximately 8% for the year. For the fourth quarter of FY '23, we expect revenue to be in the range of $1.095 billion to $1.105 billion, which, at the midpoint, would represent approximately 3% year-over-year growth, or 5% in constant currency.\n\nWe expect non-GAAP operating income to be in the range of $316 million to $326 million. Our outlook for non-GAAP earnings per share is $0.75 to $0.78 based on approximately 301 million shares outstanding. For the full year of FY '23, we now expect revenue to be in the range of $4.37 billion to $4.38 billion, which, at the midpoint, represents approximately 7% year-over-year growth, or 8.5% in constant currency. This represents a decrease of $15 million from our previous full year guidance, of which approximately $14 million is attributable to the continued FX pressure in Q3 and Q4.\n\nWe now expect our non-GAAP operating income to be in the range of $1.49 billion to $1.5 billion, representing a non-GAAP operating margin of approximately 34%. This is an increase of $50 million or 1%, respectively, as compared to our Q2 guidance. Our tax rate is expected to approximate the blended U.S. federal and state rate.\n\nOur outlook for non-GAAP earnings per share is $3.91 to $3.94, based on approximately 304 million shares outstanding. Zoom remains focused on thoughtfully balancing growth and profitability through platform innovation, customer value creation, and partner ecosystem expansion. Thank you to the Zoom team, our customers, our community, and our investors. Kelcey, please queue up our first question.\n\nKelcey McKinley\n\nWill do, Kelly. And as Kelly mentioned, we'll now move into the Q&A session. So, when I call your name, please turn on your video and unmute. And as a reminder, in an effort to allow everyone to ask a question, please limit yourself to one question.\n\nAnd, of course, our first question is going to come from Meta Marshall with Morgan Stanley.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks so much for the question, and congrats on the quarter. Maybe just sticking with the online business for a second and kind of the stabilization of that business. You know, clearly, you saw the churn statistics improve.\n\nBut just wanted to get a sense of how you guys are thinking about stabilization there, how you guys are thinking about just initiatives on new adds, as well as just free-to-pay conversion. Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, as we shared at analyst day a few weeks ago, you know, we're really happy with the continued improvement in the churn, first of all. And I think it improved even further in Q3. And the fact that now 70% of those courts have moved beyond that 16-month period, in which they really see stabilization, we continue to see that happen.\n\nWendy and her team are really focused on continuing to look at initiatives for conversion. Those include things like adding local currencies, adding local payment types, as well as looking at packages that make sense. So, all of that is still in process. And, you know, what we're thinking and we have talked about before is we expect online to stabilize from a dollar perspective in Q2 of next year.\n\nAnd based on our most recent forecast, that is still the case.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nKelcey McKinley\n\nMoving on to Mark Murphy with JPMorgan.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nThank you very much. I'll add my congrats. Very nice free cash flow performance. I wanted to ask you, Eric.\n\nYou know, the pace of R&D activity is so rapid at the moment. To what extent do you anticipate that, perhaps, some of the new product innovations -- and I'm thinking of Zoom Mail, Calendar, Zoom Spots, and others, could, perhaps, enhance the stickiness of the usage patterns, right, or drive engagement and collaboration higher in a way that could maybe benefit either your dollar retention rates or maybe some of the premium cloud adoption.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah. So, Mark, that's a great question. That's one reason why we had a very successful Zoomtopia because we announced, you know, so many innovations, almost every innovation. When we look at that how -- what we can do if we use it as a value to the existing paid customer to improve our stickiness, or maybe the potential revenue opportunity, right? Look at our features.\n\nI think we always follow that principle. Look at Email and Calendar. Look at the online paid users, subscribers. And we do not offer for the free users, right? For all those on that, you know, the pro buyers, you know, we give the email calendar for free.\n\nYou can use the email calendar full and within the service for -- another, you know, greater service, which is [Inaudible] right? Look at all other features, you know, like Spots. And, you know, all those features certainly can have our enterprise customers, you know, also make ourselves more sticky. Not only do they use Zoom for scheduling meetings, but also can use that, you know, to mimic an office, you know, environment. So, for free users, right, for sure, you know, like a like email calendar [Inaudible] support a client, right? So, for every feature innovation, I think for sure we'll add more value to our customer, either drive stickiness or drive potential revenue opportunity like Zoom IQ, you know, Virtual Agent, and the Contact Center, you know, and the Virtual Agent [Inaudible] and a lot of feature like that.\n\nSo, we are very, very excited. And again, you know, and the feedback from customers are very, very positive, you know, and they're very excited about adopting those new features and enhancements.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you, Mark.\n\nKelcey McKinley\n\nCredit Suisse's Fred Lee has the next question.\n\nFred Lee -- Credit Suisse -- Analyst\n\nAll right. Thank you for taking my question. I was wondering if you could talk a little bit about the macro impact on phone adoption and maybe give us an update on Zoom for adoption overall as you have over the past couple of quarters.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, we continue to see strength in Zoom Phone. As a reminder, we announced on the last call that we had crossed over the 4 million seat mark. We also added nine customers in Q3 that have purchased over 10,000 seats.\n\nAnd that brings us to a total of 64 customers in that category. So, I think it shows continued strength, especially in the upmarket, even in these challenging economic times. So, we're excited about the prospects that we continue to see there. And as we keep promising you, I will break it out when it gets 10% of revenue.\n\nSo, you'll be able to see that then a little more clearly.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah. Fred, to add on to what Kelly is saying, you know, more and more customers are increasingly looking at our Zoom, you know, the platform, Zoom One UC platform. It used to be, you look at an important product, Phone or Meetings of Webinar or Team Chat, now, look at a full UC stack because that will give you a better experience. In terms of total ownership of cost, it's also much better.\n\nThat's why more and more customers are moving toward our, you know, full Zoom One platform. And I'm very excited about the opportunities there.\n\nFred Lee -- Credit Suisse -- Analyst\n\nGreat. Thank you very much.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you.\n\nKelcey McKinley\n\nNow, moving on to Michael Turrin with Wells Fargo.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nHey. Thanks. Good afternoon, and appreciate you taking the question. On the front-end loaded renewal seasonality, you had useful tidbit on the deferred revenue growth you're expecting in Q4.\n\nCan you just maybe walk through how you gear up for that as a company, given it's a little bit outside the norm on general calendar cycles that we're used to seeing? What kind of visibility do you have into that cohort currently? And is there anything you can do to shift that profile? Or is it just kind of gradual, this rolls forward, and you've gotten accustomed to it internally thus far? Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, as a reminder, this occurred, right, due to the significant increase of customers we had during Q1 in the early stages of the pandemic. And what has happened is due to the practice that we have internally of making it easy for our customers, we co-term when they add on additional products or, you know, expand their seat count, for example. So, it's continued to actually exacerbate, if you will, when we're upselling customers, that front-end loaded phenomenon.\n\nSo, it will, you know, start to level out over time as we see customers, you know, in Q2 and Q4 being our largest seasonal quarters due to the six month quotas of our upmarket reps. But as you say, we are used to it now internally. Everybody knows this is how it works. We're coming into our third renewal period, and we've seen strength in each of the last two cycles.\n\nSo, we're able to accommodate. We know how it works. And it's just something we know that it's not aligned with most of the rest of the industry, which is why we keep reminding you and trying to give you as much color as possible around that.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nAppreciate that. Thank you.\n\nKelcey McKinley\n\nAnd our next question will come from Kash Rangan with Goldman Sachs.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nHello. Thank you very much. Happy Thanksgiving in advance. Good to see you, Eric and Kelly.\n\nI had a question on the enterprise business. I think most of us on the call, we were waiting for the tilt toward the enterprise business. The strength of the enterprise business can offset the weakness in the online business. As we wait for that, I'm curious to get your take on the expansion rate.\n\nI think it came in at 117% or so. And the number of customer, it used to be higher in prior quarters. The number of net new adds to the enterprise still also not quite rebounding and recovering. Can you give us some perspective on how much of this macro versus maybe competition from the likes of Teams, etc.? And, Eric, how does this play out in the, you know, broader adoption thesis for the Zoom platform? When are we likely to see these metrics inflect the other way that could validate your overall thesis that Zoom is not just about video meetings but a broader communication platform? Thank you so much.\n\nKelly Steckelberg -- Chief Financial Officer\n\nEric, you want to talk about Zoom One first, and then I'll talk about the metrics after that?\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah, sure. Absolutely. So, Kash, that's a good question. And, you know, you look at the customer, Qualtrics, right, as they move toward the Zoom One platform, right? So -- and it leverages, you know, our full UC stack, you know, starting from Meetings many years ago.\n\nThey added the Phone, you know, the Webinar, Team Chat, and so on and so forth. I think, you know, the problem was that, previously, you know, when it comes to Zoom, everybody probably assumed that this is just video conferencing. And that's not the case. That's why we're doubling down on Zoom One, you know, marketing awareness.\n\nAlso talked with the customers [Inaudible] stack. Not only do we offer the best video conferencing service, but also, you know, you look at our other offerings as a full UC stack. And also, we also have Contact Center as well. I think that would take a little bit of time but it's not as [Inaudible].\n\nZoom, we have a full, you know, the stack, you know, and plus, we also have a very flexible Team Chat. Plus this is free. And it works so well, integrated with other UC solutions. I think customers, you know, are showing great excitement about adopting the full UC powerful.\n\nAnd more and more customers are moving toward our full UC stack, rather than just the [Inaudible]. And that's why we're very excited because you look at all those offerings, you know, working together similarly. And in terms of total ownership of cost, much better because many enterprise customers are trying to consolidate their full UC stack. You know, UC stack and cloud-based stack is different.\n\nThey might use the Gmail or calendar or SharePoint, you know, or the Office, you know, from other vendors. But in terms of UC stack, we want to, you know, deploy the best breed of service. That's why we are going to win on UC stack, plus the, you know, [Inaudible] CC as well.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nGot it. Thank you so much, Eric.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nAnd, Kash, just in terms of like your comment about renewals, I want to highlight, especially in the enterprise renewals, remain very, very strong. We were actually slightly ahead of our internal forecasts for Q3. So, we continue to see -- you know, we talked about many metrics, growth, and expansion in the enterprise. It's just, as you say, we're waiting for that stabilization in online to -- because, right now, it's really having, you know, a dampening effect on the overall growth rate of the company.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nThank you, Kelly.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you, Kash.\n\nKelcey McKinley\n\nGeorge Iwanyc with Oppenheimer has the next question.\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nAll right. Thank you for taking my question. Eric, maybe with all the enterprise progress just showing, can you give us an update on Contact Center and the adoption that you're seeing there?\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah. So, yeah, again, the [Inaudible] new service are very exciting in particular for those customers who will deploy our, you know, the full service with the like of consolidated UC and CC together. And also, we have found interesting use cases [Inaudible], you know, not only to those traditional customer interaction department has started deploying the Zoom Contact Center, but also the internal IT desk as well, right? And again, you know, the Contact Center sales cycle a little bit longer, you know, unlike the Meetings. But however, you know, that showcase, you know, our platform capability and the speed of innovation, customer very excited.\n\nAnd plus, you look at our own business, right? And we use to deploy, you know, other cloud-based contact center solutions, [Inaudible] our own contact center solutions. Our teams, themselves, are very excited. And a lot of potential pipelines and leads, right, in the pipeline. You know, and also, we are doubling down on that.\n\nAnd again, the product side of it, we have a high confidence. Go-to-market side, you know, we are gaining tractions, you know, as quickly as possible. Because again, it takes some time, plus also leverage channel and internal go-to-market, you know, the investment. And I think that's a future of big revenue in front of us, especially a customer like the CC and UC together, right, and it's a much better experience, and also the total ownership of cost is also much better.\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you.\n\nKelcey McKinley\n\nMoving on to Siti Panigrahi with Mizuho.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nThank you. Thanks for taking my question. Just wanted to ask about macro pressure. You talked about last quarter, you know, sales elongation on the enterprise side.\n\nWhat kind of change you are seeing? You know, anything worsened? And also, how would that impact your pipeline as well?\n\nKelly Steckelberg -- Chief Financial Officer\n\nSo, we certainly have seen impact, as I mentioned, from FX. Of the reduced guidance of 15 million, 14 of that is coming from FX pressure. And you saw that, certainly, in our year-over-year growth in Europe and in APAC. In the enterprise, you know, again, renewals stayed strong, excitement about the products.\n\nBut as we discussed, it's continued in terms of additional deal scrutiny. I think all of my peer CFOs now are looking at deals, and that's just causing elongation in general. Not that things are losing, we're glad that we're losing deals. They're just taking longer to get done and potentially some of them pushing over quarters.\n\nBut, you know, we haven't seen that have impact. It's just taking longer and longer. Not that they're going anywhere else, it's just taking longer to get those done. Now, the good news is, right, especially with all of new products, the consolidation that we offer is a really great value story for our customers in terms of, you know, elimination of additional vendors, getting rid of on-prem servers.\n\nAnd that continues to be a great story that our customers love.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThank you, Siti.\n\nKelcey McKinley\n\nSVB Moffett's Sterling Auty has the next question.\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nThanks. Hi, guys. Kelly, maybe following up on that, I want to understand the 20% growth in enterprise in the quarter versus the guidance of low- to mid-20% for the full year, does that mean that there's a little bit of a back-end-loaded hockey stick or a bump-up that we'll see next quarter? And, specifically, I think investors are really interested in trying to gauge how should that business react as we move into next fiscal year in light of the concern about layoffs across all industries, and a lot of your Zoom Meetings, etc., are based on per employee per seat pricing.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, we certainly, we've talked about this the last couple of quarters, have seen more and more of our deals shifting to the end of the quarter and taking on that more historically natural cycle that we didn't -- you know, we haven't seen since really early in the pandemic. But that is absolutely the case for us. And we have adjusted our forecast for Q4 for some of that linearity as well.\n\nYou know, we have continued to see, as I keep saying, strength in our renewals. And I think that's because while there's concern about layoffs, there's this other phenomena about flexible work, right? Everybody wants to continue to working in the way they become accustomed to. And as long as employers are supporting that in their employees, it really means everybody needs a Zoom license. If you're out of the office even one day a week, you need that Zoom license for Phone, for Meetings, for whatever, Zoom One.\n\nAnd so, I think that is really compelling reasons for organizations to continue to renew with Zoom.\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nUnderstood. Thank you.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah. Thank you, Sterling. You know --\n\nKelcey McKinley\n\nMoving on -- oh, apologies, Eric. Please continue.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nEven for those [Inaudible] right, and often deploy the full UC stack. And look at the Team Chat. It's getting more and more popular. And also, the Phone [Inaudible] can use that for their personal use cases as well, right, because it's free.\n\nThat's why, you know, a lot of our, you know, tractions for other part of our entire UC platform.\n\nKelcey McKinley\n\nOur next question will come from Michael Funk with Bank of America. Michael, if you'll please start your video for us. All right, Michael. I -- if you can hear us, please go ahead, start your video, and come off mute to ask your question.\n\nAll right, hearing no response, we'll go ahead and move on to William Power with Baird. And, William, if you wouldn't mind doing the same thing. Great. Thank you so much.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nAll right. Thanks for taking the question. Probably for Kelly, a pretty notable increase in stock-based compensation expense. I know you talked about this at the investor day, too, that you expect to get a top-up to be more elevated.\n\nWould be great to just get a little more perspective as to how you're thinking about, you know, that going forward. Is this closer to peak levels? Will it stay at this level? Maybe, over a longer-term time frame, you know, how investors should expect that to turn. And I guess kind of tied to that, you know, you've been aggressive on the stock buyback front. You know, what are the plans there going forward? And how could that tie in to how you think about stock-based compensation?\n\nKelly Steckelberg -- Chief Financial Officer\n\nSo, first, we believe that the supplemental grant program is really important for the strategy of the company in terms of retaining our employees and keeping them focused and not having to worry about that. And the supplemental grants vest over the same period as the underlying grant that they're tied to. So, you are going to see this level continue for a few years as those grants are vesting through. And many of them, you know, originally were four-year grants.\n\nSo, they have two or three years left in which you're going to see that stock-based comp as those underlying shares are vesting. With the stock, you know, if -- once the stock stabilizes, then you will see less impact for that or less need for additional grants. So, you know, we're hoping that we're at that place and that you're going to not see additional supplemental grants on that same level. But until we get past probably another year's worth, we might have some more.\n\nIn terms of the repurchase, as you heard, we purchased 991 million or so dollars or 11 million shares. So, we have a little bit of room with that. And once we've completed that, we'll evaluate whether or not we want to ask the board for authorization. We haven't done that yet.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nOK. Thank you.\n\nKelcey McKinley\n\nAnd we'll now hear from Matt Stotler with William Blair.\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nHi there. Thank you for taking the question. Maybe just one more on the online business. It'd be great to maybe get some color, some commentary on the economics of that business, the margin profile as a comparison to the enterprise segment of the business and what the implication there is as that revenue mix continues to shift, specifically in the context of the updated long-term figures you gave us a couple weeks ago.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, we've talked about this before. Our online business is a higher-margin business as it's largely, not completely, but largely untouched by any person from a sales organization. There are some online account executives that are there to answer questions.\n\nBut it's minimal compared to our enterprise sales organization. So, we certainly took -- we've done a lot of work on modeling what that looks like. And we've taken that into consideration as we laid out our long-term margins that we shared with you at analyst day. As we looked forward for the next several years and how we think the mix could shift between the underlying and the online -- sorry, online and enterprise businesses.\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nCool. Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah.\n\nKelcey McKinley\n\nMoving on to Ryan MacWilliams with Barclays.\n\nKelly Steckelberg -- Chief Financial Officer\n\nHi, Ryan.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nThanks so much. To follow up on Matt's question, Kelly -- can you hear me?\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. Hi.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nYeah. Oh, there you go. Perfect. You previously noted a potential inflection in the online business early to mid next year.\n\nWith churn now right at around pre-pandemic levels, but we're still seeing revenue decline sequentially in this segment, any updates to the potential inflection? And, also, is there any impact from existing Zoom customers upselling to enterprise on this online business segment? Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nSo, yes. The answer is yes. There are customers that eventually upsell into enterprise, which is great, right? Because that means they're expanding and they're becoming a bigger customer overall, which we love to see. But that doesn't -- I mean it's not a company term, but it looks like it's moving out of the online business into the enterprise.\n\nAnd in terms of -- the way we're talking about it is a stabilization of online. And we expect that from a dollar perspective to still happen in Q2 of next year based on our current forecast that we're seeing.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nOK.\n\nKelcey McKinley\n\nAnd moving on to Parker Lane with Stifel.\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nYeah. Thanks for taking the question. Kelly, you referenced thousands of customers that have signed up for Zoom One since it launched, I believe, about five months ago. Can you help me understand the profile of those customers a little bit better? Do the majority of them tend to be existing customers that have been migrated onto Zoom One, new packaging? Or are you seeing a big net new cohort as well? And then, two, is it skewing more enterprise for customers that are thinking about going with Zoom One? Or are you also seeing, you know, a pretty decent spread across all different size organizations? Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nSo, Eric, I know you love to talk about Zoom One. Do you want to talk about it for a second? Just so --\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah. Sure. Absolutely. I think that, you know -- you know, first of all, I think, Parker, you know, look at our Zoom One.\n\nWe launched it several months ago, right? And look at all the customers, you know, medium-sized, enterprise, SMB, they all see the value. You know, that's why we see, you know, in almost every market, you know, they are moving toward the Zoom One package. They do see the value. We do not see any specific market that -- segment, you know, truly standing out from all the way from SMB to enterprise.\n\nAnd I think that's exactly what we anticipated.\n\nKelly Steckelberg -- Chief Financial Officer\n\nAnd thank you, Eric. I would just add to that that the key customer wins that we saw in Zoom One in Q3 were a pretty balanced mix of new, as well as customers that are upselling as they're adding new products to their portfolio. So, we're really happy about that, that we're seeing traction in both aspects of the business.\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nUnderstood. Thanks again.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you.\n\nKelcey McKinley\n\nAnd we'll now hear from Shebly Seyrafi with FBN Securities.\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nYes. Thank you very much. So, I'd like to hear from you. What do you think your current visibility is compared to, say, three months ago? I noticed that your RPO grew by 32% year to year, which is impressive.\n\nBut you also had a decline in your cRPO percentage over the past several quarters. Your expansion rate has been declining. And with your guidance for deferred revenue growth, 2% to 3%, with my model, I'm getting billings down 10% year to year in Q4. And you've never really had a billings decline in my model.\n\nSo, just talk about the visibility you have right now versus three months ago. And when do you think you might see this stabilize? You know, is it a few quarters or in a few years? Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, the current RPO pressure is largely related to the online customers and the decline that you're seeing in online as the long-term RPO really benefits from the direct and/or the enterprise side of our business, which are, you know, managed by the direct business and have more annual and multiyear contracts. That's kind of why you see that shift in terms of the overall percentage. I would say -- and then the other, you know, impact that we're having that we can't -- which is just difficult to predict, of course, is FX, right? So, you have to consider that, which is more concentrated in online than in enterprise.\n\nBut you heard in our guidance that we reduced, we said, about 14 million of that, we believe to be attributable to FX. In general, I would say the economics or the state of our business hasn't changed, meaning our enterprise business and our enterprise sales organization is stable. They're continuing to operate in the same way the online business, with the improvement in churn. As well as the way that the majority of it now has shifted out along the -- beyond the 15 months is really helpful in terms of our ability to forecast that business.\n\nAnd so, I think the visibility is the same. There's just some different reasons for all those different components that you're talking about. You know, the deferred is -- again, the decline you're seeing in Q4 is really due to the front-end-loaded nature of our business. And then, remember, so the front-end billings -- sorry, the renewals happen at the front of the year, that's where you're going to see the upswing in billings, the upswing in deferred.\n\nAnd then, that gets amortized over the year, so deferred is coming down. And then, we have much lower renewals in Q4 as well. So, you know, the renewals that are filling up the bucket are much, much smaller. So, it's -- you mentioned very many factors, and there's different reasons for all of those.\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nOK. Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah.\n\nKelcey McKinley\n\nOur next question will come from Peter Levine with Evercore.\n\nPeter Levine -- Evercore ISI -- Analyst\n\nGreat. Thank you for taking my question. So, I think given some of your customers are pushing back on larger decisions, you know, are you able to kind of toggle your sales force, maybe focus more on those back-to-base opportunities? And then, Kelly, just to follow up, you know, can you share how many of those nine -- I think you said nine 10,000 seat phone customers are net new to Zoom? And then, maybe just share, were these legacy PBX replacements, or are you going into replacing another cloud provider? Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, first of all, remember, our strategy for selling Zoom Phone to selling into the existing install base. So, I don't know actually the split between those nine, but I'm sure that the majority of those were existing Zoom customers. And I think -- I would say there's a focus on the company that, as Eric just talked about, of expanding not beyond -- not to just Phone, right? But expanding to the full platform.\n\nSo, that's really what we have our teams focusing on now. It's Zoom One, it's Contact Center, it's Zoom IQ for Sales. Now, it's Email and Calendar, and really thinking about the complete platform, including Zoom Chat and the adoption within organizations. So, it -- for all the reasons we've been talking about in terms of retention, flexibility for organizations to reduce vendors, the cost savings, the total cost of ownership that they see by having that combined, for all of those reasons, that's really becoming the focus of our enterprise sales organization.\n\nKelcey McKinley\n\nAnd our next question will come from Matthew Niknam with Deutsche Bank.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nHey, thank you for taking the question. I wanted to ask, you mentioned the greater value that customers are seeking out from the broader platform. I'm just wondering, are there specific areas where you see maybe more room to strengthen the platform? And with the compression we've seen in market valuations, how are you thinking about potential inorganic opportunities? Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nSo, Eric, do you want to talk about the platform and the value they see?\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah, sure. Absolutely. I think, you know, for those customers, right, who deployed the Zoom One platform, right, they really like it. The reason why we look at one same client, same interface, right, and you have a schedule meeting, you can use our Zoom Team Chat to communicate with your teammates and customers, make a phone call, white board is there.\n\nNow, we're adding a calendar fully integrate together. I think that's the whole value, right? Plus, you look at the customer, they used to be, you know, deploying many other partner solutions. Now, it's one platform, the full UC stack. That's the value.\n\nIt's seamless experience. And that's why more and more customers, no matter which other cloud-based solutions they deploy -- take Phone, for example, they deploy other cloud-based phone solutions. Now, they realize the full value of the entire Zoom One platform. We see them more and more.\n\nAnd the customer, they just, you know, reach out to us rather than we reach out to them to upsell. Now, they reach out to us and say, \"Yeah, I see the greater value.\" And that's why, you know, more and more innovations will be built upon the Zoom One platform. And yeah, like Zoom Spots we recently announced, and that's our focus [Inaudible] our platform, you know, story.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nAnd just in terms of inorganic opportunities --\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nIf you can elaborate on that.\n\nKelly Steckelberg -- Chief Financial Officer\n\nSure. So, you know, we continue every day to look at opportunities. And, yes, the compression evaluations, certainly, is not lost on us. You know, what we're always trying to balance, of course, is what would it bring to our customers, what would it bring or the impact potentially on our culture.\n\nAnd then, of course, the value and the state of the technology, right? We have a high bar for both talent and technology here at Zoom. So, it's been difficult, I would say, to date, to find something that really meets all of those standards. Eric is a very hard judge. But that doesn't mean that we're stopping, and we continue to look for opportunities every day.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah. Also, you know, in terms of the full platform, as I mentioned, our customer, the number of things like our experience, they see it, you know, if you look at who are the biggest service provider, you know how to make sure we have a consistent experience. That's not easy. That's why, you know, we tend to look at all of those decorative tech in order to companies like us.\n\nSo we you know, we can't many years ago, again, if we wanted to, you know, access the focus on, you know, the brand new service, you know, we might as think about organic, you know, opportunity for now what kind of you see platform we order everything now we just you know focus on the gold marketing, right? And we all have a high confidence we're get to more and more tractions there.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nThank you.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you.\n\nKelcey McKinley\n\nMoving on to Alex Zukin with Wolfe Research.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey, guys. Just maybe I have one question that -- it's a bit forward, and it's a bit hard. But if I look at, kind of to Shebly's point, the forward-looking metrics and the implicit guide for enterprise revenue next quarter, it's about 15% to maintain the low 20s for the full year. If you go forward a second, it does look like growth next year is going to be kind of in the low to mid single digits, assuming the normalization or stabilization of the online business and assuming some further decel with the macro getting tougher.\n\nWith opex growing nearly 30% this year, you know, how are we thinking about a worsening environment? Like, what's the recession playbook for Zoom? We've seen some companies, you know, take some pretty meaningful steps with respect to employees, with respect to dialing up, you know, if you will, the efficiency of the business. What's the plan -- what's the recession plan here? Maybe for both you and Eric.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, I think that your assessment, you know, in terms of -- we're not giving -- let me just make the caveat, first of all, we're not giving out FY '24 guidance on this call. We will do that, obviously, at the Q4 call. But your assessment in the way you're kind of thinking about the top-line growth is right in line with kind of how we're thinking about it right now.\n\nAnd in terms of then from an operating margin perspective, the way we're thinking about it is, as we're working on our FY '24 plan, we are being very, very thoughtful about prioritization of investments. That's how I would say it. And as you noted, we have grown our expenses, and we've hired a lot this year. And so, being very thoughtful about ensuring that they're focused on the right things, that we are prioritized internally, we are committed to continuing on innovation and meeting our customers' needs, as well as go-to-market expansion.\n\nThose are really the top priorities that we have in making sure that we have resources in the right areas for that, I guess that's what I would say.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nYeah. So, Alex, I think we are much better positioned in regard to, you know, the efficiency and the potential of productivity improvements like cash flow profitability. And the prospect -- as Kelly mentioned, we hire a lot of, you know, teammates, you know, this year. I think they are going to reach a full productivity next year.\n\nYou know, that's why I think, yeah, you know, I think we can weather the storm, right, and for any, you know, either short term or long term -- or short or long recession. And, yeah, we feel very confident, you know, to drive efficiency and the productivity.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nAnd I guess maybe just as a follow-up, if I look at the buyback cadence, given -- on the one side, Kelly, if you're talking about, you know, having to issue shares as long as the stock goes down, on the other side, you have $5 billion in cash on the balance sheet to buy back stock. So, how do we -- because I get a lot of questions about, you know, dilution, particularly, given the supplemental share buyback. So, at least on that front, what's the right way to think about over the next year, over the next two or three years, out -- you know, ex-M&A, how you're going to leverage that cash balance?\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, you know, we think, based on the share repurchase program that we currently have in place, we've done a good job of being able to offset the dilution from the supplemental shares. We want to be very thoughtful about our cash, though, as we just talked about M&A, for example, and so -- especially as we're focusing on our FY '24 plan, or balancing the opportunity for, you know, managing dilution, as well as earnings on that cash and M&A opportunity. So, all of those are being considered as we look forward for FY '24.\n\nAnd that's really what we have to say today. We'll have more to talk about when we come back for the Q4 call.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPerfect. Thank you, guys.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah.\n\nKelcey McKinley\n\nWe'll now hear from Ryan Koontz with Needham and Company.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nThanks for the question. I wonder if you can unpack the strength in enterprise and how to think about that revenue growth across different product categories. If not quantitative, can you kind of give us an idea of where, you know, Phone stacks up versus expanded Meetings license? And any other products look like that could become meaningful, you know, in the next 12 months as you look at that on the enterprise side? Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, really happy with the progress we've seen with Zoom One, with Zoom Phone, and the strength in Zoom Rooms in Q3. We also certainly see potential in Contact Center and Sales IQ. They're just so early, you know, that from a -- we're seeing progress there and excitement, but it's early stages.\n\nSo, in terms of what they're contributing overall to the dollar amount, it's minimal at this point. But we are seeing growth in terms of quarter-over-quarter expansion in those products. So, that's really exciting to see.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nGot it. Thanks, Kelly.\n\nKelcey McKinley\n\nAnd our next question will come from Catharine Trebnick with MKM.\n\nCatharine Trebnick -- MKM Partners -- Analyst\n\nThank you for taking my question. Appreciate it. One of mine is on your partner program. You brought in a new partner executive last July.\n\nCould you specify any particular areas that he's going to concentrate on to drive more revenue? He just interviewed in one of the CRM magazines. He said he wants to get to 50% revenue through the channel. And can you just address some of the ideas that he has to implement?\n\nKelly Steckelberg -- Chief Financial Officer\n\nSo, yeah, Todd -- Catharine's referring to Todd, who joined us, I think, a couple of quarters ago. He's great at Zoomtopia. He hosted our first Partner Connect with over 400 partners were there. So, that was super exciting to see.\n\nAnd while there are lots of opportunities, I think one of the biggest areas of opportunity is international partner expansion. We've done a good job over the last few years of building master agents and carriers here in the U.S., but it's still relatively nascent outside the U.S. So, that will be a big area of focus for sure.\n\nCatharine Trebnick -- MKM Partners -- Analyst\n\nAll right. Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYup.\n\nKelcey McKinley\n\nAnd, James Fish, with Piper Sandler, please go ahead with your question.\n\nJames Fish -- Piper Sandler -- Analyst\n\nHey, thanks for the question. Most of mine have been asked, but I did actually want to ask on the enterprise sales investment that we've been talking about the last couple of years. But how are you guys looking to balance productivity improvements to support your margin stability versus expanding capacity, especially as these reps who, over the last few years, really had the advantage of, you know, easier sales cycle with Meetings especially? Is there any way to also understand the experience of reps underneath in terms of how much are fully productive at this point? Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, in terms of our reps, you know, we are constantly looking at opportunities to help make them more productive. And as we were just talking about, we've hired a lot over the last few years. And as we look forward to FY '24, we'll be making many fewer hires.\n\nSo, we're really looking for how do we enable the reps, how do we make sure that we have the right overlay teams in the right places to support them? As a reminder, that's -- we have specialists that are selling Contact Center and Phone. And that's a really important aspect of making sure that everybody is aligned on serving our customers in the best way possible. So, that is a big focus. We also have a new president, Greg Tomb, that you all met last quarter.\n\nAnd he's been spending a lot of time helping us think about that, especially as we're moving up in the enterprise stack. And that's his experience. That's where his background is. And then -- and really focusing on making sure that our comp plans align.\n\nThat's another thing that we're taking a look at for FY '24 as well.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nJames, another critical point just to add on to what Kelly said, and, also, the Zoom IQ for Sales, that product, certainly, everybody could drive our teams' productivity, right, especially with reps that are working remotely, right, how to manage their productivity, drive efficiency, take some you know actions, right, you know, quickly. I think when we deploy the Zoom IQ for Sales by end of this month, literally every rep will be fully trained on Zoom IQ of for Sales. Not only do we have our sales productivity, it also will create a lot of opportunity for us to sell more and more Zoom IQ for Sales. So, that's [Inaudible] for every sales team to drive productivity.\n\nJames Fish -- Piper Sandler -- Analyst\n\nHelpful. Thanks, guys.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThank you, James.\n\nKelcey McKinley\n\nMoving on to Matt VanVliet with BTIG.\n\nMatt VanVliet -- BTIG -- Analyst\n\nYeah. Hi. Good afternoon. Thanks for taking the question.\n\nI guess you highlighted Zoom Rooms. And curious how much of that uptick do you feel like has been sort of a return to office for a number of companies and really, you know, having that mixed modality of a conference room and still having remote workers in, and how much, I guess, sort of risk might that come under over the next several quarters of being a growth lever, as we've seen layoffs, as we see, you know, slower macro, and maybe that's, you know, not an additive spend that that companies are going to want to undertake when they're already paying for the individual Zoom licenses. Thanks.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah, I think it's very similar to Zoom Meeting licenses and the aspect of as long as you have a hybrid workforce, you need the right technology in your conference rooms, you know, to ensure that you have this inclusive experience that we've all become so accustomed to. And we continue to listen to our customers. Customers work on innovations to ensure that we provide that. But I don't think it's going to go away.\n\nI mean, we'll see what happens. But I think it's still yet to come to see what happens with like commercial real estate. However, Zoom Rooms and the importance of those in a hybrid workforce, I just -- I can't tell you how important that is. I can't stress enough the importance of that.\n\nAnd that's really what our customers are seeing as well as they're in some sort of state of a hybrid work environment.\n\nMatt VanVliet -- BTIG -- Analyst\n\nGreat. Thank you.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nAnd also, Matt, another thing just quickly. So, it used to be like, look at a conf room, right? Most of the usage are -- use the internet for internal cause. And look at the Zoom Rooms. That's another case.\n\nA lot of customers are leveraging Zoom, right, to cover the customer side of partners, right? That's one difference because that's a reason why our customer like Zoom, right? When you talk with a customer partners, you want to make sure they have the best experience, right, and [Inaudible] those companies who might think about laying off employees and reduce number of the employees. Guess what? Less taxes, but more conf rooms. You know, then all of us, you know, what you can do, right, to double down on our customer and partner [Inaudible] direction. And that's why we still see a great opportunity ahead of us.\n\nMatt VanVliet -- BTIG -- Analyst\n\nThank you.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you.\n\nKelcey McKinley\n\nAnd we'll move on to Tyler Radke with Citi.\n\nTyler Radke -- Citi -- Analyst\n\nHey, thanks for taking my question. Kelly, In terms of the Q4 guide, I understand that the currency was a bit of a factor there on that lower outlook. But can you just unpack kind of what you're assuming from a macro perspective? You know, is a Q4 guide relative to what was implied last quarter? Is it incorporating, you know, churn getting worse in SMB, or weaker net adds, or maybe you're seeing something on the enterprise side? Just help us understand the non-FX side in terms of what you're expecting for Q4.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah. So, in the online segment of the business, for Q4, we expect churn to be pretty much in line with Q3. I mean, it's likely that number is going to bounce around a little bit quarter to quarter, and that's going to all be visible to you now as we report it. But we're not forecasting any dramatic changes there.\n\nAnd then, in the online segment, I would say that the -- I mean, sorry, the enterprise segment, I would say the biggest change that we're seeing is just this continued push to deals being at the back end of the quarter. And so, that linearity -- you know, over the last few years, we had a much more balanced linearity in our enterprise segment. And what that leads to, of course, is deals contributing to revenue in the quarter. And we're seeing much less of that as these deals are going back to the more traditional back end, you know, really, really back end of the quarter.\n\nNow, we have the benefit in Q4 of having kind of the two periods of December 31st close and the January 31st close, but we are expecting the linearity more consistent with what we've seen in Q3 than what we saw a year ago.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nYeah.\n\nKelcey McKinley\n\nAnd we have time for one additional question from Karl Keirstead with UBS.\n\nKelly Steckelberg -- Chief Financial Officer\n\nHi, Karl.\n\nKarl Keirstead -- UBS -- Analyst\n\nGreat. Thanks for fitting me in. Hey, Kelly, I just love to ask you about your perceived utility of the billings number. Traditionally, we look at that number as a decent proxy for business momentum.\n\nBut obviously, minus 10 in 4Q and plus 1% for the full year, I'm guessing you would argue that that's a poor proxy for Zoom's momentum. So, can you opine on that a little bit?\n\nKelly Steckelberg -- Chief Financial Officer\n\nYes.\n\nKarl Keirstead -- UBS -- Analyst\n\nBecause I think maybe there's some consternation about that negative 10 implied percent billings.\n\nKelly Steckelberg -- Chief Financial Officer\n\nThank you, Karl. I should have said this earlier. So, as a reminder, we don't guide to billings. We never have because we don't think that they are a good indicator for us because of the large percentage of our customers that are -- especially in the online segment of the business, that are on monthly contracts.\n\nAnd so, because they bill and they pay us monthly, they don't show up in that number. And so, that's why it doesn't -- it isn't really a good proxy for you to use.\n\nKarl Keirstead -- UBS -- Analyst\n\nOK. And as a follow-up, Kelly, is there anything else that's skewing that DR number? You know, is there any change to invoicing terms or maybe more flexible payment terms to customers that maybe on the margin are impacting DR as well?\n\nKelly Steckelberg -- Chief Financial Officer\n\nNothing significant.\n\nKarl Keirstead -- UBS -- Analyst\n\nOK.\n\nKelly Steckelberg -- Chief Financial Officer\n\nIt's really more about, you know, the timing. You're talking about the deferred revenue specifically, right?\n\nKarl Keirstead -- UBS -- Analyst\n\nYeah. Yeah.\n\nKelly Steckelberg -- Chief Financial Officer\n\nReally about the seasonality of the renewals. I can't stress that enough for everybody. Remember, it's the two factors. It's the fact that they bill in Q1.\n\nAnd then, so you're going to see an uptick in billings and deferred and collections. And then, that amortized over time. And then, the billings in Q4 are just a lot smaller. So, you have this double impact, right? Now, you've amortized a lot of the deferred that was picked up in Q1.\n\nSo, we're down at the lowest period in Q4. And the billings in Q4 are the lightest period to refill that bucket. So, it's going to -- this is going to be a phenomenon that we're going to see for years to come, as I've talked about, until, over time, we start to see, you know, more and more of our bookings happening in Q4.\n\nKarl Keirstead -- UBS -- Analyst\n\nOK.\n\nKelly Steckelberg -- Chief Financial Officer\n\nBut that's going to take a long time.\n\nKarl Keirstead -- UBS -- Analyst\n\nMakes sense. Thank you.\n\nKelly Steckelberg -- Chief Financial Officer\n\nOK. Thanks a lot, Karl. Thank you, everybody.\n\nKelcey McKinley\n\nAnd again, that does conclude our Q&A session for today. I'll go ahead and turn things back over to Eric for any closing or additional remarks.\n\nEric Yuan -- Founder and Chief Executive Officer\n\nThank you. First of all, thank you for every Zoom employee. Great work. Thank you for every customer, partner, and investor's great support.\n\nYou all have a wonderful holiday season. Thank you again. See you in our Q4 meeting. Thank you.\n\nKelcey McKinley\n\nThank you, Eric. And again, this does conclude today's earnings release. We thank you all so much for your participation. And from our family to yours, may you have a safe and happy holiday season.\n\nEnjoy the rest of your day. And again, we'll see you next quarter.\n\nDuration: 0 minutes\n\nKelcey McKinley\n\nTom McCallum -- Head of Investor Relations\n\nEric Yuan -- Founder and Chief Executive Officer\n\nKelly Steckelberg -- Chief Financial Officer\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nFred Lee -- Credit Suisse -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nRyan MacWilliams -- Barclays -- Analyst\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nPeter Levine -- Evercore ISI -- Analyst\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nRyan Koontz -- Needham and Company -- Analyst\n\nCatharine Trebnick -- MKM Partners -- Analyst\n\nJames Fish -- Piper Sandler -- Analyst\n\nMatt VanVliet -- BTIG -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nKarl Keirstead -- UBS -- Analyst\n\nMore ZM analysis\n\nAll earnings call transcripts"
}