{
  "companyName": "Pan American Silver",
  "companyTicker": "PAAS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/pan-american-silver-paas-q3-2022-earnings-call-tra/",
  "content": "Pan American Silver (PAAS -2.21%)\nQ3 2022 Earnings Call\nNov 10, 2022, 11:00 a.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to the Pan American Silver third quarter 2022 results conference call. [Operator instructions] I would now like to turn the conference over to Siren Fisekci, VP, investor relations.\n\nPlease go ahead.\n\nSiren Fisekci -- Vice President, Investor Relations\n\nThank you for joining us today to discuss Pan American Silver's Q3 2022 results and our agreement with Agnico Eagle Mines Limited to acquire Yamana Gold. This call includes forward-looking statements and information and make reference to non-GAAP measures. Please see the cautionary statements in our Q3 2022 MD&A and news release and the presentation slides for our call today, all of which are available on our website. I'll now turn the call over to Michael Steinmann, Pan American's president and CEO.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nThank you, Siren, and thank you for joining our call today. We have been looking forward to this call and being able to finally discuss our agreement with Agnico to acquire Yamana. But before we get into the discussion, let me first provide a brief recap of our Q3 results. The underlying performance of our gold segment operations was in line with our expectations.\n\nAlthough production came in below our quarterly guidance range because of an in-heap inventory buildup of 28,900 ounces of gold, largely at Shahuindo and La Arena. At Shahuindo, the buildup was partially related to lower rainfall rates, which reduced irrigation flow rates and recovered ounces during the quarter despite stacked ounces exceeding the plan by 18%. At La Arena, gold production not only modestly exceeded plan in the quarter, but ounces stacked also surpassed expectations by 25%, with greater tonnes placed at higher grades. Both plant contain ounces placed on the heap, Shahuindo and La Arena, during Q3 positions us to reaffirm our annual gold production guidance toward the lower end of 550,000 to 605,000 ounces.\n\nWe're also reaffirming our estimates for gold segment all-in sustaining costs of between $1,450 and $1,550 that we provided with our Q2 results. We are revising the estimates for full year 2022 silver production to be between 18 million to 18.5 million ounces from the 19 million to 20.5 million ounces we provided in our original operating outlook. The revision is largely due to lower production from lower-grade ores in Phase 9b open pit at Dolores and revising our mine sequencing into lower-grade silver ores at La Colorada during the second half of 2022. Reestablishing mining from the higher-grade ores at La Colorada has proven more challenging given our ground control systems have been compromised to a greater extent than expected from the prolonged exposure to high heat and humidity during the constrained ventilation we faced between 2017 and early 2022.\n\nDuring Q3, we deployed additional resources with two development contractors to accelerate ground control system upgrades necessary to access the higher-grade ores in the deeper portions of the eastern Candelaria deposit. We expect to reestablish near reserve grade ore mine sequencing toward the end of 2022. We are pleased with the current ventilation conditions in the mine. The progress on sinking the new ventilation shaft that will further secure long-term ventilation systems and the accelerated ground control system replacements and development advances to access the higher-grade ore zones.\n\nCost inflation and supply disruptions continue to be an industrywide issue, which has led us to expect that silver segment cash costs and all-in sustaining costs could be marginally above the high end of the range in our 2022 original operating outlook, which indicates an all-in sustaining costs for silver segment of $14.50 to $16 per ounce in 2022. Our financial position remains strong with cash and short-term investment of $187.2 million and an undrawn line of credit of $500 million at close of Q3. We declared a dividend of $0.10 per share in line with our dividend policy. In September, we updated our La Colorada's core mineral resource.\n\nWe now have 95.9 million tonnes in the indicated category, containing 94.4 million ounces of silver, 2.7 million tonnes of zinc, and 1.2 million tonnes of lead. In addition, we estimate an inferred mineral resource of 147.8 million tonnes, containing 132.9 million ounces of silver, 3.4 million tonnes of zinc, and 1.5 million tonnes of lead. This mineral resource estimates does not include drill results released on November 1st, 2022 and on July 21st, 2022 that indicate the high-grade silver zone of mineralization, which will be part of the next resource update. This morning, Triple Flag Metals Corp.\n\nannounced the acquisition of all of the outstanding shares of Maverix Metals for a share and cash consideration. In July 2016, Maverix acquired a portfolio of 13 royalties, precious metals streams, and payment agreements from Pan American Silver. As consideration for that portfolio, Pan American received, at that time, 42.85 million common shares and 20 million common share purchase warrants. Pan American's strategy for divesting this portfolio was to crystallize value for a group of assets in Pan American's mining portfolio that was largely unrecognized and unrecognized by the market at that time.\n\nOver the years, Maverix continued to grow the value of its portfolio to acquisitions and additional metals streams and royalties. On May 28, 2020, Pan American sold a portion of its shares for gross proceeds of $45.4 million. With the transaction announced today, Pan American will receive approximately $102 million in Triple Flag shares and cash. Using our royalty portfolio to start Maverix Metals in 2016 has been a very successful way to create value for our shareholders from assets largely unrecognized by the market.\n\nLet's now move on to the Pan American and Agnico arrangement agreement with Yamana. On November 4th, 2022, Pan American and Agnico Eagle Limited announced that we have delivered a definitive binding offer to the board of directors of Yamana Gold. Under the proposal, Pan American would acquire all of the issued and outstanding common shares of Yamana and Yamana would sell certain subsidiaries and partnerships that hold Yamana's interest in its Canadian assets to Agnico Eagle, including the Canadian Malartic mine. On November 8, 2022, Pan American and Agnico Eagle further announced that the arrangement agreement among Pan American, Agnico Eagle, and the Yamana became effective upon the termination of the agreement between Yamana and Gold Fields.\n\nTo summarize a few of the terms of the transaction. The total consideration was $4.8 billion, or $5.02 per Yamana share as of November 4th, 2022, when we announced the binding proposal. The consideration is made up of $1 billion in cash funded by Agnico Eagle, approximately 36.1 million shares of Agnico Eagle, and approximately 153.5 million shares of Pan American Silver. Pan American will retain all Yamana's Latin American assets.\n\nThe transaction requires Pan American and Yamana shareholder approval, as well as certain other regulatory approvals. It is important to note that Agnico Eagle has committed to provide market support to the purchase of up to $150 million of Pan American shares. Pan American will appoint three independent directors of Yamana to be added to the current Pan American board. And Pan American will work cooperatively with Yamana to integrate Yamana management into Pan American's management team.\n\nFinally, as far as timing is concerned, we would exceed -- we would expect Pan American and Yamana shareholder votes to take place in late January next year, with closing sometime in Q1 2023. The transaction would increase Pan American's portfolio to 12 operating mines and is estimated to increase our silver production by approximately 50% and coal production by approximately 100%. Pan American has over 28 years of proven expertise and experience building and operating mines in Latin America. Yamana has built a portfolio of long-life assets with expansive exploration and potential, and we have been impressed by the quality of their mining and management teams during our due diligence.\n\nThe combination of our two teams and assets will create the leading silver and gold producer concentrated in Latin America, well-suited to realize further value from the combination -- combined portfolio on producing mines and development assets. The transaction would also be expected to enhance Pan American's overall financial position and improve its ability to internally fund growth projects. It presents multiple opportunities for operational and administrative synergies, particularly between Pan American's and Yamana's corporate offices in Canada. The transaction is accretive per share to key financial and operating metrics and will make Pan American a lower-cost producer with anticipated annual operating cash flows of over $650 million for the first five years.\n\nIt will also add significantly to our proven and profitable silver and gold reserves and could increase our annual revenues to over $2.5 billion. The enlarged company will benefit from further geographical diversification and create opportunities for future portfolio optimizations. As before, Pan American will maintain a strong balance sheet. Total debt, including the two Yamana bonds and the Pan American equipment leases, will be around $850 million, with a debt-to-EBITDA ratio of only 0.8 times.\n\nTotal liquidity will be over $680 million, including our sustainability-linked revolving credit facility. This is a very exciting opportunity for Pan American and Yamana shareholders to create a strong leader in precious metals concentrated in Latin America with unparalleled exposure to silver. And with that, I will be happy to take your questions.\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] The first question is from Cosmos Chiu from CIBC. Please go ahead.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nThanks, Michael and team, and congratulations on the deal. Maybe my first questions are around the acquisition here. You know, Michael, as you mentioned, with the acquisition, you will now have -- you will have 12 operating assets. What's your interest level in terms of running 12 assets, even though they're all in Latam? And, you know, in that case, maybe too early, but have you thought about core versus noncore assets? And, you know, at this point in time, anything that you can share with us?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nSure. Thank you, Cosmos, for the question. Look, I mean, it's very early still. As I said, there will be lots of opportunity to optimize that portfolio over time once we are ready to, you know, own them for a while and run them for a while.\n\nBut I think -- as you know, we're coming, you know, Dolores is like in the last two, two and a half years of mine production, and then we'll go into leach cycle probably until 2030. So, we'll, you know, use much less of our attention on the mining side for that. As you know, Manantial Espejo in our portfolio is soon coming to an end with the reserves. So, you know, there's a lot of opportunities to optimize that portfolio and really focus later on and at the larger cornerstone assets.\n\nBut as I said, it's very early, too early to decide at this point.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nOf course. Maybe in my next question, Michael, as you mentioned, Pan American Silver is buying, you know, essentially Yamana, the company, and I would assume that you also take on Yamana's cash and Yamana's debt. Could you maybe walk through? You know, there is a termination fee that's payable to Gold Fields. I'm sure there is transactional costs as well.\n\nIs that going to be coming out of Yamana's cash? And what are your plans in terms of Yamana's debt?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nYes. And look, I don't have the final numbers on that. You probably saw on the press release that we funded $150 million of the break fee that went to Gold Fields. Yamana funded the other $150 million.\n\nYou said it, there is -- that there is cash and debt. We will take on the two bonds that Yamana has currently, and they'll take on the remainder of the cash as well. So, you know, we have to advance that further now, obviously, and see. I don't have final numbers yet on the exact closing costs for the transaction.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nGreat. And then on the bond that you're taking on for Yamana, you know, I checked out Yamana's my MD&A, looks to be a fairly attractive interest rate. From that perspective has, you know, Pan American Silver approached the rating agencies for, you know, a credit rating impact assessment of the transaction given that, you know, Pan Am doesn't have any debt right now? So, I don't know if you have your own sort of rating. And at the same time, I see that, for example, Yamana, their rating right now is investment grade.\n\nSo, any potential for an upgrade in terms of our rating or, you know, risk of downgrade? Anything that you can share with us?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nYeah. I would pass the question on to Ignacio, our CFO.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nHi, Ignacio.\n\nIgnacio Couturier -- Chief Financial Officer\n\nHi, Cosmos. Yeah. So, obviously, as you mentioned, those are very attractive coupons on those -- on the two bonds. So, we will strive, of course, to keep those.\n\nSo, in due course, we'll be talking to the rating agencies. The -- both S&P and Moody's has already put out in their bulletin their expectations. And so far, everything we've seen is that they're neutral. So, yes, we'll do everything in our power to keep those two bonds valid.\n\nBut yes, we'll keep you informed. Our expectation is that the bonds will be rerated upon closing or the new rating will come out upon closing.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nThat's great to hear. And then maybe one last question here before I pass it on. You know, commodity mix, Michael. With this acquisition, silver as a percentage, based on my numbers, will go from high 20s to low 20%.\n\nAnd then with the increase in gold, any concern in terms of that mix? You know, in the end, Pan American Silver is a silver company. But, you know, any comments on that in terms of near term and long term?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nYeah. And look, that was, of course, one of the attractions of this portfolio that it immediately increases our silver production by about 50%. So, as you said, there's a large part of gold coming in as well. The -- our silver-gold mix, depending on metal prices, if you look at revenue, will drop a few percentage point on the silver side at this but is still a very strong, you know, lower 20% number to start with.\n\nAnd then don't forget Escobal. As I said, look, we had further meetings on that process. The process of ILO 169 consultation is proceeding. I don't have -- for the timing, as I've talked about it many times.\n\nBut if you have an Escobal back in there, you know, it would bring us right back to probably a high 30% of silver versus gold. So, very, very strong silver producer.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nOK. That's great to hear. Thanks, Michael, Ignacio, Siren, and team. And those are all the questions I have.\n\nThank you.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nThank you, Cosmos.\n\nOperator\n\nThe next question is from Lawson Winder from Bank of America Securities. Please go ahead.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning. Thank you for the update, guys. I wanted to follow up on Cosmos' first question also with regard to the size of the new portfolio.\n\nSo, I imagine your team already accumulates a pretty shocking amount of air miles. So, with that expanded portfolio, even with a few noncore sales, it would still be quite large. Do you expect any sort of expansion of the existing management team?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nYou know, we are actually a very decentralized company, so our head office in Vancouver is quite small. We have very strong local teams. And, you know, I see a very similar strategy of Yamana. So, that's actually, while there's still a lot of travel, keeps that quite well under control because it's -- you know, our assets, historically and today, are run by very strong local teams.\n\nSo, it's not that we do our -- everything out of Canada. So, adding further mines and, you know, in very close by or same jurisdiction that we already are doesn't really make, you know, changes that much. I mean, in the case of Argentina, we already have, obviously, office and a team because we're running mines there for, what, a decade and a half nearly, and as well as Brazil and Chile, which, of course, neighboring countries to, you know, Peru and Argentina, where we already have our offices. So, as I said, look, over time, there will be optimization of that portfolio, for sure.\n\nBut at the moment, with that structure that we have of strong local management teams, I really don't see a big problem. And as I said in my call, you know, we really have been very impressed with the teams that we encountered from Yamana when we did due diligence on that. You know, that makes me -- it makes me feel very, very good looking at the integration there, very similar ways, a lot of focus on safety, a lot of focus on ESG, a lot of focus on high-quality stocks and assets and, you know, very similar than what we are focused on. So, I'm really looking forward to integrate those teams because I think it will be -- it's a very, very good fit.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nThank you for that perspective. With regards to the La Colorada Skarn, will this acquisition, once it closes, in any way deemphasize the development or perhaps extend the development timeline? Thank you.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nLook, the skarn is a long-term project. We all know it's a very high-quality discovery. We all know it will take a number of years to move that forward and develop it. I think that that discovery of that high-grade zone or, you know, and some drill hole is absolute bonanza grade that we discovered and published over the last few months.\n\nYou know, maybe that changes a little bit our development timeline. Maybe we'll try to go on mine that zone first. But, you know, there's still a lot of drilling and engineering to be done for that, and we have to include that zone in our resource update. But that project will be -- I see La Colorada over long term as an absolute cornerstone.\n\nYou saw the numbers, you know, large, large resource in that skarn that's going to be multidecade of possible production. And, you know, that's -- that will go ahead. I mean, the beauty here is that, you know, this will make a very strong -- financially, very strong company with very strong cash flows and will actually help to develop development projects further.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nAs you work toward that preliminary economic assessment on LC Skarn, what are kind of you kind of thinking in terms of a range of throughput sizes at this point today?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nI'll pass it on to Steve.\n\nSteve Busby -- Chief Operating Officer\n\nYeah. Good morning, Lawson. That's a great question. And it really depends on mining methods.\n\nAs we've talked about in the past, we've been looking at some of the sublevel caving methods that may get up in the range of 20,000 tonnes a day. Those are kind of some of the estimates we saw. If you remember back the long-haul studies, we were down in the 10,000 tonnes a day range, as what we've been discussing. And as Michael said, this high-grade zone offers us up an opportunity, perhaps, to get in early with the long-haul system.\n\nSo, I think that we haven't settled in on what the throughput rate would be. But those are the kind of numbers you're looking at, depending on the mining methods we apply.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nOK. Yeah. Thank you for that, Steve. I wanted to ask you about the dividend, also.\n\nSo, you announced the $0.10 dividend, so effectively paid no special dividend. But according to the formula, shouldn't you have paid a penny out in the dividend?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nSo, our dividend policy is staged. It's calculated for the additional dividend based on that cash on our balance sheet. So, that's following that policy and resulted in the $0.10.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nOh, OK. Oh, sorry. I thought it would have been an $0.11 based on having greater than $100 million of net cash.\n\nIgnacio Couturier -- Chief Financial Officer\n\nHi, this is Ignacio. So, just a couple of details on that calculation. So, it is in that cash, excluding short-term investments. So, you have to remove the short-term investments from the number and then as well as net out any debt in the balance sheet, which is just limited to the leases that we have, the operating leases.\n\nAnd when you do all that, it is below the threshold of 100 million.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nYeah, short-term investments. I didn't realize that was netted out.\n\nIgnacio Couturier -- Chief Financial Officer\n\nYeah.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Ignacio, for clearing that up. And then just finally, if I could just get your thoughts on Argentina. So, I mean, it is a relatively challenging place to operate. Would you be inclined to continue operating in Argentina? And then just looking at the regulatory environment there, particularly from a federal level, do you see any changes developing to improve that situation? Thank you.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nLook, I mean, we're working in Argentina for a long time. We know that, as I said, Manantial will, you know, come here pretty soon to the end of its reserves. But this transaction, as I said, will add another additional operation to us, which is great, because, you know, we have the infrastructure ready for it, as I've said. We have -- Yamana has a strong team there and has been very successful operating Cerro Moro now for a number of years and replacing reserves.\n\nYou know, I don't want to speculate how Argentina's going to change in the future. This are -- like everywhere we work, there are political changes that go on with elections. And, you know, changes come and go. I mean, our assets stay there, and we are active there.\n\nWe are -- you know, we are happy in the country and happy to take on, as I said, that Cerro Moro has a really high grade -- very high-grade asset into our portfolio.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you all very much.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nThank you, Lawson.\n\nOperator\n\n[Operator instructions] The next question is from Craig Hutchison from TD Securities. Please go ahead.\n\nCraig Hutchison -- TD Securities -- Analyst\n\nHi. Good morning, guys.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nHi, Craig.\n\nCraig Hutchison -- TD Securities -- Analyst\n\nHey, Michael. With respect to the presentation here today, there's mention of the pro forma operating cash flow of 650 million a year for the next five years, excluding Escobal. Can you give us the metal prices for those assumptions? And maybe just as a follow-up question, any sense on the free cash flow? Are there any major capital spends required for either yourselves or the assets being acquired for Yamana over that five-year period, excluding out the Cerro Skarn?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nYeah, look, we can show you the metal prices. I'm sure it's probably an analyst consensus that has been used, so we can pass it down to you. But I'm sure you have it as well that we used for that calculation. Capital, you mean capital like project capital in addition to sustaining capital? Is that your question?\n\nCraig Hutchison -- TD Securities -- Analyst\n\nYes.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nYeah. Look, I mean, Yamana has, like us, you know, some high-quality development assets, and they will need some capital to move them come forward. I think, in my view, one of the -- you know, one of the biggest one is obviously in Canada, which is not going to be in our portfolio anymore. The main producing assets I -- you know, there's I think some projects that Yamana has to, you know, in some cases, to expand production; in some cases, to, you know, improve or expand tailings facilities etc.\n\nBut, you know, nothing like out of the extraordinary that I can see.\n\nCraig Hutchison -- TD Securities -- Analyst\n\nOK. And then just Shahuindo, you mentioned that the -- I guess there's a build of inventory related to lower rainfall rates which impacted irrigation. Is that something that you guys can mitigate through either wells or something so that doesn't happen in the future? Or is it really going to be kind of rain-dependent?\n\nSteve Busby -- Chief Operating Officer\n\nYeah. Craig, this is Steve. We are looking at expanding on some of the wells that we have access to. In this period that we saw during Q3, which was really an extension of the dry season, it lasted longer than it typically does and a little bit drier than it typically is.\n\nAs the leach pad grows, as the heap grows, we actually are able to retain more and more precipitation as the wet season comes through. So, we actually anticipate not only reducing our reliance on wells as the heap grows, but also we'll be looking the other direction as to trying to divert some of the runoff water around the facility. So, it's got an interesting dynamic situation. Again, as it grows, we actually get access to more precipitation and water for our inventories on the heaps.\n\nSo, in the future, we think it'll be less of a problem.\n\nCraig Hutchison -- TD Securities -- Analyst\n\nOK. And then one last question for you guys, just on La Colorada. I think in your remarks, you said you think you can get back into the high-grade zones by end of this year. Is that correct? Should these issues really be behind you going into 2023?\n\nSteve Busby -- Chief Operating Officer\n\nYes, that's correct. We got a very good assessment now on the ground control systems that had been compromised from the time periods of the ventilation constraints. We hadn't realized there were quite as severe in terms of corrosion and erosion of our ground support system, the rock bolts, the meshes, things of that nature. We've launched a very extensive program with support from outside contractors to accelerate the redoing, reestablishing of that ground control that we need to get back into those high-grade zones.\n\nSo, we're quite comfortable where we're at today. It'll take us through the rest of Q4 to get through that, and we feel we'll be back in where we should be mining out the reserve grade of La Colorada.\n\nCraig Hutchison -- TD Securities -- Analyst\n\nOK. Thanks for your responses.\n\nOperator\n\nThis concludes the question-and-answer session. I'd like to turn the conference back over to Michael Steinmann for any closing remarks.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nThank you, operator. And thank you, everyone, for calling in. It was a great pleasure to update you on this transaction and on the quarter and looking forward to give an update on the year-end and obviously how this transaction progresses in January. So, we'll talk a lot at the end of the year, I guess at the end of later in February.\n\nUntil then, stay safe and have a good end of the year. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSiren Fisekci -- Vice President, Investor Relations\n\nMichael Steinmann -- President and Chief Executive Officer\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nIgnacio Couturier -- Chief Financial Officer\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nSteve Busby -- Chief Operating Officer\n\nCraig Hutchison -- TD Securities -- Analyst\n\nMore PAAS analysis\n\nAll earnings call transcripts"
}