{
  "companyName": "Tillys",
  "companyTicker": "TLYS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/tillys-tlys-q2-2022-earnings-call-transcript/",
  "content": "Tillys (TLYS -0.55%)\nQ2 2022 Earnings Call\nSep 01, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Tilly's, Inc. second quarter 2022 earnings results conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation.\n\n[Operator instructions]. And please note that this conference is being recorded. I would now like to turn the conference over to Gar Jackson with investor relations. Thank you, sir.\n\nYou may begin.\n\nGar Jackson -- Investor Relations\n\nGood afternoon, and welcome to the Tilly's fiscal 2022 second quarter earnings call. Ed Thomas, president and CEO; and Michael Henry, CFO, will discuss the company's results and then host the Q&A session. For a copy of Tilly's earnings press release, please visit the investor relations section of the company's website at tillys.com. From the same section, shortly after the conclusion of the call, you will also be able to find a recorded replay of this call for the next 30 days.\n\nCertain forward-looking statements will be made during this call that reflect Tilly's judgment and analysis only as of today, September 1, 2022, and actual results may differ materially from current expectations based on various factors affecting Tilly's business. Accordingly, you should not place undue reliance on these forward-looking statements. For a more thorough discussion of the risks and uncertainties associated with any forward-looking statements, please see the disclaimer regarding forward-looking statements that is included in our fiscal 2022 second quarter earnings release, which is furnished to the SEC today on Form 8-K, as well as our other filings with the SEC referenced in that disclaimer. Today's call will be limited to one hour and will include a Q&A session after our prepared remarks.\n\nI will now turn the call over to Ed.\n\nEd Thomas -- President and Chief Executive Officer\n\nThanks, Gar. Good afternoon, everyone, and thank you for joining us today. As our customers continue to face the highest inflationary environment of the past 40 years, our second quarter results fell just short of our estimated outlook ranges for both net sales and earnings per share. Our comp sales performance which began with a minus comp in May declined further throughout June before starting to moderate to less negative comps in the final two weeks of the quarter once the early stages of the back-to-school season began.\n\nAll geographic markets comped double-digit negative for the quarter. Our merchandise departments comped double-digit negative except for footwear, which decreased by a high-single-digit percentage. Swim was particularly weak for us across departments and geographies. Customer traffic and conversion both declined by high-single-digit percentages compared to last year.\n\nWe believe seeing both traffic and conversion declined to this extent, at the same time as indicative of the impact of inflation on our customers particularly as we lap last year's record-setting results that were fueled by stimulus payments and other pandemic-related factors. Supply chain issues have been getting somewhat better by continue to cause disruptions to typical product flows, most significantly in footwear and branded women's and children's apparel. We believe that we have managed through these challenges fairly well under the circumstances. Despite the challenges of the current environment, we continue working toward improving our business and generating long-term growth.\n\nOur sustainable product offerings continue to grow and represented 7% of our total net sales for the second quarter. We recently added a home category to serve teens and college students which is off to a good start. We believe these offerings can bring incremental business to us over time. We also expect to launch our upgraded mobile app ahead of the holiday season, which we believe will improve customer engagements through an improved mobile shopping experience compared to what has been a simple wrap of our website previously.\n\nIn terms of real estate, we now expect to open a total of a 11 new stores this year, four of which have already be opened, two are scheduled to open in mid September, one in mid October and four in November just ahead of Thanksgiving. We continue to believe that we have ample opportunities to grow our total store count by ten or more stores per year over the next several years despite current challenges with rising construction cost and inflation in general. However, as we said in the past, we intend to be disciplined in our approach to our new store openings and will only open new stores that reflect what we believe is to be appropriate lease economics relative to the environment we expect. Turning to the third quarter of fiscal 2022, which includes the peak of back-to-school season, total comparable net sales through August 30 including both physical stores and e-com decreased by 10.6% versus the comparable period of last year.\n\nThe less negative comp trend that began in the latter half of July carried through the first half of August before returning to negative double-digits in the latter half of August. For additional perspective relative to the comparable period of the pre-pandemic third quarter of fiscal 2019, comparable net sales through August 30 increased by 7.5%. While these August comp results represent an improvement compared to our second quarter comp performance, we are expecting the latter half of the third quarter to decrease significantly, compared to last year once the traditional back-to-school shopping period concludes, particularly given the impacts of inflation this year and the early shop -- early holiday shopping that took late last year. We feel good about our merchandise assortment for the holiday season and if the holiday season follows more traditional patterns, we believe we have an opportunity to have a better performance trend in the fourth quarter.\n\nWe will continue to manage our business thoughtfully relative to the environment with improved long-term performance in mind. I now turn the call over to Mike to discuss our second quarter operating results and third quarter outlook in more details. Mike?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nThanks, Ed. Our second quarter operating results compared to last year were as follows: Total net sales were $168.3 million, a decrease of $33.6 million or 16.7%, compared to a company's second quarter record of $202 million last year due to going up against last year's unprecedented pent-up demand and stimulus impacts. Total comparable net sales, including both physical stores and e-commerce, decreased by 16.4%. Total net sales from physical stores were $137.1 million, a decrease of $27.5 million or 16.7%, compared to $164.6 million last year with a comparable store net sales decrease of 16.5%.\n\nNet sales from physical stores represented 81.5% of our total net sales both this year and last year. E-commerce net sales were $31.2 million, a decrease of $6.1 million or 16.4%, compared to $37.3 million last year. E-com net sales represented 18.5% of total net sales both this year and last year. We ended the second quarter with 242 total stores, a net increase of two stores since the end of last year's second quarter.\n\nFor additional perspective, our comparable net sales for the second quarter decreased by 0.6% relative to the pre-pandemic second quarter of fiscal 2019 despite starting the quarter at high-single-digits on a percentage basis in May, which we believe is another indication of the impacts that inflation had on our customers. Gross profit, including buying, distribution, and occupancy expenses was $52 million or 30.9% of net sales, compared to $74.7 million or a then company record of 37% of net sales last year. Buying, distribution, and occupancy costs deleveraged by 330 basis points collectively despite being reduced by $0.9 million in due to carrying these costs against a significantly lower level of net sales this year. Product margins declined by 280 basis points, primarily due to an increased and more normalized markdown rate compared to last year when full price selling was at record levels.\n\nProduct margins were down 100 basis points compared to the pre-pandemic second quarter fiscal 2019. Total SG&A expenses were $46.8 million or 27.8% of net sales, compared to $48.3 million or 23.9% of net sales last year. The $1.5 million reduction in SG&A dollars was primarily attributable to the absence of any corporate bonus accrual this year compared to $2.8 million included in last year's SG&A and a $0.7 million reduction in e-com marketing expenses this year. Partially offsetting these expense reductions were less significant increases in each of our store payroll and related benefits, technology services, e-com fulfillment, and insurance expenses.\n\nOur store teams did a great job managing their labor use to average lower hours per store compared to last year, but this was more than offset by a nearly 9% average hourly wage rate increase. Operating income was $5.2 million or 3.1% of net sales, compared to a company's second quarter record of $26.4 million or 13.1% of net sales last year. Income tax expense was $1.5 million or 28.4% of pre-tax income, compared to $5.9 million or 22.5% of pre-tax income last year. The increase in effective income tax rate was primarily due to discrete tax impacts related to stock-based compensation.\n\nNet income was $3.8 million or $0.13 per diluted share, compared to a company's second quarter record of $20.4 million in net income and an all-time quarterly record of $0.66 per diluted share last year. Weighted average shares were $30.2 million this year, compared to $31.1 million last year. Turning to our balance sheet, we ended the second quarter with total cash and marketable securities of $116.4 million and no debt outstanding. This compared to $148.5 million at the end of the second quarter last year also with no debt outstanding.\n\nSince the end of last year's second quarter, we paid special cash dividends to stockholders of $30.9 million in December 2021 and repurchased 987,000 shares of our common stock for a total of $9 million this year. We have just over 1 million shares remaining under our share repurchase authorization, which expires in March 2023. We ended the second quarter with inventories cost of 4.1% per square foot, a significant improvement from being at 12.7% at the end of the first quarter. New inventories were down 1.1% per square foot relative to last year.\n\nAs we continue to contend with inconsistent product flows resulting from ongoing supply chain challenges, our goal remains to continue rightsizing our inventories relative to sales performance and anticipated sales trends, while continuing to maintain product margins that are reasonably consistent with our pre-pandemic performance as we've been doing thus far this years. Total capital expenditures for the first half were $6.9 million, compared to $8.5 million last year, the decrease being primarily due to earlier new store openings last year. For fiscal 2022 as a whole, we currently expect our total capital expenditures to be in the range of $22 million to $24 million. Turning to the third quarter of fiscal 2022, based on our quarter-to-date net sales results and current historical trends, and anticipating some deceleration in the latter half of the quarter as Ed noted earlier, we currently expect our total net sales for the third quarter of fiscal 2022 to be in the range of approximately $165 million to $170 million, SG&A to be approximately $46 million to $47 million, operating income to the range of approximately $1.9 million to $4.6 million, our estimated income tax rate to be approximately 27% and earnings per diluted share to be in the range of $0.05 to $0.11 based on estimated weighted average diluted shares of approximately $30.2 million.\n\nThis compares to a company quarterly record of $206.1 million in net sales and record earnings per diluted share of $0.66 for the third quarter last year, which exceeded the previous company record for third quarter earnings per share by $0.30. We expect to have 247 total stores opened at the end of the third quarter, a net increase of four from 243 total stores at the end of last year's third quarter. Operator, we'll now go to our Q&A session.\n\nOperator\n\nThank you, sir. [Operator instructions]. Our first question comes from the line of Jeff Van Sinderen, B. Riley.\n\nPlease proceed with your question.\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nYes. Hi, everybody. So, first let me say, really good work getting inventories, your overall inventory down. Kudos on that.\n\nI have a multi-part question here if you can bear with me. But given the pace of sales and ongoing supply chain challenges that I think most folks are experiencing, how far do you believe that you are from what in your eyes would be an optimal inventory level? And then, maybe you can speak more to kind of how you are of managing and planning inventory for the remainder of the year, any sort of excess current inventory that you have what that consists of? And then, any areas of merchandize assortment where supply chain remains disruptive and maybe just touch on planned holiday inventory receipt period and stability to adjust, make cancellations reorders around holiday. A lot there I realized.\n\nEd Thomas -- President and Chief Executive Officer\n\nHi, Jeff. I would say the inventory levels right now are pretty close optimum I think to -- there are where we want to be and as you have seen from other retailers' report to be up single-digits, low-single-digits and inventory is total credit to the whole team here who worked very hard to get it to that number, but also the big challenges make sure that when you adjust to that number there you get the right mix. There is a couple of categories of brands that we wish we had a more inventory in. But overall I think going into holiday at least from what we can see right now, most of the supply chain challenges are behind us will -- I am sure we'll have a few, but I feel pretty good in terms of where we are having an -- we are taking a pretty conservative approach to Q4 for inventory but I would expect that we'll be able to manage it within a reasonable number for sure.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nYes, Jeff, I'd add. I think we expect our overall inventory level to be reduced to some extent by the time we have finished the third quarter here and certainly expect to enter fiscal 2023 at the end of the fourth quarter with reduced overall inventory value. The challenge, as we talk about these supply chain disruptions and delays is, you have certain things that are four to six to eight weeks late but you still want them as a key part of your assortment you've taken in regardless of where the quarter in line is and so we have some of those kinds of distortions that are negatively impacting what would be our normal behavior and performance in what I'll call normalized times and obviously nothing at all over the last two and a half years has anything like I'd call normalized times going from the pandemic shutdown at 2020 to the incredible break out recovery year last year and now into this highly inflationary environment that we haven't seen in 40 years. We just in -- back and forth over the last couple of years and I think the team has done an outstanding job adapting as best we can at any moment and time.\n\nWe've been carefully making real-time decisions about what to cancel. We do tend to have cancellation rights if deliveries are meaningfully late past their original swan delivery days. So we've been taking advantage of those situations, making returns in certain other situations and you got also trying to protect, Ed mentioned that we feel good about our holiday assortment while make sure we have good ammo to go into the Black Friday weekend, as well from a merchandizing standpoint. So it's a constant balancing act.\n\nWe've discussed it multiple times a week, every single week just because things change that rapidly, but again we both feel like the team has just turned yeoman's work at just trying to keep us as under control as we can under extremely difficult circumstances.\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nOK, good. And then, I -- just as a follow-up wanted to touch on -- I just -- if you could speak a little more about how you are handling and planning your own promotional levels? Obviously, the environment is extraordinarily promotional out there. Just any thoughts around that.\n\nEd Thomas -- President and Chief Executive Officer\n\nWell, one thing as you know, we have been pretty disciplined as the company have not being overly promotional and not getting into the promotion of dame. And that's the whole reason for why -- that's one of the main reasons why we control, do such a good job of controlling inventory of goods. We don't want to have to promote our way out of it. I don't think promotions are driving business for many week hours right now.\n\nHonestly, I think it's challenging no matter where they are promotional or not. Certain categories turn back-to-school that seems more promotional others was denim. And how long bottom business has actually been pretty good, denim not so great. But we've been able to avoid any unusual promotions and we would expect that to continue through the balance of the year.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nYes, we are being very surgical about what we need to move to address any problem areas and thankfully we don't have the size of inventory increase relative to almost anyone else I've seen report so far. I had looked at over a couple dozen different companies. There is a lot of really high inventory percentage increases year-over-year out there and thankfully we are one of the very smallest.\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nOK. That's all helpful and say, thanks for taking my questions and best of luck as the remainder of the quarter plays out.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nThanks.\n\nEd Thomas -- President and Chief Executive Officer\n\nThanks, Jeff.\n\nOperator\n\nAnd our next question comes from the line of Mitch Kummetz with Seaport Research. Please proceed with your question.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nYes, thanks for taking my questions. Mike, just starting with a housekeeping question, you gave a comp on a year-over-year and also a three year. Do you happen to know August sales year-over-year and also August sales to increase or decrease versus three years ago, do you happen to have that?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nWe gave the August comp through August 30, down 10.6% to last year.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nDo you have the sales number though? You have the comp, but do you have the sales on a year-over-year and also on a three year?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nI don't have specific sales through to a specific date, no.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. I was trying to back and do what sort of implied sales you need for the balance of the quarter to get to your range. Do you happen to have that?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nYes, we are -- I can tell you that raw sales, keep in mind, we are in the very first week of fiscal September. So the books are being closed as we speak. So we don't have final sales numbers for August yet. But at least raw point of sales, raw point of sales plus e-com we did $88 million of sales in August in pre-pandemic years August represented just over 50% of the quarter.\n\nObviously, none of those years have highly inflationary environment and did not have the god of inventory that is in somewhat in place that we have today. We are contemplating a slowdown as we mentioned. Our earliest back to school stores have declined by more than 20% here recently. So that gives us some pause about the level of fall off from that business inflationary environment that we could be facing.\n\nAnd then you think about last year's October, which was historically unusual and how large it was as a percentage of the quarter. It was I think that 25% of total third quarter sales, it's never been that high in any pre-pandemic year. So, we certainly feel like there was a pull forward of holiday shopping last year and middle of the noise and concerns about supply chain difficulties and we had third quarter sales that were higher than our fourth quarter sales. That's never happened in our history.\n\nSo, we are expecting a lot more challenges in the back half of this quarter. However, the flip side of that, the positive of that should indicate that we'll have a better performance trend in the fourth quarter assuming that normalized holiday shopping patterns return. So that pull forward happened last year moving that back into the fourth quarter this year should mean that we won't be quite as negative as we were in the second quarter or as we were anticipating being for the third quarter. September and October were even tougher compares than August was last year as it relates to fiscal 2019 in particular.\n\nSo we do expect the remainder of this quarter to be tough, but this should mean that we have an opportunity to have better performance in the fourth quarter.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. Just to clarify your comments, I know you are not giving Q4 guidance, but it's something like you expect Q4 to be the less negative. That sort of my take away from what you just said, I don't know if that's accurate.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nYes, that's right. Last year, every quarter set records for quarterly sales and records for gross margin rates unlike anything we've seen in our prior history. So, I think, I do believe total sales in the fourth quarter will still be below last year's fourth quarter, but it should be less negative. I think the consensus number coming into this call for the fourth quarter was in the high 180s, I think somewhere in the 180s is a reasonable number to look at it this early date.\n\nAssuming there isn't some other leg down economically or with consumer spending or something of that nature. I think that number is probably fair for the fourth quarter. I think the prelim numbers for Q4, I think the consensus for SG&A is too light and I think the gross margin rate is too high. We've been tracking fairly close to 2019 gross margin rate.\n\nSo if I'd adjust anything for fourth quarter at this point, I'd suggest that the consensus margin rate is too high above fiscal 2019 than what we would reasonably expect.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. And then on the inventory, you mentioned, the improvement that you've seen going from last quarter, this quarter on a per store basis, Ed you mentioned though that swim was particularly weak. So I guess my question is, within your quarter end inventory, I mean, is there really any seasonal excess or were you able to clear that through in the quarter itself?\n\nEd Thomas -- President and Chief Executive Officer\n\nThe inventory is very, very clean. So, we ended the quarter in good shape by category. There is always going to be some pockets here and there and there are. But that we might be -- but we are in pretty good shape.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nYes, we are very disciplined in every single quarter. From an ageing perspective, we always approve for any and all aged goods, to be honest certain age and below a certain inventory turn rate that has been our consistent discipline for ever and ever anything where we see that kind of risk we have through to that at this point.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. And then, last question, I know that store labor has been a pressure point. Do you have -- Mike, do you have any sense as to what store labor -- the increase for this quarter is versus three years ago or from a margin standpoint how much basis point pressure this quarter versus three years ago?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nYes, on a hourly rate basis, we did an analysis of our payroll usage just to evaluate and are we being as tight as we can on an hours basis. And as I said in our prepared remarks, our teams did a really good job managing to average -- lower average number of hours per store, 7% reduction versus last year and versus fiscal 2019. The challenge has been the rate increase from last year was up 9% versus three years ago it was up 19%. So, it's gone up considerably and a lot of that has to do with California.\n\nWe are at $15 already here and we've been absorbing dollar a year increases for several years. So you think about roughly 100 of our stores are in California. They are all at a minimum of 15. Three years ago, that was 12 and so that's --\n\nEd Thomas -- President and Chief Executive Officer\n\nYes, and I don't see that changing anytime soon. It's -- we are still not out of the woods in terms of the challenges of labor rate increases and availability of labor but the team has done a good job of managing through it.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. Alright. Thanks guys. Best of luck.\n\nEd Thomas -- President and Chief Executive Officer\n\nThanks, Mitch.\n\nOperator\n\nThank you. And our next question comes from the line of Matt Koranda with ROTH Capital. Please proceed with your question.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nYes. So just wanted to put a finer point on the sort of the deceleration that's embedded in the comp guide for the rest of the quarter here. It sounds like you guys are saying it's really a comp issue more than anything and not necessarily some sort of incremental weakness you observe toward the end of August or anything like that?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nIn my opinion, what we are seeing is, once the need-based period of back-to-school is finished, the stores are really dropping off and I think that for our customer base, I think inflation is having a meaningful impact. As we look back at the second quarter and the cadence of that supposedly June and July were our easier compares, our worst comp of the quarter was in June. We were at minus 17. June was minus 20 with the final week of June being down 25 and then July got a little bit better for the first two weeks and then quite a bit better at the back-to-school season started.\n\nAs we went from basically minus 16%, 17% in the first half of July to a minus 11 and then negative single-digits. The first two weeks of August were then negative single-digits and on the latter half of August when most of our stores had finished their back-to-school, we started seeing drop offs down into -- we were 13% down in week three, 16% in week four and we are down more than that here in the first week of September and again, with that very first group of stores I mentioned in response to one of the questions, we seen that erode to a minus 20%. So, we are trying to stick with that.\n\nEd Thomas -- President and Chief Executive Officer\n\nOur fiscal dates vary significantly by geography but we've seen enough now to be able to relatively accurately forecast.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nGot it. Is that the regional and demographic difference in terms of that drop off like the store is any different, I guess, demographically or if there is something --\n\nEd Thomas -- President and Chief Executive Officer\n\nIt's pretty consistent throughout the country.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. OK. That's helpful guys. And then just maybe a finer point on merchandise margin trends in the third quarter.\n\nObviously, everyone is well aware of the promotional environment across the board is very tough. Your inventory is super clean. That's a great positive point. But maybe just talk about what's embedded in the operating profit guide for the finer point on merch margins for us.\n\nAny incremental item when that we are expecting and embedding in the guide here or is it relatively similar to 2Q?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nIt's relatively similar to Q2. It's really pure dollars getting added in from the fact that we are-sequentially from Q2, Q3 we are adding five stores going from 242 to 247 and then we also had two stores opened in the latter half of July. So you'll have a full quarter of expense for those two stores. When you think about occupancy which isn't just rents, it's also the utilities and supplies and business license, property taxes and all the things that go into occupancy plus the distribution expenses that go with those.\n\nSo, sequentially from Q2 to Q3 as a result of those five new store openings during the quarter plus the two very late Q2 openings, we are going to add almost $2 million in combination of distribution and occupancy expenses in the third quarter that were not there in the second quarter while we are expecting a similar rate of sales and a similar rate of SG&A. So it's pretty directly that movement.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. That makes sense. And then, I just wanted to make sure I understood sort of the inventory cadence for the rest of the year and the expectation there. It sounds to me, Mike, and I don't want to put words in your mouth, but it sounds like sequentially it should be down -- each successive quarter it's down sequentially in the third quarter and then down again sequentially in the fourth quarter.\n\nBut I guess a lot of -- inventory receipts volumes on demand and the environment, but maybe just speak to that if you could?\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nYes. That is our internal plan looking at our currently anticipated timing of receipts which I think I will remind you does change every single week things move that are supposed to arrive this week and next week and end up being some number of weeks late. So, the team adapts as best they can but with the current visibility we have, what we know as of today in terms of expected sales, receipt flows, planned markdowns, we are anticipating being in a negative inventory position by the time we finish third quarter and would expect that also to be the case as we finish fourth quarter.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. Excellent. Maybe just last on -- it looks like, you guys are willing to sort of buy back shares at an average of $9 a share, I just did a rough math in terms of the calculations here. And the stock now in the low $7.\n\nIt just seems like the logical inclusion here that we should have is that you'd be more willing to transact on the buy back versus special dividends at the moment but any thoughts you'd like to point on that front will be helpful.\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nThat's a fair assumption. We've been pretty strategic about it as we saw our business slowing down in second quarter, we, unfortunately had the four thought that OK, we've completed almost half of the buyback at an average price that was $9.10 and given what we are seeing, it's likely that the stock could probably go down based on how things are slowing down. So we did pause for a little bit. I wouldn't be surprised if we took some opportunistic situations to get back into that program.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. Makes perfect sense. Appreciate all the time, guys. Thanks.\n\nEd Thomas -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. At this time, we have reached the end of the question-and-answer session and I would now like to turn the call back over to Ed Thomas for any closing remarks.\n\nEd Thomas -- President and Chief Executive Officer\n\nThank you all for joining us on the call today. We look forward to sharing our third quarter results with you in early December. Have a good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGar Jackson -- Investor Relations\n\nEd Thomas -- President and Chief Executive Officer\n\nMike Henry -- Executive Vice President, Chief Financial Officer, Corporate Secretary\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nMore TLYS analysis\n\nAll earnings call transcripts"
}